["a",{"thoughts":"Spanish “a” is a single, stable sound—always the open “ah” (like the a in “father”). English already has this vowel, so recognition is high and production is straightforward.","pattern":"a","position":"Anywhere","description":"Always a pure, open ‘ah’ sound, similar to the a in English “father.” Keep the mouth open and relaxed; avoid the diphthong or schwa you might hear in English words like “cat” or “about.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"amigo","native":"amigo","position":"Beginning","cultural_context":"Commonly heard word for “friend” in pop culture and basic Spanish phrases"},{"target":"taco","native":"taco","position":"Middle","cultural_context":"Popular Mexican food item well-known in the U.S."},{"target":"fiesta","native":"fiesta","position":"End","cultural_context":"Used in English to mean a party, often seen in marketing or celebrations"}]}]
["b",{"thoughts":"English already has a /b/ sound, so learners mainly need to know that Spanish alternates between a hard plosive (like English “b”) and a softer, almost-“v” sound between vowels. This is usually an easy adjustment.","pattern":"b","position":"Anywhere","description":"Spanish “b” is pronounced two ways. 1) At the start of a phrase or after an “m” or “n,” it’s a full voiced stop—just like the English “b” in “boy.” 2) Between vowels or other voiced sounds it relaxes into a soft, voiced fricative [β̞]: your lips come close and let air leak through, almost like saying an English \"v\" but with both lips and no teeth involvement. Don’t let the lips close completely for this softer version.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"burrito","native":"burrito","position":"Beginning","cultural_context":"Popular Mexican dish widely sold in the U.S."},{"target":"Cuba","native":"Cuba","position":"Middle","cultural_context":"Caribbean country frequently mentioned in news and travel"},{"target":"Colombia","native":"Colombia","position":"Middle","cultural_context":"South American country known for coffee and emeralds"}]}]
["c",{"thoughts":"English speakers already know the Roman letter “c,” but in Spanish it flips between a hard /k/ sound and a soft /s/ (or /θ/ in Spain). They’ll find the hard version easy, the soft one mostly easy in Latin America and a bit trickier in Spain.","pattern":"c","position":"Anywhere","description":"Two main values: 1) Hard /k/ before a, o, u or a consonant (almost exactly the English k in “kite”). 2) Soft /s/ in Latin America – or /θ/ (unvoiced th as in “thin”) in Spain – when it comes before e or i. Never the English /k/-vs-/s/ ‘choice’; the rule is fixed by the next letter. ‘Ch’ is a separate digraph.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"cilantro","native":"cilantro","position":"Beginning","cultural_context":"Common herb in Mexican and U.S. cooking"},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"Major Spanish city famous for tourism and soccer"},{"target":"Cancún","native":"Cancún","position":"Multiple","cultural_context":"Well-known Mexican beach resort"},{"target":"Cuba","native":"Cuba","position":"Beginning","cultural_context":"Island country; very familiar from news and culture"}]}]
["d",{"thoughts":"Spanish “d” has two realizations an English speaker should notice: a firm dental stop [d] at the very start of an utterance or after /n/ or /l/, and a softer, almost “th-in-this” dental fricative [ð] between vowels or at the end of a word. English speakers already know the hard version, but the softer one is new and may require practice placing the tongue lightly against the upper teeth, letting air leak so it buzzes instead of pops.","pattern":"d","position":"Anywhere","description":"At the start of a phrase or after n/l, pronounce it like an English d but with the tongue touching the upper teeth (not the ridge). Between vowels or at word-end, let it soften into the voiced “th” of “this,” keeping it shorter and lighter than in English.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Doritos","native":"Doritos","position":"Beginning","cultural_context":"Popular tortilla chip brand sold in the U.S."},{"target":"empanada","native":"empanada","position":"Middle","cultural_context":"Well-known stuffed pastry found in many Latin restaurants"},{"target":"Madrid","native":"Madrid","position":"End","cultural_context":"Capital city of Spain, mentioned often in news and sports"}]}]
["e",{"thoughts":"Spanish “e” is basically the same pure mid-front vowel you hear in English “bet,” but Spanish keeps it shorter and steadier—no glide toward “y.” Most English speakers already know and use this vowel, so their main job is to avoid turning it into a diphthong.","pattern":"e","position":"Anywhere","description":"Like the “e” in English “bet,” but shorter and held steady—mouth relaxed but slightly tense, tongue forward/mid. Do not let it slide toward an “ay” sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"España","native":"Spain","position":"Beginning","cultural_context":"Country name often heard in news and sports"},{"target":"queso","native":"cheese","position":"Middle","cultural_context":"Common word on Mexican-food menus"},{"target":"peso","native":"peso (currency)","position":"Beginning","cultural_context":"Name of several Latin-American currencies mentioned in travel and finance"},{"target":"José","native":"José (male name)","position":"End","cultural_context":"Very common Spanish first name known from athletes and celebrities"}]}]
["f",{"thoughts":"Spanish “f” is identical to the English unvoiced “f” in feel or fun—made by touching the top teeth lightly to the bottom lip and letting air pass. English speakers already use this sound daily, so recognition and production should be automatic.","pattern":"f","position":"Anywhere","description":"Same sound as the English “f” in “fun.” No voice, no vibration of the vocal cords, just a steady airflow against the bottom lip. Unlike English, Spanish never turns it into a “v” sound; keep it consistently unvoiced.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"frijoles","native":"frijoles","position":"Beginning","cultural_context":"Common side dish ‘beans’ on Tex-Mex menus"},{"target":"café","native":"café","position":"Middle","cultural_context":"Word for ‘coffee’; seen on signs and menus"},{"target":"golf","native":"golf","position":"End","cultural_context":"Same sport word in English; heard in sports coverage"}]}]
["g",{"thoughts":"Most of the time English speakers can just use their regular hard “g” sound, but they have to remember it changes to a throaty “h” before e or i. The silent-u trick (gue/gui) also catches people.","pattern":"g","position":"Anywhere","description":"Two main values: (1) Hard g, just like English go, used before a, o, u or consonants, and in gue/gui where the u is normally silent. (2) Before e or i it becomes a harsh, breathy sound made in the throat—similar to English h but stronger (same sound as Spanish j). Between vowels many speakers soften a hard g to a gentle voiced “h”; aiming for the plain hard g is acceptable for beginners.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Famous avocado dip served in Mexican restaurants"},{"target":"amigo","native":"friend","position":"Middle","cultural_context":"Common Spanish word used jokingly in English (“Hey, amigo!”)"},{"target":"gente","native":"people","position":"Beginning","cultural_context":"Shows up in phrases like “La Gente” in news or on signage"},{"target":"guitarra","native":"guitar","position":"Beginning","cultural_context":"Spanish word often heard in music contexts and looks like English “guitar”"}]}]
["h",{"thoughts":"Spanish “h” is actually the easiest sound to make because you don’t make it at all. The hard part for English speakers is remembering to stay completely silent, since English usually pronounces an ‘h’ with breath.","pattern":"h","position":"Anywhere","description":"In Spanish, the letter “h” by itself is ALWAYS silent – no breath, no rasp, nothing. Just move straight to the next vowel or consonant as if the “h” weren’t there. (If you see “ch,” that’s a separate digraph pronounced like English “ch” in “church.”) Tip: keep your mouth relaxed and don’t exhale; imagine you’re starting the following vowel from rest.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Common Spanish greeting everyone learns—means “hello,” but the h is silent"},{"target":"Habanero","native":"habanero","position":"Beginning","cultural_context":"Popular hot pepper used in salsas and hot sauces"},{"target":"alcohol","native":"alcohol","position":"Middle","cultural_context":"Same word in English; refers to drinks containing ethanol"}]}]
["i",{"thoughts":"Spanish “i” is the straightforward close-front vowel /i/. English speakers already know the sound (the “ee” in “ski”), but they must remember that Spanish never stretches it or turns it into a glide, as happens in many English long vowels.","pattern":"i","position":"Anywhere","description":"Pronounce it like the “ee” in English “machine”: tongue high and forward, lips unrounded. Keep it short and pure—no diphthong or lengthening as in English “beat.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"fiesta","native":"fiesta","position":"Beginning","cultural_context":"Commonly used in English for “party”"},{"target":"tortilla","native":"tortilla","position":"Middle","cultural_context":"Very familiar Mexican flatbread sold in supermarkets"},{"target":"Chile","native":"Chile","position":"Middle","cultural_context":"South American country often mentioned in news and geography classes"}]}]
["j",{"thoughts":"Spanish “j” is always a fricative made in the throat, not a stop or an English-style “j” sound. English speakers know a similar but weaker /h/ sound, so they partly recognize it but still need to learn the harsher throat friction.","pattern":"j","position":"Anywhere","description":"In nearly all Spanish dialects the letter “j” is pronounced as a voiceless raspy breath from the back of the throat [x]—like an English /h/ in “house” but stronger and farther back, almost as if clearing fog from a cold window. It is never the English “dʒ” in “job.” Tip: start with an English /h/ and add a slight scratchy friction from the soft-palate area.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jalapeño","native":"jalapeño","position":"Beginning","cultural_context":"Common spicy pepper seen on pizzas and Mexican food menus"},{"target":"fajita","native":"fajita","position":"Middle","cultural_context":"Tex-Mex skillet dish served in many chain restaurants"},{"target":"mojito","native":"mojito","position":"Middle","cultural_context":"Popular Cuban rum cocktail ordered at bars"},{"target":"San José","native":"San José","position":"Middle","cultural_context":"Name of a major city in California and Costa Rica"}]}]
["k",{"thoughts":"Spanish “k” is the same voiceless velar stop English speakers know, just produced without the little burst of air you hear at the start of an English word like “key.” Because English already has this sound in clusters such as “ski” or after an “s,” it feels very familiar.","pattern":"k","position":"Anywhere","description":"A crisp, unaspirated “k” sound—like the English “k” in “ski” rather than the puffier “k” in “key.” Tongue touches the soft palate, quick release, no vocal-cord vibration.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"kilo","native":"kilo","position":"Beginning","cultural_context":"Common short form for kilogram, used worldwide"},{"target":"kiwi","native":"kiwi","position":"Beginning","cultural_context":"Name of the well-known green fruit"},{"target":"karaoke","native":"karaoke","position":"Beginning","cultural_context":"Popular bar activity—sing along to background tracks"},{"target":"Pakistán","native":"Pakistán","position":"Middle","cultural_context":"The country Pakistan, often in international news"}]}]
["l",{"thoughts":"Spanish “l” is essentially the same clear front-of-the-tongue /l/ that English uses at the start of words, but it never turns into the darker back-of-the-tongue sound many English speakers make at the end of syllables. Learners mainly need to remember to keep it ‘light’ even at the ends of words.","pattern":"l","position":"Anywhere","description":"Put the tip of your tongue on the ridge just behind your upper teeth, let air pass along the sides of the tongue. It sounds like the light L in English “leaf.” Do NOT retract the tongue root the way many English speakers do in “full.” Keep it the same clear L everywhere in the word.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"loco","native":"loco (crazy)","position":"Beginning","cultural_context":"Often heard in the phrase “¡loco!” meaning someone is crazy; pops up in pop culture lyrics and restaurant names"},{"target":"flamenco","native":"flamenco","position":"Middle","cultural_context":"World-famous Spanish music and dance style"},{"target":"Olé","native":"Olé","position":"Middle","cultural_context":"Common Spanish cheer shouted at soccer matches and bullfights"},{"target":"hotel","native":"hotel","position":"End","cultural_context":"Same word as English, often seen on travel signs in Spanish-speaking countries"}]}]
["m",{"thoughts":"English already has the same bilabial nasal /m/, so learners should not experience new mouth movements. Just remind them to keep the lips together and let the voice resonate through the nose.","pattern":"m","position":"Anywhere","description":"Spanish “m” is the same voiced bilabial nasal found in English, as in “man.” Lips close lightly, vocal cords vibrate, and air flows through the nose. No additional vowel-like release—just a clean nasal stop.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Margarita","native":"margarita","position":"Beginning","cultural_context":"Famous tequila cocktail ordered in many bars"},{"target":"amigo","native":"amigo","position":"Middle","cultural_context":"Pop-culture way to say “friend,” heard in movies and TV"},{"target":"álbum","native":"álbum","position":"End","cultural_context":"Same word as English “album,” used for music collections"}]}]
["n",{"thoughts":"Spanish “n” is almost the same as the English “n.”  English speakers already use the alveolar nasal and even the assimilated versions (like the velar nasal in ‘sing’), so this sound feels natural to them.","pattern":"n","position":"Anywhere","description":"Usually an alveolar nasal [n] like the n in English “no.”  Before b/p/m it sounds like an English “m,” before k/g it sounds like the “ng” in “sing,” and before t/d it’s produced with the tongue touching the back of the teeth (dental).  These small automatic shifts are similar to English nasal assimilation, so just keep the tongue relaxed and let the airflow go through the nose.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"nachos","native":"nachos","position":"Beginning","cultural_context":"Common Tex-Mex appetizer—tortilla chips with melted cheese"},{"target":"tango","native":"tango","position":"Middle","cultural_context":"World-famous Argentine dance and music style"},{"target":"San Diego","native":"San Diego","position":"End","cultural_context":"Large California city with a Spanish name"}]}]
["ñ",{"thoughts":"English speakers have met this letter in food names and news terms, but they rarely pronounce it as one single consonant. They usually break it into two sounds (“n-y”) instead of the smooth palatal nasal used in Spanish.","pattern":"ñ","position":"Anywhere","description":"Spanish “ñ” is a single consonant pronounced like the “ny” sound in the middle of the English word “canyon.” Touch the middle of your tongue to the hard palate just behind your front teeth and let the air go through the nose in one smooth sound. It is NOT simply an “n” followed by a “y”; it is one blended consonant.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jalapeño","native":"jalapeño","position":"End","cultural_context":"Popular Mexican chili pepper seen on menus and in grocery stores"},{"target":"piña colada","native":"piña colada","position":"Middle","cultural_context":"Famous tropical cocktail often referenced in pop culture"},{"target":"El Niño","native":"El Niño","position":"End","cultural_context":"Well-known weather pattern reported in the news"},{"target":"señor","native":"señor","position":"Middle","cultural_context":"Common Spanish title meaning “Mr.” that appears in movies and travel"}]}]
["o",{"thoughts":"Spanish “o” is essentially the same rounded back vowel as in a clipped English “oh,” but without the glide that often turns the English vowel into a diphthong (English tends to move toward a slight /w/ sound at the end, Spanish does not). English speakers already have the raw sound; the only new habit is keeping it short and pure.","pattern":"o","position":"Anywhere","description":"A single, pure “oh” sound—like the first half of English “oh” or the vowel in “photo,” but hold it steady without letting it slide toward “oo.” Lips are rounded, jaw relaxed, tongue mid-back.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hello","position":"Beginning","cultural_context":"Very common Spanish greeting, often used by English speakers"},{"target":"taco","native":"taco","position":"End","cultural_context":"Mass-market Mexican food item in the U.S."},{"target":"sombrero","native":"sombrero","position":"Middle","cultural_context":"Traditional Mexican hat referenced in English-language pop culture"}]}]
["p",{"thoughts":"Spanish p is the same voiceless bilabial stop English speakers know, just without the strong puff of air (aspiration) they add in words like “pin.” That tiny detail rarely causes trouble because it never changes meaning, so most learners keep their normal English p and still sound clear.","pattern":"p","position":"Anywhere","description":"Almost the same as the English “p” in “spin” (not the strongly-aspirated “p” in isolated “pin”). Lips close, build a little pressure, then release cleanly with minimal burst of air.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"paella","native":"paella","position":"Beginning","cultural_context":"Famous Spanish rice dish you see on travel and food shows"},{"target":"tapas","native":"tapas","position":"Middle","cultural_context":"Well-known Spanish small-plate appetizers served in many restaurants"},{"target":"jalapeño","native":"jalapeño","position":"Middle","cultural_context":"Common spicy pepper used in Tex-Mex and fast-food items"}]}]
["q",{"thoughts":"Spanish “q” is almost always seen in the digraph “qu” (before e or i). It is pronounced the same as an un-aspirated English hard K. Because English already has this sound, learners rarely struggle beyond remembering that the written u is silent.","pattern":"q","position":"Anywhere","description":"Pronounce it like the hard K in English “skill,” never like the English W. The following vowel carries the voice; the written u is normally silent (que = keh, qui = kee). Don’t puff extra air as many English speakers do on word-initial K sounds.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican dish with melted cheese in a tortilla"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Well-known Mexican distilled drink used in cocktails"},{"target":"Iraq","native":"Iraq","position":"End","cultural_context":"Country frequently mentioned in international news"}]}]
["r",{"thoughts":"English speakers already know the letter “r,” but the Spanish versions of it (a quick tap and a full trill) feel very different on the tongue. They will usually have heard both in songs, restaurant names, or beer commercials, yet producing them—especially the rolled trill—takes practice.","pattern":"r","position":"Anywhere","description":"Spanish has two main “r” sounds. 1) Tap/Flap: a single, very quick touch of the tongue against the roof of the mouth, similar to the middle sound in the American English word “buTTer” when it’s said quickly. This happens with a single “r” between vowels or after certain consonants. 2) Trill/Roll: several rapid taps in a row, like a purring sound. It occurs with “rr,” at the start of a word, or after l, n, or s. Keep the tongue relaxed and let the airflow make it vibrate; think of imitating a cat’s purr.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Río Grande","native":"Río Grande","position":"Beginning","cultural_context":"Famous river forming part of the U.S.–Mexico border"},{"target":"burrito","native":"burrito","position":"Multiple","cultural_context":"Popular Mexican dish found on many menus"},{"target":"Corona","native":"Corona","position":"Middle","cultural_context":"Well-known Mexican beer brand, advertised worldwide"}]}]
["s",{"thoughts":"The Spanish “s” is essentially the same hissing voiceless sound English speakers already use in “see” or “snake.” The only noteworthy difference is that it never turns into a /z/ sound between vowels the way English often does (e.g., “roses”). In careful speech it stays a pure, sharp /s/. Because English has the identical phoneme, learners find it familiar and easy.","pattern":"s","position":"Anywhere","description":"Pronounce it like the “s” in English “see.” Keep it voiceless and crisp—never let it buzz into a /z/. Tongue is close to, but not touching, the upper teeth ridge; air flows out in a steady hiss.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"salsa","native":"salsa","position":"Multiple","cultural_context":"Common dip and dance style you see on menus and in music"},{"target":"siesta","native":"siesta","position":"Beginning","cultural_context":"Famous Spanish midday-nap concept often mentioned in English"},{"target":"tacos","native":"tacos","position":"End","cultural_context":"Extremely popular Mexican food item"}]}]
["t",{"thoughts":"Spanish “t” is almost the same sound English speakers use, just made with the tongue a bit farther forward and without the strong burst of air English has at the start of stressed syllables. Because it matches an English phoneme closely, learners rarely struggle beyond remembering to keep it unaspirated.","pattern":"t","position":"Anywhere","description":"A clean, unaspirated “t” made with the tip of the tongue touching the upper front teeth (dental). Think of the English “t” in the word “stop” (no puff of air) rather than in “top.” Touch the back of the upper teeth, release quickly and quietly.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"taco","native":"taco","position":"Beginning","cultural_context":"Popular Mexican food item found in many fast-food chains and restaurants"},{"target":"tortilla","native":"tortilla","position":"Multiple","cultural_context":"Common flatbread/wrap used in Mexican cuisine"},{"target":"tequila","native":"tequila","position":"Beginning","cultural_context":"Well-known Mexican spirit used in cocktails like margaritas"},{"target":"fiesta","native":"fiesta","position":"Middle","cultural_context":"Spanish word for party, often used in English marketing and event names"}]}]
["u",{"thoughts":"The Spanish letter “u” is the same vowel every time it’s pronounced, and it matches the English “oo” in “food,” just a bit shorter and steadier. English speakers already make this sound, so it feels familiar; the only habit to break is adding an off-glide (no w-sound afterward).","pattern":"u","position":"Anywhere","description":"A single, pure back-rounded vowel [u]. Think of the “oo” in English “food,” but keep it very short and hold the lip rounding steady—don’t let it slide toward a w-sound the way many English speakers do in “two.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"uno","native":"uno","position":"Beginning","cultural_context":"The name of the popular card game “Uno,” meaning “one” in Spanish"},{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Common Mexican dish found on many menus"},{"target":"Perú","native":"Perú","position":"End","cultural_context":"Well-known South American country"},{"target":"fútbol","native":"fútbol","position":"Middle","cultural_context":"Spanish word for soccer, often heard in sports coverage"}]}]
["v",{"thoughts":"Spanish “v” looks familiar, but its sound surprises English speakers because it merges with the Spanish “b.” They must stop using the upper teeth on the lower lip and instead press the lips lightly together, producing either a full /b/ after a pause or nasal, or a softer, buzzing-less bilabial “between-vowels” glide (β).","pattern":"v","position":"Anywhere","description":"In most varieties of Spanish, the letter “v” is pronounced exactly like the Spanish “b.”\n• After a pause or after m/n, it’s a full voiced bilabial stop [b] – lips fully close, no air.\n• Between vowels or other voiced sounds, it relaxes to a softer bilabial approximant [β] – lips barely touch, no teeth, no real ‘buzz.’\nThink of starting to say an English “b,” but let some air leak and DON’T use the teeth-on-lip English “v.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Venezuela","native":"Venezuela","position":"Beginning","cultural_context":"Name of the South American country often mentioned in news and geography classes"},{"target":"ceviche","native":"ceviche","position":"Middle","cultural_context":"Popular Latin American seafood dish found on many menus"},{"target":"Navidad","native":"Christmas","position":"Middle","cultural_context":"Heard in the holiday song “Feliz Navidad”"}]}]
["w",{"thoughts":"Spanish hardly ever uses the letter “w.” When it does appear it’s in loan-words, so Spaniards either keep the English-style /w/ glide (as in “wifi”) or replace it with the soft Spanish b/v sound /β̞/ (as in many German names such as “Wagner”). Because the English /w/ already exists for learners, and the alternative /β̞/ is just the Spanish b/v they have to learn anyway, this letter should not cause much trouble.","pattern":"w","position":"Anywhere","description":"In Spanish loan-words, “w” is usually pronounced like the English ‘w’ in “water” (a quick rounded glide). In some older or Germanic names it is read like the Spanish ‘b/v’—a soft, un-aspirated bilabial sound made with the lips almost touching (similar to the middle of English “aBate”). Listen to natives for the preferred option in each word; most modern tech and food terms keep the English-style /w/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"whisky","native":"whisky","position":"Beginning","cultural_context":"Same alcoholic drink name used in English"},{"target":"wifi","native":"wifi","position":"Beginning","cultural_context":"Universal tech term for wireless internet"},{"target":"kiwi","native":"kiwi","position":"Middle","cultural_context":"Common fruit name"},{"target":"Wagner","native":"Wagner","position":"Beginning","cultural_context":"Famous German composer; name appears in music and culture"}]}]
["x",{"thoughts":"Spanish ‘x’ can sound like English /ks/, but it’s often /h/ (like an English ‘h’ in ‘ha’) and occasionally just /s/. English speakers know the letter, but not these extra values, so the guide highlights all three with familiar words.","pattern":"x","position":"Anywhere","description":"Most of the time ‘x’ is pronounced like the English ‘ks’ (as in ‘taxi’). In many place-names and older words, especially those from indigenous languages, it’s a raspy ‘h’ sound, exactly like Spanish ‘j’ (México → ‘MEH-hee-ko’). At the very start of some scholarly or borrowed words it softens to a plain ‘s’ (xilófono → ‘see-LO-fo-no’). Think: ks / h / s depending on the word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"México","native":"México","position":"Middle","cultural_context":"Name of the country south of the U.S."},{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Same word as English – a cab you hail"},{"target":"xilófono","native":"xilófono","position":"Beginning","cultural_context":"Almost identical to English “xylophone,” the percussion instrument"}]}]
["y",{"thoughts":"English speakers already know the basic /y/-glide in “yes,” so the consonant value will feel familiar. What is new is that Spanish y can also behave as a vowel (the sound of “ee”) when it stands alone or closes a word, and the consonant can be a bit harder/closer to a soft \"j\" in some accents. Remember: treat word-initial y like English “y,” treat final y like “ee.”","pattern":"y","position":"Anywhere","description":"Two jobs: (1) Consonant /ʝ/ ~ /j/ – very similar to the English y in “yes,” though many speakers press the tongue a little harder, giving a soft “dj” feel; (2) Vowel /i/ – sounds like the English “ee” when y appears by itself (the word y = “and”) or at the end of a syllable, e.g., “rey.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"yoga","native":"yoga","position":"Beginning","cultural_context":"Worldwide fitness and mindfulness practice"},{"target":"Maya","native":"Maya","position":"Middle","cultural_context":"Famous ancient Mesoamerican civilization"},{"target":"Rey","native":"rey","position":"End","cultural_context":"Heroine’s name in recent Star Wars movies; also Spanish for “king”"},{"target":"Uruguay","native":"Uruguay","position":"End","cultural_context":"South American country often mentioned in sports and geography"}]}]
["z",{"thoughts":"English speakers already know the letter “z,” but in Spanish it is almost never the English /z/ sound. Most of Latin America pronounces it exactly like an English “s,” while most of Spain pronounces it like the voiceless “th” in “thin.” Knowing which region you are listening to is the main challenge.","pattern":"z","position":"Anywhere","description":"In Latin-American Spanish, “z” is pronounced like an unvoiced English “s” (as in “sip”). In most of Spain, it is pronounced as the voiceless dental fricative /θ/, the same sound written “th” in English “thin.” It is never the English buzzing /z/. Tip: keep your vocal cords off; if you use your voice you’re making the English /z/, which Spanish never does.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Zorro","native":"zorro","position":"Beginning","cultural_context":"Masked hero in films and comics; name literally means “fox” in Spanish"},{"target":"Ibiza","native":"Ibiza","position":"Middle","cultural_context":"Well-known Spanish island famous for nightlife"},{"target":"cerveza","native":"cerveza","position":"End","cultural_context":"Spanish word for beer, common on restaurant menus"},{"target":"Zaragoza","native":"Zaragoza","position":"Multiple","cultural_context":"Major Spanish city often mentioned in travel guides"}]}]
["á",{"thoughts":"English already has the same /a/ vowel (as in “father”), so the only novelty is the written accent, which just marks stress; the actual sound is familiar.","pattern":"á","position":"Anywhere","description":"Pronounce it like the “a” in English “father.” The accent mark simply tells you this syllable is stressed; it does NOT change the vowel quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"¡Ándale!","native":"Come on! / Hurry up!","position":"Beginning","cultural_context":"Famous catch-phrase of the cartoon character Speedy Gonzales"},{"target":"más","native":"more","position":"Middle","cultural_context":"Seen on bilingual signs and menus (e.g., “2×1 y más”) in the US"},{"target":"Álamo","native":"Alamo (historic mission/fort)","position":"Beginning","cultural_context":"The Battle of the Alamo is a well-known event in U.S. history"},{"target":"Bogotá","native":"Bogotá (capital of Colombia)","position":"End","cultural_context":"Often mentioned in news, travel shows, and airline destinations"}]}]
["é",{"thoughts":"Spanish accented é is simply the normal Spanish vowel /e/ with guaranteed stress; English speakers have seen it in loan-words like café or résumé. The sound itself is similar to the first part of English “day” but shorter and without the off-glide, so it is usually easy to say— the main new idea is placing the stress where the accent mark tells you.","pattern":"é","position":"Anywhere","description":"é is pronounced as a pure, short \"eh\" sound (close-mid front vowel). Think of the first half of the English word “day,” but stop before your tongue glides up toward a \"y\" sound. The accent mark does NOT change the vowel quality; it simply shows that this syllable is stressed.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"México","native":"México","position":"Beginning","cultural_context":"Name of the neighboring country—often seen spelled with the accent in Spanish contexts"},{"target":"Pérez","native":"Pérez","position":"Middle","cultural_context":"Common Hispanic surname seen in sports & media"},{"target":"café","native":"café","position":"End","cultural_context":"Word for a coffee shop; used in English menus"},{"target":"José","native":"José","position":"End","cultural_context":"Very common Spanish male name (e.g., baseball star José Altuve)"}]}]
["í",{"thoughts":"Spanish í is just the stressed version of the vowel /i/. English speakers know the basic “ee” sound, so recognition is high; the main teaching point is to keep it short-and-pure (no off-glide). The pattern can show up anywhere in a word.","pattern":"í","position":"Anywhere","description":"Pronounced like the pure “ee” in English “machine.” Keep the tongue forward and high, lips slightly spread. Unlike many English ‘ee’ sounds, do NOT let it slide into a ‘y’ sound; hold one steady, short vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"sí","native":"sí (yes)","position":"End","cultural_context":"Common word for “yes” often heard in movies and basic phrases"},{"target":"aquí","native":"aquí (here)","position":"End","cultural_context":"Often seen on bilingual signs like “Exit Aquí/Here”"},{"target":"María","native":"María","position":"Middle","cultural_context":"Very common Spanish given name—think of the song “Maria” from West Side Story"}]}]
["ó",{"thoughts":"In Spanish the written accent on ó does NOT change the vowel quality; it simply marks that the pure closed-back vowel /o/ is the stressed syllable. English already has a similar sound in words like “go,” but English speakers often let the vowel glide toward /u/ (“gou”). They just need to keep it short and pure and put the main stress on that syllable.","pattern":"ó","position":"Anywhere","description":"Pronounce a short, pure “o” (lips rounded, tongue back) similar to the first part of English “go,” but do NOT let it slide into a w-sound. The accent mark only shows this syllable gets the stress.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Óscar","native":"Óscar","position":"Beginning","cultural_context":"Common Spanish given name; actor Óscar Isaac"},{"target":"Adiós","native":"Adiós","position":"Middle","cultural_context":"Spanish word for “good-bye” heard in everyday English"},{"target":"Corazón","native":"Corazón","position":"End","cultural_context":"“Heart” in Spanish; title line in many Latin pop songs"},{"target":"Pokémon","native":"Pokémon","position":"Middle","cultural_context":"Globally known video-game and cartoon franchise"}]}]
["ú",{"thoughts":"Spanish ú is simply the regular Spanish vowel /u/ marked for stress. English already has a similar sound in words like “food,” so the quality is familiar; the main new idea is that the accent shows which syllable is stressed, not a new vowel quality. The sound itself should feel easy for English speakers, but they must remember to keep it short and pure (no glide) and to place the stress where the accent appears.","pattern":"ú","position":"Anywhere","description":"Pronounce ú as a pure, short \"oo\" sound, like the vowel in English “food,” but without any trailing glide (avoid turning it into “yoo”). The accent mark only tells you that this syllable is stressed; it does not change the vowel quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Úrsula","native":"Úrsula","position":"Beginning","cultural_context":"Famous villain name from Disney’s “The Little Mermaid”"},{"target":"música","native":"música","position":"Middle","cultural_context":"Looks like the English word “music,” often seen on Spanish‐language playlists and signs"},{"target":"Cancún","native":"Cancún","position":"End","cultural_context":"Well-known Mexican beach resort city advertised in travel commercials"}]}]
["ü",{"thoughts":"English speakers rarely see the Spanish ü, but when it does appear it simply tells you to pronounce the normally-silent “u” in the spellings gue / gui as a quick w-sound (as in English “wet”). So “güe / güi” = “gwe / gwi.” No change to the g; just slip a brief w-glide in before the e or i. Because English already has this w-glide, the sound itself is easy—remembering to say it is the only real hurdle.","pattern":"ü","position":"Anywhere","description":"In Spanish, ü only appears in the letter groups güe and güi. It forces the “u” to be heard, making the sequence sound like gwe or gwi (e.g., pin-GWI-no). Think of saying English “GWEt” minus the final t.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin,” an animal everyone recognizes"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Looks like English “bilingual,” a term you likely know"}]}]
["ch",{"thoughts":"Spanish “ch” is the same single sound English speakers already know from “chair.” No surprises in spelling or voice/voiceless issues, so recognition and production should be straightforward. Biggest note: make it a single sound, never pronounce the letters separately (never “c-h”).","pattern":"ch","position":"Anywhere","description":"Always a single, voiceless affricate—just like the first sound in English “chocolate” or “church.” Lips round slightly, tongue touches the roof behind the upper teeth, air is released in a quick burst.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"churro","native":"churro","position":"Beginning","cultural_context":"Popular fried pastry sold at fairs and theme parks"},{"target":"nacho","native":"nacho","position":"Middle","cultural_context":"Common snack of tortilla chips with cheese"},{"target":"muchacho","native":"muchacho","position":"Middle","cultural_context":"Often heard in movies or songs meaning “boy/guy”"}]}]
["ll",{"thoughts":"Most English speakers have already seen “ll” in food names like tortilla or quesadilla, so they know it exists, but they may not realise that its sound changes by region—usually a “y” sound, sometimes closer to the “j” in “Jacques,” or even “sh” in parts of Argentina/Uruguay. Producing a clean Spanish‐style glide (not the English dark L or a hard J) takes some practice.","pattern":"ll","position":"Anywhere","description":"In most of Spain and Latin America today, “ll” is pronounced like the English “y” in “yes” [j]. In some areas (Argentina, Uruguay, parts of Colombia) it can sound like the “s” in “measure” [ʒ] or “sh” [ʃ]. Traditional Spanish had a separate palatal L [ʎ], similar to the ‘lli’ in “million” said very quickly; you may still hear this in a few regions. Aim for a quick, light “y” glide unless you’re copying a specific accent.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"llama","native":"llama","position":"Beginning","cultural_context":"Animal name borrowed directly into English"},{"target":"tortilla","native":"tortilla","position":"Middle","cultural_context":"Staple Mexican flatbread familiar in tacos and wraps"},{"target":"quesadilla","native":"quesadilla","position":"Middle","cultural_context":"Popular Mexican dish—cheesy folded tortilla"},{"target":"paella","native":"paella","position":"Middle","cultural_context":"Well-known Spanish rice dish on many restaurant menus"}]}]
["rr",{"thoughts":"Spanish “rr” is the famous rolled/ trilled R—something many English speakers notice in words like “burrito” or “churro.” It never starts a word in Spanish spelling, but a single initial “r” is pronounced the same way, so learners feel it can show up almost anywhere in heard speech.","pattern":"rr","position":"Anywhere","description":"A rolled or trilled R. The tip of your tongue quickly vibrates against the alveolar ridge (the bumpy spot right behind your upper front teeth) one-plus times. Think of the Scottish rolled R in “brrrr” or a cat purr, but shorter. Airflow does the work—don’t try to force the tongue to tap; relax and let the airstream make it flutter.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Common Mexican food stuffed with rice, beans, etc."},{"target":"churro","native":"churro","position":"Middle","cultural_context":"Cinnamon-sugar fried dough snack sold at fairs and theme parks"},{"target":"Sierra Nevada","native":"Sierra Nevada","position":"Middle","cultural_context":"Name of a U.S. mountain range and popular craft-beer brand"}]}]
["qu",{"thoughts":"Spanish “qu” (only used before e/i) always sounds like a plain, quick /k/. English already has that consonant, so the main tip is to drop the English-style “w” glide and tone down the burst of air.","pattern":"qu","position":"Anywhere","description":"Pronounce it as a hard, unaspirated K—similar to the K in English “ski.” It never sounds like “kw.” Keep the tongue back, release quickly, and avoid the strong puff of air typical in English “k” at the start of words.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican cheesy tortilla dish"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in margaritas"},{"target":"quinoa","native":"quinoa","position":"Beginning","cultural_context":"Health-food grain commonly sold in supermarkets"}]}]
["que",{"thoughts":"Spanish “que” is just the consonant /k/ plus the pure Spanish ‘e’ vowel; the written “u” is silent. English speakers already know both sounds, but they must remember not to say a /w/ or /kw/ and to keep the /k/ un-aspirated.","pattern":"que","position":"Anywhere","description":"Pronounce it /ke/: an un-aspirated English ‘k’ (as in the second K of “skate”) followed by a short, pure “eh” like the vowel in “get.” The written “u” is completely silent; there is never a /w/ or /kw/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Well-known Mexican dish—cheesy folded tortilla"},{"target":"¿Qué pasa?","native":"¿Qué pasa?","position":"Beginning","cultural_context":"Pop-culture phrase meaning “What’s up?”"},{"target":"taquería","native":"taquería","position":"Middle","cultural_context":"Name for a taco shop, seen on many restaurant signs"}]}]
["qui",{"thoughts":"Spanish “qui” is simply the hard K sound plus a pure “ee.” The written u is silent; its only job is to keep the g-sound from appearing. English already has the /ki/ sequence in words like “key,” so the sound itself is familiar. The only wrinkle is making the Spanish vowel a quick, pure [i] without the slight glide English sometimes adds.","pattern":"qui","position":"Anywhere","description":"Pronounce it like English “key” /ki/: a hard K followed immediately by a short, pure EE. The written “u” is completely silent.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican liquor used in margaritas"},{"target":"taquito","native":"taquito","position":"Middle","cultural_context":"Small rolled taco on many Tex-Mex menus"},{"target":"aquí","native":"aquí","position":"End","cultural_context":"Means “here”; often appears on bilingual signs"},{"target":"quinoa","native":"quinoa","position":"Beginning","cultural_context":"Popular grain substitute sold in supermarkets"}]}]
["gu",{"thoughts":"Spanish “gu” is not a new consonant for English speakers—it always starts with a hard g.  The only wrinkle is whether the written u is heard.  If it is next to a, o, or a written ü, you will hear a quick w-like glide (gw).  If it comes before e or i without the two dots, the u is silent and you just say a hard g.  English has both patterns (e.g., Gwen vs. get) so the concept is familiar, but learners must remember the spelling rule.","pattern":"gu","position":"Anywhere","description":"Always a hard g.  gu + a/o/u or gü + e/i = “gw” as in ‘Gwen’.  gu + e/i = just hard g; the u is silent (as in Spanish ‘guitar-ra’).  Keep the Spanish vowels short and crisp.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Popular avocado dip served in many restaurants"},{"target":"agua","native":"agua","position":"Middle","cultural_context":"Basic Spanish word for water, often seen on bottled-water labels"},{"target":"guitarra","native":"guitarra","position":"Beginning","cultural_context":"Looks like the English word “guitar,” common in beginner Spanish lessons"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish for “penguin”; the ü shows up in language-learning apps and kids’ cartoons"}]}]
["gue",{"thoughts":"English speakers already know a hard “g” before “e” in words like “get,” but in Spanish the written combo “gue” is the reliable way to keep that hard G before the vowel E. The written “u” is normally silent unless it carries a diaeresis (ü), in which case you pronounce a brief “w”-like glide – something English doesn’t spell the same way, but the sound itself (as in “Gwen”) is familiar.","pattern":"gue","position":"Anywhere","description":"Most of the time “gue” sounds like a hard English G plus the Spanish open e: “geh.” You do NOT say the “u.” If the word uses “güe” (with ï), you pronounce it “gweh,” adding a quick W glide, like the first part of “Gwen.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guerrilla","native":"guerrilla (irregular fighter)","position":"Beginning","cultural_context":"Loanword frequently seen in news and history contexts"},{"target":"Guernica","native":"Guernica (Picasso’s famous painting/town)","position":"Beginning","cultural_context":"Iconic Picasso artwork often referenced in art classes"},{"target":"bilingüe","native":"bilingüe (bilingual)","position":"End","cultural_context":"Looks like the English word “bilingual”; seen in language-learning materials"}]}]
["gui",{"thoughts":"English speakers already meet the spelling “gui” in words like “guitar.”  In Spanish it behaves almost the same: hard G + a pure long “ee.”  The only surprise is the dotted version “güi,” which DOES pronounce the U as a quick W-sound.  So learners mainly have to remember “silent U vs. w-sound when you see the two dots.”","pattern":"gui","position":"Anywhere","description":"1) gui (no dots) = hard G + long “ee”: /gi/ – like the start of “geek,” but use the hard G of “get” and a pure \"ee\".\n2) güi (with ¨ over the u) = /gwi/ – say “GWEE.”  The dieresis tells you to pronounce the U as a quick W glide.\nKeep the vowel tight (like “machine”), and never soften the G to a J sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guitarra","native":"guitarra","position":"Beginning","cultural_context":"Spanish word for “guitar,” familiar from music and classes"},{"target":"Guillermo","native":"Guillermo","position":"Beginning","cultural_context":"First name of film director Guillermo del Toro"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish for “penguin,” a well-known animal"}]}]
["gü",{"thoughts":"English already has the /gw/ cluster (e.g. ‘GW’ in “Gwen”), so the sound itself is not new; what is new is the two-dot mark that tells Spanish speakers to pronounce the normally-silent ‘u’. Learners mainly need to remember to say the little ‘w’ glide before the following e or i.","pattern":"gü","position":"Anywhere","description":"In Spanish, the two dots (¨) over the u mean you pronounce the u, giving a clear “gw” sound before e or i: güe = GWAY, güi = GWEE. Think of saying the English letters “G + W” quickly together. Keep the lips rounded for the brief w-glide, then move right into the e or i vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin” – often seen in zoo signage or children’s books"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Appears on bilingual job ads and language-learning material"},{"target":"Agüero","native":"Agüero","position":"Middle","cultural_context":"Surname of famous Argentine soccer player Sergio Agüero"}]}]
["güe",{"thoughts":"“güe” is the hard English “g” in “go” followed immediately by the English “w” glide and the short open “e” as in “get”: /gwe/. The dieresis (¨) over the u tells you to pronounce the u; without it (gue) the u would be silent.","pattern":"güe","position":"Anywhere","description":"Say a hard g + quick w + short e (like “gweh”). Keep the w very short so it doesn’t become a separate syllable and don’t let the e drift toward an English long “ay.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"güey","native":"güey","position":"Beginning","cultural_context":"Common Mexican slang for “dude,” heard in movies and TV"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Looks almost identical to the English word “bilingual”"},{"target":"Nicaragüense","native":"Nicaragüense","position":"Middle","cultural_context":"Word for a person from Nicaragua—seen in news and geography contexts"},{"target":"Agüero","native":"Agüero","position":"Middle","cultural_context":"Last name of famous soccer star Sergio Agüero, often mentioned in sports media"}]}]
["güi",{"thoughts":"\"güi\" is rare but not exotic: it sounds like the English cluster “gwee.” The diaeresis (two dots) tells you to pronounce the u – otherwise in Spanish “gui” would sound like “gee.” English speakers already make the /gw/ glide in “penguin” or “Gwen,” so the main adjustment is to keep a very short, rounded w-glide before the long \"ee\" vowel.","pattern":"güi","position":"Anywhere","description":"Pronounce it /gwí/: a hard English g (as in “go”) immediately followed by a quick w-glide and a long \"ee\" sound. Think “gwee” in one smooth syllable. Keep the tongue back for the g, then let the lips round briefly for the w before finishing with the high front \"ee.\"","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin,” easy to guess from the English animal name"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Looks almost like the English word “bilingual,” often seen on bilingual packaging or signage"}]}]
["ce",{"thoughts":"English speakers already know that the letter “c” can sound like /s/ (city) or /k/ (cat).  In Spanish, when that “c” is followed by “e” (or “i”), it is ALWAYS the soft version – either the plain /s/ sound used across Latin America or the Castilian lisp-like /θ/ (as in think).  So the digraph “ce” never sounds like /k/ and never like English “ch.”  Learners just have to remember to keep the airflow continuous and not to add a vowel after the consonant.","pattern":"ce","position":"Anywhere","description":"‘c’ + ‘e’ is pronounced like the English “s” in “see” throughout Latin America, or like the unvoiced “th” in “think” in much of Spain.  The sound is always voiceless, never ‘k’ or ‘ch.’  Place the tip of your tongue close to (or lightly between, for Castilian) your front teeth and let air pass without vibration.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"cerveza","native":"beer","position":"Beginning","cultural_context":"Common word tourists use to order a beer"},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"Famous Spanish city and soccer team"},{"target":"dulce de leche","native":"dulce de leche","position":"Multiple","cultural_context":"Popular caramel-like dessert flavor found in ice-cream and pastries"}]}]
["ci",{"thoughts":"English speakers already know the consonant sounds /s/ and /θ/ as well as the vowel /i/ (“ee”). The only novelty is that Spanish always keeps the vowel short-and-pure and that in Spain the soft c is a voiceless dental “th.” Because learners have to remember two regional variants and keep the vowel from drifting toward a glide, the item is moderately tricky but not truly hard.","pattern":"ci","position":"Anywhere","description":"In Spanish, the letter group “ci” is pronounced like a short, pure \"ee\" vowel preceded by a soft c.  In most of Latin America the soft c is just an unvoiced English-style S: /si/.  In Spain it is the voiceless dental TH you hear in “think”: /θi/.  Keep the \"ee\" very short and do not add a trailing y-sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"cinco","native":"five","position":"Beginning","cultural_context":"From the holiday name “Cinco de Mayo,” widely mentioned in the U.S."},{"target":"ciudad","native":"city","position":"Beginning","cultural_context":"Seen in place names such as “Ciudad de México.”"},{"target":"gracias","native":"thanks","position":"Middle","cultural_context":"Common Spanish word English speakers use when thanking someone in Spanish"}]}]
["ge",{"thoughts":"English speakers already know the regular hard g /g/ and the soft g /dʒ/, but Spanish ge is neither of those—it’s the harsh “back-of-the-throat h” they may have heard in words like “jalapeño.” They may have encountered it without realizing the spelling rule (g before e or i). The sound is conceptually familiar but physically a bit tricky.","pattern":"ge","position":"Anywhere","description":"When g is immediately followed by e in Spanish, it is pronounced as a voiceless velar fricative /x/—think of a stronger, throatier version of the English h, like the ch in Scottish “loch” or German “Bach.” After that comes a short Spanish e (like the e in “bet,” but pure and brief). It never uses the hard g of “get.” Keep the back of your tongue close to the soft palate and let air hiss out without vibrating the vocal cords.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"general","native":"general","position":"Beginning","cultural_context":"Same spelling as English “general” (military rank/overall), common cognate"},{"target":"Argentina","native":"Argentina","position":"Middle","cultural_context":"Well-known South American country, often mentioned in news and sports"},{"target":"Gerónimo","native":"Gerónimo","position":"Beginning","cultural_context":"Famous historical name/exclamation shouted when jumping, heard in pop culture"}]}]
["gi",{"thoughts":"English speakers see the letters “gi” and expect a hard “g” as in “give.”  In Spanish, though, “g” before “i” changes to the same harsh or breathy sound that Spanish “j” makes, so it surprises learners.  The sound exists in some English dialects as a very strong ‘h,’ but most speakers still need a little practice to get the extra throat friction.","pattern":"gi","position":"Anywhere","description":"In Spanish, the spelling “gi” (with no silent u after the g) is pronounced /xi/: a raspier, throaty version of English “h” immediately followed by the pure Spanish “i” (like the “ee” in “machine”).  Think of starting to say a strong “h” while the back of your tongue lightly brushes the soft palate, then glide straight into “ee”: “hee,” but with more throat friction.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Gibraltar","native":"Gibraltar","position":"Beginning","cultural_context":"Well-known British territory at the entrance of the Mediterranean"},{"target":"gigante","native":"gigante","position":"Beginning","cultural_context":"Means “giant”; heard in phrases like wrestling name “El Gigante” or store slogans"},{"target":"digital","native":"digital","position":"Middle","cultural_context":"Looks almost identical to the English word “digital,” meaning the same thing"}]}]
["je",{"thoughts":"English speakers have probably run into the string “je” in words like “jefe” or the name “Jesús.” The main challenge is the Spanish letter J: it is not the English ‘j’ /dʒ/ or even the soft ‘h’ /h/, but a harsher throaty sound /x~h/. After that comes a short, pure Spanish ‘e’ (like the vowel in English “met,” but shorter and without the glide). Because of the unfamiliar consonant, the syllable may feel rough on the throat.","pattern":"je","position":"Anywhere","description":"Pronounce Spanish “je” as a single syllable: start with the back-of-the-throat ‘j’ (a raspy sound similar to the ‘ch’ in Scottish “loch” or the German “Bach”) and follow immediately with a clean, short ‘eh’ vowel. Avoid adding a ‘d’ or ‘sh’ quality as in English ‘j,’ and keep the vowel pure (no trailing ‘y’ glide).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Jesús","native":"Jesús","position":"Beginning","cultural_context":"Common Spanish given name—same as Biblical 'Jesus'"},{"target":"jefe","native":"jefe","position":"Beginning","cultural_context":"Heard in movies/TV as 'El Jefe' meaning 'the boss'"},{"target":"viaje","native":"viaje","position":"End","cultural_context":"Phrase '¡Buen viaje!' ('Have a good trip') appears in travel shows and guides"}]}]
["ji",{"thoughts":"Spanish “j” is always that raspy throat ‘h’, and when it meets “i” you simply add a pure “ee” afterwards. English speakers have heard it in foods like “fajita” or “jícama,” so the sound is not totally foreign, but the harsh back-of-the-throat friction can still feel unusual.","pattern":"ji","position":"Anywhere","description":"Pronounce a strong, breathy, back-of-the-throat “h” (like German “Bach” or Scottish “loch”) immediately followed by the vowel “ee.” Do NOT use the English ‘j’ /dʒ/ or add a ‘y’ glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fajita","native":"fajita","position":"Middle","cultural_context":"Tex-Mex dish of sizzling meat and peppers"},{"target":"jícama","native":"jícama","position":"Beginning","cultural_context":"Crunchy Mexican root vegetable found in grocery stores"}]}]
["y",{"thoughts":"Final Spanish “y” is the same glide English speakers already use in diphthongs like ‘boy/soy’. It never behaves like the English hard consonant in ‘yes’; instead it’s a quick /ee̯/ glide that finishes the word. Most learners have heard it in phrases such as “muy bien.” So it should feel familiar and be easy to copy.","pattern":"y","position":"End","description":"At the end of a word, Spanish “y” is not a full vowel but a short glide /j/ that blends with the vowel just before it: “o-y” becomes /oy/, “u-y” becomes /uy/, “e-y” becomes /ej/. Think of the final sound in English “toy” or “say,” but make it cleaner and shorter—avoid adding an extra syllable.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hoy","native":"hoy","position":"End","cultural_context":"Common Spanish word for “today,” heard in beginner lessons and songs"},{"target":"muy","native":"muy","position":"End","cultural_context":"Part of the set phrase “muy bien” that many non-Spanish speakers already know"},{"target":"soy","native":"soy","position":"End","cultural_context":"Appears in the meme-like phrase “Yo soy...” (“I am…”) and in brand slogans like “Soy yo”"},{"target":"rey","native":"rey","position":"End","cultural_context":"Seen in titles like “El Rey” (The King), e.g., the song by Vicente Fernández"}]}]
["r",{"thoughts":"Initial Spanish “r” is rolled, unlike the English ‘r’. Learners have probably heard the trill in words like “rodeo” but usually can’t produce it yet.","pattern":"r","position":"Beginning","description":"At the very start of a Spanish word, a single “r” is pronounced as a full alveolar trill (a rapid series of taps of the tongue against the ridge just behind the upper teeth). It sounds like the rolling ‘rr’ you hear in stereotypical “Arriba!”—closer to the rapid ‘dr’ in “drum-roll,” but longer and more vibrating than any English sound. Keep the tongue loose, flick air over it, and practice by imitating a purring cat.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"rodeo","native":"rodeo","position":"Beginning","cultural_context":"Western cattle-roping sport; same word used in English"},{"target":"rumba","native":"rumba","position":"Beginning","cultural_context":"Well-known Latin dance and music style"},{"target":"Río Grande","native":"Río Grande","position":"Beginning","cultural_context":"Famous river forming part of the U.S.–Mexico border; name appears in maps and news"}]}]
["h",{"thoughts":"Spanish h at the beginning of a word is always silent. English speakers expect an audible /h/ (as in “hat”), so they must consciously drop the breathy sound.","pattern":"h","position":"Beginning","description":"In Spanish, the letter “h” is completely silent—no breathy /h/ sound at all. Start directly with the following vowel or consonant, almost as if the word began with that next letter. Think of the silent h in English words like “honor” or “hour,” but apply that rule every time you see an initial h in Spanish.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Common Spanish greeting you likely know means “hello”"},{"target":"habanero","native":"habanero","position":"Beginning","cultural_context":"Well-known hot chili pepper used in salsas and hot sauces"},{"target":"Honduras","native":"Honduras","position":"Beginning","cultural_context":"Central American country mentioned in news, geography, and sports"}]}]
