["^r",{"thoughts":"Spanish r at the very start of a word is the same trilled sound learners meet as “rr.” English speakers have probably heard it in words like “Rumba” or hearing a Spanish-accented “Rico,” but they rarely produce it, so it feels exotic and challenging.","pattern":"^r","description":"At the beginning of a Spanish word the letter “r” is pronounced as a full alveolar trill – a rapid series of taps where the tip of your tongue strikes the bumpy ridge just behind your upper front teeth several times (usually 2-3). Air is pushed out steadily while the tongue vibrates, creating a rolled sound similar to Scottish Gaelic or Italian rolled r’s. Make sure the tongue is relaxed and the airflow is continuous; don’t try to consciously tap, let the air do the work.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Rumba","native":"rumba","position":"Beginning","cultural_context":"Well-known Latin dance and music style often taught in dance studios and seen on shows like “Dancing with the Stars”"},{"target":"Rico (as in Puerto Rico)","native":"Rico","position":"Beginning","cultural_context":"Name of the U.S. territory Puerto Rico; frequently heard in news, travel ads, and popular culture"},{"target":"Ronaldo","native":"Ronaldo","position":"Beginning","cultural_context":"Famous international soccer star whose name is often pronounced with the Spanish/Portuguese rolled R by commentators"}]}]
["r",{"thoughts":"Spanish “r” actually comes in two flavors: a quick single-tap (most common) and a stronger multiple-tap trill when the letter is at the very start of a word or follows l, n, or s. The quick tap is very similar to the flap Americans already make in words like “butter,” so the sound is not totally foreign, but remembering when to tap vs. trill adds complexity.","pattern":"r","description":"Most of the time a single Spanish r is a fast, single tap of the tongue against the little ridge just behind your upper front teeth (the same place you start an English “d”). It’s like the quick sound many Americans make in the middle of “butter” or “ladder.” When a single r stands at the beginning of a word—or follows the consonants l, n, or s—it is pronounced as a short trill: the tongue vibrates against that same ridge two or three times in rapid succession. Keep the tongue relaxed and use a burst of air from the lungs to start the vibration.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Corona","native":"Corona","position":"Middle","cultural_context":"Famous Mexican beer brand frequently advertised in the U.S."},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"Major Spanish city known for tourism and soccer; often mentioned in travel shows and sports news"},{"target":"Rio Grande","native":"Río Grande","position":"Beginning","cultural_context":"Well-known river forming part of the U.S.–Mexico border, often referenced in geography and history"}]}]
["rr",{"thoughts":"Spanish “rr” is the rolled or trilled R—something English almost never uses. Learners must vibrate the tongue tip against the ridge just behind the upper front teeth (alveolar ridge) while pushing air. Many English speakers have heard the sound in Mexican food names or shouted interjections like “Arriba!”, but they rarely produce it themselves, so it feels exotic and tricky.","pattern":"rr","description":"Touch the very tip of your tongue lightly to the ridge right behind your upper front teeth, let it relax, and push air so it vibrates rapidly—like a tiny drum roll. You need several quick taps (a trill), not just one. Think of a cat purring or the sound of a tiny motor. Voice it (vocal cords on) as you trill. The result is a bright, buzzing R that lasts a fraction of a second.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Common Mexican dish found in many U.S. restaurants"},{"target":"Sierra Nevada","native":"Sierra Nevada","position":"Middle","cultural_context":"Famous U.S. mountain range and popular beer brand name"},{"target":"arriba","native":"arriba","position":"Middle","cultural_context":"Spanish exclamation (“Up!”) often heard in pop culture and sports chants"}]}]
["ll",{"thoughts":"English speakers have seen “ll” in Mexican food terms and place names, but they may not realize it is usually pronounced like the English “y” in “yes.” Some dialects make it sound more like the “s” in “measure,” so learners need one clear default: the ‘y’-sound.","pattern":"ll","description":"In most Latin-American and many European accents, the Spanish letters “ll” are pronounced like the English consonant sound /y/ as in “yes.” Place the middle of your tongue close to, but not touching, the roof of your mouth just behind your upper teeth and let voiced air glide out. It is a single smooth sound, not a doubled or held ‘l.’ (In a few regions, it can sound like the ‘zh’ in “measure,” but the ‘y’ pronunciation is safest for learners.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"llama","native":"llama","position":"Beginning","cultural_context":"The South-American animal seen in zoos and memes is spelled this way in English, too."},{"target":"tortilla","native":"tortilla","position":"Middle","cultural_context":"Staple Mexican flatbread found in supermarkets and restaurants."},{"target":"quesadilla","native":"quesadilla","position":"End","cultural_context":"Popular Mexican dish; the word appears on many fast-food menus."}]}]
["ñ",{"thoughts":"English already has a very close approximation (the “ny” in “canyon”), but the dedicated Spanish letter and the need to keep the tongue against the hard palate throughout can still feel new. Learners usually recognise it from food and news terms.","pattern":"ñ","description":"This is a single consonant made by placing the middle-front of your tongue against the hard palate (just behind your upper front teeth) while letting air pass through your nose – essentially saying an “n” and “y” at the same time. It sounds like the “ny” cluster in the English word “canyon.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jalapeño","native":"jalapeño","position":"End","cultural_context":"Popular Mexican pepper featured in salsas, nachos, and fast-food menus"},{"target":"piña colada","native":"piña colada","position":"Middle","cultural_context":"Famous tropical cocktail mentioned in songs and drink menus"},{"target":"El Niño","native":"El Niño","position":"End","cultural_context":"Climate pattern often discussed in weather reports and news"}]}]
["ch",{"thoughts":"English already has the same spelling and sound, so learners mainly need to remember that Spanish keeps it consistent—always the “ch” of “church.”","pattern":"ch","description":"In Spanish, “ch” is pronounced exactly like the English “ch” in “church.” Start with the tip of your tongue touching or very near the ridge just behind your upper front teeth (as if saying a quick \"t\"), then immediately release into a hissing \"sh\" airflow. The result is one blended sound, a voiceless affricate [t͡ʃ]. Unlike English, Spanish never lets this spelling sound like “k” or “sh” alone—it's always the same.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"churro","native":"churro","position":"Beginning","cultural_context":"Fried dough pastry sold at fairs, theme parks, and many Mexican restaurants in the US"},{"target":"nacho","native":"nacho","position":"Middle","cultural_context":"Popular snack of tortilla chips with melted cheese; word appears on almost every casual restaurant menu"},{"target":"macho","native":"macho","position":"Middle","cultural_context":"Used in English to describe a very tough or masculine person (e.g., “macho man”)"}]}]
["qu",{"thoughts":"Spanish “qu” is straightforward for English speakers because it sounds like the familiar English /k/ and never like the English “kw.” The silent “u” can surprise beginners, but once learned, it’s easy.","pattern":"qu","description":"In Spanish, the digraph “qu” is pronounced exactly like the English “k” sound (/k/) when it appears before the vowels e or i. The written “u” is silent—there is no “w” or “oo” sound. Your tongue should briefly touch the soft palate (same place as in the English word “key”), then release a quick, unvoiced burst of air.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican dish widely available in U.S. restaurants"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in margaritas and other cocktails"},{"target":"Quixote (Don Quixote)","native":"Quijote","position":"Beginning","cultural_context":"Classic Spanish novel often referenced in literature and pop culture"}]}]
["que",{"thoughts":"“qu-e” in Spanish is pronounced /ke̞/. The consonant is exactly the English hard “k.”  The written “u” is silent, and the vowel is a pure, short mid-front vowel similar to the first syllable in “ketchup,” not the diphthong “ay” as in English “kay.”  English speakers already know the /k/ sound and a similar “eh” vowel, but they often turn it into “kay,” so some adjustment is needed.","pattern":"que","description":"Say a hard English “k,” then a quick, pure \"eh\" (like the e in “bet,” but a bit tenser).  Do NOT let the vowel glide into a “y” sound—keep it very short and flat: “keh.”  The written “u” is silent.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican dish commonly found in U.S. restaurants"},{"target":"queso","native":"cheese","position":"Beginning","cultural_context":"Word for melted cheese dip on many Tex-Mex menus"}]}]
["qui",{"thoughts":"Spanish “qui” is simply the consonant /k/ plus the vowel /i/. English speakers already know both sounds separately (“k” as in “cat”, long “ee” as in “keep”). The only minor twist is that the written “u” is silent, which can surprise learners.","pattern":"qui","description":"Pronounce it like the English word “key,” but keep it very short and crisp: start with the back-of-the-tongue /k/, immediately glide to a pure, tense “ee” vowel /i/. There is no ‘w’ or ‘y’ glide and the written “u” is completely silent.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Popular Mexican spirit used in margaritas and other cocktails"},{"target":"mosquito","native":"mosquito","position":"Middle","cultural_context":"Common insect; same word in English weather and travel warnings"},{"target":"Quixote (as in Don Quixote)","native":"Quijote","position":"Beginning","cultural_context":"Famous literary character frequently mentioned in books, movies, and pop culture"}]}]
["ge",{"thoughts":"Spanish “ge” is written with the letter g followed by e, and it is always pronounced like a throaty, voiceless “h” (/x/). English speakers hear something similar at the start of the Scots word “loch” or the German “Bach,” but a bit softer. The tongue is raised toward the soft palate while air is forced out, creating gentle friction. It never sounds like the hard English “g” in “go.”","pattern":"ge","description":"Pronounce it as a soft, breathy ‘h’ made farther back in the mouth than the English h. Raise the back of your tongue toward the soft palate, let the air pass with audible friction, and follow immediately with the vowel e (“eh”). Think of exhaling a quiet, scratchy sigh.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"general","native":"general","position":"Beginning","cultural_context":"Spelled exactly like the English word “general,” often heard when talking about military ranks or titles in Spanish-language media"},{"target":"Argentina","native":"Argentina","position":"Middle","cultural_context":"Name of the well-known South American country, frequently mentioned in sports and world news"},{"target":"gente","native":"gente","position":"Beginning","cultural_context":"Common word meaning “people,” encountered in Spanish songs, subtitles, and beginner textbooks"}]}]
["gi",{"thoughts":"Spanish “gi” uses the same soft g you hear in Spanish “j”.  It is a raspy, throat-based sound that English rarely employs, so learners may confuse it with an ordinary English h.  Fortunately, it shows up in many international words like “digital” and “original,” so students have reference points even if they have not noticed the different sound.","pattern":"gi","description":"In Spanish, the letter combination “gi” is pronounced as a single consonant-vowel unit.  The g is a voiceless velar fricative [x]—think of a stronger, throatier version of the English h in “ahead,” similar to the ch in Scottish “loch” or German “Bach.”  You produce it by raising the back of your tongue toward the soft palate without fully closing off the airflow, letting air scrape through your throat.  Immediately after that, you glide into a short, pure Spanish “i” (like the ee in “meet,” but shorter and without the y-glide).  Altogether it sounds like “hee,” but with a huskier, more back-of-the-throat beginning.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Gibraltar","native":"Gibraltar","position":"Beginning","cultural_context":"Famous British territory at the entrance to the Mediterranean; appears in news and geography discussions"},{"target":"digital","native":"digital","position":"Middle","cultural_context":"Same word in English, heavily used in tech and everyday speech"},{"target":"original","native":"original","position":"Middle","cultural_context":"Common adjective and noun in both languages, used in advertising and entertainment (e.g., \"original series\")"}]}]
["gue",{"thoughts":"English speakers already know the hard “g” in “get.”  In Spanish, the sequence “gue” is simply that same hard g plus the short open e sound, and the written “u” is silent (unless it carries a diaeresis – ü – which is a different case).  The main new idea is learning to ignore the ‘u’ when no dots are present.","pattern":"gue","description":"Pronounce it like the beginning of English “get” but immediately followed by a pure Spanish short “eh” sound: [ge].  The written “u” is NOT pronounced.  Lips stay relaxed (no diphthong into a glide as in English “gay”); keep the vowel short and crisp.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"guerrilla","native":"guerrilla","position":"Beginning","cultural_context":"You’ve heard of “guerrilla warfare” or “guerrilla marketing” in English media."},{"target":"Miguel","native":"Miguel","position":"Middle","cultural_context":"Common Hispanic first name—think baseball star Miguel Cabrera or actor Miguel."},{"target":"Guernica","native":"Guernica","position":"Beginning","cultural_context":"Famous Picasso painting and historical Spanish town often mentioned in art or history classes."}]}]
["gui",{"thoughts":"“gui” in Spanish is simply a hard “g” plus the vowel sound “ee.”  The written “u” is silent (unless it has two dots – ü – which is a different pattern).  English already has the hard g /g/ and the long e /i/ sounds, but English spelling never uses “gui-” for this, so learners may hesitate or try to pronounce the “u.”","pattern":"gui","description":"Pronounce it like the hard g in “get” followed immediately by the Spanish “ee” sound (as in “machine”).  The written “u” is NOT pronounced; it only tells you the g should stay hard before the letter i.  Smoothly connect the sounds: /gi/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guitarra","native":"guitarra","position":"Beginning","cultural_context":"Spanish word for the very familiar instrument “guitar,” so the spelling looks similar and is often seen in music contexts"},{"target":"Guillermo","native":"Guillermo","position":"Beginning","cultural_context":"First name of well-known Mexican film director Guillermo del Toro and other public figures"},{"target":"Guinea Ecuatorial","native":"Guinea Ecuatorial","position":"Beginning","cultural_context":"Spanish-speaking African nation occasionally mentioned in news, geography classes, or international sports"}]}]
["güe",{"thoughts":"“güe” is the spelling Spanish uses when the writer wants the letter u to be clearly pronounced after g and before e.  English speakers already know the hard g sound (go) and the w-glide (we), so the only new idea is putting them together quickly before the “eh” vowel.  Most learners have run across the pattern in place-names like Parc Güell or surnames such as Agüero, but they may not have realized what the two-dot mark (¨) is doing.","pattern":"güe","description":"Say a hard English g as in “go,” immediately slide into a short w sound, and finish with the vowel in “bet.”  It comes out like “GW-eh.”  The two dots over the u (called a diaeresis) tell you that the u is NOT silent; you must voice it as a w-glide.  Your lips start rounded for the w, then open for the eh.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Güell","native":"Güell","position":"Beginning","cultural_context":"Gaudí’s famous Parc Güell in Barcelona—common tourist destination and photo spot"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Spanish word for “bilingual”; often seen on bilingual education signs and textbooks in the U.S."},{"target":"Agüero","native":"Agüero","position":"Middle","cultural_context":"Surname of Argentine soccer star Sergio Agüero, mentioned frequently in sports media"}]}]
["güi",{"thoughts":"The dieresis over the u tells the reader that the u must be pronounced and glide into the following i, giving a /gwi/ or /gwí/ sound. English speakers have heard the same consonant-glide in words like “Gwen” (/gwɛn/) or “penguin” (/ˈpɛŋɡwɪn/), so it is not completely foreign, but the written ü and the quick transition to a Spanish-style pure vowel /i/ may feel new.","pattern":"güi","description":"Pronounce a hard English g (as in go) while quickly rounding your lips into a brief w-like glide, then move straight into a short, pure Spanish eee sound /i/. All together it sounds like “gwee,” but keep the Spanish vowel crisp (no diphthong such as the English long e).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin”; shows up in zoo signs, children’s cartoons, and product names that feature penguins"},{"target":"lingüística","native":"lingüística","position":"Middle","cultural_context":"Looks like the English word “linguistics,” common term in academics and language apps; the ü clearly displays the sound"}]}]
["ga",{"thoughts":"English already has the hard g + “ah” sequence (garden, gala), so most learners have heard and said it before. The only reminder is that Spanish never softens this g before ‘a’, so it always stays a hard sound.","pattern":"ga","description":"Pronounce a hard, voiced “g” (like in English “go”) immediately followed by the open “ah” vowel (as in “father”). The tongue briefly contacts the back of the soft palate for the g, releases, and the mouth stays open for the broad a sound. The result is one quick syllable: “gah.” There is no puff of extra air and no change to a soft ‘j’ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"gazpacho","native":"gazpacho","position":"Beginning","cultural_context":"Well-known Spanish cold soup featured on many menus and cooking shows"},{"target":"Galápagos","native":"Islas Galápagos","position":"Beginning","cultural_context":"Famous Ecuadorian islands you see in documentaries about Darwin and unique wildlife"},{"target":"garbanzo","native":"garbanzo","position":"Beginning","cultural_context":"Spanish word for chickpea, found on cans and ingredient lists in grocery stores"}]}]
["go",{"thoughts":"Spanish “go” is almost identical to the English syllable “go,” except the Spanish vowel is a pure, steady sound instead of the English tendency to glide toward a slight “w.” English speakers therefore already know the consonant and nearly know the vowel.","pattern":"go","description":"Pronounce a hard, voiced G—your vocal cords vibrate and the back of your tongue briefly seals against the soft palate, just like the G in English “goat.” Immediately release into a pure, rounded mid-back vowel /o/. Keep the vowel short and steady (no trailing ‘w’ sound). The result is /go/, one clean syllable.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"amigo","native":"amigo","position":"End","cultural_context":"Common Spanish word for “friend” that shows up in movies and casual English speech"},{"target":"tango","native":"tango","position":"End","cultural_context":"World-famous Argentine dance and music style"},{"target":"Goya","native":"Goya","position":"Beginning","cultural_context":"Well-known Latino food brand in U.S. supermarkets (also a famous Spanish painter’s surname)"}]}]
["gu",{"thoughts":"“gu” is common and shows up in words many English speakers already know, but the pronunciation rules (silent vs. “w”-like glide) are not obvious from English spelling habits. Native English speakers already make the hard G /g/ and the glide /w/, so the physical sounds aren’t new; what’s new is knowing when the written “u” is silent and when it is pronounced.","pattern":"gu","description":"In Spanish, the letter group “gu” always begins with a hard G – the same sound you make in English “go.”\n• Before the vowels a, o, or u (gua, guo, gu), the “u” is pronounced like a quick English W, creating /gwa/, /gwo/, /gw/; lips round briefly, then open into the vowel (e.g., “guacamole”).\n• Before e or i (gue, gui) the “u” is normally SILENT. It’s there only to keep the hard G. Say just /ge/ or /gi/ as in “Miguel.”\n• If you see two dots over the u (güe, güi), the “u” is pronounced, again like a W.\nThe hard G never softens to the English J sound, and the glide never becomes a full vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Very popular avocado dip served in Mexican restaurants and supermarkets"},{"target":"Miguel","native":"Miguel","position":"Middle","cultural_context":"Common Spanish first name—famous singer Miguel, baseball star Miguel Cabrera"},{"target":"Guatemala","native":"Guatemala","position":"Beginning","cultural_context":"Central American country frequently mentioned in news, maps, and travel shows"}]}]
["ce",{"thoughts":"Spanish “ce” is simply the letter ‘c’ when it comes directly before the vowel e. In most of the Spanish you’ll hear in Latin America it is pronounced just like the English “s.” In much of Spain it is produced like the un-voiced “th” in “thin.” Because the Latin-American ‘s’ version is what English speakers meet most often, the sound will usually feel already familiar.","pattern":"ce","description":"When the letter c appears before the vowel e in Spanish, you pronounce it as an un-voiced fricative: \n• Latin America (the variety you will hear most in music, films, and travel in the Americas): like the English “s” in “see.” Your tongue is close to, but not touching, the roof of the mouth just behind the teeth; the air hisses out smoothly with no vocal-cord vibration.\n• Spain (Castilian Spanish): like the un-voiced “th” in “thin.” The tip of the tongue rests lightly between the upper and lower teeth while air passes.\nImportant: it is never pronounced like the English hard “k” or the English voiced “z.”\n\nSpelling clue: any time you see “ce-,” “-ce-,” or “-ce” endings, use this soft sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"cerveza","native":"beer","position":"Beginning","cultural_context":"Common word on Mexican restaurant menus and on popular T-shirts saying “¡Más cerveza!”"},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"World-famous Spanish city and soccer team often mentioned in travel and sports news"},{"target":"Celia Cruz","native":"Celia Cruz","position":"Beginning","cultural_context":"Iconic Cuban salsa singer whose name appears in music streaming services and documentaries"}]}]
["ci",{"thoughts":"English speakers have already met the Spanish spelling “ci” in words like “Cinco de Mayo” or “gracias.” The spelling signals the “soft c.” In most of Latin America it sounds exactly like the English “s” plus the vowel “ee” (/si/). In Spain it is a light “th” as in “thin” plus “ee” (/θi/). Because English already has /si/ in words such as “see,” producing it is usually easy; the main pitfall is remembering not to say /ki/.","pattern":"ci","description":"In Spanish, the letters C + I are pronounced like the English “s” followed by a long “ee” (Latin America: /si/), or like the unvoiced “th” in “thin” plus “ee” (Spain: /θi/). Your tongue starts close to your upper gums (as for an English “s” or “th”) then immediately glides into the high front vowel /i/. It never sounds like the English hard “k.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Cinco de Mayo","native":"Cinco de Mayo","position":"Beginning","cultural_context":"Famous Mexican holiday widely celebrated and advertised in the United States"},{"target":"San Francisco","native":"San Francisco","position":"Middle","cultural_context":"Well-known major U.S. city whose name comes from Spanish"},{"target":"gracias","native":"gracias","position":"Middle","cultural_context":"Common Spanish word for “thank you” that many English speakers use when traveling or dining"}]}]
["ca",{"thoughts":"For English speakers, the sequence “ca” in Spanish is simply a hard /k/ followed by the open Spanish ‘a’ (/a/). Both components exist in English, so recognition is high and production is mostly straightforward. Main thing is avoiding an English “æ” (as in “cat”) and keeping the vowel short and pure.","pattern":"ca","description":"Pronounce it as a hard, unaspirated “k” sound immediately followed by the open vowel /a/—the same vowel you hear in the word “spa.” Your tongue briefly touches the soft palate for the /k/, then drops and stays low and relaxed for the ‘a’. Do not release a strong burst of air (aspiration) and do not let the vowel slide toward “ay” or “æ.” It’s a crisp, single syllable: [ka].","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"café","native":"café","position":"Beginning","cultural_context":"Common word for a coffee shop; widely used in English"},{"target":"Cancún","native":"Cancún","position":"Beginning","cultural_context":"Famous Mexican beach destination frequently mentioned in travel shows and ads"},{"target":"guacamole","native":"guacamole","position":"Middle","cultural_context":"Popular avocado dip served in many restaurants and at parties"}]}]
["co",{"thoughts":"Spanish “co” is simply a hard, unaspirated K sound followed by a pure single-beat “o.”  English speakers already say something very close, so the only real adjustment is keeping the vowel short and steady (no English-style glide toward a w/oo sound).","pattern":"co","description":"Start with the back of your tongue touching the soft palate to make a clean, quick K. Release it straight into a single, rounded “o” as in Spanish—lips rounded, jaw relaxed, and keep the vowel short and flat (don’t let it slide into the diphthong “oʊ” you hear in English words like “go”). The result is one crisp syllable /ko/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Coca-Cola","native":"Coca-Cola","position":"Multiple","cultural_context":"Global soft-drink brand everyone recognizes"},{"target":"Colorado","native":"Colorado","position":"Beginning","cultural_context":"U.S. state name frequently heard in news, travel, and sports"},{"target":"taco","native":"taco","position":"End","cultural_context":"Popular Mexican food item common in the U.S. and worldwide"}]}]
["cu",{"thoughts":"English speakers already know the hard “c” = /k/ sound and the “oo” vowel. Putting them together as “cu” (/ku/) or “cua/ cue /cuo/ as /kwa/, /kwe/, /kwo/ should feel familiar. The only reminder is not to slip in a “y” sound (avoid /kyu/). Lips stay rounded for a short, pure \"oo\" and the tongue starts in the same position used for the English word “cool.”","pattern":"cu","description":"In Spanish the letter pair “cu” is pronounced with a hard K sound followed immediately by the pure Spanish “u” vowel: /ku/. Think of saying English “koo,” but keep the vowel short and steady, like the first half of “could” without the final consonant. When another vowel follows (cua, cue, cuo), the sound becomes /kw/ + vowel, similar to English “qu-” in “quota.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Cuba","native":"Cuba","position":"Beginning","cultural_context":"Caribbean country often mentioned in history, politics, and travel"},{"target":"Cuervo (as in José Cuervo)","native":"Cuervo","position":"Beginning","cultural_context":"Famous tequila brand seen in bars and advertisements"},{"target":"cumbia","native":"cumbia","position":"Beginning","cultural_context":"Popular Latin American dance and music style referenced in world-music playlists"}]}]
["z",{"thoughts":"Spanish “z” is rarely a brand-new sound for English speakers because, in most of Latin America, it is simply the unvoiced “s” you already know.  What can cause confusion is that in much of Spain the same letter is pronounced like the English “th” in “thin.”  Either way, nothing about tongue placement or voicing is truly foreign to an English mouth.","pattern":"z","description":"Latin America: pronounce it exactly like the English “s” in “see.”\nSpain (Castilian accent): place the tip of your tongue lightly between your teeth and let air pass without vibrating your vocal cords—just like the “th” in “thin.”  The sound is always voiceless (no buzzing).  Whichever accent you choose, keep it short and crisp—never the English “z” (which is voiced).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Zara","native":"Zara","position":"Beginning","cultural_context":"Global fashion retailer whose stores and ads are common in malls and cities"},{"target":"Ibiza","native":"Ibiza","position":"Middle","cultural_context":"Famous Spanish island known worldwide for its nightlife and beaches"},{"target":"González","native":"González","position":"End","cultural_context":"Very common Spanish surname seen in sports, news, and entertainment"}]}]
["b",{"thoughts":"Spanish “b” is mostly the same voiced lip-closing sound English speakers already know, but between vowels it weakens into a softer, almost “v-like” glide that English doesn’t use. This variant may surprise learners, yet it is produced with the same lip position—just less force.","pattern":"b","description":"Start with both lips lightly together, voice on, and let the air build briefly. At the beginning of a phrase or after an m/n, release it fully like the English /b/ in “boy.” Between vowels or after most other consonants, keep the lips almost closed and let the sound leak out with continuous voicing; don’t release a full pop and don’t use your teeth—think of a very soft, lazy /b/, not the English /v/. There is no puff of air (aspiration).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"burrito","native":"burrito","position":"Beginning","cultural_context":"Popular Mexican dish found in many fast-food chains"},{"target":"Cuba","native":"Cuba","position":"Middle","cultural_context":"Well-known Caribbean country talked about in news and travel"},{"target":"Tabasco","native":"Tabasco","position":"Middle","cultural_context":"Famous hot-sauce brand sold internationally"}]}]
["v",{"thoughts":"English speakers already know the letter “v,” but in Spanish it is not pronounced with the upper teeth on the bottom lip. Instead, it shares the same sound as the Spanish “b,” a softer, almost buzzing lip-to-lip sound. Learners often keep using the English /v/ and need a reminder to bring the lips together instead of using the teeth.","pattern":"v","description":"In Spanish, the letter “v” is pronounced like a soft, unaspirated “b.”\n1. Lightly press both lips together (no teeth involved).\n2. Let air pass through with very little explosion—more like a gentle “bv” glide than the hard English “b.”\n3. At the start of a phrase or after a pause it is a closed bilabial stop (similar to English “b” but softer); between vowels it relaxes into a bilabial fricative/approximant, where the lips barely touch and the sound feels halfway between English “b” and “v.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Venezuela","native":"Venezuela","position":"Beginning","cultural_context":"Widely mentioned South American country; heard in news and geography class"},{"target":"Navidad","native":"Navidad","position":"Middle","cultural_context":"From the popular Christmas song “Feliz Navidad” played every holiday season"},{"target":"ceviche","native":"ceviche","position":"Middle","cultural_context":"Popular Latin American seafood dish featured on many restaurant menus"}]}]
["x",{"thoughts":"Spanish “x” can represent two different sounds: most of the time it is the crisp consonant cluster /ks/ (like the “x” in English “extra”), but in a handful of place-names and old spellings it is the rough, breathy sound /x/ (the same sound spelled “j” in words like “jalapeño”). English speakers therefore half-know the letter already, yet are often surprised by the Mexico/Texas pronunciation.","pattern":"x","description":"1) The common value is /ks/: say a quick “k” immediately followed by an “s,” with no vowel in between, as in English “ex-tra.”  2) In certain proper names of indigenous origin (México, Oaxaca, Texas, Ximena, etc.) it is pronounced /x/ – a voiceless, breathy “h” made by narrowing the back of the throat, the same sound you hear in Spanish “j.”\nTip: if the word looks international or scientific, choose /ks/; if it is a well-known place name, try the Spanish “h” sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"México","native":"México","position":"Middle","cultural_context":"Neighboring country; seen on maps, news, and travel materials"},{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Identical to the English word for a hired car service"},{"target":"Texas","native":"Texas","position":"Middle","cultural_context":"U.S. state name that comes from Spanish and appears constantly in media"}]}]
["j",{"thoughts":"Spanish “j” is the scratchy, throaty sound English-speakers notice in words like “jalapeño.” It is much stronger than the English “h,” made further back in the mouth and without any vocal-cord vibration, so it can feel unfamiliar and tricky at first.","pattern":"j","description":"Make a breathy, friction-filled sound at the back of your mouth. Lift the back of your tongue toward the soft palate (the same area you use for a hard ‘k’) but don’t touch it—let air scrape through the narrow gap. Your vocal cords stay off (no voicing), so it’s closer to the harsh ‘ch’ in German “Bach” or the Scottish “loch” than to the gentle English “h.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"jalapeño","native":"jalapeño","position":"Beginning","cultural_context":"Common Mexican pepper on many restaurant menus"},{"target":"José","native":"José","position":"Beginning","cultural_context":"Very common Spanish first name, e.g., baseball player José Altuve"},{"target":"San José","native":"San José","position":"Middle","cultural_context":"Major city in California and Costa Rica often mentioned in news and travel"}]}]
["s$",{"thoughts":"“s$” means the letter S when it is the very last sound of a Spanish word. English speakers already use an /s/ at the ends of many words (cats, bus), so the sound itself is familiar. The only trick is to keep it a pure, hissy /s/—never letting it turn into the voiced /z/ you sometimes hear in English plurals (dogs → /z/) and never adding an extra vowel afterward. Because of that small adjustment, the sound is still easy for most learners.","pattern":"s$","description":"A crisp, unvoiced “s” (IPA /s/) made with the tongue close to the alveolar ridge, letting air hiss out. In Spanish this final S is always voiceless—no vibration in the vocal cords—and it ends the word abruptly without adding any trailing vowel sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tacos","native":"tacos","position":"End","cultural_context":"Popular Mexican food widely eaten in the U.S. and elsewhere"},{"target":"nachos","native":"nachos","position":"End","cultural_context":"Common bar-snack and movie-night food, originally Mexican"},{"target":"adiós","native":"adiós","position":"End","cultural_context":"Well-known Spanish way to say “good-bye” often used in English conversations"}]}]
["d$",{"thoughts":"Word-final Spanish “d” is not the same hard stop English speakers make.  It is a soft, voiced dental fricative/approximant—closer to the “th” in “this,” but even weaker.  Many learners will want to pronounce it as a clear /d/ because that’s how English spells it.  The sound itself (the TH of “this”) is familiar, but using it when you see a letter D and keeping it very light takes practice.","pattern":"d$","description":"When the letter D appears at the END of a Spanish word, it is usually pronounced as a very soft, voiced dental fricative [ð̞].\n• Place the tip of your tongue just against the back of your upper front teeth (same place as English “th” in “this”).\n• Let the vocal cords vibrate and let a small stream of air pass—do NOT make a firm, popping stop like English final /d/.\n• Keep it light; many native speakers barely let it be heard in casual speech.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Madrid","native":"Madrid","position":"End","cultural_context":"Capital city of Spain; talked about in news, sports, and travel"},{"target":"salud","native":"health","position":"End","cultural_context":"Common Spanish toast (“Cheers!”) heard in Mexican restaurants and movies"},{"target":"usted","native":"you (formal)","position":"End","cultural_context":"Frequently appears in beginner Spanish lessons and popular phrases like “¿Cómo está usted?”"}]}]
["^ps",{"thoughts":"In Spanish, the digraph “ps” at the very start of a word is never pronounced with a “p.”  It is written for etymological reasons, but speakers only say an /s/.  English already does this in words such as “psychology” or “pseudonym,” so the concept is familiar and easy for learners.","pattern":"^ps","description":"When a Spanish word begins with the letters “ps,” you completely drop the “p.”  Just start with a normal Spanish “s” sound (a clear, unvoiced hiss made with the tongue close to the front teeth and no vocal-cord vibration).  There is no brief stop or puff of air before it—go straight into the /s/ as if the word were spelled “s…”.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"psicología","native":"psicología","position":"Beginning","cultural_context":"Looks almost the same as English “psychology,” often seen on university course lists or department signs"},{"target":"psicodélico","native":"psicodélico","position":"Beginning","cultural_context":"Spanish version of “psychedelic,” encountered in music and pop-culture discussions"},{"target":"Psicosis","native":"Psicosis","position":"Beginning","cultural_context":"Spanish title of Alfred Hitchcock’s classic film “Psycho,” a name movie fans may notice on posters or streaming menus"}]}]
["h",{"thoughts":"Spanish “h” is actually the absence of a sound – something English speakers already encounter in words like “hour” or “honest.” The key is remembering NOT to add the English puff of air.","pattern":"h","description":"In standard Spanish the letter “h” is completely silent. You do not breathe out or constrict your throat at all—just move straight to the next vowel or consonant. Think of it as if the letter isn’t there.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Common Spanish greeting known worldwide"},{"target":"Honduras","native":"Honduras","position":"Beginning","cultural_context":"Central American country often mentioned in news and geography lessons"},{"target":"alcohol","native":"alcohol","position":"Middle","cultural_context":"Same spelling in English—refers to beverages and chemical term"}]}]
["^h",{"thoughts":"Spanish words that start with the letter “h” are pronounced exactly as though the word began with a vowel – the “h” is completely silent. English speakers are used to an audible, breathy /h/, so they have to remember to remove that sound. Luckily many high-profile Spanish loanwords already show this, so the idea is somewhat familiar, but old habits can still sneak in.","pattern":"^h","description":"When the letter “h” appears at the very beginning of a Spanish word, you do NOT pronounce any sound at all. Start the word directly with the following vowel or consonant, almost as if the “h” were invisible. There is no puff of air, no /h/ noise, and certainly no aspiration like the English “h” in “house.” (Exception: the digraph “ch” is its own sound and is not silent.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Common Spanish greeting; many English speakers know it from basic phrases or travel"},{"target":"hasta","native":"hasta","position":"Beginning","cultural_context":"Heard in the movie line “Hasta la vista, baby,” meaning “until”"},{"target":"Honduras","native":"Honduras","position":"Beginning","cultural_context":"Central American country mentioned in news and geography classes"}]}]
["^hu",{"thoughts":"Spanish words that start with “hu” are pronounced without any audible H. The letter u combines with the following vowel to make the glide /w/, the same sound English writes with W. Because English already has this sound, learners mainly need to remember to drop any H sound and glide straight into the next vowel.","pattern":"^hu","description":"At the beginning of a word, the letters “h-u” are pronounced as a single glide like the English W. The H is completely silent; round your lips as if saying an English “w” and immediately move into the next Spanish vowel (e.g., huevo = /ˈwe-βo/). Don’t add an English H or a hard G sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"huevo","native":"huevo","position":"Beginning","cultural_context":"Seen on Mexican-style menus in dishes like “huevos rancheros.”"},{"target":"Hugo","native":"Hugo","position":"Beginning","cultural_context":"Common first name and the fashion label “Hugo Boss.”"},{"target":"huarache","native":"huarache","position":"Beginning","cultural_context":"Traditional Mexican sandal and food item; also the Nike “Huarache” sneakers."}]}]
["^hue",{"thoughts":"“hue” at the beginning of a Spanish word is simply the sound /we/.  The written “h” is silent and the “u” acts like the English “w”, so an English speaker basically says “we-” followed by the rest of the word.  Because the raw sound (/w/ + short e) exists in English, learners usually catch on quickly, especially if they already order “huevos rancheros.”","pattern":"^hue","description":"At the start of a word, the letters “hue” are pronounced as one syllable /we/.  Ignore the “h” completely.  Round your lips as if you are starting the English word “we,” glide into the pure Spanish “e” (like the vowel in “bet,” not the English diphthong in “way”), and then continue with the next consonant or vowel of the word.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"huevo","native":"huevo","position":"Beginning","cultural_context":"Spanish word for “egg”; appears on many bilingual menus and grocery products"},{"target":"huevos rancheros","native":"huevos rancheros","position":"Beginning","cultural_context":"Popular Mexican breakfast dish featured in cafés and cookbooks across the U.S."},{"target":"huelga","native":"huelga","position":"Beginning","cultural_context":"The term for a labor strike; appears in news coverage of protests and in U.S. history texts about farm-worker movements"}]}]
["^hie",{"thoughts":"^hie means the word begins with silent “h” plus the diphthong “ie.” Functionally you just say the Spanish “ye-” sound at the very start, just like the first part of English “yes.” Because English already has an initial /jɛ/ glide, most learners catch on quickly; the only surprise is remembering the written “h” is totally silent.","pattern":"^hie","description":"Ignore the written “h,” then pronounce “ie” as one smooth unit that sounds like the English “yeh.” Start with the tongue high and near the hard palate as if saying the English consonant “y,” then glide straight into a short open-mid “eh” vowel. Altogether it comes out as /je/ — a quick, single syllable that resembles the opening of the English word “yes,” but without the final “s.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hielo","native":"hielo","position":"Beginning","cultural_context":"If you ask for ice in Spanish-speaking bars or see “con hielo” on drink menus"},{"target":"hiena","native":"hiena","position":"Beginning","cultural_context":"Spanish word you might spot on bilingual zoo signs next to the animal hyena"},{"target":"hierba","native":"hierba","position":"Beginning","cultural_context":"Seen on spice packets or herbal tea labels marked “hierbas”"}]}]
["y",{"thoughts":"Spanish “y” is usually a palatal voiced sound somewhere between the English “y” in “yes” and the soft “j” in “judge.” English speakers have heard the sound in many Spanish-language place-names and ads, but the extra tongue contact can feel unfamiliar.","pattern":"y","description":"To pronounce Spanish “y,” start with the position for the English “y” in “yes,” but let the middle/front of your tongue come a little closer (or even lightly touch) the hard palate just behind your upper front teeth. Keep the sound voiced and let the air glide out smoothly. At the very start of an utterance it may begin with a tiny voiced stop, making it sound like the first part of English “judge,” but it quickly relaxes into the glide. Between vowels it becomes an even softer, buzzy glide. It never sounds like the English vowel ‘eye’ unless it is the single-letter word “y” (“and”).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"yo","native":"yo","position":"Beginning","cultural_context":"Commonly heard in phrases like “Yo quiero Taco Bell” commercials and basic Spanish classes, meaning “I.”"},{"target":"Yucatán","native":"Yucatán","position":"Beginning","cultural_context":"Well-known Mexican peninsula famous for tourism and Mayan ruins."},{"target":"Maya","native":"maya","position":"Middle","cultural_context":"Name of the ancient civilization and modern indigenous people frequently mentioned in history and travel shows."}]}]
["y$",{"thoughts":"The pattern y$ = the letter “y” when it is the very last letter in a Spanish word.  In that position it is no longer a consonant (/ʝ/), it turns into the vowel-glide /i̯/ – a quick \"ee\" off-glide tacked onto the previous vowel.  English speakers have heard it in country names like “Paraguay” and in the word “soy,” but they often pronounce it with the English \"oy\" [ɔɪ].  The real Spanish sound keeps a pure Spanish vowel before a short \"y\" glide, [oj] or [aj].  That makes it somewhat familiar but still needs practice.","pattern":"y$","description":"When the letter “y” is the very last letter of a Spanish word it is pronounced like a quick \"ee\" glide /i̯/ that attaches to the vowel right before it.  Think of the English \"y\" in “yes,” but here it comes after the vowel instead of before.  Say the preceding vowel clearly (o, a, e, etc.) and then let your tongue slide forward toward the \"ee\" position without adding an extra syllable.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"soy","native":"soy","position":"End","cultural_context":"Seen on grocery shelves in “soy milk,” “soy sauce”; Spanish word means “I am.”"},{"target":"Paraguay","native":"Paraguay","position":"End","cultural_context":"South-American country name heard in geography classes and sports events like the World Cup."},{"target":"Uruguay","native":"Uruguay","position":"End","cultural_context":"Another South-American country name often mentioned with Paraguay, soccer, and travel shows."}]}]
["tl$",{"thoughts":"‘tl’ at the very end of a word is rare in both English and Spanish; it mostly shows up in Spanish through loan-words from the Indigenous language Nahuatl. Spanish speakers treat it as a very tight sequence (or even a single affricate) with no vowel in between: first a clean English-style ‘t’, then immediately release the air laterally for an ‘l’. Because English never ends a word with a plain ‘tl’, learners may hesitate or slip in an extra vowel.","pattern":"tl$","description":"Put the tip of your tongue against the ridge just behind your upper teeth as if you are going to say a normal English ‘t’. Release the ‘t’, but instead of pulling the tongue all the way down, let the sides of the tongue drop so the air escapes around them—basically you move straight into an ‘l’ sound without inserting any vowel. The result sounds like a very quick, crisp ‘tl’ mashed together.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"axolotl","native":"axolotl","position":"End","cultural_context":"Exotic Mexican salamander popular as a meme and even a pet; appears in video games like Minecraft"},{"target":"Popocatépetl","native":"Popocatépetl","position":"End","cultural_context":"Active volcano near Mexico City often mentioned in news reports and travel documentaries"},{"target":"Nahuatl","native":"náhuatl","position":"End","cultural_context":"Name of the Aztec language you encounter in history or anthropology discussions"}]}]
["tz",{"thoughts":"English already has the /ts/ combination at the end of words like “cats,” so the physical action is familiar, but it almost never appears at the start or in the middle of an English word. Spanish “tz” asks you to place that same /ts/ cluster before a following vowel (often in words of indigenous origin such as Nahuatl). That feels unusual in English, so it may sound tricky at first, yet the tongue and airflow movements are the same as in the familiar ‘t+s’ of “cats.”","pattern":"tz","description":"Start with a quick, light English T, but do not let the tongue fully release before you immediately hiss into an S. Think of it as saying the ending of “cats” but right up against the next vowel: /ts/. The result is one tight syllable, almost like a single consonant. In many parts of Mexico and Central America it is a clear /ts/; in other regions it softens to a plain /s/. For learners, keeping the brief T contact gives the most neutral pronunciation.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"quetzal","native":"quetzal","position":"Middle","cultural_context":"National bird of Guatemala; name appears in travel shows and on currency trivia"},{"target":"Quetzalcoatl","native":"Quetzalcoatl","position":"Middle","cultural_context":"Well-known Aztec deity referenced in history documentaries and fantasy media"},{"target":"tzatziki","native":"tzatziki","position":"Beginning","cultural_context":"Popular Greek yogurt-cucumber dip found on many restaurant menus; same sound cluster helps reinforce the pronunciation"}]}]
["ks",{"thoughts":"The cluster “ks” is the exact same consonant pairing English speakers already say in words like “box” or “six,” so it should feel very familiar. In Spanish you simply keep the two sounds together without inserting a vowel between them.","pattern":"ks","description":"Pronounce a hard, unaspirated “k” sound immediately followed by a sharp “s.” Your tongue briefly touches the soft-palate for the “k,” releases, and the air continues straight into an “s” hiss. No extra vowel (like ‘uh’) should slip in between the two consonants.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Same word as in English for a cab—ubiquitous in travel vocabulary"},{"target":"éxito","native":"éxito","position":"Beginning","cultural_context":"Spanish word meaning “success,” often seen in song titles and store names across Latin America"},{"target":"máximo","native":"máximo","position":"Middle","cultural_context":"Close cognate of English “maximum,” encountered in weather reports (temperatura máxima) and everyday descriptions"}]}]
["w",{"thoughts":"Spanish only uses the letter “w” in loan-words and names, so English speakers already know both the spelling and the sound. In almost every case Spaniards pronounce it exactly like the English glide /w/, the same sound at the start of “water.”","pattern":"w","description":"Shape your lips into a small rounded opening as if you were going to pronounce an English “oo,” then immediately glide into the following vowel without letting the lips stay rounded for long. This is the same quick, voiced glide you make at the start of English words like “way” or between the syllables of “go-ing.” In Spanish it only appears in borrowed words such as “whisky” or “wifi.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"whisky","native":"whisky","position":"Beginning","cultural_context":"The classic alcoholic drink; the word is spelled the same in English and Spanish."},{"target":"sándwich","native":"sándwich","position":"Middle","cultural_context":"A universal food item; Spanish keeps the English spelling with a tilde on the first ‘a’."},{"target":"show","native":"show","position":"End","cultural_context":"Used in Spanish to mean a performance or TV show, borrowed directly from English and heard in entertainment contexts."}]}]
["g$",{"thoughts":"Spanish words almost never end in a native “g”; when they do it is almost always an English loan such as “blog.”  When it does appear, the sound is the same hard, voiced velar stop English speakers know from the end of “dog,” but without the little burst of air English sometimes adds.  So the sound should already feel familiar and be easy to produce.","pattern":"g$","description":"Letter “g” at the very end of a Spanish word is pronounced as a hard, voiced velar stop [g].  Touch the back of your tongue to the soft palate (same place as in English “go”) and let your vocal cords vibrate.  Release cleanly and do NOT add an extra puff of air or a following vowel—the sound should be short and crisp.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"blog","native":"blog","position":"End","cultural_context":"Common internet word; same as English online diary"},{"target":"zigzag","native":"zigzag","position":"End","cultural_context":"Describes a back-and-forth pattern; same spelling in English and Spanish"},{"target":"tag","native":"tag","position":"End","cultural_context":"Used for labels in clothing and as a social-media term"}]}]
["mf",{"thoughts":"The Spanish “mf” sound is not normally shown in spelling—most words are written with “nf,” but the n automatically changes to an m-like sound [ɱ] before the letter f. English has the same nasal-plus-f sequence in words like “comfort,” so the articulatory pattern is already familiar.","pattern":"mf","description":"You start with an m-type nasal, but instead of sealing both lips you touch the bottom lip lightly against the upper teeth (labiodental nasal [ɱ]). Without pausing, let air slide out for the voiceless “f.” It feels just like the transition between the two consonants in English “comfy” or “ham-fisted.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"infección","native":"infección","position":"Beginning","cultural_context":"Cognate of “infection”; heard often in health news"},{"target":"conflicto","native":"conflicto","position":"Middle","cultural_context":"Looks and sounds like English “conflict,” used in news and politics"},{"target":"conferencia","native":"conferencia","position":"Middle","cultural_context":"Direct cognate of “conference,” common in business & academic settings"}]}]
