["a",{"thoughts":"English already has a very similar short “a” sound (as in “father”), so this vowel should feel familiar. The biggest tip is to keep it pure and short—don’t glide toward an “uh” or “ay.”","pattern":"a","position":"Anywhere","description":"Always a single, pure open vowel—like the “a” in British-English “father” or the first half of the American interjection “ah.” Mouth open, jaw relaxed, tongue low and centered. No diphthong or schwa at the end.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"amigo","native":"amigo","position":"Beginning","cultural_context":"Famous Spanish word for “friend” used in English pop culture"},{"target":"taco","native":"taco","position":"Middle","cultural_context":"Ubiquitous Mexican food item"},{"target":"siesta","native":"siesta","position":"End","cultural_context":"Well-known term for an afternoon nap"},{"target":"salsa","native":"salsa","position":"Multiple","cultural_context":"Common word for the spicy sauce and a popular dance"}]}]
["b",{"thoughts":"Spanish “b” is basically the same consonant English speakers already know, but it has a second, softer version between vowels that feels almost like a mix of English b and v. Mastery mostly means remembering to relax the lips for that softer allophone.","pattern":"b","position":"Anywhere","description":"In Spanish the letters b and v share ONE sound. 1) At the start of a word or after a pause/nasal (m, n), it’s a full voiced bilabial stop—nearly identical to English b but with a slightly gentler release. 2) Between vowels or most other consonants, it weakens into a bilabial approximant: lips come together but don’t fully stop the air, so it sounds like a soft, buzzy b/v. The vocal cords stay vibrating the whole time.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"burrito","native":"burrito","position":"Beginning","cultural_context":"Well-known Mexican food item sold everywhere in the U.S."},{"target":"Barcelona","native":"Barcelona","position":"Beginning","cultural_context":"Famous Spanish city; common travel and sports reference"},{"target":"Cuba","native":"Cuba","position":"Middle","cultural_context":"Caribbean country frequently mentioned in news and culture"},{"target":"habla","native":"habla","position":"Middle","cultural_context":"Heard in the common phrase “¿Habla español?” meaning “Do you speak Spanish?”"}]}]
["c",{"thoughts":"Spanish “c” can sound like two different English consonants, depending on the next letter. Before a, o, u or a consonant, it is a hard /k/ (as in English “cat”). Before e or i, it becomes a soft sound: in most of Latin America it is like English /s/; in Spain it is a lisp-like /th/ as in “thin.” English speakers already know both sounds, but the spelling–sound switch can be confusing.","pattern":"c","position":"Anywhere","description":"Hard /k/ before a, o, u, or consonant (casa, taco). Soft /s/ (or Spanish-Spain /θ/) before e or i (cerveza, Barcelona). Same letter, two pronunciations—watch the following vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"casa","native":"casa","position":"Beginning","cultural_context":"Very common word; means “house” and appears in phrases like “mi casa”"},{"target":"taco","native":"taco","position":"Middle","cultural_context":"Famous Mexican food item popular worldwide"},{"target":"cerveza","native":"cerveza","position":"Beginning","cultural_context":"Spanish word for beer, seen on menus and commercials"}]}]
["d",{"thoughts":"Spanish “d” is easy to recognise in print, but its sound changes depending on where it sits in a word. English already has both ingredients: a hard /d/ (dog) and a voiced “th” /ð/ (this). Spanish just switches between them in predictable places, so the challenge is remembering when to soften it.","pattern":"d","position":"Anywhere","description":"Hard version: A voiced dental stop—like the English d in “dog,” but with the tongue touching the upper front teeth. It’s used at the very start of a phrase or after n or l (día, Andes).\nSoft version: A voiced dental fricative—very close to the “th” in English “this,” produced with the tongue touching the upper teeth and air flowing. It appears between vowels or after most other consonants and at word-end (adiós, Madrid). Word-final d can be so weak it nearly disappears.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"día","native":"día","position":"Beginning","cultural_context":"Heard in the greeting “buenos días” (good morning/day)"},{"target":"adiós","native":"adiós","position":"Middle","cultural_context":"Common Spanish way to say goodbye—often used in English too"},{"target":"Andes","native":"Andes","position":"Middle","cultural_context":"Famous South American mountain range mentioned in geography and travel shows"},{"target":"Madrid","native":"Madrid","position":"End","cultural_context":"Capital city of Spain, often referenced in sports and tourism"}]}]
["e",{"thoughts":"Spanish “e” is a straightforward, single-value vowel; English speakers already know a close cousin sound, but must remember not to let it slide toward the English long “a” (/eɪ/).","pattern":"e","position":"Anywhere","description":"Pronounce it as a pure, short mid-front vowel, like the vowel in English “bet,” but a little tenser and without any finishing glide. Keep the tongue forward, jaw moderately open, and cut the sound off cleanly.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"enchilada","native":"enchilada","position":"Beginning","cultural_context":"Familiar Mexican dish filled and rolled in a tortilla"},{"target":"peso","native":"peso","position":"Middle","cultural_context":"Currency name you hear in travel or financial news"},{"target":"café","native":"café","position":"End","cultural_context":"Word for coffee; appears on menus and coffee shop signs"}]}]
["f",{"thoughts":"Spanish “f” is virtually identical to the English /f/ in “fun.” It never changes spelling‐to‐sound and is never voiced like English “of.” So it’s a very comfortable consonant for English speakers.","pattern":"f","position":"Anywhere","description":"Same voiceless labiodental fricative as English “f” in “fish.” Touch the bottom lip lightly to the upper teeth and let air pass; no extra puff of air and never pronounced like “v.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"fiesta","native":"fiesta","position":"Beginning","cultural_context":"Used in English to mean a lively party"},{"target":"fútbol","native":"fútbol","position":"Beginning","cultural_context":"The Spanish word for soccer, heard in sports coverage"},{"target":"café","native":"café","position":"Middle","cultural_context":"Coffee; you see it on menus and signs"},{"target":"golf","native":"golf","position":"End","cultural_context":"Same word for the sport"}]}]
["g",{"thoughts":"Spanish “g” is straightforward when it is hard (/g/), but becomes the raspy “j-sound” (/x/) before e or i, which English speakers don’t have. Learners must remember that “gue/gui” keep the hard G and the u is silent unless it has a dieresis (ü).","pattern":"g","position":"Anywhere","description":"1) Hard G: Before a, o, u or after n, it is the same voiced stop you know from English “go.”  2) Soft G: Before e or i (spelled ge, gi) it is the voiceless velar fricative /x/, similar to the Scottish “loch” or the German “Bach.”  3) In “gue/gui” the u is silent and the G stays hard; with ü (güe/güi) the u is pronounced. Keep the back of the tongue against the soft palate for the hard G, and for the soft G let air scrape the throat without voicing.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gato","native":"gato","position":"Beginning","cultural_context":"Common word for “cat”; appears in beginner Spanish lessons and memes"},{"target":"amigo","native":"amigo","position":"Middle","cultural_context":"Means “friend”; often used jokingly in English (“Hola, amigo!”)"},{"target":"Argentina","native":"Argentina","position":"Middle","cultural_context":"Large South American country; heard in sports and news"},{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Popular avocado dip served in Mexican restaurants"}]}]
["h",{"thoughts":"Spanish “h” is almost always silent, so English speakers do not have to learn a new sound—just remember not to pronounce it. The idea of a silent h already exists in English words like “honor” or “hour,” so the concept feels familiar.","pattern":"h","position":"Anywhere","description":"In modern standard Spanish the letter “h” by itself is completely silent—no breathy or aspirated sound at all. When you see it, simply ignore it and move on to the next vowel or consonant. (Note: the digraph “ch” is a separate sound /tʃ/, like English “chocolate.”)","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Basic Spanish word for “hello,” used worldwide"},{"target":"habanero","native":"habanero","position":"Beginning","cultural_context":"Well-known very hot chili pepper in Mexican salsas"},{"target":"ahora","native":"ahora","position":"Middle","cultural_context":"Means “now”; often seen in bilingual signs or phrases like “Hasta ahora”"}]}]
["i",{"thoughts":"Spanish i is a pure, close front vowel /i/. English speakers already know a very similar sound in the stressed vowel of “machine” or “see”, but in Spanish it is always tense and never drifts toward a y-glide. Main pitfall: don’t let it relax toward the English short “ɪ” in “sit.” Keep lips unrounded, tongue high and forward, and make it short and steady.","pattern":"i","position":"Anywhere","description":"Pronounced like the “ee” in English “see,” but shorter and steadier—no off-glide toward y. It is always the tense /i/ sound, even in unstressed syllables.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Ibiza","native":"Ibiza","position":"Beginning","cultural_context":"Well-known Spanish party island and vacation spot"},{"target":"fiesta","native":"fiesta","position":"Middle","cultural_context":"Used in English for a party or celebration"},{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Popular Tex-Mex dish"},{"target":"sí","native":"yes","position":"End","cultural_context":"Common word for “yes” often heard in pop culture"}]}]
["j",{"thoughts":"Spanish “j” is one of the letters whose sound differs most from what an English speaker expects. It is never the English “j” (as in “job”) but a raspy h-like noise made farther back in the throat. Learners will probably have heard it in food names or place names, but reproducing it accurately is still tricky.","pattern":"j","position":"Anywhere","description":"Spanish j is pronounced as a voiceless velar (or uvular) fricative, written phonetically [x]. In most of Spain it is a strong, throaty sound like the harsh h in the Scottish word “loch” or the German “Bach.” In much of Latin America it softens toward an English h, but it is still produced farther back than the everyday English h. Let air scrape the back of the throat without using the vocal cords; there is no buzzing and no tongue-tip contact.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"jalapeño","native":"jalapeño","position":"Beginning","cultural_context":"Common chili pepper found on pizzas, nachos, etc."},{"target":"fajita","native":"fajita","position":"Middle","cultural_context":"Popular Tex-Mex dish of grilled meat and veggies"},{"target":"Baja California","native":"Baja California","position":"Middle","cultural_context":"Mexican peninsula known for tourism and the drink “Baja Blast”"}]}]
["k",{"thoughts":"In Spanish, the letter “k” is uncommon but when it appears it is pronounced exactly like the hard English /k/ in “kite.” No aspiration burst; keep it crisp and short. Same sound no matter where it sits in a word.","pattern":"k","position":"Anywhere","description":"Always a hard, unaspirated /k/—similar to English “skate,” but without the little puff of air native English speakers add at the start of stressed syllables. Touch the back of your tongue to the soft palate, release cleanly.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"kilómetro","native":"kilómetro","position":"Beginning","cultural_context":"Metric distance unit seen on road signs"},{"target":"kiwi","native":"kiwi","position":"Beginning","cultural_context":"Common fruit sold in supermarkets"},{"target":"karaoke","native":"karaoke","position":"Multiple","cultural_context":"Popular singing pastime, same word in English"},{"target":"kayak","native":"kayak","position":"Multiple","cultural_context":"Small boat used for water sports, same spelling in English"}]}]
["l",{"thoughts":"Spanish uses only a single, clear “light l.”  English already has this sound at the start of words like “leaf,” so the quality is familiar, but English speakers often switch to a darker, velarized L at the end of syllables.  The main adjustment is to keep the tongue-tip, light version even in the middle or at the end of a Spanish word.","pattern":"l","position":"Anywhere","description":"Place the tongue tip against the ridge just behind the upper front teeth, let air flow along the sides of the tongue, and keep the back of the tongue relaxed.  It should sound like the clear L in English “leaf,” never the darker L you hear in English “pull” or “milk.”  This light lateral is used in all positions in Spanish.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Lima","native":"Lima","position":"Beginning","cultural_context":"Capital city of Peru; appears in travel, food (limes), and geography contexts"},{"target":"hola","native":"hola","position":"Middle","cultural_context":"Every basic Spanish course and greetings—means “hello”"},{"target":"salsa","native":"salsa","position":"Middle","cultural_context":"Popular dance and hot sauce; word borrowed directly into English"},{"target":"hotel","native":"hotel","position":"End","cultural_context":"Same spelling and meaning as English “hotel”"}]}]
["m",{"thoughts":"Spanish m is practically identical to the English m sound. It’s a voiced bilabial nasal made by closing the lips and letting air resonate through the nose. English speakers already use the same articulation in words like “man” or “come,” so there is usually no new movement to learn. The only wrinkle is that final m is rare in Spanish, and when an m is followed by a bilabial consonant (p/b), it blends smoothly without changing its quality—again just as in English.","pattern":"m","position":"Anywhere","description":"Same as the m in English “map.” Lips closed, voice on, air escapes through the nose. Keep it short and clear; don’t let it trail off into an English-style humming “mmm.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"México","native":"México","position":"Beginning","cultural_context":"Name of the country right south of the USA"},{"target":"sombrero","native":"sombrero","position":"Middle","cultural_context":"Iconic Mexican wide-brimmed hat; common loanword"},{"target":"álbum","native":"álbum","position":"End","cultural_context":"Same word in English for a collection of songs or photos"}]}]
["n",{"thoughts":"Spanish “n” is virtually the same alveolar nasal that English speakers use in ‘no’ or ‘ten,’ so it feels familiar. Small twist: in fast Spanish it may subtly shift its place of articulation before other consonants, but learners can safely pronounce the regular English-style /n/ and still be understood.","pattern":"n","position":"Anywhere","description":"Same sound as the English n in “no.” Tip of the tongue touches the ridge just behind the upper front teeth, air resonates through the nose. Unlike in some English words (butt’n), it never becomes a syllable by itself, and it stays crisp without an extra puff of air.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"nachos","native":"nachos","position":"Beginning","cultural_context":"Popular Tex-Mex snack found on many menus"},{"target":"enchilada","native":"enchilada","position":"Middle","cultural_context":"Classic Mexican dish widely known in the US"},{"target":"pan","native":"pan","position":"End","cultural_context":"Means bread; appears in phrases like “pan dulce” sold in bakeries"}]}]
["ñ",{"thoughts":"Spanish ñ is one of the few letters English speakers notice because it shows up in food names and weather reports. They’ve heard it, but may not realize it’s a single consonant, not an n-plus-y. They can usually imitate it by thinking of the “ny” in “canyon.”","pattern":"ñ","position":"Anywhere","description":"ñ is a single consonant: a palatal nasal. The closest English approximation is the “ny” sound in “canyon” or “onion.” Touch the middle of your tongue to the hard palate (just behind the roof ridge) while letting air flow through your nose. Do NOT pronounce a separate y after it; it’s one blended sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jalapeño","native":"jalapeño","position":"End","cultural_context":"Popular Mexican pepper used in many dishes"},{"target":"piña colada","native":"piña colada","position":"Middle","cultural_context":"Famous tropical cocktail"},{"target":"El Niño","native":"El Niño","position":"End","cultural_context":"Weather pattern reported in the news"},{"target":"mañana","native":"mañana","position":"Middle","cultural_context":"Often borrowed in English to mean “tomorrow” or “later”"}]}]
["o",{"thoughts":"Spanish “o” is a single, pure mid-back rounded vowel [o]. English speakers already use a similar sound in the first part of “oh”, but in English the vowel usually glides (oʊ). The main adjustment is to keep it short and steady—no closing glide.","pattern":"o","position":"Anywhere","description":"A short, steady version of the English “oh” vowel. Lips stay rounded and the sound does not slide toward a ‘w’ or ‘oo’. It is the same quality whether stressed or unstressed, just slightly shorter when unstressed.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Olé","native":"Olé","position":"Beginning","cultural_context":"Famous cheer shouted at bullfights and soccer matches"},{"target":"taco","native":"taco","position":"End","cultural_context":"Extremely popular Mexican food"},{"target":"loco","native":"loco","position":"Multiple","cultural_context":"Often heard in the phrase “¡loco!” meaning “crazy,” and in brand/product names like “Baja Loco”"}]}]
["p",{"thoughts":"English already has a very similar /p/ sound, so learners mainly need to remember to drop the strong puff of air they use in English when the letter starts a word. Choosing food-related words and the country name keeps the examples familiar.","pattern":"p","position":"Anywhere","description":"Spanish “p” is a voiceless bilabial stop like the English p in the word “spin.” Your lips close, then release cleanly, but you should NOT add the strong burst of air (aspiration) you often make in English “pin.” If a tissue held in front of your lips barely moves, you’re doing it right.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"paella","native":"paella","position":"Beginning","cultural_context":"Famous Spanish rice dish served at many restaurants"},{"target":"tapas","native":"tapas","position":"Middle","cultural_context":"Spanish small-plate appetizers popular worldwide"},{"target":"España","native":"España","position":"Middle","cultural_context":"Spanish word for Spain, seen in sports and travel"},{"target":"papaya","native":"papaya","position":"Multiple","cultural_context":"Tropical fruit sold in supermarkets"}]}]
["q",{"thoughts":"Spanish ‘q’ is almost always seen in the digraph “qu” before e or i and is pronounced just like a hard English k (as in “ski”), never the “kw” sound found in English “queen.” Because English has the /k/ sound, the issue is spelling-to-sound, not making a new sound.","pattern":"q","position":"Anywhere","description":"Pronounce “q” (really “qu”) as a hard k. Ignore the u; it is silent and only signals you should use the hard k before e or i. Do NOT add a w glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican cheese tortilla dish"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican liquor used in many cocktails"},{"target":"quinceañera","native":"quinceañera","position":"Beginning","cultural_context":"Latin American 15th-birthday celebration often mentioned in media"}]}]
["r",{"thoughts":"Spanish uses two related sounds for the single letter “r.” 1) A quick single-tap of the tongue against the ridge behind the upper teeth (like the very fast “t” in the American English pronunciation of “beTTer”). 2) A strong roll/trill made by vibrating the tongue tip (what most people call “rolling the r”).  The trill occurs at the beginning of a word and after the letters l, n, or s; the light tap occurs almost everywhere else, including word-final position.  English doesn’t have either of these exact sounds, so learners have to train their tongue to make the light tap and the stronger roll.","pattern":"r","position":"Anywhere","description":"Light tap /ɾ/: flick the tip of your tongue once against the ridge just behind your upper front teeth, keeping the contact extremely brief. Trill /r/: build up a gentle airflow while the tongue tip is in the same place and let it vibrate several times. Do NOT pull the tongue back like the English “r.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Roma","native":"Roma","position":"Beginning","cultural_context":"Capital city of Italy; name is identical in many languages"},{"target":"toro","native":"toro","position":"Middle","cultural_context":"Means “bull”; seen in Mexican restaurant names and the phrase “El Toro”"},{"target":"margarita","native":"margarita","position":"Multiple","cultural_context":"Well-known tequila cocktail"},{"target":"amor","native":"amor","position":"End","cultural_context":"Means “love”; common in Spanish songs and pop culture phrases like “mi amor”"}]}]
["s",{"thoughts":"Spanish “s” is essentially the same un-voiced /s/ sound English speakers know, but Spanish keeps it consistently sharp and never lets it buzz into /z/ (as in English “roses”) or soften into /ʃ/ (as in “sure”). The tongue is placed a bit closer to the teeth (dental–alveolar), giving a slightly crisper hiss, but if you make an English “s” without voicing you’re already very close.","pattern":"s","position":"Anywhere","description":"Pronounce it like the un-voiced “s” in English “see.” It is ALWAYS voiceless (never /z/), even between vowels or at the ends of words. Keep the airflow steady and the tongue lightly against or just behind the upper teeth.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"salsa","native":"salsa","position":"Multiple","cultural_context":"Famous dip/dance term widely used in English"},{"target":"queso","native":"queso","position":"Middle","cultural_context":"Spanish word for cheese seen on Tex-Mex menus"},{"target":"tacos","native":"tacos","position":"End","cultural_context":"Iconic Mexican dish popular worldwide"}]}]
["t",{"thoughts":"Spanish /t/ is one of the easiest consonants for English speakers because it is still a voiceless stop made with the tongue against the upper teeth. The only trick is that it is dental (the tongue touches the back of the upper front teeth) and it is never aspirated—there is no little burst of air like the one you may hear in English words such as “top.” If an English speaker simply softens the release and keeps the tongue a bit farther forward, it will sound authentically Spanish.","pattern":"t","position":"Anywhere","description":"Dental, unaspirated “t.” Similar to the English “t” in “stop” (where almost no air is released) rather than the strongly-puffed “t” in “top.” Place the tongue tip against the back of the upper front teeth, release cleanly without a burst of air.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"taco","native":"taco","position":"Beginning","cultural_context":"Famous Mexican food found everywhere in the U.S."},{"target":"tortilla","native":"tortilla","position":"Multiple","cultural_context":"Mainstay flatbread for tacos and burritos; often on restaurant menus"},{"target":"patio","native":"patio","position":"Middle","cultural_context":"Same word used in English for an outdoor paved area"},{"target":"internet","native":"internet","position":"Multiple","cultural_context":"Exact same word as English—global network"}]}]
["u",{"thoughts":"Spanish “u” is usually a pure, short “oo” sound, but it can also act like English “w” before another vowel, and in the spellings “qu” and “gu” before e/i it is often silent. English speakers know the basic “oo” sound, but keeping it short and remembering when the letter is silent or a glide can trip them up.","pattern":"u","position":"Anywhere","description":"Most of the time Spanish “u” is the pure vowel [u]—like the “oo” in English “food,” but shorter and without any off-glide. Before another vowel (ua, ue, ui, uo) it often turns into a quick “w” sound, e.g., “Guatemala” ≈ gwa-. In the combinations “qu” and “gu” before e or i (queso, guitarra), the “u” is usually silent unless it carries a diaeresis (ü).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"uno","native":"uno","position":"Beginning","cultural_context":"Number one; also the name of the popular card game \"UNO\""},{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Well-known Mexican food item"},{"target":"guacamole","native":"guacamole","position":"Middle","cultural_context":"Famous avocado dip served in many restaurants"},{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Common Mexican dish; often on English-language menus"}]}]
["v",{"thoughts":"Spanish “v” is really the same phoneme as Spanish “b.” Learners expect an English-style /v/, but they will actually hear and should produce a bilabial sound: a full voiced stop [b] at the start of a breath group or after a nasal/pause, and a softer bilabial approximant [β] between vowels. The lower lip never touches the upper teeth as in English.","pattern":"v","position":"Anywhere","description":"Pronounce it like the Spanish letter “b,” not the English /v/. Lips come together (bilabial). At the very start of a sentence or after a pause/nasal, release it like an English “b.” Between vowels it relaxes into a soft blurry sound [β]—air slips between gently pressed lips, almost like saying “ba” with no full closure.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Valencia","native":"Valencia","position":"Beginning","cultural_context":"Well-known Spanish city famous for oranges and paella"},{"target":"ceviche","native":"ceviche","position":"Middle","cultural_context":"Popular Latin-American citrus-marinated seafood dish"},{"target":"Navidad","native":"Navidad","position":"Middle","cultural_context":"Means Christmas; heard in the song “Feliz Navidad”"},{"target":"Sevilla","native":"Sevilla","position":"Middle","cultural_context":"Major Spanish city known for flamenco and bullfighting"}]}]
["w",{"thoughts":"Spanish uses the letter “w” only in loanwords or proper names, so learners will mainly see it in familiar international terms. Most of the time it keeps the English-style /w/ glide (wifi, whisky, taekwondo). In a handful of German surnames or words coming through German, Spaniards often read it like a Spanish “v/b” (a soft bilabial stop or fricative), e.g., Wagner pronounced roughly “BAHG-ner.” Because the English /w/ is already in the learner’s repertoire, the sound itself is easy; the only surprise is that it can sometimes flip to a “b” sound when Spaniards speak.","pattern":"w","position":"Anywhere","description":"Usually pronounced like the English “w” glide: round your lips and move quickly into the next vowel (wifi /ˈwi.fi/, whisky /ˈwis.ki/). In a few German loan names, Spaniards pronounce it like a Spanish “v/b” (lips together, short buzz), e.g., Wagner → /ˈbaɡ.neɾ/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"wifi","native":"Wi-Fi","position":"Beginning","cultural_context":"Same wireless-network term used worldwide"},{"target":"whisky","native":"whiskey","position":"Beginning","cultural_context":"Popular alcoholic drink, spelling with “whisky” common in Spanish menus"},{"target":"taekwondo","native":"taekwondo","position":"Middle","cultural_context":"Well-known martial art featured in the Olympics"},{"target":"Wagner","native":"Wagner","position":"Beginning","cultural_context":"Famous German composer; Spaniards often pronounce the W like a “b”"}]}]
["x",{"thoughts":"Spanish “x” is unpredictable for English ears: sometimes the familiar /ks/, other times the harsh “j” sound /x/, and in a few Indigenous place-names a soft /s/ or /sh/. Learners need to recognize all three.","pattern":"x","position":"Anywhere","description":"In Spanish, the letter “x” can be pronounced three ways:\n1. /ks/ – exactly like the English X in “taxi”.\n2. /x/ – the rough, throaty sound of Spanish “j” (similar to a strong English h in “Bach”).\n3. /s/ (and locally /ʃ/) – found mostly in Indigenous names; think of a soft English “s” or sometimes “sh”.\nListen to natives to know which version a word uses.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Same word as in English for a cab"},{"target":"México","native":"México","position":"Middle","cultural_context":"Name of the country, seen in Spanish spelling"},{"target":"Xochimilco","native":"Xochimilco","position":"Beginning","cultural_context":"Tourist-famous canal district in Mexico City"}]}]
["y",{"thoughts":"The letter “y” in Spanish can act either as a consonant (most common at the start of a syllable) or as a vowel (basically the same sound as the Spanish letter “i”).  English speakers already know the glide /j/ from “yes,” but may be surprised that final or stand-alone “y” is pronounced like the vowel in “machine.”  Overall, the sound is familiar, but switching between the two roles and keeping it unaspirated takes a little practice.","pattern":"y","position":"Anywhere","description":"Consonant: Like the English “y” in “yes,” but keep the tongue closer to the roof of the mouth and don’t add an English-style breath or “d” sound.  Vowel: When “y” is the only letter of a syllable (as in muy, soy, the word y “and”) it is pronounced exactly like Spanish “i” – the long “ee” in English “see.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"yo","native":"yo","position":"Beginning","cultural_context":"Common first-person pronoun; heard in basic phrases like “yo soy…”"},{"target":"playa","native":"playa","position":"Middle","cultural_context":"Word for “beach,” often seen on travel signs or resort names"},{"target":"muy","native":"muy","position":"End","cultural_context":"Appears in the well-known phrase “muy bien” (“very well”)"},{"target":"y","native":"y","position":"Beginning","cultural_context":"Single-letter word meaning “and,” used in countless beginner examples like “pan y agua”"}]}]
["z",{"thoughts":"English speakers already know the letter “z”, but in Spanish its sound is different: in most of Latin America it is an unvoiced /s/, while in much of Spain it is the “th” in “thin” (/θ/). The spelling-to-sound rule is very consistent, so the only difficulty is remembering which regional accent you’re imitating.","pattern":"z","position":"Anywhere","description":"Latin America: pronounce it like the English “s” in “snake” – tip of the tongue close to the front teeth, no vocal-cord vibration. Spain (Castilian): pronounce it like the unvoiced “th” in “thin”, with the tongue placed lightly between the teeth. Never pronounce it like the English “z” in “zoo” (voiced /z/).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"zorro","native":"zorro","position":"Beginning","cultural_context":"Masked hero “Zorro” from movies and books"},{"target":"Ibiza","native":"Ibiza","position":"Middle","cultural_context":"Famous Spanish party island often mentioned in travel shows"},{"target":"feliz","native":"feliz","position":"End","cultural_context":"Heard in the Christmas song “Feliz Navidad” meaning “happy”"},{"target":"pizza","native":"pizza","position":"Multiple","cultural_context":"Same word as in English for the Italian dish; Spanish spells it with double z"}]}]
["á",{"thoughts":"English speakers already know the plain Spanish “a” sound from words like “taco” or “amigo.” The accent mark simply shows which syllable is stressed; it doesn’t change the vowel quality. So the only new idea is remembering to keep it short, open, and not turn it into the English diphthong found in “day.”","pattern":"á","position":"Anywhere","description":"Same open “ah” vowel you hear in the first half of the English word “father,” but a bit shorter and pure. The accent mark (´) only tells you that this syllable is stressed—nothing about the mouth position changes.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"¡Ándale!","native":"¡Ándale!","position":"Beginning","cultural_context":"Famous catch-phrase from the Speedy Gonzales cartoon meaning “Come on!”"},{"target":"más","native":"más","position":"Middle","cultural_context":"Very common word for “more,” heard in phrases like “uno más.”"},{"target":"Bogotá","native":"Bogotá","position":"End","cultural_context":"Capital city of Colombia, often mentioned in news and travel shows"}]}]
["é",{"thoughts":"Spanish \"é\" is simply the normal Spanish vowel /e/ with a written accent showing stress. English speakers already meet it in words like “café” and “José.” The vowel is a pure, mid-front sound—closer to the first part of English “day” but held steady (no glide). Main challenge is keeping it short and pure, and remembering the accent only marks stress, not a different letter.","pattern":"é","position":"Anywhere","description":"Pronounce it like the vowel in English “day,” but do NOT slide into a y-sound. It’s a single, steady \"eh\" made slightly higher than the English vowel in “bet.” The accent mark just tells you this syllable gets the stress.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"México","native":"México","position":"Beginning","cultural_context":"Name of the neighboring country, often seen in news and travel"},{"target":"café","native":"café","position":"End","cultural_context":"Means coffee; appears on menus and in English as “café” for a coffee shop"},{"target":"José","native":"José","position":"End","cultural_context":"Very common Spanish given name, familiar from sports and entertainment"}]}]
["í",{"thoughts":"English speakers already know the basic \"ee\" vowel, so the only new idea is that the written accent mark (´) simply shows where the stress falls—it does NOT change the quality of the vowel. The sound is the same pure \"ee\" every time, just held a bit shorter and without the off-glide English often gives it.","pattern":"í","position":"Anywhere","description":"Exactly the pure \"ee\" sound in English “machine,” but shorter and without gliding toward a ‘y’. The acute accent (´) only tells you that this syllable is stressed; it does not change the vowel quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Íñigo","native":"Íñigo","position":"Beginning","cultural_context":"Famous line “Hello, my name is Íñigo Montoya” from the movie The Princess Bride"},{"target":"cafetería","native":"cafetería","position":"Middle","cultural_context":"Looks like the English word “cafeteria,” meaning a casual dining place"},{"target":"sí","native":"sí","position":"End","cultural_context":"Means “yes” – probably the first Spanish word most learners encounter"}]}]
["ó",{"thoughts":"Spanish ó is not a special vowel quality—same pure close-mid back rounded vowel /o/, the accent only marks syllable stress. English has a similar sound in “go”, but English usually glides to a /w/; Spanish stays short and pure. So the sound itself is familiar, though English speakers must keep it brief and not diphthongize.","pattern":"ó","position":"Anywhere","description":"Pronounce it like the first part of the English vowel in “go”, but clip it short and don’t let it slide toward a “w”. Lips are rounded, tongue is mid-high and back. The accent mark simply means this syllable is stressed; it doesn’t change the quality of the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Óscar","native":"Óscar","position":"Beginning","cultural_context":"Common Spanish given name; same as English “Oscar” (the movie award) but with Spanish stress"},{"target":"adiós","native":"adiós","position":"End","cultural_context":"Famous Spanish way to say “good-bye” often used in English"},{"target":"corazón","native":"corazón","position":"End","cultural_context":"Means “heart”; appears in song titles and pop culture phrases like “Corazón Latino”"}]}]
["ú",{"thoughts":"Spanish ú is simply the pure vowel [u]; the accent mark only shows the stressed syllable, so the sound quality never changes. English already has an almost identical vowel in “food,” but English speakers tend to glide it (“oo-uh”). They just need to keep it short and pure.","pattern":"ú","position":"Anywhere","description":"A short, pure “oo” sound, like the vowel in English “food” but without any glide—start and end the sound in the same mouth position. The accent mark only tells you this syllable gets the stress; it does not change the vowel quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Búfalo","native":"Búfalo","position":"Beginning","cultural_context":"Looks like the English word “buffalo” or the U.S. city Buffalo"},{"target":"Cancún","native":"Cancún","position":"End","cultural_context":"Famous Mexican beach resort often seen in travel ads"},{"target":"Perú","native":"Perú","position":"End","cultural_context":"The South American country—Machu Picchu, Andes, etc."},{"target":"menú","native":"menú","position":"End","cultural_context":"Same word as English “menu,” seen in restaurants"}]}]
["ü",{"thoughts":"English speakers already know the sound /w/ that the Spanish ü represents; what is new is the spelling with the diaeresis. It only shows up inside the digraphs güe/güi (and the rarer qüe/qüi) to tell the reader to pronounce the normally silent u. So the sound itself is easy, but the rule and the strange dots may be unfamiliar.","pattern":"ü","position":"Anywhere","description":"In Spanish, the letter u with two dots (ü) simply tells you to pronounce the u in the sequences güe, güi (or qüe, qüi). Say a hard g or k, glide quickly into an English-style w, then the vowel: güe = gwe, güi = gwi. Think of saying “gwe” or “gwi” as in the name Gwen or the first syllable of “iguana,” but starting with a hard g.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"pingüino","native":"penguin","position":"Middle","cultural_context":"Spanish word for the familiar Antarctic bird; often appears in kids’ books or nature programs"},{"target":"bilingüe","native":"bilingual","position":"End","cultural_context":"Looks almost identical to the English word “bilingual,” common in language-learning contexts"},{"target":"Güell (Parc Güell)","native":"Güell","position":"Middle","cultural_context":"Famous Gaudí park in Barcelona that many tourists and travel shows mention"}]}]
["ch",{"thoughts":"Spanish “ch” is the same sound English speakers already use in words like “cheese.” It’s a single, crisp, voiceless “tch” sound (IPA [tʃ])—never the “sh” of French nor the “k” sound some English c-spellings can have. Because the sound exists in English, learners mostly just need to remember that the spelling never changes its value in Spanish.","pattern":"ch","position":"Anywhere","description":"Pronounced like the “ch” in English “chair.” Place the tongue against the roof of the mouth as if starting a quick “t,” then immediately release into a “sh” position—producing one compact affricate [tʃ]. Unlike some English spellings, Spanish “ch” always keeps this sound and is never “k” or “sh.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"churro","native":"churro","position":"Beginning","cultural_context":"Fried pastry sold at fairs and Mexican restaurants"},{"target":"nachos","native":"nachos","position":"Middle","cultural_context":"Popular Tex-Mex dish of tortilla chips with melted cheese"},{"target":"macho","native":"macho","position":"Middle","cultural_context":"Borrowed into English to mean extremely masculine"}]}]
["ll",{"thoughts":"English speakers have run into “ll” in food names like tortilla and quesadilla, but may not realize it’s usually a single consonant sound, not two separate L’s. The most common modern sound is the English “y” of “yes,” though some regions use a soft “zh” (measure) or “sh.” Pronouncing it as a plain English L is the main trap.","pattern":"ll","position":"Anywhere","description":"In most of Latin America and much of Spain, “ll” is pronounced like the English y-sound in “yes” (/ʝ/ or /j/). In parts of Argentina, Uruguay, and some Andean areas it can sound like the “s” in “measure” (/ʒ/) or even “sh.” Older Castilian Spanish and some rural areas still use a palatal ‘ly’ (/ʎ/), which feels like saying English L and Y at the same time. When in doubt, a clear English “y” is the safest choice.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"llama","native":"llama","position":"Beginning","cultural_context":"Name of the Andean animal; English uses the same word"},{"target":"tortilla","native":"tortilla","position":"Middle","cultural_context":"Staple Mexican flatbread often used in tacos"},{"target":"quesadilla","native":"quesadilla","position":"Middle","cultural_context":"Popular Mexican dish—cheesy folded tortilla"},{"target":"paella","native":"paella","position":"Middle","cultural_context":"Iconic Spanish rice dish often featured in food shows"}]}]
["rr",{"thoughts":"Spanish “rr” is the famous rolled-R (alveolar trill). English has no native trill, so speakers recognize it from Spanish words but rarely produce it correctly. It shows up between vowels or after some consonants, never at the very start of a word, but we label overall position as “Anywhere.”","pattern":"rr","position":"Anywhere","description":"A rapid roll or trill of the tongue against the ridge just behind the upper front teeth. Think of a very quick series of D or T taps blending together (rrrr). It is much stronger than the single Spanish “r” tap and nothing like the smooth English R. Start by repeating a light “tt-tt-tt” while letting airflow vibrate the tongue until it buzzes.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Popular Mexican food item"},{"target":"Sierra","native":"Sierra","position":"Middle","cultural_context":"Mountain range name and common brand names like Sierra Nevada"},{"target":"arriba","native":"arriba","position":"Middle","cultural_context":"Famous “Arriba, arriba!” catchphrase from cartoons and celebrations"},{"target":"perro","native":"perro","position":"Middle","cultural_context":"Means “dog”; often heard in beginner Spanish classes and pop culture"}]}]
["qu",{"thoughts":"Spanish “qu” is always read as a hard K before the vowels e or i; the written u is silent unless it has a dieresis (ü), which is another pattern. So “que” = /keh/, “qui” = /kee/. English speakers already know the same K sound and are used to silent letters (e.g., English “queue”), so this should feel familiar.","pattern":"qu","position":"Anywhere","description":"qu is pronounced like the hard K in English “kite.” The written u is NOT voiced, so que = keh, qui = kee. Keep the tongue toward the back of the mouth—don’t round the lips as if saying a w.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican cheese-filled tortilla dish found on many menus"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican distilled drink"},{"target":"Quijote","native":"Quijote","position":"Beginning","cultural_context":"From “Don Quijote,” the classic Spanish novel often mentioned in literature classes"}]}]
["que",{"thoughts":"Spanish “que/qué” is always pronounced /ke/, with a hard K plus the open E of “get.” The written “u” is completely silent – no “kw” or “kway” like in English “queen” or French “queue.” Stress may change when an accent is added (qué), but the sound of the syllable itself never changes. English speakers already have both sounds, so the only trap is forgetting to drop the U-sound.","pattern":"que","position":"Anywhere","description":"Pronounce it like the “ke” in English “kettle.” Hard K + short E. The written “u” is silent, so resist adding a W glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Common Mexican dish found on many U.S. menus"},{"target":"Enrique","native":"Enrique","position":"Middle","cultural_context":"Famous first name of singer Enrique Iglesias"},{"target":"porque","native":"porque","position":"End","cultural_context":"Seen in the meme phrase “¿Por qué no los dos?” (Why not both?)"}]}]
["qui",{"thoughts":"Spanish “qui” is quite straightforward for English speakers: it sounds just like the first part of English “key.” The written “u” is silent, and there is never an added /w/ sound (unlike English “quick”). Because the vowel is the pure Spanish “i” (a short, tense “ee”), there is no diphthong. Most learners have heard it in words like “tequila,” so recognition is moderate and pronunciation usually poses little trouble.","pattern":"qui","position":"Anywhere","description":"Pronounce it /ki/. Think of English “key,” but keep the vowel short and pure. Do NOT pronounce the written “u,” and do NOT add a “kw” glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quince","native":"quince","position":"Beginning","cultural_context":"The Spanish word for the number fifteen, often heard in the phrase “quinceañera.”"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican distilled drink known worldwide."},{"target":"mosquito","native":"mosquito","position":"Middle","cultural_context":"Same insect name used in English; borrowed from Spanish."},{"target":"Chiquita","native":"Chiquita","position":"Middle","cultural_context":"International banana brand seen in supermarkets."}]}]
["gu",{"thoughts":"English speakers have met the letters “gu” in words like “guacamole.” The tricky part is that sometimes the u is silent and sometimes it makes a w-like glide. Adding a diaeresis (ü) forces the w-sound.","pattern":"gu","position":"Anywhere","description":"In Spanish “gu” always keeps the hard English g as in “go.” The question is whether you also hear a w-glide:\n• Before a, o, or a stressed/u with no e or i right after it (gua, guo, güa, gu—): it sounds like the English cluster “gw,” e.g., “Gwen.”\n• Before e or i, the u is normally silent: “gue, gui” = hard g only, like the g in “get.”\n• If you see “güe” or “güi,” the two dots mean pronounce the u, so it again becomes “gw.”\nKeep the Spanish g short and smooth; do not add the puff of air English speakers sometimes give to initial g.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Famous avocado dip in Mexican food"},{"target":"guitarra","native":"guitarra","position":"Beginning","cultural_context":"Spanish word for the well-known instrument guitar"},{"target":"agua","native":"agua","position":"Middle","cultural_context":"Means water; appears on bottled-water labels and in basic phrases"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish for penguin, a common animal in movies and cartoons"}]}]
["gue",{"thoughts":"Spanish “gue” is the spelling trick used when you need a hard, English-style “g” right before the vowel “e.”  The written “u” is normally silent; it is just a placeholder that lets the letter g keep its hard sound instead of turning into the throatier Spanish “soft g.”  English speakers meet this cluster in names like Guevara or words such as guerrilla, so the look of it is familiar, but they may still be tempted to pronounce the “u.”","pattern":"gue","position":"Anywhere","description":"Pronounce it as a hard g plus the Spanish short e: /ge/ – similar to the “ge” in English “get,” but with a pure Spanish e (no diphthong).  The letter “u” is NOT pronounced unless it carries a diaeresis (ü), which is another pattern.  Keep the sound short and crisp; don’t add a ‘w’ glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guevara","native":"Guevara","position":"Beginning","cultural_context":"Surname of revolutionary Che Guevara, widely referenced in pop culture and history"},{"target":"guerrilla","native":"guerrilla","position":"Beginning","cultural_context":"Loan-word in English for an irregular fighter or warfare style"},{"target":"guerra","native":"guerra","position":"Beginning","cultural_context":"Means “war”; appears in titles like “La Guerra Civil (Spanish Civil War)” and in news reporting"}]}]
["gui",{"thoughts":"English speakers already know the hard g sound (as in “go”) and the long e sound (as in “see”).  In Spanish “gui” most often puts these two together as one smooth syllable.  The silent-u spelling may look odd, and the occasional appearance of a diaeresis (güi) or an accent mark (guí) adds a layer of spelling/pronunciation puzzle, so the concept is familiar but not completely obvious.","pattern":"gui","position":"Anywhere","description":"Most of the time “gui” is pronounced like the English sounds in “gee-whiz” put together: a hard g + long e [gi].  The written u is normally silent and simply keeps the g hard.  When you see “güi,” the two dots tell you the u IS pronounced, giving a “gwee” sound [gwi].  If you see “guí,” the accent just means the i is stressed, still [gi] or [gwi] depending on the dots.  Keep the Spanish hard g at the back of the throat; don’t soften it to the English j sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guitarra","native":"guitarra","position":"Beginning","cultural_context":"Spanish word for “guitar,” seen on menus for live-music nights and in music classes"},{"target":"Guillermo","native":"Guillermo","position":"Beginning","cultural_context":"First name of Oscar-winning film director Guillermo del Toro"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin,” shows up in zoo signage and kids’ cartoons dubbed in Spanish"},{"target":"bilingüe","native":"bilingüe","position":"Middle","cultural_context":"Spanish adjective for “bilingual,” resembles the English word and appears in language-learning contexts"}]}]
["gü",{"thoughts":"The sound is simply the English-friendly “gw” cluster, but the two dots (ü) tell the reader that the normally silent Spanish “u” must be pronounced before e or i. English speakers already say this sound in words like “penguin” and names like “Gwen,” so articulation is easy; the challenge is recognizing the spelling convention.","pattern":"gü","position":"Anywhere","description":"Pronounce the g as in “go” immediately followed by a brief w-glide, then the following vowel: güe = “gweh,” güi = “gwee.” It’s the same consonant cluster you hear in English “language” or “Gwen.” The diaeresis (two dots) simply reminds you not to drop the w-sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"güero","native":"güero","position":"Beginning","cultural_context":"Common Mexican Spanish nickname meaning fair-skinned or blond, heard in songs and movies"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Means “penguin,” the animal from many cartoons and nature shows"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Looks like English “bilingual,” used in education and resumes"}]}]
["güe",{"thoughts":"English speakers already know the /gw/ cluster (Gwen, iguana, penguin). In Spanish, the dieresis on the ü simply warns you that the u is NOT silent, so you still keep the hard g and add a quick w-glide before the open e. The mouth movement is natural for English, so only the spelling looks exotic.","pattern":"güe","position":"Anywhere","description":"Pronounce it /gwe/: a hard English g plus a quick w-glide, followed by the short e in \"bet.\" It feels like starting to say the name “Gwen” but stopping before the n. The dieresis (two dots) tells you to voice the u; without it, the u would be silent and the g would sound like the harsh Spanish j.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Looks almost identical to English “bilingual”; often printed on product labels or language settings"},{"target":"vergüenza","native":"vergüenza","position":"Middle","cultural_context":"Heard in movies/TV as in the phrase “¡Qué vergüenza!” meaning “What a shame/embarrassment”"},{"target":"antigüedad","native":"antigüedad","position":"Middle","cultural_context":"Related to the word “antique”; used in museum or history contexts"}]}]
["güi",{"thoughts":"English speakers have already seen the diaeresis (two dots) in the word “pingüino.” The dots signal that the normally-silent “u” in “gui” must now be pronounced. So “güi” is simply the hard English “g” plus “wee” → “gwee.” The glide from g to w can feel new, but it is the same mouth movement you do when you say the first two sounds in the made-up English syllable “gwee.”","pattern":"güi","position":"Anywhere","description":"Pronounce it as one smooth syllable: hard g + English w + long e, IPA [ɡwi]. The ¨ over the u forces you to say that u as a quick w-like glide; without it (\"gui\") the u would be silent. Think of saying “GWE-” in the name “Gwen,” then add a long “ee.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"güiro","native":"güiro","position":"Beginning","cultural_context":"Latin-American percussion instrument often mentioned in salsa or merengue music"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for the well-known bird “penguin” seen in films and zoos"},{"target":"lingüística","native":"lingüística","position":"Middle","cultural_context":"Looks like the English term “linguistics,” the academic study of language"}]}]
["ce",{"thoughts":"The digraph “ce” is really just the letter c placed before e; it triggers the soft-c pronunciation. English speakers already know the hissy [s] sound, and many have at least heard the Castilian lisp-like [θ]. Biggest hurdle is remembering that Spanish never uses the English hard “k” sound before e.","pattern":"ce","position":"Anywhere","description":"When the letter c comes before e (or i) in Spanish, it is never the hard “k” sound. In most of Latin America it is pronounced like the English “s” in “see” — [se]. In Spain it is pronounced like the unvoiced “th” in “think” — [θe]. Tongue is near the front teeth; just blow air lightly. The following vowel is the pure Spanish “eh” sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"cerveza","native":"cerveza","position":"Beginning","cultural_context":"Common Spanish word for beer you might order on vacation"},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"Famous Spanish city and soccer team"},{"target":"dulce","native":"dulce","position":"End","cultural_context":"Seen in desserts like “dulce de leche”"}]}]
["ci",{"thoughts":"English speakers already know that the letter “c” can sound like /s/ before “i” (as in English “city”). In Latin-American Spanish, “ci” is the same hissing /s/ plus the vowel /i/. In most of Spain it is a lisp-like /θ/ (as in English “thin”) plus /i/. The vowel is short and pure, not a diphthong like the long English “ee.” Learners only have to watch that they don’t add a glide (avoid “see-y”). The Castilian /θ/ may feel odd but is made with the tongue tip lightly between the teeth, no voice.","pattern":"ci","position":"Anywhere","description":"Latin America: /si/ (like the “s” in English “see,” but with a shorter, pure Spanish “ee”). Spain: /θi/ (like the unvoiced “th” in “thin,” then the same short Spanish “ee”).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"cine","native":"cine","position":"Beginning","cultural_context":"Root of the word “cinema,” used for movie theaters"},{"target":"ciudad","native":"ciudad","position":"Beginning","cultural_context":"Means “city,” an almost identical cognate"},{"target":"gracias","native":"gracias","position":"Middle","cultural_context":"Common phrase for “thank you” in Spanish classes and travel"},{"target":"ciencia","native":"ciencia","position":"Beginning","cultural_context":"Cognate of “science,” seen in academic contexts"}]}]
["ge",{"thoughts":"English speakers have already met this sound in words like “jalapeño” (spelled with j) but the spelling “ge” tricks them into expecting a hard g. The key is that a Spanish g followed by e (or i) is NEVER the hard “g” of “get”; it’s the throaty, hissy ‘h’ sound [x], almost like clearing your throat. It shows up anywhere in a word.","pattern":"ge","position":"Anywhere","description":"In Spanish, ge is pronounced like a strong, raspier English h, made further back in the throat—similar to the ch in German “Bach” or Scottish “loch.” Do NOT say the hard g of “get.” Keep the back of the tongue near the soft palate and let air pass noisily through.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"general","native":"general","position":"Beginning","cultural_context":"Same word as English “general” (military rank or broad category)"},{"target":"Argentina","native":"Argentina","position":"Middle","cultural_context":"Well-known South American country famous for tango, steak, and Messi"},{"target":"vegetariano","native":"vegetariano","position":"Middle","cultural_context":"Looks like English “vegetarian,” means the same thing"}]}]
["gi",{"thoughts":"English speakers know the letter combo “gi,” but in Spanish the sound is totally different from the hard or soft “g” they expect. Here it is the harsh, breathy “j” sound (the same you hear in “José”). It shows up anywhere in a word, so position = Anywhere.","pattern":"gi","position":"Anywhere","description":"In Spanish, g + i is pronounced like a raspy, back-of-the-throat ‘h’ [x]—the same sound as the Spanish letter j. Think of a stronger version of the English h in “ha-ha,” produced further back. The vowel that follows is a clean Spanish “ee.” So “gi” ≈ “hee” but with a noticeable scratchy airflow.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Gibraltar","native":"Gibraltar","position":"Beginning","cultural_context":"Well-known Rock of Gibraltar at Spain’s southern tip"},{"target":"digital","native":"digital","position":"Middle","cultural_context":"Same word as English “digital,” used in tech contexts"},{"target":"energía","native":"energía","position":"Middle","cultural_context":"Word for “energy,” common in news and science talks"}]}]
["je",{"thoughts":"“je” is just the letter j followed by the vowel e, so the only new thing for an English speaker is the Spanish j sound (/x/). It is like a strong, raspy, throaty “h” (think German “Bach” or Scottish “loch”), followed by the open “eh” vowel. English has no exact equivalent, so speakers often replace it with a soft h, but a correct version is further back in the throat.","pattern":"je","position":"Anywhere","description":"Say a harsh, back-of-the-throat unvoiced “h” (similar to the ch in “loch”) immediately followed by the vowel in “bet.” It is one smooth syllable: /xe/. Do not voice it or turn it into the English dʒ sound in “jet.” Keep the tongue low and airflow continuous as if fogging a window.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"jefe","native":"jefe","position":"Beginning","cultural_context":"Common Spanish word for “boss,” heard in movies and Tex-Mex restaurants"},{"target":"Jerez","native":"Jerez","position":"Beginning","cultural_context":"Famous Spanish city that gave us sherry wine"},{"target":"objetivo","native":"objetivo","position":"Middle","cultural_context":"Looks like English “objective,” often seen in bilingual signage or textbooks"},{"target":"viaje","native":"viaje","position":"End","cultural_context":"Word for “trip,” appears in the phrase “¡Buen viaje!” on travel ads"}]}]
["ji",{"thoughts":"The spelling “ji” in Spanish is simply the letter j followed by i. The j is the same raspy, back-of-throat sound English speakers already know from words such as “jalapeño.” Adding the vowel i just gives it an “ee” glide, so you get something like an emphatic English “hee,” but starting with a bit of friction in the throat. English speakers are used to hearing this sound in Mexican food terms, though producing the harsher velar fricative can be tricky.","pattern":"ji","position":"Anywhere","description":"Pronounce j like a strong, breathy h made at the back of the mouth (similar to the Scottish “loch” or a very throaty English h). Immediately follow it with the Spanish i, which is the pure “ee” sound in English “see.” Put them together quickly: [xee] or [hee] depending on how strong your h is.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fajita","native":"fajita","position":"Middle","cultural_context":"Tex-Mex dish found on many restaurant menus"},{"target":"jícama","native":"jícama","position":"Beginning","cultural_context":"Crunchy root vegetable often mentioned in salads and Mexican cuisine"},{"target":"Jalisco","native":"Jalisco","position":"Beginning","cultural_context":"Mexican state famous for tequila; name appears on liquor bottles & travel shows"},{"target":"jirafa","native":"jirafa","position":"Beginning","cultural_context":"Spanish word for “giraffe,” resembles the English word so it’s recognizable"}]}]
["y",{"thoughts":"Final-letter Y in Spanish is not a consonant like English “y” in “yes.” It functions as a pure vowel /i/, the same quality as Spanish “i.” English speakers already have the “ee” vowel, so the sound itself is easy; the only challenge is remembering not to add a glide.","pattern":"y","position":"End","description":"When “y” appears as the last letter of a Spanish word, it is pronounced like the vowel sound in English “see” (IPA [i])—a clear, short \"ee\" with no preceding consonant glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"muy","native":"muy","position":"End","cultural_context":"Heard in the phrase “muy bien” (very well) taught in beginner Spanish"},{"target":"Paraguay","native":"Paraguay","position":"End","cultural_context":"South American country frequently mentioned in geography and sports"},{"target":"Uruguay","native":"Uruguay","position":"End","cultural_context":"Neighboring South American country known from news and international soccer"}]}]
["r",{"thoughts":"Spanish “r” at the start of a word is always the rolled (trilled) version—basically the same sound written as “rr” inside a word. English has no true trill, so learners must train the tongue to tap rapidly against the alveolar ridge. Using familiar words that start with r helps highlight the sound.","pattern":"r","position":"Beginning","description":"A rapid alveolar trill: the tip of your tongue vibrates lightly against the ridge just behind your upper front teeth. Think of the exaggerated movie-style “rrrr” in “Arriba!”—but shorter and crisper than an English pirate “r.” Airflow and a relaxed tongue help produce multiple quick taps.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"rápido","native":"rápido","position":"Beginning","cultural_context":"Heard in action movies/TV as “¡Rápido!” meaning “hurry!”"},{"target":"rumba","native":"rumba","position":"Beginning","cultural_context":"Popular Latin dance and music style known worldwide"},{"target":"Rico","native":"Rico","position":"Beginning","cultural_context":"Recognized from the place name Puerto Rico"}]}]
["h",{"thoughts":"Spanish “h” at the start of a word is always silent, so English speakers only have to remember not to add the English /h/ sound. This is familiar because English already has some silent-h words such as “honor” or “hour.”","pattern":"h","position":"Beginning","description":"Unlike most English words, the written “h” at the beginning of a Spanish word makes NO sound at all—just start with the following vowel or consonant (e.g., “hola” sounds like “OH-lah”). Try to resist adding the English breathy /h/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Common greeting you see in beginner Spanish lessons and on T-shirts"},{"target":"Honduras","native":"Honduras","position":"Beginning","cultural_context":"Central American country often mentioned in news and geography"},{"target":"habanero","native":"habanero","position":"Beginning","cultural_context":"Spicy chili pepper frequently listed in hot-sauce ingredients"},{"target":"hacienda","native":"hacienda","position":"Beginning","cultural_context":"Word for a large estate or ranch, appears in history texts and restaurant names"}]}]
