["a",{"thoughts":"Spanish letter “a” is identical to the open, un-stressed vowel English speakers use in words like “father.” It appears in all syllable positions, so there’s nothing exotic about where it shows up—only that Spanish keeps it pure (never turns into the “æ” of ‘cat’ or the schwa of ‘sofa’). Most learners already have the mouth shape and sound in their inventory, so the main job is remembering to pronounce it consistently.","pattern":"a","position":"Anywhere","description":"Open your mouth wide and low, tongue relaxed and resting low in the mouth, lips unrounded—exactly like the “ah” in English “father.” Hold it briefly and clearly; don’t let it slide toward an “uh” (schwa) or the tighter “æ” of “cat.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"taco","native":"taco","position":"Middle","cultural_context":"Ubiquitous Mexican food item found on most U.S. menus"},{"target":"salsa","native":"salsa","position":"Multiple","cultural_context":"Common dip and dance style referenced in English"},{"target":"Patagonia","native":"Patagonia","position":"Multiple","cultural_context":"Well-known outdoor clothing brand and South American region"}]}]
["b",{"thoughts":"English already has a strong /b/ plosive, but Spanish uses both a plosive [b] and a softer buzzy approximant [β̞] depending on position. Learners usually default to the English plosive everywhere; that’s understood, but they should also notice the lighter version between vowels.","pattern":"b","position":"Anywhere","description":"In Spanish, the letter “b” represents a single sound family. After a pause or after an \"m\" or \"n\" you say a full voiced plosive, just like the English “b” in “ball.” Between vowels or other voiced sounds, Spanish relaxes it into a soft, lips-almost-touching glide (an airy, buzzing sound) rather than a hard stop. Imagine starting to say a “b” but letting the air flow without fully closing your lips—almost like a gentle vibration.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"burrito","native":"burrito","position":"Beginning","cultural_context":"Popular Mexican food item commonly ordered in the U.S."},{"target":"Cuba","native":"Cuba","position":"Middle","cultural_context":"Well-known Caribbean country frequently mentioned in news and history"},{"target":"La Bamba","native":"La Bamba","position":"Multiple","cultural_context":"Title of a famous Mexican folk song and 1987 movie familiar to many English speakers"}]}]
["c",{"thoughts":"English already uses the letter C for both /k/ and /s/, so learners will recognize the two main Spanish values. The only new twist is that Spaniards pronounce ce/ci as /θ/, but Latin-American /s/ will feel completely familiar. Articulation is identical to English hard C and English S; no new mouth movement required.","pattern":"c","position":"Anywhere","description":"The Spanish letter “c” has two regular pronunciations:\n1. Hard C (/k/): When followed by a, o, u, or a consonant (ca, co, cu, cl…), it is the same voiceless K sound you make in English “cat.” The back of the tongue taps the soft palate; vocal cords stay off.\n2. Soft C (/s/ in Latin America, /θ/ in most of Spain): When followed by e or i (ce, ci), Latin-American Spanish uses the voiceless S sound of English “see.” In Spain it is a voiceless TH as in “thin.” Either way, the sound remains unvoiced and airy.\nImportant differences from English: the Spanish hard C is crisper—never the aspirated “kh” puff some English speakers add; and the soft C is never the buzzing /z/ you might hear in English words like “city.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Coca-Cola","native":"Coca-Cola","position":"Multiple","cultural_context":"Global soft-drink brand; you see the Spanish spelling on menus everywhere"},{"target":"cerveza","native":"cerveza","position":"Beginning","cultural_context":"Common Spanish word for beer, often ordered by English speakers in Mexican or Spanish restaurants"},{"target":"taco","native":"taco","position":"Middle","cultural_context":"Popular Mexican dish widely eaten in the U.S. and elsewhere"}]}]
["d",{"thoughts":"Spanish “d” alternates between a crisp English-like [d] (after a pause, after “n” or “l”) and a softer, quick “th” sound [ð] (like the “th” in “this”) everywhere else. English speakers know both sounds separately but not the rule for switching, so the sound is familiar yet the distribution causes some challenge.","pattern":"d","position":"Anywhere","description":"In Spanish, the letter “d” is pronounced in two ways:\n1) Hard [d]: Place the tip of your tongue on the ridge just behind your upper front teeth, release with a small burst of voice. This happens at the start of a phrase or after an “n” or “l” (e.g., “día,” “andar”). It feels almost identical to the English “d.”\n2) Soft [ð]: Keep the tongue in the same spot but let the air glide out without fully stopping—like the voiced “th” in English “this.” This softer version appears between vowels and after most consonants (e.g., “cada,” “nada”).\n\nKey tip: Your tongue always touches the teeth ridge; never pull it back like many English speakers do in words such as “dog.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Doritos","native":"Doritos","position":"Beginning","cultural_context":"Popular tortilla chip brand sold worldwide and advertised in English-language media"},{"target":"avocado","native":"aguacate","position":"Middle","cultural_context":"Common food item and ingredient in guacamole; word appears on menus and in grocery stores"},{"target":"Madrid","native":"Madrid","position":"End","cultural_context":"Capital city of Spain, referenced frequently in news, sports, and travel shows"}]}]
["e",{"thoughts":"Spanish “e” is one of the five simple, pure vowels. English speakers already know a very similar sound (the vowel in “bet”), though English tends to stretch it or slide into a slight ‘y’ sound at the end. The biggest reminder is to keep it short and crisp.","pattern":"e","position":"Anywhere","description":"A single, clean vowel made with the tongue pushed slightly forward and mid-high in the mouth—very much like the English vowel in “bed,” but shorter and without any glide. Lips stay relaxed, jaw barely opens, and the sound remains steady from start to finish.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"fiesta","native":"fiesta","position":"Middle","cultural_context":"Commonly used in English to mean a party or celebration"},{"target":"queso","native":"queso","position":"Middle","cultural_context":"Spanish word for cheese, seen on Tex-Mex menus and snack brands"},{"target":"café","native":"café","position":"End","cultural_context":"Word for coffee or coffee shop, borrowed directly into English"}]}]
["f",{"thoughts":"The Spanish letter “f” is pronounced exactly the same way as the English “f,” so English speakers won’t face any surprises. It can occur at the start, in the middle, or at the end of words, but its articulation never changes.","pattern":"f","position":"Anywhere","description":"Push air through a small gap between your lower lip and upper front teeth without using your vocal cords—just like the English “f” in “fish.” In Spanish it is always this pure, unvoiced sound; it never shifts to a “v” or a softer sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"fiesta","native":"fiesta","position":"Beginning","cultural_context":"Widely used in English to mean a lively party, especially with a Mexican or Latin theme"},{"target":"café","native":"café","position":"Middle","cultural_context":"Seen on coffee shop signs and menus around the world"},{"target":"fútbol","native":"fútbol","position":"Beginning","cultural_context":"Spanish word for soccer, heard during World Cup broadcasts and sports commentary"}]}]
["g",{"thoughts":"English speakers already know the hard “g” sound (as in “go”), but the soft Spanish “g” before e/i, pronounced like a throaty English “h” or the Scottish “loch,” is new. Because the letter can switch between these two values, learners must watch the following vowel to pick the right sound.","pattern":"g","position":"Anywhere","description":"Spanish “g” has TWO common pronunciations.\n1. Hard g [g]: Before a, o, u, or a consonant, and in the cluster “gu + e/i” (guitarra). It is the same as the English g in “go.”\n2. Soft g [x]: Before e or i (ge, gi). This is a voiceless throaty sound made by narrowing the back of the tongue against the soft palate—similar to the English “h” in “ahead” but stronger, or the Scottish “loch.”\nTip: Look at the next vowel—e/i = soft; anything else = hard.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"amigo","native":"amigo","position":"Middle","cultural_context":"Very common Spanish word for “friend”; often used jokingly in English (“Hey, amigo!”)"},{"target":"Argentina","native":"Argentina","position":"Middle","cultural_context":"South American country known for tango and soccer; heard regularly in news and sports"},{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Popular avocado dip served in Mexican restaurants across the U.S. and elsewhere"}]}]
["h",{"thoughts":"Spanish “h” is actually the absence of a sound, which surprises many learners. English speakers already know silent-letters (hour, honest), so the idea exists, but they must remember to keep Spanish completely un-aspirated every single time.","pattern":"h","position":"Anywhere","description":"In modern standard Spanish the letter “h” is silent. You do not exhale or add any English-style /h/ before the following vowel or consonant; simply begin the word (or continue the syllable) as if the “h” were not written at all. Example: “hotel” is pronounced roughly “oh-TEL.” The only exception is when it combines as the separate digraph “ch,” which has its own /ch/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola (hello)","position":"Beginning","cultural_context":"Most common Spanish greeting; appears in phrasebooks and pop culture"},{"target":"hotel","native":"hotel (hotel)","position":"Beginning","cultural_context":"Same word as English for lodging; tourists see it on signs throughout the Spanish-speaking world"},{"target":"alcohol","native":"alcohol (alcohol)","position":"Middle","cultural_context":"Identical spelling and meaning in English; product labels and news"}]}]
["i",{"thoughts":"Spanish “i” is practically the same pure high-front vowel found in many English words such as the first syllable of “machine.”  English speakers already make this sound, but they sometimes lengthen it into a glide (“ee-uh”) or relax it toward the lax “ih” in “sit.”  The key coaching point is to keep it short and tense.","pattern":"i","position":"Anywhere","description":"A short, tense “ee” sound.  Lips are slightly spread, jaw nearly closed, and the front of the tongue is raised close to the roof of the mouth without touching it.  It should stay pure—no glide or change in quality from start to finish.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Popular Tex-Mex food commonly ordered at fast-food chains"},{"target":"siesta","native":"siesta","position":"Beginning","cultural_context":"Well-known word for an afternoon nap, heard in travel shows and everyday English conversation"},{"target":"quesadilla","native":"quesadilla","position":"Middle","cultural_context":"Common Mexican dish on U.S. menus and in grocery freezer aisles"}]}]
["j",{"thoughts":"The Spanish letter “j” represents a harsh, breathy sound that does not exist as a separate phoneme in English, though English speakers have heard it in common Mexican food names and place names. They usually think it is just an “h,” but the tongue and throat position make it stronger and raspier. The sound can appear anywhere in a word.","pattern":"j","position":"Anywhere","description":"Spanish “j” is a voiceless velar—or slightly uvular—fricative. Start as if you were going to say the English “k,” but instead of stopping the air, keep the back of the tongue close to the soft palate and let air pass through, creating a raspy, throaty friction. It is much stronger than the English “h” in “hat,” almost like clearing your throat gently.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jalapeño","native":"jalapeño","position":"Beginning","cultural_context":"Common spicy pepper listed on menus and in grocery stores"},{"target":"José Cuervo","native":"José Cuervo","position":"Beginning","cultural_context":"Well-known tequila brand advertised in the United States"},{"target":"Baja","native":"Baja","position":"Middle","cultural_context":"Name of the Mexican peninsula; heard in travel shows and menu items like “Baja fish tacos”"}]}]
["k",{"thoughts":"The Spanish /k/ is produced the same way as the English hard “k,” but it is never followed by the strong puff of air (aspiration) that English speakers unconsciously add at the start of stressed syllables. Because English already has this consonant, learners mainly need to remember to keep it crisp and unaspirated. The sound is spelled several ways in Spanish (c, qu, k), so the bigger challenge is recognizing the different spellings rather than making the sound.","pattern":"k","position":"Anywhere","description":"Touch the back of your tongue to the soft palate, stop the airflow, then release it quickly—like the English “k” in the word “ski.” Do NOT add the extra burst of air you hear in English words like “kay.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"taco","native":"taco","position":"Middle","cultural_context":"Classic Mexican dish that is mainstream in the U.S."},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Well-known Mexican spirit used in margaritas"},{"target":"queso","native":"queso","position":"Beginning","cultural_context":"Spanish word for cheese, often seen on Tex-Mex menus (e.g., queso dip)"}]}]
["l",{"thoughts":"Spanish uses the same “clear-L” that English speakers already pronounce at the start of words like “light.” There is no “dark-L” as in English word-final position, but that doesn’t create major problems for learners.","pattern":"l","position":"Anywhere","description":"Place the tip of your tongue lightly against the ridge just behind your upper front teeth and let the air flow around the sides of the tongue. Keep the sound short and light—do not add the velar, ‘dark’ quality many English speakers produce at the end of words like “ball.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Latino","native":"Latino","position":"Beginning","cultural_context":"Common term in English-language media for people of Latin American heritage"},{"target":"hola","native":"hola","position":"Middle","cultural_context":"Widely known Spanish greeting meaning “hello”"},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"Famous Spanish city known for tourism, soccer (FC Barcelona), and architecture"}]}]
["m",{"thoughts":"Spanish “m” is the same bilabial nasal found in English, so learners already know the mouth position and voicing. The only thing to remember is that Spanish keeps it crisp, without the vowel-lengthening that sometimes happens in English.","pattern":"m","position":"Anywhere","description":"Close both lips, let the vocal cords vibrate, and allow air to resonate through the nose while keeping the mouth closed. It’s the same sound as the English “m” in “moon” or “summer,” produced quickly and clearly in Spanish.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"México","native":"México","position":"Beginning","cultural_context":"Country name regularly encountered in geography, news, travel, and Mexican cuisine"},{"target":"amigo","native":"amigo","position":"Middle","cultural_context":"Popular Spanish word for “friend” that shows up in movies, TV, and casual English speech"},{"target":"álbum","native":"álbum","position":"End","cultural_context":"Word for a music or photo collection; spelled almost the same in English (‘album’)"}]}]
["n",{"thoughts":"Spanish “n” is exactly the same sound as the English “n” in words like “no” or “ten.” English speakers have no new articulation to learn; they only have to remember that it can show up anywhere in a Spanish word.","pattern":"n","position":"Anywhere","description":"It is the voiced alveolar nasal. Place the tongue tip against the ridge just behind your upper front teeth (the alveolar ridge) and let the air resonate through your nasal cavity while voicing. It is identical to the English “n.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"nachos","native":"nachos","position":"Beginning","cultural_context":"Popular Mexican snack food found on many U.S. menus"},{"target":"Panamá","native":"Panamá","position":"Middle","cultural_context":"Central American country often mentioned in geography and travel shows; known for the Panama Canal"},{"target":"San Diego","native":"San Diego","position":"End","cultural_context":"Major U.S. city whose Spanish name is heard frequently in news, sports, and travel"}]}]
["ñ",{"thoughts":"English speakers have already run into “ñ” in food names and weather reports. The sound itself exists in English (the “ny” in “canyon”), so recognition is high, but matching it consistently in Spanish words and remembering the tilde can still be tricky.","pattern":"ñ","position":"Anywhere","description":"Pronounce it like the “ny” in the English word “canyon.” Start with an “n” but let the middle of your tongue rise to touch the roof of the mouth just behind the teeth, creating a quick ‘y’ glide right after the ‘n’—one blended sound: /ny/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jalapeño","native":"jalapeño","position":"End","cultural_context":"Popular Mexican pepper used in many dishes and hot-sauce labels"},{"target":"piña colada","native":"piña colada","position":"Middle","cultural_context":"Famous tropical cocktail mentioned in pop songs and bar menus"},{"target":"El Niño","native":"El Niño","position":"End","cultural_context":"Well-known Pacific weather pattern covered in international news"}]}]
["o",{"thoughts":"Spanish “o” is essentially the same pure mid-back rounded vowel many English speakers already use in words like “go,” but without the final glide toward a “w” sound. Because the sound exists in English, learners usually recognize and reproduce it quickly; the main adjustment is to keep it short and steady.","pattern":"o","position":"Anywhere","description":"Pronounce it as a single, short, pure “oh” sound. Keep your lips rounded but relaxed, tongue in the mid-back position, and do NOT let the vowel slide toward a ‘w’ or ‘oo.’ It should be one clean, steady vowel lasting about the length of a single beat.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola","position":"Beginning","cultural_context":"Common Spanish greeting frequently heard in beginner courses, travel apps, and pop culture"},{"target":"taco","native":"taco","position":"End","cultural_context":"Staple Mexican food widely eaten in the U.S. and elsewhere"},{"target":"mojito","native":"mojito","position":"Multiple","cultural_context":"Popular Cuban cocktail found on many bar menus"}]}]
["p",{"thoughts":"Spanish /p/ is almost the same sound English speakers already use; the only trick is remembering that Spanish does not add the strong puff of air (aspiration) that English has at the start of stressed syllables.","pattern":"p","position":"Anywhere","description":"It is a voiceless bilabial stop: close both lips, build a little pressure, then release quickly. In Spanish the release is soft—keep your vocal cords off and avoid the noticeable burst of air you usually make in English at the beginning of a word like “pie.” Hold a hand in front of your mouth: you should feel almost no air when saying the Spanish /p/. Between vowels it sounds the same but even shorter.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"papaya","native":"papaya","position":"Multiple","cultural_context":"Tropical fruit found in smoothies and grocery stores everywhere"},{"target":"tapas","native":"tapas","position":"Middle","cultural_context":"Famous Spanish small-plate dishes popular in many restaurants"},{"target":"Pepsi","native":"Pepsi","position":"Beginning","cultural_context":"Global soft-drink brand name heard daily"}]}]
["q",{"thoughts":"English speakers already know the /k/ sound. In Spanish the letter “q” is simply another way to spell that sound when it comes before e or i, with a silent u. Biggest surprise is that the written u is not heard.","pattern":"q","position":"Anywhere","description":"In Spanish the letter “q” (always written as “qu” before the vowels e or i) is pronounced exactly like the hard “k” sound in English words such as “kite” or “skate.” The back of your tongue briefly touches the soft palate and releases a small burst of air. The written “u” is completely silent—your lips do not round and you do not create a /w/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican stuffed tortilla available at many fast-food chains and restaurants"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican distilled spirit used in margaritas"},{"target":"quinoa","native":"quinoa","position":"Beginning","cultural_context":"Health-food grain now common in grocery stores and recipes"}]}]
["r",{"thoughts":"Spanish “r” actually covers two related sounds: a quick single-tap (flap) that occurs between vowels, and a stronger multi-vibration trill that appears at the beginning of a word or when written “rr.” English already has a hidden flap in words like “butter,” but has no trill, so learners will partly recognize the feel but still face something new.","pattern":"r","position":"Anywhere","description":"Tap version: Touch the tip of your tongue quickly to the ridge just behind your upper front teeth—so fast it feels like a soft, single click of the tongue (similar to the very quick sound Americans make in the middle of “butter”).\nTrill version: Use the same tongue placement but force more air, letting the tongue vibrate two or more times—like a tiny motor. Keep airflow steady and relaxed; the vibration happens passively when the tongue is in the right spot.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Common Mexican dish found in many restaurants and freezer aisles"},{"target":"Rio","native":"Rio","position":"Beginning","cultural_context":"Title of a popular animated movie and the Spanish word for “river” seen in place names like Rio Grande"},{"target":"Puerto Rico","native":"Puerto Rico","position":"Multiple","cultural_context":"U.S. territory mentioned frequently in news, travel, and pop culture"}]}]
["s",{"thoughts":"The Spanish “s” is essentially the same voiceless ‘s’ sound English speakers use in words like “sun” or “bus.” It does not change before vowels and never becomes the /z/ sound, so it is very familiar and easy for English learners.","pattern":"s","position":"Anywhere","description":"A hissing, voiceless sound made by letting air pass between the tongue and the ridge behind the upper teeth (the same as the English “s” in “snake”). In Spanish it always stays an unvoiced /s/; it never turns into a /z/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"salsa","native":"salsa","position":"Multiple","cultural_context":"Popular dip and dance style widely known in the U.S."},{"target":"queso","native":"queso","position":"Middle","cultural_context":"Spanish word for cheese, often seen on Tex-Mex menus (e.g., queso dip)."},{"target":"siesta","native":"siesta","position":"Beginning","cultural_context":"Well-known term for an afternoon nap, often referenced in travel and culture discussions."}]}]
["t",{"thoughts":"English speakers already know the basic /t/ sound, but the Spanish version is slightly different: it is dental (tongue against upper teeth) and unaspirated (no strong puff of air). Since the articulatory change is small and the sound is common, it should be easy for most learners once they become aware of the lack of aspiration.","pattern":"t","position":"Anywhere","description":"In Spanish, /t/ is a voiceless dental stop. Place the tip of your tongue lightly against the back of your upper front teeth (not on the ridge just behind them as in English). Release the tongue without a strong burst of air—think of it as a softer, crisper ‘t’ than in English words like “top.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"taco","native":"taco","position":"Beginning","cultural_context":"Popular Mexican food widely eaten and advertised in English-speaking countries"},{"target":"patio","native":"patio","position":"Middle","cultural_context":"Same word used in English to mean an outdoor paved area"},{"target":"tortilla","native":"tortilla","position":"Multiple","cultural_context":"Common flatbread used in many Mexican dishes, mentioned in recipes and restaurants"}]}]
["u",{"thoughts":"Spanish “u” is almost identical to the English vowel in “food.” English speakers already make this sound, but they need to keep it short and pure, without turning it into a diphthong (no glide toward a w-sound).","pattern":"u","position":"Anywhere","description":"A single, pure vowel made with the tongue high and toward the back of the mouth, lips rounded – like the “oo” in English “food.” Hold it briefly and evenly; do not let it slide or change quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Popular Mexican wrap filled with beans, rice, etc., common in U.S. restaurants"},{"target":"Cuba","native":"Cuba","position":"Beginning","cultural_context":"Well-known Caribbean country often mentioned in news and travel"},{"target":"menú","native":"menú","position":"End","cultural_context":"Same word as English “menu,” seen at restaurants and in software"}]}]
["v",{"thoughts":"English speakers already know the written letter “v,” but in Spanish it’s not the English /v/. Spanish “v” sounds almost identical to Spanish “b,” produced with the lips (bilabial), not the teeth. The main hurdle is breaking the English habit of touching the top teeth to the bottom lip. Because the mouth movement is similar to the English “b,” the concept is familiar, but the habit change takes some practice.","pattern":"v","position":"Anywhere","description":"In Spanish, the letter “v” is pronounced the same as the Spanish “b.”\n• At the start of a breath-group or after a pause/nasal (m, n), it is a hard bilabial plosive [b]—lips close firmly, short pop of air, vocal cords vibrate.\n• Between vowels or most other consonants, it relaxes into a soft bilabial approximant [β̞]—lips come close without fully closing; it sounds like a very soft, buzzing-less “b.”\nKey point: Your lips—not your teeth—do the work. Do NOT touch the top teeth to the bottom lip as in the English /v/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Venezuela","native":"Venezuela","position":"Beginning","cultural_context":"Name of the South American country often mentioned in news, geography, and sports."},{"target":"ceviche","native":"ceviche","position":"Middle","cultural_context":"Popular Latin American seafood dish found on many restaurant menus in the U.S."},{"target":"Navidad (as in “Feliz Navidad”)","native":"Navidad","position":"Middle","cultural_context":"Title of the famous bilingual Christmas song played every holiday season."}]}]
["w",{"thoughts":"The Spanish letter “w” is almost always found in loan-words or proper names taken from other languages. Spaniards therefore pronounce it the way they hear it in those foreign words, which for modern Spanish generally matches the English sound /w/ (as in “water”). Because the articulation and lip rounding are identical to English, native English speakers should find it instantly familiar and easy to reproduce.","pattern":"w","position":"Anywhere","description":"Make a small, tight circle with your lips (as if beginning to whistle) and voice a quick glide while letting air flow: /w/. It is the same sound you make at the start of English words like “we” or “wine.” In Spanish it never represents any other sound; if you can say English “w,” you already have it.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"whisky","native":"whisky","position":"Beginning","cultural_context":"International name for the alcoholic drink; spelled the same in English"},{"target":"wifi","native":"wifi","position":"Beginning","cultural_context":"Universal tech term for wireless internet"},{"target":"kiwi","native":"kiwi","position":"Middle","cultural_context":"Common fruit name and nickname for New Zealanders, used the same in English"}]}]
["x",{"thoughts":"Spanish “x” usually sounds like the English “x” in eXit (/ks/), so that part feels familiar, but some very common words (México, Texas) use an /h/-like sound instead. English speakers know the words, yet don’t expect the second pronunciation, which raises the challenge slightly.","pattern":"x","position":"Anywhere","description":"Most of the time, Spanish “x” is pronounced like the English consonant cluster /ks/—one quick burst, no extra vowel (ta-ksi for “taxi”).  However, in a handful of historic or place names (México, Texas, Oaxaca, Xochimilco) it is pronounced like a soft English “h.”  The mouth is open, airflow continuous, and the back of the tongue approaches (but doesn’t touch) the roof of the mouth—similar to exhaling fog on glass.  Context or memorization tells you which value to use.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Same word for a cab—used worldwide"},{"target":"México","native":"Mexico","position":"Middle","cultural_context":"Neighboring country; name appears constantly in English media"},{"target":"Texas","native":"Texas","position":"Middle","cultural_context":"U.S. state whose Spanish spelling is identical but pronounced with the Spanish /h/ sound"}]}]
["y",{"thoughts":"Most English speakers already know the consonant sound of Spanish “y” because it is almost identical to the English “y” in “yes.” In some regions Spanish speakers make it a bit more “soft-j/zh” sounding, but using an English y is acceptable for beginners. The only surprise is that when the letter stands alone (the word \"y\" meaning “and”) it is pronounced like the vowel “ee.”","pattern":"y","position":"Anywhere","description":"As a consonant, pronounce it like the y in English “yes”: tongue high and close to the hard palate, air flowing smoothly without friction. Avoid turning it into a harsh English “j.” When the letter y stands alone as the word for “and,” pronounce it like the long e sound “ee.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"yoga","native":"yoga","position":"Beginning","cultural_context":"Same word used for the popular exercise and meditation practice"},{"target":"Maya","native":"Maya","position":"Middle","cultural_context":"Name of the well-known ancient Central American civilization (e.g., “Maya temples”) and a common given name"},{"target":"papaya","native":"papaya","position":"Middle","cultural_context":"Tropical fruit you see in supermarkets, smoothies, and fruit salads"}]}]
["z",{"thoughts":"English speakers already know both sounds that Spanish “z” can make: either the un-voiced “th” of “thin” (common in Spain) or the un-voiced “s” of “see” (common across Latin America). The new idea is that Spanish never uses the buzzing “z” of “zebra.” So the challenge is not making a new sound, but remembering which one to use.","pattern":"z","position":"Anywhere","description":"In most of Spain, the letter “z” is pronounced like the voiceless “th” in English “thin”—tongue lightly between the teeth, air passes out without vibration. In nearly all of Latin America, the same letter is pronounced like a clear, hissy English “s.” It is always voiceless and never the buzzy “z” of English “zoo.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Zara","native":"Zara","position":"Beginning","cultural_context":"Global clothing brand found in many malls"},{"target":"Ibiza","native":"Ibiza","position":"Middle","cultural_context":"Famous Spanish party island often mentioned in travel shows and music"},{"target":"chorizo","native":"chorizo","position":"Middle","cultural_context":"Popular Spanish-style sausage on brunch menus and in grocery stores"}]}]
["á",{"thoughts":"English already has the same open “ah” vowel as in “father,” so the actual mouth position is familiar; what’s new is noticing the written accent, which simply marks the stressed syllable.","pattern":"á","position":"Anywhere","description":"á is the same open-back ‘ah’ vowel you hear in the English word “father.”  Your jaw drops, lips are relaxed (not rounded), and the tongue is low and slightly forward.  The written accent does NOT change the sound itself; it just shows where the word’s main stress falls.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Bogotá","native":"Bogotá","position":"End","cultural_context":"Capital city of Colombia, often mentioned in news and travel shows"},{"target":"mañana","native":"mañana","position":"Middle","cultural_context":"Commonly quoted Spanish word for “tomorrow,” used jokingly in English (“mañana attitude”)"},{"target":"Málaga","native":"Málaga","position":"Middle","cultural_context":"Well-known vacation city on Spain’s Costa del Sol, appears in travel articles and cruise itineraries"}]}]
["é",{"thoughts":"Spanish “é” is simply the regular vowel “e” with an accent mark that tells you it gets the main stress. The actual mouth position is the same every time: a pure, short, mid-front vowel. It sits between the English vowels in “bet” and the first part of “bay,” but it never glides to a “y” sound. English speakers have heard it in many borrowed words, so the sound is familiar; the main challenge is keeping it short and pure.","pattern":"é","position":"Anywhere","description":"Open your mouth slightly, lips relaxed and unrounded. Place your tongue mid-high and toward the front, as for the first half of the English diphthong in “day,” but stop there—do NOT let it slide into a “y” sound. Keep it short and clear. The written accent just tells you this syllable is stressed; it does not change the vowel quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"café","native":"café","position":"End","cultural_context":"Generic word for a coffee shop; printed on countless signs and menus"},{"target":"México","native":"México","position":"Middle","cultural_context":"The country name seen on maps, news, and travel ads"},{"target":"José","native":"José","position":"End","cultural_context":"Common Spanish first name, familiar from public figures and friends"}]}]
["í",{"thoughts":"The accented í is simply the regular Spanish “i” (/i/) with a written accent to show that the syllable carries the stress. English already has an identical vowel in words like “machine” or “see,” so the only real new idea is noticing the written accent and stressing that syllable.","pattern":"í","position":"Anywhere","description":"It is the same pure “ee” sound you hear in English words like “machine,” but in Spanish it is always short and crisp—never glides into a “y.” The written accent (´) only tells you that this syllable gets the stress.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"sí","native":"sí","position":"End","cultural_context":"Common Spanish word for “yes” often heard in movies, TV, and basic phrase lists"},{"target":"Día de los Muertos","native":"Día de los Muertos","position":"Middle","cultural_context":"Mexican Day-of-the-Dead holiday featured in films like “Coco” and news coverage"},{"target":"María","native":"María","position":"Middle","cultural_context":"Very common Spanish given name; title of the famous song in “West Side Story”"}]}]
["ó",{"thoughts":"Spanish ó is not a new vowel for English speakers—the acute accent only tells you that the syllable is stressed. The actual sound is a pure, single “o” (close-mid, back, rounded). The only challenge is avoiding the English glide that turns “o” into “oh-oo.”","pattern":"ó","position":"Anywhere","description":"Pronounce it like the first part of English “go,” but stop before your lips move into the little \"w\" glide. Keep your lips rounded, keep the vowel short and steady, and put extra stress on the syllable because of the accent mark.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Adiós","native":"adiós","position":"Middle","cultural_context":"Common Spanish word for “good-bye” heard in movies and travel phrases"},{"target":"Corazón","native":"corazón","position":"Middle","cultural_context":"Spanish word for “heart,” featured in popular song titles and lyrics like “Corazón” by Shakira"}]}]
["ú",{"thoughts":"The accented \"ú\" is simply the regular Spanish vowel /u/ (like the “oo” in English “food”) but marked to receive the main stress of the word. So the sound itself is familiar; the main new point is remembering that the written accent tells you where to put the stress.","pattern":"ú","position":"Anywhere","description":"Pronounce it like the long “oo” in English “food,” keeping the lips rounded and the tongue high and toward the back of the mouth. The written accent mark (´) just means this syllable is stressed; it does not change the vowel quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Cancún","native":"Cancún","position":"End","cultural_context":"Popular Mexican beach resort destination often mentioned in travel ads and news"},{"target":"Perú","native":"Perú","position":"End","cultural_context":"Spanish name of Peru, a well-known South American country"},{"target":"Jesús","native":"Jesús","position":"End","cultural_context":"Spanish form of the name “Jesus,” familiar from religion and common Spanish first name"}]}]
["ü",{"thoughts":"The Spanish ü simply forces the letter “u” to be heard after g and before e/i, producing the same glide as the English “w.” English speakers already use this sound every day; the only new part is seeing it written with two dots.","pattern":"ü","position":"Anywhere","description":"Ü is pronounced like the English w-sound. In Spanish it normally appears in the groups güe and güi. Say a quick w and immediately move into the following vowel: güe = “gweh,” güi = “gwee.” Nothing in the lips, tongue, or throat is new—just remember to pronounce the u instead of leaving it silent.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Agüero","native":"Agüero","position":"Middle","cultural_context":"Last name of famous soccer star Sergio Agüero, often shouted by English-language sportscasters"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Appears on bilingual product labels and signs to indicate “bilingual” service"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin,” visible in kids’ cartoons, zoo exhibits, and snack brands that feature penguins"}]}]
["ch",{"thoughts":"English already has the same \"ch\" sound (as in “chocolate”), so learners possess a ready-made reference. In Spanish the spelling–sound match is very consistent, which lowers difficulty.","pattern":"ch","position":"Anywhere","description":"Pronounce it exactly like the English \"ch\" in “chocolate” or “chair”: start with the tip of the tongue touching the ridge just behind the upper teeth (like a quick ‘t’) and immediately release into a strong ‘sh’ sound, producing one crisp affricate [tʃ]. Spanish keeps this sound short and clear—never turn it into a soft ‘sh’ or a hard ‘k’.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"churro","native":"churro","position":"Beginning","cultural_context":"Popular fried pastry sold at fairs, amusement parks, and many coffee shops"},{"target":"nacho","native":"nacho","position":"Middle","cultural_context":"Common Tex-Mex snack of tortilla chips with melted cheese; word is on countless menus"},{"target":"Chile","native":"Chile","position":"Beginning","cultural_context":"Well-known South American country and also the Spanish word for chili pepper, seen on food labels"}]}]
["ll",{"thoughts":"English speakers have already seen the double-l in food words like “tortilla.” In most Spanish today it’s pronounced like the English consonant Y in “yes,” so it doesn’t add a brand-new mouth movement, but learners must remember not to read it as the English L or as two separate letters. Regional variants (zh/sh sounds) exist, but the Y-sound is the safest neutral choice.","pattern":"ll","position":"Anywhere","description":"In modern standard Spanish, the letter pair “ll” is pronounced as a single consonant that sounds like the English y in “yes.” Place the middle of your tongue close to (but not touching) the hard palate and let the air flow smoothly while voicing. Do NOT touch the tongue to the teeth or alveolar ridge as you would for an English L. In many Latin-American regions this “ll” is identical to the Spanish letter “y.” (Some areas pronounce it more like the “zh” in “measure,” but the y-sound will be understood everywhere.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"tortilla","native":"tortilla","position":"Middle","cultural_context":"Staple Mexican flatbread widely sold in grocery stores and used for tacos and wraps"},{"target":"quesadilla","native":"quesadilla","position":"Middle","cultural_context":"Popular Mexican snack of melted cheese in a folded tortilla, common on restaurant menus"},{"target":"Amarillo","native":"Amarillo","position":"End","cultural_context":"Well-known Texas city name and the Spanish word for the color yellow, heard in travel and song titles"}]}]
["rr",{"thoughts":"English has no rolled-R, so learners have likely heard it in words like “burrito” but seldom produce it. They must learn the tongue-tip trill.","pattern":"rr","position":"Anywhere","description":"Spanish “rr” is an alveolar trill (a rolled R). Place the tip of your tongue lightly against the small ridge just behind your upper front teeth (the alveolar ridge). Let a steady airstream pass so the tongue tip vibrates rapidly—at least two quick taps—in a series of very short flaps. Do NOT use the back of the throat; the sound is made with the tongue tip and airflow, similar to a rapid motorboat sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"burrito","native":"burrito","position":"Middle","cultural_context":"Popular Mexican food item found in many fast-food chains"},{"target":"arriba","native":"arriba","position":"Middle","cultural_context":"Common exclamation in pop culture and songs meaning “up!” or “go!”"},{"target":"Sierra","native":"sierra","position":"Middle","cultural_context":"Name of mountain ranges, vehicles (GMC Sierra), and beer (Sierra Nevada) familiar in English"}]}]
["qu",{"thoughts":"English speakers already know the /k/ sound, but they may try to pronounce the written “u.” Main tip: treat “qu” before e or i exactly like the hard “k” in “kite,” with no following “w.”","pattern":"qu","position":"Anywhere","description":"In Spanish, the letter pair “qu” is pronounced as a single hard K sound /k/. The written “u” is completely silent and there is no “w” glide afterward. It only appears before the vowels e or i (que, qui). Make the same back-of-the-tongue contact you use for an English K in “sky,” release cleanly, and go straight into the next vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican dish found in many restaurants and frozen food aisles"},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in margaritas and other cocktails"},{"target":"mosquito","native":"mosquito","position":"Middle","cultural_context":"Common insect; the English word comes directly from Spanish"}]}]
["gu",{"thoughts":"English speakers have run into “gu” in words like “guacamole,” but they may not realise Spanish has two ways to treat the pair: (1) hard g + w glide (gw) before a, o, u or when ü is written, and (2) hard g only (silent u) before e or i. The actual g sound is fully familiar; the only challenge is remembering whether the u is heard.","pattern":"gu","position":"Anywhere","description":"In Spanish, the letters g + u mark a HARD g sound (like the g in “go”). What happens to the u depends on the vowel that follows:\n• Before a, o, or u – or when you see ü – you pronounce a quick w-like glide after the g. Think “gw”: “gua” = GWAH, “guo” = GWO, “güe/güi” = GWE/GWEE.\n• Before e or i with no dots, the u is silent. You just say a hard g: “gue” = GEH, “gui” = GEE.\nSo “Guatemala” = GWA-te-MA-la, but “guitarra” = gee-TA-rra (no w).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guatemala","native":"Guatemala","position":"Beginning","cultural_context":"Central-American country often mentioned in news, travel, and geography lessons"},{"target":"agua","native":"agua","position":"Middle","cultural_context":"Spanish word for water; appears on bilingual drink menus and bottled-water labels"},{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Well-known avocado dip served in Mexican and Tex-Mex cuisine"}]}]
["gü",{"thoughts":"English speakers rarely see the diaeresis (two dots) over the letter \"u\" in Spanish, so they may overlook it. In Spanish, \"gü\" tells the reader that the normally silent \"u\" between g + e/i is actually pronounced, giving a clear \"gw\" sound. The sound itself (like the “gw” in the English word “penguin”) is familiar, but the spelling cue is new.","pattern":"gü","position":"Anywhere","description":"Pronounce it as one consonant cluster: start with a hard English “g” (as in “go”) and immediately glide into a short \"w\" sound before the following vowel. Think “gw.” Your lips should round briefly for the “w.” Example: güe = “gwe,” güi = “gwi.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Agüero","native":"Agüero","position":"Middle","cultural_context":"Last name of Sergio Agüero, the famous Argentine soccer striker who starred for Manchester City"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin,” often seen in bilingual children’s books and on zoo signage"},{"target":"vergüenza","native":"vergüenza","position":"Middle","cultural_context":"Common Spanish word meaning “embarrassment/shame,” appears in popular songs and TV subtitles"}]}]
["que",{"thoughts":"English speakers already know the /k/ sound followed by a short “e” (as in “kettle”). Spanish writes that sound with the three-letter sequence “que,” where the u is silent. Because the spelling looks longer than the sound, learners often try to pronounce an extra vowel (koo-eh), but it’s really just one syllable: /ke/. The pattern can turn up at the start, middle, or end of a word.","pattern":"que","position":"Anywhere","description":"Pronounce it like the English sound “keh”: a hard k (back of the tongue touches the soft palate, quick release) immediately followed by the short e of “get.” The written “u” is never voiced—its only job is to keep the c hard. There is no w-glide, no y-sound, and no separate syllable.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican dish found on many restaurant menus in the U.S."},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in cocktails like the margarita"},{"target":"Enrique","native":"Enrique","position":"End","cultural_context":"First name of pop star Enrique Iglesias, often mentioned in English-language media"}]}]
["qui",{"thoughts":"English speakers already use the /ki/ sound (as in “key”) so the sound itself is familiar; the only novelty is that the written “u” is completely silent in Spanish spelling.","pattern":"qui","position":"Anywhere","description":"In Spanish, the letter group “qui” is pronounced just like the English word “key”: a hard K sound immediately followed by the long E vowel /i/. The written “u” is not voiced at all; it only exists to keep the hard K sound before the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in margaritas and other cocktails"},{"target":"Quito","native":"Quito","position":"Beginning","cultural_context":"Capital city of Ecuador that appears in travel shows, news, and geography classes"},{"target":"quinceañera","native":"quinceañera","position":"Beginning","cultural_context":"Latin-American coming-of-age celebration often portrayed in movies and TV"}]}]
["gue",{"thoughts":"English speakers already know the hard “g” in “get.”  In Spanish, when that hard g is followed by the vowel sound “eh,” Spanish spelling inserts a silent “u” to keep the g hard (otherwise “ge” would be a throaty English-style “h”).  Learners mainly have to remember that the u is NOT pronounced.","pattern":"gue","position":"Anywhere","description":"In Spanish, the letter group “gue” is pronounced as one syllable: a hard, voiced “g” (like the g in “get”) immediately followed by the pure Spanish “e” vowel (similar to the “e” in “bet,” but shorter and without the trailing y-sound many English speakers add).  The written “u” is completely silent unless it carries a diaeresis (ü), which is another pattern.  So “gue” sounds like “geh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guevara","native":"Guevara","position":"Beginning","cultural_context":"Surname of revolutionary figure Che Guevara, whose image is common on posters and T-shirts"},{"target":"Miguel","native":"Miguel","position":"Middle","cultural_context":"Very common Spanish first name; many English speakers know celebrities like singer Miguel or baseball player Miguel Cabrera"},{"target":"Guernica","native":"Guernica","position":"Beginning","cultural_context":"Title of Picasso’s famous painting often referenced in art and history discussions"}]}]
["gui",{"thoughts":"English speakers have already met the hard “g + ee” sound in words like “gift” or “gear.”  In Spanish spelling, the sequence “gui” (without the two-dot dieresis) shows the very same hard g, with the letter “u” completely silent.  The only new element is that the Spanish “i” is a pure, tense “ee” without any glide.  Nothing else is tricky, so this pattern should feel mostly familiar.","pattern":"gui","position":"Anywhere","description":"The letters g-u-i are pronounced /gi/ – a hard, unaspirated “g” (as in “go”) immediately followed by a pure “ee” vowel.  The written “u” is silent unless it carries a dieresis (ü), which is not the case here.  Keep the Spanish “g” crisp and avoid the little puff of air English sometimes adds, and keep the “ee” short and steady.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guitarra","native":"guitar","position":"Beginning","cultural_context":"Spanish word for the very common musical instrument; often seen on menus, music classes, and Latin songs"},{"target":"Guillermo","native":"Guillermo","position":"Beginning","cultural_context":"First name of Oscar-winning film director Guillermo del Toro and other public figures"},{"target":"Guinea","native":"Guinea","position":"Beginning","cultural_context":"Country name that appears in news and geography (e.g., Equatorial Guinea)"}]}]
["güe",{"thoughts":"The \"güe\" sequence keeps the hard English “g” sound (as in “go”) while adding a clearly pronounced w-glide plus a short Spanish \"e\". The two dots (¨) over the u tell you the u is NOT silent.","pattern":"güe","position":"Anywhere","description":"Say a hard g (as in “go”), immediately slide into a quick w sound, then finish with the pure Spanish e (like the e in “bet,” but shorter and without the final English diphthong). Put it together as “gweh.” Do it smoothly in one syllable: /gwe/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"güero","native":"güero","position":"Beginning","cultural_context":"Mexican Spanish slang you might hear in restaurants or TV shows meaning a fair-skinned or blond person"},{"target":"bilingüe","native":"bilingüe","position":"End","cultural_context":"Shows up on packaging, job ads, and dictionaries to mean \"bilingual\""},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for “penguin” that appears at zoos, in children’s books, and animated movies"}]}]
["güi",{"thoughts":"The letters güi are read as “gwee.”  English already has the consonant-vowel pattern /gw/ in words like “Gwen” or “penguin,” so the sound is not brand-new; what trips learners up is the diaeresis (ü) that signals the normally silent u must be voiced.  Articulatorily, you start with a hard g (as in go), let a quick w glide form by rounding the lips, and finish with a pure Spanish i (= English long ee).  Nothing in the sequence is nasal or rolled, so the main hurdle is remembering to pronounce the u.","pattern":"güi","position":"Anywhere","description":"Pronounce it \"gwee\":\n1. Begin with a hard g, the same plosive you use in “go.”\n2. Keep the back of the tongue raised but allow the lips to round slightly so a brief w glide follows the g.\n3. End with a pure Spanish i, identical to the vowel in English “machine” (long ee).  The sound flows together as one syllable: /gwi/.\nThe ü (diaeresis) tells you that the u is NOT silent; without the dots, gui would normally be “gee.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"güiro","native":"güiro","position":"Beginning","cultural_context":"Latin percussion instrument heard in salsa and taught in many school music classes"},{"target":"pingüino","native":"pingüino","position":"Middle","cultural_context":"Spanish word for the well-known animal penguin; appears in cartoons and wildlife documentaries with Spanish audio or subtitles"},{"target":"lingüística","native":"lingüística","position":"Middle","cultural_context":"Looks almost identical to the English academic field \"linguistics,\" so students may encounter it in bilingual course titles"}]}]
["ce",{"thoughts":"Spanish “ce” is simply the consonant sound /s/ (or /θ/ in Spain) followed by a short open-mid “eh” vowel. English speakers already have the /s/ sound and a very similar vowel, so it should feel familiar.","pattern":"ce","position":"Anywhere","description":"In most of the Spanish-speaking world, the letter sequence “ce” is pronounced like the English “seh”: start with a clear /s/ sound (as in “see”), then quickly move to a short, pure “eh” vowel (as in the first part of “bet,” but shorter). In Spain, the /s/ is replaced by a soft interdental /θ/ (similar to the “th” in “thin”) plus the same “eh” vowel, so it sounds like “theh.” The vowel is crisp and not drawn out; keep it one beat long.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"cerveza","native":"cerveza","position":"Beginning","cultural_context":"Common Spanish word for beer, seen on menus and bottle labels"},{"target":"Barcelona","native":"Barcelona","position":"Middle","cultural_context":"World-famous Spanish city known for tourism, architecture, and its soccer team"},{"target":"dulce","native":"dulce","position":"End","cultural_context":"Appears in desserts like dulce de leche and is used to label sweet foods"}]}]
["ci",{"thoughts":"Spanish “ci” is simply the letter c placed before i. Outside of Spain it is pronounced like the English “s” in “see.” In most of Spain it is pronounced like the un-voiced “th” in “thin,” but learners who focus on Latin-American Spanish can stick with the “s” sound. Because English already has both of these sounds, the pattern is very familiar and generally easy to say; the only trick is remembering not to use a hard “k” sound.","pattern":"ci","position":"Anywhere","description":"In Latin-American Spanish, “ci” is pronounced /si/—exactly like the English word “see”: the tip of your tongue is close to (but not touching) the ridge just behind your upper teeth and air flows out as an un-voiced hiss. In Castilian Spanish you may hear /θi/, the same sound as English “th” in “thin.” Either way, the vowel is a pure, short “ee.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Cinco de Mayo","native":"Cinco de Mayo","position":"Beginning","cultural_context":"Widely celebrated Mexican holiday often mentioned in U.S. media and restaurants"},{"target":"gracias","native":"gracias","position":"Middle","cultural_context":"Common Spanish word for “thank you” that many English speakers use when traveling or dining"},{"target":"Valencia","native":"Valencia","position":"Middle","cultural_context":"Well-known Spanish city often referenced in sports (soccer team) and travel shows"}]}]
["ca",{"thoughts":"English speakers already know the hard K sound followed by an AH-vowel, so they will recognize Spanish “ca” right away. The only small adjustment is reducing the burst of air (aspiration) that usually follows an English K.","pattern":"ca","position":"Anywhere","description":"Pronounce a hard, voiceless K sound (like the C in “cat”) immediately followed by the open Spanish vowel A, which is like the “a” in “father.” Keep the K unaspirated—try not to release a strong puff of air. The tongue touches the soft palate for the K, then drops quickly for the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"casa","native":"casa","position":"Beginning","cultural_context":"Phrase “mi casa es su casa” and real-estate term “casa” are widely heard in English-speaking media"},{"target":"picante","native":"picante","position":"Middle","cultural_context":"Seen on Mexican-food menus and hot-sauce labels meaning “spicy”"},{"target":"Cabo","native":"Cabo","position":"Beginning","cultural_context":"Short name for the popular vacation spot Cabo San Lucas in Mexico"}]}]
["co",{"thoughts":"English speakers already have the /k/ sound and the vowel /o/ in their inventory, so the Spanish syllable “co” will feel natural; they just need to keep the vowel short and pure, with no ending glide.","pattern":"co","position":"Anywhere","description":"In Spanish, “co” is pronounced /ko/: a hard, unaspirated \"k\" sound followed immediately by a pure, single-sound \"o\" (like the first part of English “go,” but shorter and without the slight w glide many English speakers add). There is no puff of air after the k, and the vowel stays steady—do not let it slide toward “oo.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Coca-Cola","native":"Coca-Cola","position":"Multiple","cultural_context":"Worldwide soda brand; the name is identical in English and Spanish"},{"target":"taco","native":"taco","position":"End","cultural_context":"Extremely popular Mexican dish widely eaten in the U.S. and elsewhere"},{"target":"Costa Rica","native":"Costa Rica","position":"Beginning","cultural_context":"Well-known Central American travel destination often mentioned in English-language media"}]}]
["cu",{"thoughts":"English speakers already know the sound “k-oo” (as in “cool”). In Spanish, whenever you see “cu”, that is exactly what you get: a hard K followed immediately by the vowel sound “oo”. Nothing tricky, no silent letters. Because both elements exist in English, the only real task is to keep the vowel pure and short–not the long diphthong sometimes heard in English \"coo\".","pattern":"cu","position":"Anywhere","description":"Pronounce a hard English K and immediately glide into a short, pure “oo” (like the vowel in English “boot”). It is one syllable, so Cuba = KOO-bah, Cuervo = KWER-vo. Do not add a y or w sound, and keep the “oo” brief.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Cuba","native":"Cuba","position":"Beginning","cultural_context":"Island nation often mentioned in history, politics, and travel stories"},{"target":"Jose Cuervo","native":"José Cuervo","position":"Middle","cultural_context":"Best-selling tequila brand seen in bars and liquor stores"},{"target":"La Cucaracha","native":"La cucaracha","position":"Beginning","cultural_context":"Famous Spanish folk song referenced in pop culture"}]}]
["ge",{"thoughts":"Spanish “ge” triggers the harsh /x/ sound (same as the letter “j”). English has no native equivalent, but many learners have at least heard it in place-names like “Argentina.” The tongue is pulled back toward the soft palate and air is forced through a narrow gap, creating a raspy “h,” followed by a clear Spanish “eh.” Because the sound itself is unfamiliar and is produced far back in the mouth, most English speakers need practice.","pattern":"ge","position":"Anywhere","description":"When the letter g is followed by e in Spanish, it is pronounced /xe/: a raspy, throaty “h” (voiceless velar fricative) like the Scottish “loch,” immediately followed by the pure Spanish vowel e (as in “met” but without the English diphthong). Think of saying an English “h” while squeezing the airflow at the back of your mouth.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"general","native":"general","position":"Beginning","cultural_context":"Same word as English “general” (military rank or ‘in general’)—you may have seen it on Spanish signs or subtitles"},{"target":"Argentina","native":"Argentina","position":"Middle","cultural_context":"Well-known South American country famous for tango and soccer star Lionel Messi"},{"target":"Segovia","native":"Segovia","position":"Middle","cultural_context":"Historic Spanish city tourists visit for its Roman aqueduct and roast suckling pig"}]}]
["gi",{"thoughts":"Spanish “gi” is the same soft-g you hear in “ge”.  It’s written g + i (with no silent u).  The g turns into the raspy Spanish H sound /x/, followed immediately by a pure Spanish i (like the English vowel in “machine”).  English has no native /x/, but speakers have heard it in words like “Bach” or the Scottish “loch”, so they have a reference point.  The main challenge is making the friction farther back in the throat than an English H.","pattern":"gi","position":"Anywhere","description":"When g is followed by i in Spanish (without a u), it is pronounced /xi/: a breathy, raspier version of the English H produced near the back of the throat, followed by the vowel “ee.”  Think of saying “hee” while starting the H sound where you clear your throat or the way Germans say the ch in “Bach.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Gibraltar","native":"Gibraltar","position":"Beginning","cultural_context":"Well-known British territory on the southern tip of Spain; appears frequently in news and travel shows"},{"target":"gigante","native":"gigante","position":"Beginning","cultural_context":"Spanish for “giant”; shows up on bilingual product labels like “tamaño gigante” and looks like the English word “gigantic”"},{"target":"religión","native":"religión","position":"Middle","cultural_context":"Spanish word for “religion,” almost identical to the English cognate and common in headlines or international discussions"}]}]
["ga",{"thoughts":"The Spanish combination “ga” sounds almost identical to the hard “ga” an English speaker already knows in words like “galaxy” or “garage.” Only the vowel is a bit more open and pure, but the overall feel is familiar, so there should be little trouble recognizing or producing it.","pattern":"ga","position":"Anywhere","description":"Pronounce a hard, voiced “g” (like the first sound in the English word “go”) immediately followed by the open Spanish “a” (similar to the “a” in “father,” but held for just one crisp beat). There is no puff of air, and the vowel stays pure—avoid sliding toward an English \"uh\" or \"ay.\"","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"gazpacho","native":"gazpacho","position":"Beginning","cultural_context":"Cold Spanish soup you often see on restaurant menus and in cooking shows"},{"target":"garbanzo","native":"garbanzo","position":"Beginning","cultural_context":"Word for chickpea that appears on cans and in many hummus ingredient lists"},{"target":"sangría","native":"sangría","position":"Middle","cultural_context":"Popular Spanish punch served in many bars and summer parties"}]}]
["go",{"thoughts":"The sequence “go” in Spanish is very straightforward for English speakers: hard g + pure o. The only new point is that Spanish g is unaspirated and the vowel is shorter and never turns into the /ou/ glide English has in “go.” Overall the sound is familiar and easy.","pattern":"go","position":"Anywhere","description":"Pronounce a hard, voiced G (like the g in the English word “go”) immediately followed by a pure, single-sound Spanish o – a mid-back, rounded vowel that is shorter and does not glide. Keep the tongue against the soft palate for the g, release with no extra puff of air, and finish with the clean, single o sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"amigo","native":"amigo","position":"End","cultural_context":"Common Spanish word for “friend”; widely used in English pop culture and casual speech"},{"target":"tango","native":"tango","position":"End","cultural_context":"Famous Argentine dance and music style known worldwide"},{"target":"Bogotá","native":"Bogotá","position":"Middle","cultural_context":"Capital city of Colombia, often mentioned in news and travel shows"}]}]
["gu",{"thoughts":"English speakers have run into “gu” in words like “guacamole,” but they may not realise Spanish has two ways to treat the pair: (1) hard g + w glide (gw) before a, o, u or when ü is written, and (2) hard g only (silent u) before e or i. The actual g sound is fully familiar; the only challenge is remembering whether the u is heard.","pattern":"gu","position":"Anywhere","description":"In Spanish, the letters g + u mark a HARD g sound (like the g in “go”). What happens to the u depends on the vowel that follows:\n• Before a, o, or u – or when you see ü – you pronounce a quick w-like glide after the g. Think “gw”: “gua” = GWAH, “guo” = GWO, “güe/güi” = GWE/GWEE.\n• Before e or i with no dots, the u is silent. You just say a hard g: “gue” = GEH, “gui” = GEE.\nSo “Guatemala” = GWA-te-MA-la, but “guitarra” = gee-TA-rra (no w).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guatemala","native":"Guatemala","position":"Beginning","cultural_context":"Central-American country often mentioned in news, travel, and geography lessons"},{"target":"agua","native":"agua","position":"Middle","cultural_context":"Spanish word for water; appears on bilingual drink menus and bottled-water labels"},{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Well-known avocado dip served in Mexican and Tex-Mex cuisine"}]}]
["za",{"thoughts":"Spanish “za” is spelled with the letter z followed by the vowel a.  In most of Latin America it sounds like the English “sa” in “salsa.”  In most of Spain it is pronounced like the un-voiced “th” in English “thin” plus the vowel a.  Either way, the vowel is the pure Spanish “a” (as in “father”), so the only real challenge is matching the correct consonant sound for the dialect you’re aiming at.","pattern":"za","position":"Anywhere","description":"Latin America: say an English “s” followed immediately by the open Spanish “a” vowel, /sa/.  Spain: place the tip of your tongue lightly between or just behind your front teeth, let air hiss out (like the ‘th’ in “thin”), then open to the Spanish “a,” /θa/.  The vowel should be short, crisp, and never diphthongized.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Zaragoza","native":"Zaragoza","position":"Beginning","cultural_context":"Major Spanish city whose name appears in travel shows and history books"},{"target":"plaza","native":"plaza","position":"End","cultural_context":"Common loan-word in English for an open square or shopping center"},{"target":"cerveza","native":"cerveza","position":"End","cultural_context":"Spanish word for beer, often seen on menus and in advertisements"}]}]
["zo",{"thoughts":"English speakers already know the letter combo “zo,” but in Spanish the Z is voiceless (never the buzzing English Z). In Latin America it’s the same sound as an English S; in most of Spain it’s the un-voiced TH of “think.” The following vowel is a pure, short “oh.” The parts are familiar, but the change from a voiced Z to a voiceless S/TH and keeping the vowel pure (no glide toward “oo”) adds a modest challenge.","pattern":"zo","position":"Anywhere","description":"Say a clean, voiceless consonant plus a pure “oh.”\n• Latin America: make the normal English S sound and immediately follow it with a short, round “oh” – “so” without the slight W glide.\n• Spain: place the tip of your tongue between the teeth as for the TH in “think,” blow air, then go straight into the same pure “oh.”\nEither way, keep the Z completely un-voiced, and keep the vowel short and steady.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Zorro","native":"zorro","position":"Beginning","cultural_context":"Famous masked vigilante hero in films and books; also the Spanish word for “fox.”"},{"target":"Amazonas","native":"Amazonas","position":"Middle","cultural_context":"Spanish name for the Amazon River/region, heard in documentaries and geography discussions."},{"target":"chorizo","native":"chorizo","position":"End","cultural_context":"Popular Spanish sausage commonly mentioned on menus and cooking shows."}]}]
["zu",{"thoughts":"English speakers already know the sound of the vowel “u” as in “food.”  The only new piece here is that Spanish “z” is never the English voiced /z/.  In most of Latin America it is the same as an English unvoiced “s” (so “zu” ≈ “soo”).  In most of Spain it is an unvoiced “th” as in “thin” (so “zu” ≈ “thoo”).  Because the tongue and lips are in familiar positions, the combination is not hard, but the learner must remember to drop the English buzzing /z/ sound.","pattern":"zu","position":"Anywhere","description":"Say the English “s” in “soon” (Latin America) or the unvoiced “th” in “thin” (Spain), then immediately glide into the long “oo” vowel as in “food.”  Keep the consonant unvoiced—no buzzing.  The lips stay relaxed throughout; only the tongue moves from the front-teeth position for /s/ or /θ/ into the back, rounded position for “oo.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Zumba","native":"Zumba","position":"Beginning","cultural_context":"Worldwide dance-fitness program advertised in most gyms"},{"target":"azul","native":"azul (blue)","position":"Middle","cultural_context":"Very common Spanish word for the color blue; appears in basic lessons and song titles like “Cielito Lindo”"},{"target":"Zuma","native":"Zuma","position":"Beginning","cultural_context":"Name of Zuma Beach in California and a popular video game, so it shows up in travel and gaming media"}]}]
["ya",{"thoughts":"English speakers already have the /j/ (“y” in yes) plus the open /a/ vowel, so the combo “ya” should feel very familiar. The only nuance is that Spanish may start the syllable a bit harder (sometimes affricate-like [dʒ] → [ʝ]), but aiming for a quick, smooth “yah” is close enough for everyday speech.","pattern":"ya","position":"Anywhere","description":"Pronounce it as one quick syllable: start with the English “y” sound in “yes,” then immediately open into the Spanish “a” (like the “a” in “father”)—together it sounds like “yah.” Keep it short and clean, without the diphthong or drawl some English speakers add.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"papaya","native":"papaya","position":"End","cultural_context":"Tropical fruit commonly found in supermarkets and smoothie menus"},{"target":"Playa del Carmen","native":"Playa del Carmen","position":"End","cultural_context":"Well-known Mexican beach resort mentioned in travel ads"},{"target":"Maya","native":"maya","position":"End","cultural_context":"Name of the ancient Mesoamerican civilization often covered in school and documentaries"}]}]
["ye",{"thoughts":"“y e” is pronounced just like the first part of the English word “yes,” so most learners have already met the sound. The only new point is to keep the Spanish vowel short and pure – no glide toward an “i” at the end.","pattern":"ye","position":"Anywhere","description":"Pronounce it “yeh.” Start with the English y-sound in “yes,” keeping the middle of your tongue close to, but not touching, the roof of your mouth. Immediately follow it with a single, pure Spanish e (like the vowel in English “met,” but shorter and without any glide). The result is a crisp, one-syllable “yeh.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Oye","native":"listen / hey","position":"End","cultural_context":"Title line of the classic Santana song “Oye Como Va,” heard in movies, TV, and commercials"},{"target":"Reyes","native":"kings / common surname","position":"Middle","cultural_context":"Seen in “Día de los Reyes” (Three Kings Day) celebrations and as a last name of athletes like soccer player José Antonio Reyes"},{"target":"ayer","native":"yesterday","position":"Middle","cultural_context":"Appears in many popular Latin songs titled or containing the word “Ayer,” often heard by English speakers exploring Latin music"}]}]
["yi",{"thoughts":"The letter combination “yi” is just the consonant sound of Spanish y (a palatal glide similar to the English y in “yes”, but a little stronger and voiced) immediately followed by the vowel i (as in “machine”).  English speakers already have both pieces, so this should feel familiar, though joining them quickly inside one syllable can require a bit of practice.  The pattern can show up at the start, middle, or end of a Spanish word, but it is not extremely common.","pattern":"yi","position":"Anywhere","description":"Say the English y sound in “yes”, but let the middle of your tongue come a little closer to (almost brushing) the hard palate so it is slightly more “hissy/soft-j”.  Flow directly into the Spanish i, which is a pure, brief “ee” (lips relaxed, tongue high and front).  Put the two together with no break: [ʝi] → something like “yee”, but a touch smoother and voiced throughout.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"yihad","native":"yihad","position":"Beginning","cultural_context":"Spanish spelling of the word “jihad,” a term often heard in international news"},{"target":"yin-yang","native":"yin-yang","position":"Beginning","cultural_context":"The well-known Chinese philosophical symbol; spelled the same in Spanish"},{"target":"Yibuti","native":"Yibuti","position":"Beginning","cultural_context":"Spanish name for the African country Djibouti, which appears on world maps and in geography discussions"}]}]
["y",{"thoughts":"For English speakers, the Spanish letter “y” at the END of a word is never the consonant sound heard at the start of English “yes.” Instead, it behaves like the vowel sound “ee,” but it usually merges with the preceding vowel to form a glide, exactly like the last part of English diphthongs in “boy,” “say,” or “buy.” Because English already writes that glide with the letter “y,” the concept feels familiar and is usually easy to copy.","pattern":"y","position":"End","description":"When “y” is the final letter in a Spanish word, pronounce it as a quick \"ee\" sound that attaches to the vowel before it: a-y ➜ “eye,” o-y ➜ “oy,” u-y ➜ “oo-ee,” etc. It never makes a separate syllable and never sounds like the English consonant /y/ in “yes.” Think of the ending sound in English words “boy” (/oy/) or “day” (/ay/)—that same glide is what Spanish is doing.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"soy","native":"soy","position":"End","cultural_context":"Word for the bean used in soy sauce, soy milk, and other foods—spelled and pronounced the same in English"},{"target":"muy","native":"muy","position":"End","cultural_context":"Common in phrases like “muy bien” or “muy caliente” seen on restaurant menus and in pop culture"},{"target":"Uruguay","native":"Uruguay","position":"End","cultural_context":"South-American country often mentioned during the FIFA World Cup and in world news"}]}]
["r",{"thoughts":"English speakers use an approximant R (the tongue never actually taps the roof), while Spanish word-initial “r” is a strong alveolar trill—several quick taps/flutters of the tongue tip against the ridge just behind the upper teeth. They’ve probably heard it in words like “rumba” or “Río Grande,” but most have never produced it themselves, so it feels exotic and tricky.","pattern":"r","position":"Beginning","description":"At the start of a Spanish word, the single letter “r” is pronounced as a multiple-flap trill. Lightly place the tip of your tongue on the alveolar ridge (the bump right behind your upper front teeth) and let air pass so the tongue vibrates rapidly—something like a fast series of D or T sounds strung together (rrr). Your vocal cords stay on the whole time.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"rumba","native":"rumba","position":"Beginning","cultural_context":"Famous Latin dance and style of music often mentioned in movies and dance shows"},{"target":"Río Grande","native":"río grande","position":"Beginning","cultural_context":"Major river on the U.S.–Mexico border, referenced in geography and news"},{"target":"Ranchero (as in “Huevos Rancheros”)","native":"ranchero","position":"Beginning","cultural_context":"Name of a popular Mexican breakfast dish found on many American brunch menus"}]}]
["r",{"thoughts":"English already has an alveolar tap sound in the casual pronunciation of words like “butter” or “ladder,” but English speakers never use it at the end of a word. They expect an /r/ approximant there, so switching to a quick tap then cutting the airflow feels odd and usually causes either an English-style r or an added vowel (“amor-uh”).","pattern":"r","position":"End","description":"When an “r” comes at the END of a Spanish word it is NOT the long, trilled rr. It is a single, quick tap of the tongue against the alveolar ridge—the bumpy area just behind your upper front teeth. Think of the very fast d-like sound many Americans use in the middle of “buDDer.” Touch once, release immediately, then stop voicing; do NOT let the tongue stay curled back like the English final r, and do NOT add an extra vowel after it.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"doctor","native":"doctor","position":"End","cultural_context":"Same word as English “doctor”; you see it on signs outside clinics in Spanish-speaking areas"},{"target":"señor","native":"señor","position":"End","cultural_context":"Common Spanish title (Mr.) heard in restaurants, movies, and the phrase “¡Sí, señor!”"},{"target":"amor","native":"amor","position":"End","cultural_context":"Word for “love” that appears in many song lyrics and phrases like “mi amor”"}]}]
["h",{"thoughts":"Spanish “h” is actually the absence of a sound, which surprises many learners. English speakers already know silent-letters (hour, honest), so the idea exists, but they must remember to keep Spanish completely un-aspirated every single time.","pattern":"h","position":"Anywhere","description":"In modern standard Spanish the letter “h” is silent. You do not exhale or add any English-style /h/ before the following vowel or consonant; simply begin the word (or continue the syllable) as if the “h” were not written at all. Example: “hotel” is pronounced roughly “oh-TEL.” The only exception is when it combines as the separate digraph “ch,” which has its own /ch/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hola","native":"hola (hello)","position":"Beginning","cultural_context":"Most common Spanish greeting; appears in phrasebooks and pop culture"},{"target":"hotel","native":"hotel (hotel)","position":"Beginning","cultural_context":"Same word as English for lodging; tourists see it on signs throughout the Spanish-speaking world"},{"target":"alcohol","native":"alcohol (alcohol)","position":"Middle","cultural_context":"Identical spelling and meaning in English; product labels and news"}]}]
["gue",{"thoughts":"English speakers already know the hard “g” in “get.”  In Spanish, when that hard g is followed by the vowel sound “eh,” Spanish spelling inserts a silent “u” to keep the g hard (otherwise “ge” would be a throaty English-style “h”).  Learners mainly have to remember that the u is NOT pronounced.","pattern":"gue","position":"Anywhere","description":"In Spanish, the letter group “gue” is pronounced as one syllable: a hard, voiced “g” (like the g in “get”) immediately followed by the pure Spanish “e” vowel (similar to the “e” in “bet,” but shorter and without the trailing y-sound many English speakers add).  The written “u” is completely silent unless it carries a diaeresis (ü), which is another pattern.  So “gue” sounds like “geh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guevara","native":"Guevara","position":"Beginning","cultural_context":"Surname of revolutionary figure Che Guevara, whose image is common on posters and T-shirts"},{"target":"Miguel","native":"Miguel","position":"Middle","cultural_context":"Very common Spanish first name; many English speakers know celebrities like singer Miguel or baseball player Miguel Cabrera"},{"target":"Guernica","native":"Guernica","position":"Beginning","cultural_context":"Title of Picasso’s famous painting often referenced in art and history discussions"}]}]
["gui",{"thoughts":"English speakers have already met the hard “g + ee” sound in words like “gift” or “gear.”  In Spanish spelling, the sequence “gui” (without the two-dot dieresis) shows the very same hard g, with the letter “u” completely silent.  The only new element is that the Spanish “i” is a pure, tense “ee” without any glide.  Nothing else is tricky, so this pattern should feel mostly familiar.","pattern":"gui","position":"Anywhere","description":"The letters g-u-i are pronounced /gi/ – a hard, unaspirated “g” (as in “go”) immediately followed by a pure “ee” vowel.  The written “u” is silent unless it carries a dieresis (ü), which is not the case here.  Keep the Spanish “g” crisp and avoid the little puff of air English sometimes adds, and keep the “ee” short and steady.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guitarra","native":"guitar","position":"Beginning","cultural_context":"Spanish word for the very common musical instrument; often seen on menus, music classes, and Latin songs"},{"target":"Guillermo","native":"Guillermo","position":"Beginning","cultural_context":"First name of Oscar-winning film director Guillermo del Toro and other public figures"},{"target":"Guinea","native":"Guinea","position":"Beginning","cultural_context":"Country name that appears in news and geography (e.g., Equatorial Guinea)"}]}]
["que",{"thoughts":"English speakers already know the /k/ sound followed by a short “e” (as in “kettle”). Spanish writes that sound with the three-letter sequence “que,” where the u is silent. Because the spelling looks longer than the sound, learners often try to pronounce an extra vowel (koo-eh), but it’s really just one syllable: /ke/. The pattern can turn up at the start, middle, or end of a word.","pattern":"que","position":"Anywhere","description":"Pronounce it like the English sound “keh”: a hard k (back of the tongue touches the soft palate, quick release) immediately followed by the short e of “get.” The written “u” is never voiced—its only job is to keep the c hard. There is no w-glide, no y-sound, and no separate syllable.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quesadilla","native":"quesadilla","position":"Beginning","cultural_context":"Popular Mexican dish found on many restaurant menus in the U.S."},{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in cocktails like the margarita"},{"target":"Enrique","native":"Enrique","position":"End","cultural_context":"First name of pop star Enrique Iglesias, often mentioned in English-language media"}]}]
["qui",{"thoughts":"English speakers already use the /ki/ sound (as in “key”) so the sound itself is familiar; the only novelty is that the written “u” is completely silent in Spanish spelling.","pattern":"qui","position":"Anywhere","description":"In Spanish, the letter group “qui” is pronounced just like the English word “key”: a hard K sound immediately followed by the long E vowel /i/. The written “u” is not voiced at all; it only exists to keep the hard K sound before the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tequila","native":"tequila","position":"Middle","cultural_context":"Famous Mexican spirit used in margaritas and other cocktails"},{"target":"Quito","native":"Quito","position":"Beginning","cultural_context":"Capital city of Ecuador that appears in travel shows, news, and geography classes"},{"target":"quinceañera","native":"quinceañera","position":"Beginning","cultural_context":"Latin-American coming-of-age celebration often portrayed in movies and TV"}]}]
