["Dieu merci",{"thoughts":"'Dieu merci' translates to 'Thank God' in English. It's a common expression used to express relief or gratitude when something has turned out well or has been resolved, often after a difficult or uncertain situation.","target_language_multi_word_term":"Dieu merci","meaning":"'Thank God'","additional_notes":"Used to express relief or gratitude, often for positive outcomes or avoided misfortunes.","target_language_example":"Dieu merci, il n'a pas plu pendant notre pique-nique.","native_language_example":"Thank God, it didn't rain during our picnic."}]
["Dieu sait",{"thoughts":"'Dieu sait' is a French expression that translates to 'God knows' in English. It is typically used to convey uncertainty or highlight the unknown nature of a situation.","target_language_multi_word_term":"Dieu sait","meaning":"'God knows'.","additional_notes":"Used to express uncertainty or acknowledge that only a higher power knows the answer or outcome.","target_language_example":"Dieu sait combien de temps cela prendra.","native_language_example":"God knows how long that will take."}]
["Votre Altesse",{"thoughts":"'Votre Altesse' is a formal term of address used to refer to royalty or someone of high rank, and it is important for learners to understand its use in contexts involving formal titles or when reading about royal figures.","target_language_multi_word_term":"Votre Altesse","meaning":"'Your Highness'.","additional_notes":"Used as a formal and respectful way to address or refer to royal figures, often used in both historical contexts and fictional settings involving royalty.","target_language_example":"Votre Altesse, nous sommes honorés de votre présence ce soir.","native_language_example":"Your Highness, we are honored by your presence tonight."}]
["Votre Majesté",{"thoughts":"'Votre Majesté' is a formal term used to address a king or queen in French. It's equivalent to 'Your Majesty' in English. Beginner learners would benefit from knowing this if they encounter formal or historical content involving royalty.","target_language_multi_word_term":"Votre Majesté","meaning":"'Your Majesty'.","additional_notes":"Used as a respectful and formal way to address a king or queen. This term is used in formal settings, literature, or historical contexts when referring to a sovereign.","target_language_example":"Votre Majesté, puis-je vous proposer une solution?","native_language_example":"Your Majesty, may I offer you a solution?"}]
["aimer bien",{"thoughts":"\"Aimer bien\" means to like something or someone. It's less strong than simply \"aimer,\" which can imply love or passion. Beginners might confuse these terms, so it's important to know the distinction.","target_language_multi_word_term":"aimer bien","meaning":"'to like something/someone'.","additional_notes":"\"Aimer bien\" is used when you wish to express that you like something or someone, but in a casual, less intense way than 'aimer'.","target_language_example":"J'aime bien le chocolat.","native_language_example":"I like chocolate."}]
["aller chercher",{"thoughts":"Aller chercher is a common French phrase meaning 'to go get' or 'to go pick up'. It involves going somewhere to obtain or retrieve something or someone.","target_language_multi_word_term":"aller chercher","meaning":"'to go get' or 'to pick up'.","additional_notes":"Used when you need to go somewhere to retrieve a person, object, or thing. It's often used in daily activities like picking up groceries or fetching someone from a location.","target_language_example":"Je dois aller chercher les enfants à l'école.","native_language_example":"I have to go pick up the kids from school."}]
["allez savoir",{"thoughts":"\"Allez savoir\" is a casual French expression often used to convey curiosity or the idea that something is uncertain or unknowable. Generally, it translates to something akin to 'who knows' in English.","target_language_multi_word_term":"allez savoir","meaning":"'who knows'.","additional_notes":"Used to express that something is uncertain or cannot be predicted or explained.","target_language_example":"Pourquoi il a fait ça ? Allez savoir.","native_language_example":"Why did he do that? Who knows."}]
["allez-y",{"thoughts":"\"Allez-y\" is a French phrase used to encourage someone to proceed or go ahead with an action. It's in the formal or plural form, suitable for addressing either one person formally or multiple people.","target_language_multi_word_term":"allez-y","meaning":"'go ahead' or 'go on'.","additional_notes":"This phrase is often used to prompt someone to begin an activity or to give them permission to do something. It is the formal/plural version, whereas 'vas-y' is the informal/singular equivalent.","target_language_example":"Si vous êtes prêts, allez-y !","native_language_example":"If you are ready, go ahead!"}]
["allons-y",{"thoughts":"The phrase 'allons-y' is a common expression used in French to suggest starting or engaging in an action. It is often said with enthusiasm and used in similar contexts to 'let's go' in English. It's a very useful phrase for beginners to express readiness or to encourage others to move forward or proceed.","target_language_multi_word_term":"allons-y","meaning":"'let's go'.","additional_notes":"Used to suggest starting something or moving forward, often expressed with encouragement or enthusiasm.","target_language_example":"Allons-y, il est temps de partir!","native_language_example":"Let's go, it's time to leave!"}]
["alors que",{"thoughts":"'Alors que' is used to contrast situations, often translated as 'while' or 'whereas' when comparing two differing actions or states. It's useful in expressing contrasting ideas in French.","target_language_multi_word_term":"alors que","meaning":"'while' or 'whereas'.","additional_notes":"Utilized to highlight contrast or difference between two clauses or situations.","target_language_example":"Il fait chaud ici alors qu'il neige dehors.","native_language_example":"It's warm in here while it's snowing outside."}]
["après tout",{"thoughts":"The phrase 'après tout' is often used in French to mean 'after all', providing a kind of justification or concluding thought. It’s useful for learners to know it as it ties together an argument or justifies a statement, similar to its use in English.","target_language_multi_word_term":"après tout","meaning":"'after all' or 'ultimately'.","additional_notes":"Used to justify or underscore a statement, especially when drawing a conclusion or providing a rationale that might seem counterintuitive at first.","target_language_example":"Il est intelligent et, après tout, il mérite le poste.","native_language_example":"He is smart and, after all, he deserves the position."}]
["après-midi",{"thoughts":"'Après-midi' is the French term used to refer to the period of time in the day between noon (12:00 p.m.) and evening. This is similar to the English term 'afternoon'. For beginners, it's important to know that this term is always used with the article 'l'' because 'après-midi' is typically treated as a masculine noun (although it can technically be either gender).","target_language_multi_word_term":"après-midi","meaning":"afternoon.","additional_notes":"Used to specify the time period after noon and before evening, typically from 12:00 p.m. to about 6:00 p.m. It can be used to plan or refer to events happening in that time span.","target_language_example":"Je vais faire du shopping cet après-midi.","native_language_example":"I'm going shopping this afternoon."}]
["arriver à",{"thoughts":"\"Arriver à\" is a versatile French expression that means to manage or succeed in doing something. It is commonly used when discussing achievements or capabilities.","target_language_multi_word_term":"arriver à","meaning":"to manage to, to succeed in.","additional_notes":"Used to express the ability or attainment of completing a task or objective. Often appears with an infinitive verb following 'à'.","target_language_example":"Il a finalement arrivé à réparer sa voiture.","native_language_example":"He finally managed to fix his car."}]
["attendu que",{"thoughts":"'Attendu que' is a formal phrase used in French to introduce a clause explaining the reason or context for something; often seen in legal documents or formal writing.","target_language_multi_word_term":"attendu que","meaning":"'considering that' or 'given that'.","additional_notes":"This phrase is frequently used in formal contexts to set up explanations or justifications, particularly in legal, formal letters, or reports.","target_language_example":"Attendu que les conditions météorologiques sont mauvaises, l'événement a été annulé.","native_language_example":"Considering that the weather conditions are bad, the event was canceled."}]
["au chaud",{"thoughts":"\"Au chaud\" is a French phrase that literally translates to \"in the warm.\" It is used in various contexts to mean keeping something or someone warm either physically, like staying warm during winter, or figuratively, like feeling comforted or at ease.","target_language_multi_word_term":"au chaud","meaning":"'in the warm' or 'warmly'.","additional_notes":"Often used to describe staying cozy indoors or keeping something at a warm temperature.","target_language_example":"Je veux rester au chaud à la maison aujourd'hui.","native_language_example":"I want to stay warm at home today."}]
["au contraire",{"thoughts":"\"Au contraire\" is a French phrase used to express disagreement or to introduce a statement that goes against what has just been said. It's used similarly to \"on the contrary\" in English.","target_language_multi_word_term":"au contraire","meaning":"'on the contrary'.","additional_notes":"Used to correct or oppose a previous statement or belief; often introduces a contrasting perspective.","target_language_example":"Il pensait que le film était ennuyeux. Au contraire, je l'ai trouvé passionnant.","native_language_example":"He thought the movie was boring. On the contrary, I found it thrilling."}]
["au courant",{"thoughts":"\"Au courant\" is a French expression used to describe someone who is informed or aware of current events or trends. It's important for beginners to recognize phrases that indicate familiarity with a subject.","target_language_multi_word_term":"au courant","meaning":"informed or up-to-date.","additional_notes":"Often used to describe someone who keeps themselves updated with the latest news or trends. Can also be used more broadly in social contexts to convey that someone is knowledgeable about a particular subject.","target_language_example":"Elle est toujours au courant des dernières nouvelles.","native_language_example":"She is always up to date with the latest news."}]
["au début",{"thoughts":"'Au début' is a phrase used to indicate the starting point or initial stage of an event or situation. It's similar to the English phrase 'in the beginning' and is often used when recounting past events or changes.","target_language_multi_word_term":"au début","meaning":"'at the beginning'.","additional_notes":"Used to describe the initial phase or starting point of an event, story, or situation.","target_language_example":"Au début, il était timide.","native_language_example":"At the beginning, he was shy."}]
["au fait",{"thoughts":"\"Au fait\" is a French phrase that can be used as a conversational connector, often meaning 'by the way'. It helps introduce a new topic or a related thought in a conversation.","target_language_multi_word_term":"au fait","meaning":"'by the way'.","additional_notes":"Used to introduce a slightly different topic or to remind someone about something important in a conversation. It's like saying 'incidentally' or 'speaking of which' in English.","target_language_example":"Au fait, as-tu déjà terminé le rapport ?","native_language_example":"By the way, have you finished the report yet?"}]
["au lit",{"thoughts":"'Au lit' is a simple French phrase used in everyday conversation, literally meaning 'to bed' or 'in bed'. It's straightforward and can be used in contexts involving going to sleep, resting, or asking if someone will or has gone to bed.","target_language_multi_word_term":"au lit","meaning":"'to bed' or 'in bed'.","additional_notes":"Used to refer to going to sleep or the condition of being in bed. Often used when discussing bedtime routines or checking if someone is awake or resting.","target_language_example":"Il est tard, je vais au lit.","native_language_example":"It's late, I'm going to bed."}]
["au revoir",{"thoughts":"'Au revoir' is a basic French phrase used to say goodbye. It is taught early to learners because of its frequent use in everyday situations when parting with someone.","target_language_multi_word_term":"au revoir","meaning":"'goodbye'.","additional_notes":"Commonly used for both formal and informal farewells. It literally translates to 'until we see each other again.'","target_language_example":"Elle a dit au revoir avant de partir.","native_language_example":"She said goodbye before leaving."}]
["au travail",{"thoughts":"The phrase 'au travail' is often used in French to mean 'at work.' It refers to being physically at one's place of employment or the state of working. This phrase is useful for beginner learners to talk about location in relation to their job or a task.","target_language_multi_word_term":"au travail","meaning":"'at work'.","additional_notes":"Used to describe being at one's place of employment or actively doing work. It can refer to both physical location and the act of working.","target_language_example":"Je suis au travail jusqu'à 17 heures.","native_language_example":"I am at work until 5 PM."}]
["autant que",{"thoughts":"'Autant que' is a comparative phrase used to indicate 'as much as' or 'as many as' in comparisons. It's often used to compare quantities, qualities, or frequencies between two elements.","target_language_multi_word_term":"autant que","meaning":"'as much as' or 'as many as'.","additional_notes":"Used to compare equal amounts or numbers between two nouns. Can be followed by a verb or an adjective.","target_language_example":"Elle a autant de livres que toi.","native_language_example":"She has as many books as you."}]
["autre chose",{"thoughts":"The phrase 'autre chose' translates to 'another thing' or 'anything else'. It's commonly used in everyday conversation to ask if someone needs or wants something else.","target_language_multi_word_term":"autre chose","meaning":"'another thing' or 'anything else'.","additional_notes":"Often used to inquire if there are additional requests or items needed. Commonly heard in customer service or during a meal.","target_language_example":"Voulez-vous autre chose?","native_language_example":"Would you like anything else?"}]
["autre à",{"thoughts":"While 'autre à' could appear together in some contexts, it doesn't form a typical fixed expression or phrase with a distinct meaning separate from the individual words 'autre' (other) and 'à' (to/at). The focus should be on understanding the contexts in which 'autre' might precede 'à', such as describing alternatives or choices.","target_language_multi_word_term":"autre à","meaning":"'other to' or 'another at'.","additional_notes":"'Autre' is used in various expressions to indicate alternation or difference. When preceding 'à', it might introduce another choice or option in a sequence or list, thus context is important.","target_language_example":"Je n'ai pas d'autre à vous proposer.","native_language_example":"I have no other to offer you."}]
["avant tout",{"thoughts":"\"Avant tout\" is a French phrase that signifies priority or importance, similar to 'above all.' It's used to emphasize that something is more critical than other considerations.","target_language_multi_word_term":"avant tout","meaning":"'above all' or 'first and foremost'.","additional_notes":"Used to emphasize the primary importance or precedence of one thing over others.","target_language_example":"Avant tout, il est important d'écouter.","native_language_example":"Above all, it's important to listen."}]
["avec plaisir",{"thoughts":"The term 'avec plaisir' is a polite phrase often used in response to thanks, essentially indicating one's willingness or happiness to help or comply.","target_language_multi_word_term":"avec plaisir","meaning":"'with pleasure'.","additional_notes":"Used as a polite way to say you are happy to help, similar to 'my pleasure' in English.","target_language_example":"Merci pour ton aide ! \nAvec plaisir !","native_language_example":"Thank you for your help! \nMy pleasure!"}]
["avoir besoin de",{"thoughts":"\"Avoir besoin de\" is a basic but essential phrase used to express necessity or requirement. It's a common structure that beginners encounter early on, particularly useful for daily conversations. Understanding this structure helps learners convey their needs or ask about others' needs.","target_language_multi_word_term":"avoir besoin de","meaning":"\"to need\" or \"to have need of\".","additional_notes":"Used to indicate necessity or requirement. Often followed by a noun or an infinitive verb to specify what is needed.","target_language_example":"J'ai besoin de dormir.","native_language_example":"I need to sleep."}]
["avoir bon",{"thoughts":"\"Avoir bon\" is a colloquial French expression indicating that someone enjoys something or feels that something is good. It is often used in the context of pleasure or satisfaction, similar to saying 'having a good time'.","target_language_multi_word_term":"avoir bon","meaning":"'to feel good' or 'to have a good time'.","additional_notes":"Commonly used in informal settings or conversations to express enjoyment or a positive experience.","target_language_example":"Après la fête, tout le monde avait bon.","native_language_example":"After the party, everyone was having a good time."}]
["avoir confiance",{"thoughts":"'Avoir confiance' is a phrase meaning to have trust or confidence in someone or something. It's important for beginner learners as it is commonly used in everyday interactions, particularly in relation to personal or professional relationships.","target_language_multi_word_term":"avoir confiance","meaning":"'to trust' or 'to have confidence'.","additional_notes":"Often followed by 'en' for people or 'dans' for things to specify what or whom you have confidence in.","target_language_example":"J'ai confiance en toi.","native_language_example":"I trust you."}]
["avoir de la chance",{"thoughts":"The French phrase 'avoir de la chance' translates to 'to be lucky' in English. It's used to describe someone experiencing good fortune or benefiting from a favorable situation. This phrase is commonly used in everyday conversations when discussing luck or fortunate circumstances.","target_language_multi_word_term":"avoir de la chance","meaning":"'to be lucky'.","additional_notes":"Used to express having good luck or being fortunate in a situation. Common in everyday speech when someone benefits from chance.","target_language_example":"Il a eu de la chance de trouver un emploi si facilement.","native_language_example":"He was lucky to find a job so easily."}]
["avoir envie",{"thoughts":"The phrase 'avoir envie' is a common expression in French that means 'to feel like' or 'to want'. It is useful for expressing desires or cravings, which is a fundamental part of daily conversations. Beginners should understand the construction as it involves the verb 'avoir' (to have) and 'envie' (wish/desire), making it idiomatic in structure.","target_language_multi_word_term":"avoir envie","meaning":"'to feel like' or 'to want'.","additional_notes":"Often used to express a desire or craving for something. Typically followed by 'de' and an infinitive verb or noun.","target_language_example":"J'ai envie de manger une glace.","native_language_example":"I feel like eating ice cream."}]
["avoir faim",{"thoughts":"'Avoir faim' is a common way to express hunger. It's an essential phrase for beginners, both practical and grammatically different from English.","target_language_multi_word_term":"avoir faim","meaning":"to be hungry.","additional_notes":"Literally translates to 'to have hunger,' showing a different structure from English, which uses 'be' instead of 'have.'","target_language_example":"J'ai faim, allons manger.","native_language_example":"I'm hungry, let's eat."}]
["avoir intérêt",{"thoughts":"The phrase 'avoir intérêt' is commonly used in French to express that someone has a stake or benefit in something happening for certain purposes, often indicating a level of urgency or importance.","target_language_multi_word_term":"avoir intérêt","meaning":"'to have an interest' or 'to be advisable'.","additional_notes":"Often used to suggest that it would be wise or beneficial to do something. It can also imply a warning or a strong recommendation.","target_language_example":"Tu as intérêt à finir tes devoirs avant demain.","native_language_example":"You'd better finish your homework by tomorrow."}]
["avoir l'air",{"thoughts":"'Avoir l'air' is a French expression used to say that someone or something looks or seems a certain way. It's often followed by an adjective or a noun.","target_language_multi_word_term":"avoir l'air","meaning":"'to seem' or 'to look like'.","additional_notes":"Used to indicate a similarity in appearance or impression, often based on visual perception or context. It can describe people, objects, or situations.","target_language_example":"Elle a l'air fatiguée aujourd'hui.","native_language_example":"She looks tired today."}]
["avoir raison",{"thoughts":"The phrase 'avoir raison' is commonly used in French to express that someone is correct or right about something. Understanding and using this phrase is important for beginners because it can be used in everyday conversations when discussing opinions or decisions.","target_language_multi_word_term":"avoir raison","meaning":"'to be right'.","additional_notes":"This phrase is used when asserting that someone's opinion or argument is correct. It literally translates to 'to have reason'.","target_language_example":"Tu as raison, ce film était incroyable.","native_language_example":"You are right, that movie was amazing."}]
["avoir soif",{"thoughts":"'Avoir soif' is a basic French expression used to indicate thirst, literally translated as 'to have thirst'. It's a phrase beginners will likely encounter when talking about feelings or needs related to food and drink.","target_language_multi_word_term":"avoir soif","meaning":"'to be thirsty'.","additional_notes":"It's the idiomatic way in French to express the need for a drink, as compared to English where one directly uses the verb 'to be'.","target_language_example":"J'ai soif après avoir couru.","native_language_example":"I'm thirsty after running."}]
["avoir à",{"thoughts":"The term 'avoir à' is a French phrase that indicates obligation or necessity, similar to 'have to' or 'must' in English. It's often used to express a requirement or something that someone needs to do.","target_language_multi_word_term":"avoir à","meaning":"'to have to' or 'must'.","additional_notes":"This phrase is typically followed by an infinitive verb to indicate an action that needs to be completed.","target_language_example":"J'ai à finir mes devoirs avant demain.","native_language_example":"I have to finish my homework by tomorrow."}]
["avoir à voir",{"thoughts":"'Avoir à voir' is an idiomatic expression in French, often used to indicate relationships between concepts or to emphasize relevance or connection.","target_language_multi_word_term":"avoir à voir","meaning":"'to have to do with'.","additional_notes":"Used to discuss if something is related or relevant to something else, often indicating a connection or involvement.","target_language_example":"Cela n'a rien à voir avec notre discussion.","native_language_example":"That has nothing to do with our discussion."}]
["beau gosse",{"thoughts":"'Beau gosse' is a colloquial expression in French used to describe a handsome young man. It can also have a casual tone and be used among friends. Understanding this phrase can be helpful for informal conversations.","target_language_multi_word_term":"beau gosse","meaning":"a handsome guy.","additional_notes":"This phrase is informal and often used to compliment or describe a young man who is attractive. It is commonly used in casual conversations or among friends.","target_language_example":"C'est vraiment un beau gosse.","native_language_example":"He's really a handsome guy."}]
["bien dit",{"thoughts":"'Bien dit' translates to 'well said' in English. It is used to praise someone for their expression or the aptness of their statement. For beginners, it's important to understand how to use such phrases to engage in conversations politely and acknowledge others' good points or arguments.","target_language_multi_word_term":"bien dit","meaning":"'well said'.","additional_notes":"Used to agree with or commend someone for expressing something effectively or accurately.","target_language_example":"Ton argument est convaincant, bien dit!","native_language_example":"Your argument is convincing, well said!"}]
["bien entendu",{"thoughts":"\"Bien entendu\" is a common French expression, typically used to convey agreement or confirmation, similar to saying \"of course.\" It's often used in conversational situations to show understanding or agreement with what's being said.","target_language_multi_word_term":"bien entendu","meaning":"'of course' or 'naturally'.","additional_notes":"Used to affirm agreement or acknowledge that something is naturally expected.","target_language_example":"Bien entendu, je viendrai à ta fête.","native_language_example":"Of course, I will come to your party."}]
["bien fait",{"thoughts":"'Bien fait' is a French phrase that literally translates to 'well done' in English. It can be used either to compliment someone's work, indicating that something is of good quality, or sometimes sarcastically or humorously to indicate a negative consequence was deserved.","target_language_multi_word_term":"bien fait","meaning":"'well done'.","additional_notes":"Used both sincerely to praise someone's work and humorously to indicate someone received a deserved outcome. Context is important for determining the intended tone.","target_language_example":"Ton projet est vraiment bien fait. Félicitations!","native_language_example":"Your project is really well done. Congratulations!"}]
["bien joué",{"thoughts":"The term 'bien joué' is commonly used in French to congratulate someone or acknowledge a good effort, similar to 'well done' in English. It's often used in sports, games, or after someone accomplishes something successfully.","target_language_multi_word_term":"bien joué","meaning":"'well done' or 'good job'.","additional_notes":"Often used to praise someone for their efforts or success in both formal and informal contexts. Common in sports or games.","target_language_example":"Bien joué pour ton match aujourd'hui!","native_language_example":"Well done for your match today!"}]
["bien plus",{"thoughts":"'Bien plus' is a French phrase used to indicate a greater amount, degree, or extent of something. It's frequently used to compare things or highlight an increase or improvement.","target_language_multi_word_term":"bien plus","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize a considerable increase or a significantly larger quantity in comparison to something else.","target_language_example":"Il est bien plus intelligent que moi.","native_language_example":"He is much more intelligent than I am."}]
["bien que",{"thoughts":"'Bien que' is a conjunction in French used to introduce a subordinate clause expressing a contrast or contradiction, similiar to 'although' or 'even though' in English.","target_language_multi_word_term":"bien que","meaning":"'although' or 'even though'.","additional_notes":"It is commonly used to introduce a statement that contrasts with the main clause, often indicating a contrary fact.","target_language_example":"Bien que fatigué, il a décidé de sortir.","native_language_example":"Although tired, he decided to go out."}]
["bien sûr",{"thoughts":"'Bien sûr' is a commonly used expression in French that signifies agreement or confirmation, similar to 'of course' in English. It's important for beginner learners because it helps in positive responses and emphasizing agreement.","target_language_multi_word_term":"bien sûr","meaning":"'of course'.","additional_notes":"Used to express agreement or reinforce a statement. It can be used in different contexts, both formal and informal, to indicate certainty or agreement.","target_language_example":"Bien sûr, je peux t'aider avec ça.","native_language_example":"Of course, I can help you with that."}]
["bien vu",{"thoughts":"'Bien vu' is a French phrase used to express agreement or acknowledgment of a good point or clever observation. It translates directly to 'well seen' but is similar to saying 'good point' or 'well spotted' in English.","target_language_multi_word_term":"bien vu","meaning":"'well seen' or 'good point'.","additional_notes":"It is used to acknowledge that someone has made a clever observation or valid point. Often used in informal conversations.","target_language_example":"Bien vu, tu as remarqué le détail important.","native_language_example":"Good point, you noticed the important detail."}]
["bien à vous",{"thoughts":"'Bien à vous' is a common closing remark in French letters and emails, serving as a polite and formal equivalent to 'yours sincerely'.","target_language_multi_word_term":"bien à vous","meaning":"'yours sincerely' or 'best regards'.","additional_notes":"Used as a courteous closing expression in formal written communication, especially emails or letters. It is less familiar than 'amicalement' and more professional.","target_language_example":"Je reste à votre disposition pour toute information complémentaire. Bien à vous, Pierre.","native_language_example":"I remain at your disposal for any further information. Yours sincerely, Pierre."}]
["bon anniversaire",{"thoughts":"'Bon anniversaire' is a common phrase used to wish someone a happy birthday in French. It's an essential part of social interactions and celebrations.","target_language_multi_word_term":"bon anniversaire","meaning":"'happy birthday'.","additional_notes":"This phrase is used during birthday celebrations to convey good wishes to someone on their special day.","target_language_example":"Je te souhaite un bon anniversaire !","native_language_example":"I wish you a happy birthday!"}]
["bon vieux temps",{"thoughts":"\"Bon vieux temps\" is a commonly used expression in French to evoke nostalgia for past times. It translates to the English phrase \"good old days.\" This term is frequently used in conversations reminiscing about a more favorable or enjoyable past.","target_language_multi_word_term":"bon vieux temps","meaning":"'good old days'.","additional_notes":"Used when recalling the past with fondness or nostalgia, often implying that the past was better than the present.","target_language_example":"On se rappelle souvent du bon vieux temps quand la vie était plus simple.","native_language_example":"We often remember the good old days when life was simpler."}]
["bon voyage",{"thoughts":"'Bon voyage' is a French expression used to wish someone a good trip. It is commonly used in English conversations as well, making it a familiar phrase for many learners.","target_language_multi_word_term":"bon voyage","meaning":"'have a good trip'.","additional_notes":"Used to wish someone well as they embark on a journey or trip. Often said as a farewell when someone is departing.","target_language_example":"Avant son départ, ses amis lui ont dit : \"Bon voyage !\"","native_language_example":"Before she left, her friends said: \"Have a good trip!\""}]
["bonne chance",{"thoughts":"'Bonne chance' is a phrase used to wish someone good luck. It's commonly used in various situations where someone is about to undertake something that needs support or encouragement.","target_language_multi_word_term":"bonne chance","meaning":"'good luck'.","additional_notes":"Used to wish someone success or to encourage them before a challenging task or event.","target_language_example":"Bonne chance pour ton examen !","native_language_example":"Good luck on your exam!"}]
["bonne journée",{"thoughts":"'Bonne journée' is a common French phrase used to wish someone a pleasant day. It's often used as a farewell when parting from someone during the day. It's equivalent to 'have a nice day' in English and reflects a courteous and friendly sentiment.","target_language_multi_word_term":"bonne journée","meaning":"'have a nice day'.","additional_notes":"Used when parting ways with someone, usually in the morning or early afternoon, to express a wish for the person to have a pleasant rest of the day.","target_language_example":"Passez une bonne journée !","native_language_example":"Have a nice day!"}]
["bonne nouvelle",{"thoughts":"The term 'bonne nouvelle' translates to 'good news' in English. Beginners might encounter this phrase in everyday conversations when someone wants to share something positive.","target_language_multi_word_term":"bonne nouvelle","meaning":"'good news'.","additional_notes":"Used to describe a piece of positive or favorable information or updates.","target_language_example":"J'ai une bonne nouvelle pour toi !","native_language_example":"I have good news for you!"}]
["bonne nuit",{"thoughts":"'Bonne nuit' is a common French phrase used to say 'goodnight'. It is often used when parting ways with someone at night or when wishing someone a good sleep.","target_language_multi_word_term":"bonne nuit","meaning":"'goodnight'.","additional_notes":"Used as a farewell in the evening or at night, often before going to sleep.","target_language_example":"Je vais me coucher maintenant, bonne nuit !","native_language_example":"I'm going to bed now, goodnight!"}]
["bonne soirée",{"thoughts":"'Bonne soirée' is a common French phrase used to wish someone a good evening as a farewell, similar to 'good night'. It's often used when parting ways in the evening.","target_language_multi_word_term":"bonne soirée","meaning":"'good evening' or 'have a nice evening'.","additional_notes":"This phrase is often used when saying goodbye in the evening, expressing a wish for the evening to be pleasant. It can be used in both formal and informal settings.","target_language_example":"Passe une bonne soirée!","native_language_example":"Have a nice evening!"}]
["c'est",{"thoughts":"\"C'est\" is the contraction of \"ce\" (it/that/this) and \"est\" (is). It’s one of the first expressions learners meet because it introduces or identifies things or people and is used constantly.","target_language_multi_word_term":"c'est","meaning":"it’s / this is / that is","additional_notes":"Used to point out, describe, or identify something: C’est + noun, adjective, name, date, etc. Always spelled with the apostrophe.","target_language_example":"C'est un livre intéressant.","native_language_example":"It's an interesting book."}]
["c'est la meilleure",{"thoughts":"The phrase \"c'est la meilleure\" is used to emphasize that something is the best or the greatest. A beginner learner might encounter this in conversations praising something or someone.","target_language_multi_word_term":"c'est la meilleure","meaning":"'it's the best'.","additional_notes":"Used to express that something is the top choice or the most excellent among options. Often used positively when recommending or praising.","target_language_example":"C'est la meilleure pizza que j'ai jamais mangée.","native_language_example":"It's the best pizza I've ever eaten."}]
["c'est moi",{"thoughts":"'C'est moi' is a basic expression for identification or assertion in conversations. Helpful for beginners when introducing oneself or responding to recognition.","target_language_multi_word_term":"c'est moi","meaning":"'it's me'.","additional_notes":"Used when identifying oneself to others, often in casual or familiar situations.","target_language_example":"Qui est à la porte? C'est moi.","native_language_example":"Who's at the door? It's me."}]
["c'est tout",{"thoughts":"This phrase is often used to indicate the conclusion or sufficiency of something, similar to saying 'that's it' or 'that's all' in English. It's a simple, concise way to affirm that there is nothing more to add.","target_language_multi_word_term":"c'est tout","meaning":"'that's all' or 'that's it'.","additional_notes":"Commonly used to indicate that something is complete or enough. It can be used in contexts ranging from concluding explanations to ending a transaction.","target_language_example":"J'ai fini mes devoirs, c'est tout.","native_language_example":"I've finished my homework, that's all."}]
["c'est ça",{"thoughts":"\"C'est ça\" is a common French expression used in conversations to affirm or confirm something, equivalent to \"that's it\" or \"exactly.\"","target_language_multi_word_term":"c'est ça","meaning":"'that's it' or 'exactly'.","additional_notes":"Used to confirm agreement or understanding with someone's statement or question. It can also imply correctness or accuracy in relation to what was just mentioned.","target_language_example":"- Tu vois ce que je veux dire ? \n- Oui, c'est ça.","native_language_example":"- Do you see what I mean? \n- Yes, that's it."}]
["ce dont",{"thoughts":"'Ce dont' is a phrase used in French to refer to something previously mentioned, usually with verbs or expressions that require 'de'. It's the equivalent of 'what' or 'which' in English when 'de' is involved.","target_language_multi_word_term":"ce dont","meaning":"'what' or 'that which', with 'de'.","additional_notes":"Often used in contexts where it's necessary to link back to an antecedent described by 'de'.","target_language_example":"Je ne sais pas ce dont tu parles.","native_language_example":"I don't know what you are talking about."}]
["ce faisant",{"thoughts":"'Ce faisant' is a French expression used to describe the act of doing something as a means of achieving a particular result. It's related to actions taken to accomplish a task or goal. This can often be used in a more formal context or writing.","target_language_multi_word_term":"ce faisant","meaning":"'doing so' or 'in doing so'.","additional_notes":"Used to indicate the means or process by which something is accomplished. It often precedes a result or consequence of the action taken.","target_language_example":"Il a étudié toute la nuit, ce faisant, il a réussi son examen.","native_language_example":"He studied all night, and in doing so, he passed his exam."}]
["ce fut un plaisir",{"thoughts":"The term 'ce fut un plaisir' is often used in polite and formal settings. It's equivalent to saying 'it was a pleasure' in English, typically used to express appreciation after an event or meeting.","target_language_multi_word_term":"ce fut un plaisir","meaning":"'it was a pleasure'.","additional_notes":"Used to express gratitude or enjoyment after an encounter, often in formal contexts.","target_language_example":"Merci pour l'invitation, ce fut un plaisir de vous rencontrer.","native_language_example":"Thank you for the invitation, it was a pleasure to meet you."}]
["ce que",{"thoughts":"'Ce que' is a very common phrase that can trip up beginners because it translates to English 'what' when it is the object of a verb; it can also be read as 'that which'. It’s used to introduce relative clauses or indirect questions, never used as the subject (that would be 'ce qui').","target_language_multi_word_term":"ce que","meaning":"'what' / 'that which' (object).","additional_notes":"Introduces a clause that acts as the object of a verb; use 'ce qui' when it is the subject.","target_language_example":"Dis-moi ce que tu veux.","native_language_example":"Tell me what you want."}]
["ce qui",{"thoughts":"'Ce qui' is used to introduce a relative clause and often translates to 'what' or 'that which' in English. It's important to differentiate between 'ce qui' and 'ce que,' as their usage depends on the grammatical structure they introduce.","target_language_multi_word_term":"ce qui","meaning":"'what' or 'that which'.","additional_notes":"Used when 'what' is the subject of a relative clause. 'Ce qui' is followed by a verb, unlike 'ce que,' which is followed by a subject and then a verb.","target_language_example":"Je ne comprends pas ce qui se passe.","native_language_example":"I don't understand what is happening."}]
["celui-ci",{"thoughts":"'Celui-ci' is a French demonstrative pronoun that specifies something close to the speaker, often translated as 'this one' in English. It's a useful term for beginners to distinguish between objects or people based on proximity.","target_language_multi_word_term":"celui-ci","meaning":"'this one' (masculine, singular)","additional_notes":"Used to identify a specific singular masculine noun or object that is near the speaker. It's the masculine singular form; feminine would be 'celle-ci'.","target_language_example":"Je préfère celui-ci.","native_language_example":"I prefer this one."}]
["celui-là",{"thoughts":"'Celui-là' is a pronoun used in French to specify a particular object or person, often implying that it is distinct or at a distance from the speaker.","target_language_multi_word_term":"celui-là","meaning":"'that one' (masculine singular).","additional_notes":"Used to refer to a specific object or person, often emphasizing its separation from others, usually compared with 'celui-ci' for closer objects or persons.","target_language_example":"Je préfère celui-là.","native_language_example":"I prefer that one."}]
["chose faite",{"thoughts":"'Chose faite' is a French idiom that literally translates to 'thing done' and is equivalent to 'it's done' or 'it's settled' in English. It conveys the sense of completing or finalizing something.","target_language_multi_word_term":"chose faite","meaning":"'it's done' or 'it's settled'.","additional_notes":"It is often used to express that a decision has been made or a task has been completed, indicating closure on a matter.","target_language_example":"La réunion est organisée, c'est une chose faite.","native_language_example":"The meeting is organized, it's done."}]
["combien ça coûte",{"thoughts":"The phrase 'combien ça coûte' is commonly used to ask for the price of something, which is a practical and essential skill for shopping and making purchases in a French-speaking region. It directly translates to 'how much does it cost', serving as a useful tool for beginners to initiate questions related to money and transactions.","target_language_multi_word_term":"combien ça coûte","meaning":"'how much does it cost?'","additional_notes":"Used to inquire about the price of an object or service. Very useful in shopping or market settings.","target_language_example":"Combien ça coûte ce livre?","native_language_example":"How much does this book cost?"}]
["comme si",{"thoughts":"'Comme si' is a French expression used to say 'as if' in English. It's commonly used in similes and to express skepticism or doubt about a hypothetical situation.","target_language_multi_word_term":"comme si","meaning":"'as if'.","additional_notes":"Often used to describe situations that are imaginary or unlikely, and can convey sarcasm or disbelief.","target_language_example":"Il parle français comme si c'était sa langue maternelle.","native_language_example":"He speaks French as if it were his native language."}]
["comme ça",{"thoughts":"'Comme ça' is a versatile phrase in French typically used to describe a manner or degree, similar to 'like that' or 'so'. It can also be used in gestures to indicate something obvious or self-explanatory.","target_language_multi_word_term":"comme ça","meaning":"'like that' or 'so'.","additional_notes":"Commonly used to explain how something is done or to demonstrate a direct comparison.","target_language_example":"Fais-le comme ça !","native_language_example":"Do it like that!"}]
["comment cela",{"thoughts":"'Comment cela' is a French phrase used to ask 'How is that?' or 'What do you mean by that?', usually to clarify or get more details about something mentioned previously.","target_language_multi_word_term":"comment cela","meaning":"'how is that' or 'what do you mean by that?'","additional_notes":"Used to ask for more information or clarification about a statement or situation.","target_language_example":"Comment cela fonctionne-t-il ?","native_language_example":"How does that work?"}]
["comment ça",{"thoughts":"'Comment ça' is a phrase used in French conversations. It is often utilized to ask for clarification or additional details about something just mentioned.","target_language_multi_word_term":"comment ça","meaning":"'how', 'in what way', or 'how come'.","additional_notes":"Used to ask for more information or clarification in casual conversations. Can be part of longer phrases like 'comment ça va?' meaning 'how's it going?'","target_language_example":"Comment ça marche, cette machine ?","native_language_example":"How does this machine work?"}]
["compter sur",{"thoughts":"'Compter sur' is a French phrase used to express reliance or dependence on someone or something, similar to how 'count on' is used in English. It is particularly relevant for expressing trust and dependability, often common themes in conversational scenarios.","target_language_multi_word_term":"compter sur","meaning":"'to count on' or 'to rely on'.","additional_notes":"This phrase is used to express trust and reliance, similar to when you count on someone for help or support. It is common in expressing confidence in someone's abilities or dependability.","target_language_example":"Je peux toujours compter sur toi.","native_language_example":"I can always count on you."}]
["contrairement à",{"thoughts":"The phrase 'contrairement à' is used to express contrast or opposition, making it essential for expressing differences in opinions, actions, or characteristics. It can be useful in beginner conversations to differentiate preferences or expectations.","target_language_multi_word_term":"contrairement à","meaning":"'contrary to' or 'unlike'.","additional_notes":"This phrase is used to express a contrast between two things, persons, or ideas. It's often followed by nouns or pronouns.","target_language_example":"Contrairement à moi, elle aime le chocolat noir.","native_language_example":"Unlike me, she likes dark chocolate."}]
["coup de feu",{"thoughts":"The French term 'coup de feu' has several meanings depending on the context. It can mean a gunshot, a burst of activity, or a sudden increase in temperature or pressure, especially in a culinary context. Given this is for beginner learners, the phrase's use in everyday scenarios such as cooking or a burst of intense activity might be most relevant.","target_language_multi_word_term":"coup de feu","meaning":"'gunshot', or 'burst of activity'.","additional_notes":"In cooking, 'coup de feu' refers to a period when many dishes are being prepared simultaneously, requiring intense effort. It can also figuratively describe any burst of intense activity or urgency.","target_language_example":"Pendant le coup de feu, la cuisine était en pleine effervescence.","native_language_example":"During the rush, the kitchen was buzzing with activity."}]
["coup de fil",{"thoughts":"The phrase 'coup de fil' is used to mean a phone call in French, literally translating to 'hit of wire'. It is a colloquial expression used frequently in everyday conversation. Understanding such informal phrases is helpful for learners to engage in more natural conversations.","target_language_multi_word_term":"coup de fil","meaning":"'phone call'.","additional_notes":"In casual French, this term is often used instead of the more formal 'appel téléphonique'.","target_language_example":"Je donnerai un coup de fil à Marie ce soir.","native_language_example":"I will give Marie a call this evening."}]
["coup de main",{"thoughts":"'Coup de main' translates directly to 'helping hand' and is used to indicate assistance or help. It is a useful phrase for learners to understand how to ask for or offer help in French.","target_language_multi_word_term":"coup de main","meaning":"'helping hand' or 'assistance'.","additional_notes":"This phrase can be used both when asking for help and when offering to help someone.","target_language_example":"Peux-tu me donner un coup de main avec ce projet ?","native_language_example":"Can you give me a helping hand with this project?"}]
["d'un coup",{"thoughts":"The phrase 'd'un coup' literally translates to 'of a blow' but is commonly used in French to mean 'all of a sudden' or 'at once'. It's used to describe something that happens abruptly or all at once, often unexpectedly.","target_language_multi_word_term":"d'un coup","meaning":"'all of a sudden' or 'at once'.","additional_notes":"Commonly used to describe abrupt or unexpected events. Can also imply that something happens in a single action or effort.","target_language_example":"Il a terminé le livre d'un coup.","native_language_example":"He finished the book all at once."}]
["d'une minute à l'autre",{"thoughts":"The phrase 'd'une minute à l'autre' is used in French to denote something that can happen at any moment or very suddenly - akin to the English phrase 'any minute now.' This is a helpful phrase for beginners to convey the idea of anticipation or sudden occurrence.","target_language_multi_word_term":"d'une minute à l'autre","meaning":"'any minute now' or 'suddenly'.","additional_notes":"This phrase is used to describe events or situations that are expected to occur soon or without much warning.","target_language_example":"Il peut arriver d'une minute à l'autre.","native_language_example":"He could arrive any minute now."}]
["de deux",{"thoughts":"The phrase 'de deux' is typically used to express division or splitting into two parts. It can also be a part of composite phrases to indicate something involving two. It is important when dealing with contexts that involve numbers or division.","target_language_multi_word_term":"de deux","meaning":"'of two'.","additional_notes":"Commonly used in contexts involving separation or distribution, like dividing something into two parts.","target_language_example":"Chaque gâteau doit être coupé en parts de deux.","native_language_example":"Each cake must be cut into pieces of two."}]
["de nouveau",{"thoughts":"\"De nouveau\" is a French phrase used to indicate the repetition of an action or situation, translating to 'again' or 'anew'. This phrase is often interchangeable with 'encore', though 'de nouveau' often emphasizes starting something from the beginning or experiencing something with freshness.","target_language_multi_word_term":"de nouveau","meaning":"'again' or 'anew'.","additional_notes":"Often used to indicate the repetition of an action. It carries a nuance of starting over or experiencing something in a fresh way, different from 'encore' which might simply mean doing something one more time.","target_language_example":"Elle a dû tout refaire de nouveau.","native_language_example":"She had to do everything all over again."}]
["de nuit",{"thoughts":"The phrase 'de nuit' is often used to specify something that happens or is used during the night. It's an important distinction for timing or description of activities and objects. This term will be useful for understanding schedules, habits, or even when describing certain products like 'travail de nuit' (night work) or 'veilleuse de nuit' (nightlight).","target_language_multi_word_term":"de nuit","meaning":"'at night' or 'of the night'.","additional_notes":"Commonly used to describe events or objects associated with nighttime. Can be used to indicate a shift in a work schedule or events that specifically occur at night.","target_language_example":"Elle travaille de nuit dans l'hôpital.","native_language_example":"She works at night in the hospital."}]
["de plus",{"thoughts":"'De plus' is a French phrase that can mean 'furthermore' or 'moreover'. It is commonly used to add information or to reinforce a previously mentioned point.","target_language_multi_word_term":"de plus","meaning":"'furthermore' or 'moreover'.","additional_notes":"Used to add additional information or emphasis in a sentence, often between clauses.","target_language_example":"Il a terminé ses devoirs. De plus, il a aidé sa sœur avec les siens.","native_language_example":"He finished his homework. Furthermore, he helped his sister with hers."}]
["de quoi",{"thoughts":"\"De quoi\" is a French phrase used to indicate what something is about or what is necessary for something. It's often used in questions or with expressions like avoir de quoi, which means to have enough or the means.","target_language_multi_word_term":"de quoi","meaning":"'of what' or 'about what'.","additional_notes":"Often used in questions to ask about the content or necessity. Can also appear in phrases like 'avoir de quoi', meaning 'to have enough' or 'to have something to'.","target_language_example":"De quoi parle ce livre ?","native_language_example":"What is this book about?"}]
["de retour",{"thoughts":"'De retour' is a French phrase used to indicate someone or something is back after being away.","target_language_multi_word_term":"de retour","meaning":"back or returned.","additional_notes":"Used to express that someone or something has come back after an absence. It is commonly used to talk about people returning from trips, breaks, or even after being unavailable for some time.","target_language_example":"Il est de retour de vacances.","native_language_example":"He is back from vacation."}]
["de rien",{"thoughts":"'De rien' is commonly used in French as a polite response to someone thanking you.","target_language_multi_word_term":"de rien","meaning":"'you're welcome.'","additional_notes":"Used to acknowledge and respond to 'merci' (thank you) in an informal way. It conveys that the action or favor was not a burden.","target_language_example":"- Merci pour ton aide ! - De rien.","native_language_example":"- Thank you for your help! - You're welcome."}]
["de suite",{"thoughts":"\"De suite\" is a very common French phrase that means immediately or right away. It's used in both conversational and more formal settings, making it a useful expression for learners to know.","target_language_multi_word_term":"de suite","meaning":"immediately or right away.","additional_notes":"Often used to indicate that something will or should happen without delay.","target_language_example":"Je vais m'occuper de cela de suite.","native_language_example":"I'll take care of that right away."}]
["de un",{"thoughts":"'De un' is not a correct or commonly used phrase in French. It seems to be a misinterpretation or typo. Normally, 'de' is followed by a definite article like 'le' or 'la', resulting in contractions such as 'du' (de + le) or 'de la'.","target_language_multi_word_term":"de un","meaning":"","additional_notes":"This combination is incorrect in standard French grammar. Instead, 'un' following 'de' would typically become 'd'un'.","target_language_example":"D'un coup, il a compris.","native_language_example":"All of a sudden, he understood."}]
["de ça",{"thoughts":"'De ça' is a common phrase used to refer to 'of that' or 'about that', often when speaking about something that has been previously mentioned.","target_language_multi_word_term":"de ça","meaning":"'of that' or 'about that'.","additional_notes":"Commonly used to refer back to a previously mentioned topic or item, and is informal in tone.","target_language_example":"Je ne veux pas parler de ça.","native_language_example":"I don't want to talk about that."}]
["des familles",{"thoughts":"The term 'des familles' is often used in a fixed expression to refer to 'families,' but in colloquial speech, it can also add emphasis or indicate that something is done in a big way. It's used in expressions like 'en masse' or 'in the family-sized version.'","target_language_multi_word_term":"des familles","meaning":"'families'.","additional_notes":"Can also be used informally to suggest doing something in a big or excessive way, similar to saying 'family-sized' or 'a lot'.","target_language_example":"On a mangé des pizzas des familles hier soir.","native_language_example":"We ate family-sized pizzas last night."}]
["des fois",{"thoughts":"\"Des fois\" is a French adverbial phrase often used in informal contexts to express the idea of frequency or repetition.","target_language_multi_word_term":"des fois","meaning":": 'sometimes'.","additional_notes":"\"Des fois\" is synonymous with \"parfois\" but is more informal. It suggests something that happens occasionally or not often.","target_language_example":"Des fois, je vais courir le matin.","native_language_example":"Sometimes, I go running in the morning."}]
["devine quoi",{"thoughts":"The phrase 'devine quoi' is informal and commonly used in French to create suspense or build interest before revealing surprising or important news. It's akin to saying 'guess what' in English.","target_language_multi_word_term":"devine quoi","meaning":"'guess what'.","additional_notes":"Used to introduce surprising or important information, similar to its English equivalent. The phrase can also encourage engagement by prompting the listener to actively participate in the conversation.","target_language_example":"Devine quoi ! J'ai eu une promotion !","native_language_example":"Guess what! I got a promotion!"}]
["dire au revoir",{"thoughts":"\"Dire au revoir\" is a straightforward expression used in French to bid farewell. It literally translates to 'say goodbye' and is part of everyday conversational language.","target_language_multi_word_term":"dire au revoir","meaning":"'say goodbye'.","additional_notes":"This phrase is used in a variety of social contexts, from formal to informal settings, whenever people part ways.","target_language_example":"Je vais dire au revoir à tout le monde avant de partir.","native_language_example":"I'm going to say goodbye to everyone before leaving."}]
["dire que",{"thoughts":"The phrase 'dire que' is often used in French to introduce a clause that begins with 'that' or to express irony or disbelief in a statement.","target_language_multi_word_term":"dire que","meaning":"'to say that' or 'to think that'.","additional_notes":"Commonly used to indicate what someone is saying or thinking, or to express irony. It can introduce a statement or opinion.","target_language_example":"Elle a dit qu'il pleuvait.","native_language_example":"She said that it was raining."}]
["dire quelque chose",{"thoughts":"\"Dire quelque chose\" translates to \"to say something\" and is useful for beginners to express speaking or stating anything, which includes expressing ideas, opinions, or responses.","target_language_multi_word_term":"dire quelque chose","meaning":"\"to say something.\"","additional_notes":"This phrase can be used to express a need or action involving expressing words, ideas, or sentiments. It's a versatile phrase for indicating speech or communication.","target_language_example":"Je veux dire quelque chose important.","native_language_example":"I want to say something important."}]
["dire quoi",{"thoughts":"The phrase 'dire quoi' is used colloquially in French to indicate surprise or disbelief, similar to the English 'say what?' or 'excuse me?'. It's a casual expression that reflects needing clarification or not having caught what was said.","target_language_multi_word_term":"dire quoi","meaning":"'say what?' or 'excuse me?'","additional_notes":"Used in informal conversation when you need something repeated or clarified because you didn't hear or understand.","target_language_example":"Tu as gagné à la loterie ? Dire quoi ?","native_language_example":"You won the lottery? Say what?"}]
["du bon",{"thoughts":"'Du bon' is a French phrase which can mean 'good' or 'some good'. It's used to express something positive or agreeable.","target_language_multi_word_term":"du bon","meaning":"'good' or 'some good'.","additional_notes":"Often used to express quality or positive attributes in things or situations, like food or experiences.","target_language_example":"Ce film était du bon.","native_language_example":"That movie was good."}]
["du calme",{"thoughts":"'Du calme' is a common expression used to urge someone to relax or calm down in a situation. It is important for a beginner to recognize it as a way to advise or request tranquility.","target_language_multi_word_term":"du calme","meaning":"'calm down' or 'relax'.","additional_notes":"Used to tell someone to stay composed or to relax in a situation that might be stressful or tense.","target_language_example":"Il faut du calme pour résoudre ce problème.","native_language_example":"You need to stay calm to solve this problem."}]
["du coup",{"thoughts":"\"Du coup\" is a common French conversational filler phrase often used to indicate a result, consequence, or to move the conversation forward. It's very versatile in spoken French and doesn't translate directly into English.","target_language_multi_word_term":"du coup","meaning":"'so' or 'as a result'.","additional_notes":"Often used to transition between thoughts or to indicate a conclusion or an effect of something previously mentioned. It is informal and frequently used in everyday conversation.","target_language_example":"Il pleuvait toute la journée, du coup nous sommes restés à la maison.","native_language_example":"It was raining all day, so we stayed home."}]
["du monde",{"thoughts":"The term \"du monde\" involves the partitive article 'du', meaning 'of the' or 'some', combined with 'monde', meaning 'world'. In English, this translates to a sense of 'of the world' or 'in the world'. It's frequently used in various contexts like describing popularity or frequency.","target_language_multi_word_term":"du monde","meaning":"'of the world'.","additional_notes":"Often used to describe something's status, role, or occurrence in a global context.","target_language_example":"C'est le meilleur restaurant du monde.","native_language_example":"It's the best restaurant in the world."}]
["du temps de",{"thoughts":"The phrase 'du temps de' is used in French to refer to something in the past or during a certain period. It is often used to talk about an era or a significant time in history or someone's life.","target_language_multi_word_term":"du temps de","meaning":"'in the time of' or 'during the time of'.","additional_notes":"This phrase is typically used to refer to specific periods, such as an era (e.g., 'du temps de Napoléon') or a person's lifetime ('du temps de mon grand-père').","target_language_example":"Du temps de Napoléon, les lois étaient différentes.","native_language_example":"In the time of Napoleon, the laws were different."}]
["du tout",{"thoughts":"The term 'du tout' is often used for emphasis in negative sentences, translating to 'at all' in English. This phrase can help beginners understand how to emphasize the absence or negation of something in French.","target_language_multi_word_term":"du tout","meaning":"'at all'.","additional_notes":"Used for emphasis in negative contexts, generally to indicate total absence or non-occurrence of something. Often paired with 'ne... pas' to form a complete negation.","target_language_example":"Je ne comprends pas du tout.","native_language_example":"I don't understand at all."}]
["dès que",{"thoughts":"'Dès que' is a phrase used to indicate when something will happen immediately after another event occurs. It closely relates to temporal sequences or conditions.","target_language_multi_word_term":"dès que","meaning":"as soon as","additional_notes":"Used to express that one event will closely follow another in time. Commonly used in conversation and writing to specify immediate succession after another action or event happens.","target_language_example":"Je t'appellerai dès que j'arriverai.","native_language_example":"I will call you as soon as I arrive."}]
["déjà vu",{"thoughts":"The term 'déjà vu' is imported into English and globally recognized, but its origin is French. It refers to the sensation that one has lived through the present situation before, a feeling of familiarity when encountering something new.","target_language_multi_word_term":"déjà vu","meaning":"'already seen'.","additional_notes":"Commonly used to describe an eerie feeling of reliving a moment in time. Despite being borrowed into English, it retains the same meaning in French.","target_language_example":"En entrant dans cette pièce, j'ai eu un sentiment de déjà vu.","native_language_example":"Upon entering this room, I had a feeling of déjà vu."}]
["en arrière",{"thoughts":"This phrase is used to indicate movement or position towards the back or behind something. It's a common directional phrase in French.","target_language_multi_word_term":"en arrière","meaning":"'backward' or 'to the back'.","additional_notes":"Often used to describe physical movement in the opposite direction or to indicate something located behind another object or person.","target_language_example":"Il a fait un pas en arrière.","native_language_example":"He took a step backward."}]
["en avoir assez",{"thoughts":"'En avoir assez' is a common French idiom used to express having had enough of something, similar to the English phrase 'to have had enough'. It is often used to indicate frustration or the feeling of being fed up.","target_language_multi_word_term":"en avoir assez","meaning":"To have enough, to be fed up.","additional_notes":"Used to express that one is tired or annoyed about a situation or behavior that has continued for too long.","target_language_example":"J'en ai assez de ce bruit constant.","native_language_example":"I've had enough of this constant noise."}]
["en bas",{"thoughts":"'En bas' is a common phrase used to indicate position or direction, often in relation to a location that is lower than where one currently is.","target_language_multi_word_term":"en bas","meaning":"'downstairs' or 'below'.","additional_notes":"This phrase is often used to refer to something or somewhere situated at a lower level in buildings or structures.","target_language_example":"Les toilettes sont en bas.","native_language_example":"The toilets are downstairs."}]
["en cours",{"thoughts":"'En cours' is a French expression meaning 'in progress' or 'ongoing', often used to describe activities or processes that are currently happening.","target_language_multi_word_term":"en cours","meaning":"'in progress' or 'ongoing'.","additional_notes":"Commonly used to indicate that something is currently being developed or completed. It implies that the event or activity is ongoing and not yet finished.","target_language_example":"Le projet est encore en cours.","native_language_example":"The project is still in progress."}]
["en effet",{"thoughts":"'En effet' is a French phrase often used to confirm or emphasize something that has been previously mentioned. It can translate to 'indeed' or 'in fact' in English.","target_language_multi_word_term":"en effet","meaning":"'indeed' or 'in fact'.","additional_notes":"It is used to reinforce or confirm a statement, often providing clarification or adding information.","target_language_example":"Elle est très sympathique, en effet, elle aide toujours tout le monde.","native_language_example":"She is very nice, indeed, she always helps everyone."}]
["en faire",{"thoughts":"'En faire' is a French phrase used to suggest an action or reaction to a situation, often related to making a fuss or dealing with something.","target_language_multi_word_term":"en faire","meaning":"to do (with it) or to make of it","additional_notes":"Often used in expressions like 'Tu n'en fais pas trop?' meaning 'Aren't you overreacting?', indicating dealing with or reacting to situations, sometimes implying overreaction or drama.","target_language_example":"Il n'en fait jamais trop quand il s'agit de ses amis.","native_language_example":"He never makes a big deal when it comes to his friends."}]
["en fait",{"thoughts":"The term 'en fait' is commonly used in French to clarify or correct information, similar to 'in fact' or 'actually' in English. It's often used to provide more precise information or to contradict a previous statement.","target_language_multi_word_term":"en fait","meaning":"'in fact' or 'actually'.","additional_notes":"Used to emphasize a point, clarify information, or correct a misunderstanding.","target_language_example":"Je pensais que tu étais occupé, mais en fait, tu étais libre.","native_language_example":"I thought you were busy, but in fact, you were free."}]
["en forme",{"thoughts":"'En forme' is a French expression used to describe someone who is feeling well, healthy, or in good physical condition. It's often used to inquire about someone's well-being or to complement their energetic appearance.","target_language_multi_word_term":"en forme","meaning":"'in shape' or 'feeling well'.","additional_notes":"Used to describe someone's physical condition, often after exercise or when asking about someone's general well-being.","target_language_example":"Après une bonne nuit de sommeil, je me sens en forme.","native_language_example":"After a good night's sleep, I feel in shape."}]
["en haut",{"thoughts":"'En haut' is a term used to refer to a position or location above. It's useful for explaining where something is situated, typically used to describe places or directions.","target_language_multi_word_term":"en haut","meaning":"'up', 'above', or 'upstairs'.","additional_notes":"Used to describe where something is, often in contrast with 'en bas' which means 'down' or 'below'.","target_language_example":"Les livres sont en haut de l'étagère.","native_language_example":"The books are on the top shelf."}]
["en jeu",{"thoughts":"'En jeu' is a French phrase commonly used in contexts where something is at stake or at play, indicating the elements or factors involved in a situation.","target_language_multi_word_term":"en jeu","meaning":"'at stake' or 'in play'.","additional_notes":"Used to describe what is involved or at risk in a particular situation or process. It often indicates the elements that are being considered or are involved.","target_language_example":"Il y a beaucoup d'argent en jeu dans ce projet.","native_language_example":"There is a lot of money at stake in this project."}]
["en retard",{"thoughts":"\"En retard\" is a phrase used to describe being late for an event or having a delay. It is commonly used in both formal and informal situations to express tardiness.","target_language_multi_word_term":"en retard","meaning":"late.","additional_notes":"Used to indicate someone or something is behind schedule or has not arrived at the expected time.","target_language_example":"Il est arrivé en retard à la réunion.","native_language_example":"He arrived late to the meeting."}]
["en route",{"thoughts":"The term 'en route' is commonly used in both French and English, indicating that someone or something is in transit or on the way to a destination.","target_language_multi_word_term":"en route","meaning":"'on the way' or 'in transit'.","additional_notes":"This phrase can be used to describe a person or an object that is currently on the way to a specific location or destination.","target_language_example":"Je suis en route vers le bureau.","native_language_example":"I am on the way to the office."}]
["en train de",{"thoughts":"\"En train de\" is used in French to indicate an action that is currently ongoing, similar to the English present continuous tense. It is important for learners to understand this structure as it is frequently used in everyday conversation.","target_language_multi_word_term":"en train de","meaning":"'in the process of' or 'currently (verb)-ing'.","additional_notes":"Used to describe actions that are happening at the moment of speaking. It is often followed by an infinitive verb.","target_language_example":"Je suis en train de manger.","native_language_example":"I am eating."}]
["en tête",{"thoughts":"The phrase 'en tête' is used in French to indicate 'at the front' or 'in the lead' and is commonly used in contexts like sports or any scenario where ranking or position is important.","target_language_multi_word_term":"en tête","meaning":"'in the lead' or 'at the front'.","additional_notes":"Often used in competitive contexts to describe something that is leading or winning. Also used more generally to mean something is at the forefront or the top of a list.","target_language_example":"L'équipe est en tête du championnat.","native_language_example":"The team is leading the championship."}]
["en vouloir",{"thoughts":"The multiword term 'en vouloir' is an idiomatic expression in French that conveys holding a grudge or being angry at someone. It's a reflexive construction commonly used to express personal feelings of resentment. It's important for learners to understand its use and variations as it shows up often in informal and conversational French.","target_language_multi_word_term":"en vouloir","meaning":"'to hold a grudge' or 'to be angry at'.","additional_notes":"This expression is reflexively used with pronouns to show who is angry at whom. For example, 'Je t'en veux' means 'I am angry at you'. It is essential to pair 'en vouloir' with the correct pronoun to specify the subject of the anger.","target_language_example":"Je lui en veux pour ce qui s’est passé.","native_language_example":"I am angry at him/her for what happened."}]
["en échange",{"thoughts":"\"En échange\" is commonly used to indicate a trade-off or something given in return for something else, often in transactions or informal negotiations.","target_language_multi_word_term":"en échange","meaning":"'in exchange' or 'in return'.","additional_notes":"Used when indicating a reciprocal action or trade, where something is given or received as a part of a transaction.","target_language_example":"Je te donnerai mon livre, en échange de ton aide.","native_language_example":"I will give you my book, in exchange for your help."}]
["en être",{"thoughts":"'En être' is a versatile French phrase that can mean different things based on context. It is often used to refer to the current state or progress of a situation or action. It can also be used impersonally to express a condition or state of affairs.","target_language_multi_word_term":"en être","meaning":"'to be at' or 'to be up to a certain point'.","additional_notes":"Commonly used to ask about the status or progress of an ongoing event or process. It can also imply being involved in or part of something.","target_language_example":"Où en es-tu avec ton projet?","native_language_example":"Where are you at with your project?"}]
["entendre dire",{"thoughts":"\"Entendre dire\" is a French phrase used to express hearing information indirectly, such as through rumors or reports from others.","target_language_multi_word_term":"entendre dire","meaning":"'to hear (that)' or 'to hear about'.","additional_notes":"Used when conveying information that has been heard from someone else rather than experienced directly.","target_language_example":"J'ai entendu dire qu'il va pleuvoir demain.","native_language_example":"I heard that it's going to rain tomorrow."}]
["entendre parler",{"thoughts":"'Entendre parler' is a common French expression used when someone has heard about something or someone, often indicating indirect knowledge or rumors. Perfect for a beginner to expand their understanding of discussing hearsay or indirect information.","target_language_multi_word_term":"entendre parler","meaning":"to hear about.","additional_notes":"Used to refer to getting information through hearing, often through informal channels or word of mouth.","target_language_example":"J'ai entendu parler d'une nouvelle boulangerie en ville.","native_language_example":"I heard about a new bakery in town."}]
["entendre parler de",{"thoughts":"This expression is used in French to indicate hearing about something or someone informally through secondhand sources like conversation, news, or rumors.","target_language_multi_word_term":"entendre parler de","meaning":"'to hear about'.","additional_notes":"Used when referring to information or news you've received from others, not necessarily firsthand experience.","target_language_example":"J'ai entendu parler de cette nouvelle exposition.","native_language_example":"I heard about this new exhibition."}]
["est passé",{"thoughts":"\"Est passé\" is the third person singular past tense of the verb 'passer', often used to describe events or actions that have occurred. In English, it translates to 'has passed' or 'went'. It is frequently used to talk about time or events that have already been completed.","target_language_multi_word_term":"est passé","meaning":"'has passed' or 'went'.","additional_notes":"Commonly used to indicate the completion of an action or the passage of time. The tense provides context that the action is in the past and completed.","target_language_example":"Le train est passé il y a cinq minutes.","native_language_example":"The train went by five minutes ago."}]
["est-ce que",{"thoughts":"'Est-ce que' is a very common question marker beginners meet early. It’s placed at the start of a statement to turn it into a yes/no (or information) question without inversion or changing word order.","target_language_multi_word_term":"est-ce que","meaning":"introductory phrase for questions: “do/does/is/are…?”","additional_notes":"Put it at the start of a sentence to form a question in spoken or informal written French. No verb inversion is needed afterward.","target_language_example":"Est-ce que tu viens ce soir ?","native_language_example":"Are you coming tonight?"}]
["est-il",{"thoughts":"'Est-il' is an inversion used in formal French to form questions with the verb 'être' (to be), equivalent to asking 'is he' or 'is it'. It is commonly used in written or formal contexts.","target_language_multi_word_term":"est-il","meaning":"'is he' or 'is it'.","additional_notes":"This inversion structure is a formal way of asking questions, commonly used in written French and less so in casual spoken language.","target_language_example":"Est-il possible de finir ce projet aujourd'hui ?","native_language_example":"Is it possible to finish this project today?"}]
["et des",{"thoughts":"'Et des' is a French phrase combining 'et', meaning 'and', with 'des', a partitive article or indefinite plural article meaning 'some'. It can indicate adding some elements to a list or specifying an indefinite quantity or possession. This phrase might not always have a direct match in English, where 'des' can be omitted or implied in many contexts.","target_language_multi_word_term":"et des","meaning":"'and some' or 'and of the'.","additional_notes":"Used to add items in a list without needing to specify exact numbers or details, often found in descriptions or lists.","target_language_example":"J'ai des pommes et des oranges.","native_language_example":"I have some apples and some oranges."}]
["et si",{"thoughts":"'Et si' is a phrase in French often used to propose a suggestion or to introduce a hypothetical situation.","target_language_multi_word_term":"et si","meaning":"'and if' or 'what if'.","additional_notes":"Typically used to introduce an idea for discussion, a potential scenario, or a suggestion.","target_language_example":"Et si on allait au cinéma ce soir ?","native_language_example":"What if we went to the movies tonight?"}]
["ex-femme",{"thoughts":"'Ex-femme' is a compound word consisting of 'ex,' meaning former, and 'femme,' meaning wife, thus denoting a former wife or ex-wife. This term is useful in personal contexts to describe someone's previous marital status.","target_language_multi_word_term":"ex-femme","meaning":"'ex-wife'.","additional_notes":"Used to refer to a woman to whom someone was formerly married.","target_language_example":"Il a invité son ex-femme à la fête.","native_language_example":"He invited his ex-wife to the party."}]
["excuse-moi",{"thoughts":"'Excuse-moi' is a French phrase commonly used in casual contexts to ask for pardon or to get someone's attention. It is the informal version of 'excusez-moi', which is used in more formal contexts.","target_language_multi_word_term":"excuse-moi","meaning":"'excuse me' or 'pardon me'.","additional_notes":"Used to apologize or politely interrupt someone when speaking. It is the singular informal version, typically used with friends, family, or peers.","target_language_example":"Excuse-moi, tu as l'heure ?","native_language_example":"Excuse me, do you have the time?"}]
["excusez-moi",{"thoughts":"'Excusez-moi' is a formal French phrase used to politely attract someone's attention or to apologize.","target_language_multi_word_term":"excusez-moi","meaning":"'excuse me'.","additional_notes":"Used in formal or neutral contexts when trying to pass through a crowd, or to get someone's attention politely, or to apologize for minor things.","target_language_example":"Excusez-moi, pourriez-vous m'indiquer le chemin pour aller à la gare ?","native_language_example":"Excuse me, could you show me the way to the train station?"}]
["faire aller",{"thoughts":"'Faire aller' in French is an informal expression that conveys the idea of coping or managing in a situation, often despite difficulties. It's similar to saying 'make do' in English.","target_language_multi_word_term":"faire aller","meaning":"'make do' or 'get by'.","additional_notes":"Used when facing less than ideal circumstances and you need to manage with what is available.","target_language_example":"Même sans voiture, on va faire aller.","native_language_example":"Even without a car, we'll make do."}]
["faire attention",{"thoughts":"'Faire attention' is a French phrase used to mean being careful or paying attention. This is a useful phrase for beginner learners when they're learning phrases that indicate caution or mindfulness.","target_language_multi_word_term":"faire attention","meaning":"'to pay attention' or 'to be careful'.","additional_notes":"Used when someone needs to be alert or cautious about something. A very common phrase in safety instructions and daily advice.","target_language_example":"Fais attention en traversant la rue.","native_language_example":"Be careful when crossing the street."}]
["faire avec",{"thoughts":"'Faire avec' is a French phrase meaning 'to make do with' or 'to put up with'. It's used when someone has to manage with a situation or resources that are not ideal. Beginner learners should understand this term as part of daily expressions about handling less-than-ideal circumstances.","target_language_multi_word_term":"faire avec","meaning":"to make do with","additional_notes":"'Faire avec' expresses acceptance of circumstances or limitations, suggesting a practical approach to dealing with available resources or situations.","target_language_example":"Nous devons faire avec ce que nous avons.","native_language_example":"We have to make do with what we have."}]
["faire bien",{"thoughts":"The term 'faire bien' is a combination of the verb 'faire' (to do/make) and 'bien' (well). It's used to express doing something well or correctly. It's often used when giving advice or evaluating an action.","target_language_multi_word_term":"faire bien","meaning":"to do well","additional_notes":"Often used to describe actions that are performed correctly or in a satisfactory manner. Also can be used in an advisory sense, suggesting that performing an action well is advisable.","target_language_example":"Il faut faire bien les choses dès le début.","native_language_example":"You must do things well from the start."}]
["faire bon",{"thoughts":"\"Faire bon\" is often part of larger expressions in French, generally meaning 'to yield good results' or 'to create a good situation,' and is typically combined with other words. It's useful for beginners to understand in contexts involving results or outcomes.","target_language_multi_word_term":"faire bon","meaning":"'to yield good results' or 'to create a good situation.'","additional_notes":"It is often used in expressions such as 'faire bon ménage' (to get along well) or 'faire bon accueil' (to give a warm welcome).","target_language_example":"Ils ont fait bon voyage.","native_language_example":"They had a good trip."}]
["faire bon voyage",{"thoughts":"'Faire bon voyage' is a French expression used to wish someone a good trip or safe travels. It is commonly used before someone leaves on a journey.","target_language_multi_word_term":"faire bon voyage","meaning":"'have a good trip'.","additional_notes":"This phrase is commonly used to express good wishes to someone who is about to travel. It's akin to saying 'safe travels' or 'bon voyage' in English.","target_language_example":"J'espère que tu vas faire bon voyage.","native_language_example":"I hope you have a good trip."}]
["faire confiance",{"thoughts":"'Faire confiance' is a French phrase used to express the act of trusting or having confidence in someone or something. It's an essential term for building relationships and confidence in everyday situations.","target_language_multi_word_term":"faire confiance","meaning":"to trust or to have confidence.","additional_notes":"Commonly used with the preposition 'à', as in 'faire confiance à quelqu'un', meaning 'to trust someone'.","target_language_example":"Je fais confiance à mon ami.","native_language_example":"I trust my friend."}]
["faire diversion",{"thoughts":"'Faire diversion' means to create a distraction or divert attention. It's a useful phrase for talking about situations where someone's trying to shift focus away from something.","target_language_multi_word_term":"faire diversion","meaning":"'to create a distraction'.","additional_notes":"It is widely used to indicate a deliberate attempt to redirect people's attention from one subject to another.","target_language_example":"Il a essayé de faire diversion pour éviter les questions difficiles.","native_language_example":"He tried to create a distraction to avoid the tough questions."}]
["faire du bien",{"thoughts":"The phrase 'faire du bien' translates to 'to do good' or 'to be good for' in English. It's used when talking about something having a positive effect or benefit. Beginners should understand this term as something that is beneficial for someone's well-being or health.","target_language_multi_word_term":"faire du bien","meaning":"'to do good' or 'to be beneficial'.","additional_notes":"The phrase is often used when talking about actions or things that are good for someone's health or mood, like exercise or a particular type of food.","target_language_example":"Faire du sport fait du bien à la santé.","native_language_example":"Exercising is good for one's health."}]
["faire gaffe",{"thoughts":"'Faire gaffe' is a colloquial French expression meaning to be careful or to watch out. It's an informal phrase often used in everyday conversation.","target_language_multi_word_term":"faire gaffe","meaning":"be careful or watch out.","additional_notes":"An informal way to suggest caution or alertness, similar to saying 'watch it' or 'be careful' in English.","target_language_example":"Fais gaffe en traversant la rue.","native_language_example":"Be careful crossing the street."}]
["faire mieux de",{"thoughts":"The phrase 'faire mieux de' is a French idiomatic expression used to give advice or make a suggestion. It's similar to saying 'had better' in English, often used to indicate that taking a certain action is advisable or necessary.","target_language_multi_word_term":"faire mieux de","meaning":"'had better'.","additional_notes":"Used to recommend or advise someone to do something, usually because not doing it could lead to negative consequences.","target_language_example":"Tu ferais mieux de partir avant la pluie.","native_language_example":"You'd better leave before the rain."}]
["faire plaisir",{"thoughts":"'Faire plaisir' is a common French phrase used to express making someone happy or doing something that someone will enjoy.","target_language_multi_word_term":"faire plaisir","meaning":"to please or make happy.","additional_notes":"Often used to describe actions taken to make others happy or to bring joy. Can apply to both small gestures and significant efforts.","target_language_example":"Ça me fait plaisir de te voir.","native_language_example":"It makes me happy to see you."}]
["faire pour",{"thoughts":"'Faire pour' is a French phrase often used to discuss efforts or methods to achieve something, usually followed by an infinitive verb indicating the specific action wanted or needed to be taken. Beginners might encounter it when expressing intentions or actions taken to accomplish a goal or solve a problem.","target_language_multi_word_term":"faire pour","meaning":"'do to' or 'do in order to'.","additional_notes":"Commonly used followed by an infinitive verb to express actions taken to achieve a specific purpose.","target_language_example":"Je vais tout faire pour réussir cet examen.","native_language_example":"I will do everything to pass this exam."}]
["faire savoir",{"thoughts":"'Faire savoir' is a French phrase that means to let someone know or to make something known. It's a useful expression for beginners to learn to express communication of information.","target_language_multi_word_term":"faire savoir","meaning":"to let (someone) know.","additional_notes":"Often used to communicate information or news to someone, and can also mean to inform or announce.","target_language_example":"Je vais lui faire savoir demain.","native_language_example":"I will let him know tomorrow."}]
["faire semblant",{"thoughts":"\"Faire semblant\" is a common French expression that means to pretend or to act as if something is the case when it is not. This concept might be useful in situations involving feelings, intentions, or actions that are not genuine.","target_language_multi_word_term":"faire semblant","meaning":"'to pretend'.","additional_notes":"Used when someone acts in a way that is not genuine or true, often to deceive or mislead others.","target_language_example":"Il fait semblant d'être malade pour éviter le travail.","native_language_example":"He pretends to be sick to avoid work."}]
["faire un tour",{"thoughts":"\"Faire un tour\" is a French expression commonly used to express the idea of going for a walk or a leisurely outing. It is versatile and can refer to taking a short trip or even a ride, depending on the context. It’s useful for beginner learners as it’s part of everyday conversation when talking about casual activities.","target_language_multi_word_term":"faire un tour","meaning":"'go for a walk' or 'take a trip'.","additional_notes":"Used when referring to a casual or leisurely walk, ride, or short excursion. It can be used in various contexts, from strolling through the neighborhood to taking a quick drive.","target_language_example":"Nous allons faire un tour au parc cet après-midi.","native_language_example":"We are going for a walk in the park this afternoon."}]
["fait que",{"thoughts":"'Fait que' is frequently used in French to indicate causation or to point out a consequence. It is often seen in phrases that say something like 'the fact that...' in English.","target_language_multi_word_term":"fait que","meaning":"'the fact that' or 'due to the fact that'.","additional_notes":"Used to introduce a clause and often indicates causation or explanation.","target_language_example":"Le fait que tu sois là change tout.","native_language_example":"The fact that you are here changes everything."}]
["grand jour",{"thoughts":"The term 'grand jour' translates literally to 'big day' and is used in French to denote an important or significant day, often one that is eagerly anticipated or celebrated.","target_language_multi_word_term":"grand jour","meaning":"'big day'.","additional_notes":"Used to refer to significant occasions such as weddings, graduations, or any other major life event.","target_language_example":"Aujourd'hui est le grand jour de leur mariage.","native_language_example":"Today is the big day of their wedding."}]
["grand-mère",{"thoughts":"'Grand-mère' is a French term for a family member that is commonly referred to in daily conversations. It directly translates to an English family term and is relevant to learn for identifying family relationships.","target_language_multi_word_term":"grand-mère","meaning":"'grandmother'.","additional_notes":"Refers to the mother of a person's parent. Similar to English, can also be affectionately referred to as 'mamie' in French.","target_language_example":"Ma grand-mère me raconte toujours des histoires.","native_language_example":"My grandmother always tells me stories."}]
["grand-père",{"thoughts":"'Grand-père' is a term used for a male family member, specifically the father of one's parent, commonly known as 'grandfather' in English. This term is important for language learners as family vocabulary is a common topic in early language education.","target_language_multi_word_term":"grand-père","meaning":"'grandfather'.","additional_notes":"Used to refer to the father of one's father or mother. The word can sometimes appear with the definite article 'le,' as in 'le grand-père,' especially when talking about a specific person's grandfather.","target_language_example":"Mon grand-père aime raconter des histoires.","native_language_example":"My grandfather likes to tell stories."}]
["grâce à",{"thoughts":"'Grâce à' is a common French expression used to indicate gratitude or credit for something, often translated as 'thanks to' in English. It's a useful phrase for expressing positive outcomes or circumstances attributed to someone or something.","target_language_multi_word_term":"grâce à","meaning":"'thanks to'.","additional_notes":"Used to credit a person, thing, or condition as the source of a positive event or situation.","target_language_example":"Nous avons réussi le projet grâce à ton aide.","native_language_example":"We succeeded in the project thanks to your help."}]
["hors de",{"thoughts":"'Hors de' is a French prepositional phrase indicating something is outside of or beyond something else. It's useful in various contexts, including physical space and abstract concepts like control or limits.","target_language_multi_word_term":"hors de","meaning":"outside of or beyond.","additional_notes":"Commonly used to indicate physical space, such as 'outside of a building', or figuratively, for concepts like 'beyond control'.","target_language_example":"Il est hors de la maison.","native_language_example":"He is outside of the house."}]
["il faut",{"thoughts":"'Il faut' is a common French expression used to express necessity or obligation. It's equivalent to 'one must' or 'it is necessary' and is often followed by an infinitive verb or a noun.","target_language_multi_word_term":"il faut","meaning":"'it is necessary' or 'one must'.","additional_notes":"Commonly used to indicate that something needs to be done. It doesn't specify who must do it, which makes it quite general. Often used in impersonal constructions.","target_language_example":"Il faut étudier pour réussir.","native_language_example":"It is necessary to study in order to succeed."}]
["il le faut",{"thoughts":"'Il le faut' is a French expression used to indicate necessity or obligation, similar to saying 'it's necessary' or 'it must be done' in English. It's not frequently used in everyday conversation, but understanding it can be beneficial for comprehension.","target_language_multi_word_term":"il le faut","meaning":"\"it is necessary\"","additional_notes":"This phrase conveys something that must be done or an obligation that must be met. It is often used to express the importance of an action or decision.","target_language_example":"Pour réussir, il le faut.","native_language_example":"To succeed, it is necessary."}]
["il y a",{"thoughts":"'Il y a' is a very common phrase in French, used to indicate presence or existence, similar to 'there is' or 'there are' in English. It can also be used to talk about time in the past, making it essential for both descriptive and narrative contexts.","target_language_multi_word_term":"il y a","meaning":"'there is' or 'there are'.","additional_notes":"Used to state the existence of something in a place or time. Can also refer to a time period ago when discussing the past (e.g., three days ago).","target_language_example":"Il y a un chat sur la table.","native_language_example":"There is a cat on the table."}]
["il y en a",{"thoughts":"'Il y en a' is a French phrase used to indicate the existence or presence of some things or some people among others. It's useful for highlighting that these things are part of a larger group or to emphasize the extent or quantity of items or people present.","target_language_multi_word_term":"il y en a","meaning":"'there are some'.","additional_notes":"Commonly used to refer to the presence of certain things among others, often to bring attention to them or emphasize quantity.","target_language_example":"Il y en a beaucoup dans le parc.","native_language_example":"There are many of them in the park."}]
["j'ai une question",{"thoughts":"The phrase 'j'ai une question' is used in French to politely indicate that the speaker has a query or something they would like clarified. It's a straightforward way to interject with a question in a conversation or presentation, similar to saying 'I have a question' in English.","target_language_multi_word_term":"j'ai une question","meaning":"I have a question.","additional_notes":"Commonly used in classrooms, meetings, or any situations where asking questions is appropriate. It's a polite and direct way to indicate a desire for further information.","target_language_example":"Excusez-moi, j'ai une question à poser.","native_language_example":"Excuse me, I have a question to ask."}]
["j'ai à faire",{"thoughts":"The phrase 'j'ai à faire' is commonly used in French to express having something to do. It's a versatile expression that allows the speaker to indicate they have tasks, duties, or engagements. This term is important for beginners to understand contexts where someone is busy or occupied with activities.","target_language_multi_word_term":"j'ai à faire","meaning":"'I have something to do'.","additional_notes":"Used to indicate one is busy or engaged with tasks or responsibilities.","target_language_example":"Je ne peux pas venir ce soir, j'ai à faire.","native_language_example":"I can't come tonight, I have something to do."}]
["j'sais pas",{"thoughts":"The contraction 'j'sais pas' is a casual colloquial form of 'je ne sais pas', meaning 'I don't know'. It's often used in spoken French to express uncertainty or lack of knowledge in an informal way.","target_language_multi_word_term":"j'sais pas","meaning":"'I don't know'.","additional_notes":"A shortened and informal version of 'je ne sais pas', this phrase is frequently used in conversational French to convey uncertainty or lack of knowledge.","target_language_example":"- Tu sais où est le parc?\n- J'sais pas.","native_language_example":"- Do you know where the park is?\n- I don't know."}]
["je fais aller",{"thoughts":"'Je fais aller' is a colloquial expression in French that implies carrying on or getting by despite difficulties or imperfections. It's not about thriving, but rather managing or coping with a situation.","target_language_multi_word_term":"je fais aller","meaning":"\"I'm managing\" or \"I'm getting by.\"","additional_notes":"Used in informal contexts, often in response to questions about how one is doing. It expresses that things are not perfect but manageable.","target_language_example":"- Comment ça va ? - Je fais aller.","native_language_example":"- How are you? - I'm getting by."}]
["je ne comprends pas",{"thoughts":"'Je ne comprends pas' is a basic French expression used to express a lack of understanding.","target_language_multi_word_term":"je ne comprends pas","meaning":"'I don't understand'.","additional_notes":"Used when someone doesn't understand something that was said or explained. Essential in everyday conversations when language barriers arise.","target_language_example":"Pardon, je ne comprends pas.","native_language_example":"Sorry, I don't understand."}]
["je ne dis pas",{"thoughts":"The phrase 'je ne dis pas' is a basic negative construction in French, useful for expressing that one is not saying something. It's important for beginners to understand how negation is formed in French, with 'ne...pas' around the verb. The phrase is direct and often used in conversations.","target_language_multi_word_term":"je ne dis pas","meaning":"'I am not saying'.","additional_notes":"Uses the common French negation structure 'ne...pas'. It is used to disagree or clarify something that one is not claiming or asserting.","target_language_example":"Je ne dis pas que c'est impossible.","native_language_example":"I am not saying that it's impossible."}]
["je ne pense pas",{"thoughts":"'Je ne pense pas' is a phrase used to express doubt or disagreement, essentially meaning 'I don't think so' in English.","target_language_multi_word_term":"je ne pense pas","meaning":"'I don't think so'.","additional_notes":"Used to express doubt, disagreement, or uncertainty about something that has been stated or asked.","target_language_example":"Il va pleuvoir demain ? Je ne pense pas.","native_language_example":"Will it rain tomorrow? I don't think so."}]
["je ne sais pas",{"thoughts":"'Je ne sais pas' is a very common French phrase that beginner learners will frequently encounter. It is used to express a lack of knowledge or certainty about something, and is equivalent to 'I don't know' in English. Understanding how to use this phrase can be very useful when trying to communicate in situations where you might not understand something or lack the information.","target_language_multi_word_term":"je ne sais pas","meaning":"'I don't know.'","additional_notes":"Often used in conversation when you're uncertain or don't have the information requested. Very common in daily speech.","target_language_example":"Je ne sais pas où il est.","native_language_example":"I don't know where he is."}]
["je ne te dis pas",{"thoughts":"'Je ne te dis pas' is a phrase used for emphasis to stress that something is evident or goes without saying.","target_language_multi_word_term":"je ne te dis pas","meaning":"'I'm telling you' or 'I'm not even mentioning that'.","additional_notes":"Used often to emphasize the obviousness of a statement or action, or to point out something that is implicitly understood. This phrase can be context-dependent and can sometimes express irony or exaggeration.","target_language_example":"Je ne te dis pas comme elle était énervée après cela.","native_language_example":"I'm telling you she was so upset after that."}]
["je t'aime",{"thoughts":"'Je t'aime' is a very commonly used phrase of endearment in French, expressing romantic or deep affection for someone.","target_language_multi_word_term":"je t'aime","meaning":"'I love you'.","additional_notes":"Used to express romantic love, affection, or strong fondness. Commonly used with partners, family, or close friends.","target_language_example":"Je t'aime plus que tout au monde.","native_language_example":"I love you more than anything in the world."}]
["je t'en prie",{"thoughts":"'Je t'en prie' is a polite way of saying 'you're welcome' or 'please, go ahead' in French. It is the informal version, used in familiar settings.","target_language_multi_word_term":"je t'en prie","meaning":"'you're welcome' or 'please'.","additional_notes":"Used informally with friends, family, or peers. Equivalent to 'de rien'. As an invitation to proceed, it's similar to 'please, go ahead'.","target_language_example":"Quand il m'a remercié, j'ai répondu : \"Je t'en prie.\"","native_language_example":"When he thanked me, I replied: \"You're welcome.\""}]
["je vais aller",{"thoughts":"'Je vais aller' is a phrase that combines the present tense of 'aller' used as an auxiliary verb with the infinitive form of 'aller' itself. It is often used to express a plan or intention to go somewhere shortly. This construction helps beginners become familiar with forming basic future intentions.","target_language_multi_word_term":"je vais aller","meaning":"I am going to go.","additional_notes":"This phrase is part of the near future construction in French, often used to express intentions or future plans. It is constructed with 'aller' (to go) in the present tense and an infinitive verb. Useful for daily conversations about immediate plans.","target_language_example":"Je vais aller au marché demain.","native_language_example":"I am going to go to the market tomorrow."}]
["je vois",{"thoughts":"'Je vois' is a simple phrase used by French speakers that translates directly to 'I see' in English. It is useful for beginners as it can be used to confirm understanding or acknowledgment in a conversation.","target_language_multi_word_term":"je vois","meaning":"'I see'.","additional_notes":"Used to signal understanding, agreement, or to show that you are paying attention to the speaker.","target_language_example":"Ah, je vois ce que tu veux dire.","native_language_example":"Ah, I see what you mean."}]
["je vous en prie",{"thoughts":"'Je vous en prie' is a polite phrase in French that serves as a common response to being thanked. It can also be used to invite someone to do something or offer reassurance.","target_language_multi_word_term":"je vous en prie","meaning":"'you're welcome' or 'please' (formal).","additional_notes":"Used in formal situations. It can be used as a reply to 'thank you', or to encourage someone to proceed.","target_language_example":"- Je vous remercie! - Je vous en prie.","native_language_example":"- Thank you! - You're welcome."}]
["jeune homme",{"thoughts":"'Jeune homme' is a term that refers to a young man or male youth. It is often a polite or friendly way to address or refer to a male who is relatively younger, typically in his teens or twenties.","target_language_multi_word_term":"jeune homme","meaning":"'young man' or 'young male'.","additional_notes":"Used to refer to a male youth or a man of young age. Can be used in various contexts, such as addressing someone directly or describing someone.","target_language_example":"Ce jeune homme vient de terminer ses études.","native_language_example":"This young man just finished his studies."}]
["joyeux anniversaire",{"thoughts":"\"Joyeux anniversaire\" is a very common phrase in French used to wish someone a happy birthday. In English, this is equivalent to saying 'happy birthday'. For a beginner learning French, understanding this phrase is useful for social interactions and cultural exchanges. The phrase combines 'joyeux', meaning 'joyous' or 'happy', with 'anniversaire', meaning 'birthday'.","target_language_multi_word_term":"joyeux anniversaire","meaning":"'happy birthday'.","additional_notes":"Used to wish someone well on their birthday. Often accompanied by celebrations and gifting.","target_language_example":"Joyeux anniversaire, Marie!","native_language_example":"Happy birthday, Marie!"}]
["la faire",{"thoughts":"'La faire' is a combination of a definite article and a verb, which can mean to do 'it' or refer to completing a certain task. It's commonly used when a feminine noun is implied, and is a pronoun associated with the feminine singular noun.","target_language_multi_word_term":"la faire","meaning":"'to do it' (for a feminine singular noun).","additional_notes":"Used when referring to the completion of a task represented by a feminine noun. It is a pronoun for 'it' in this context.","target_language_example":"Je vais la faire demain.","native_language_example":"I will do it tomorrow."}]
["la ferme",{"thoughts":"\"La ferme\" is commonly used in French as an imperative expression to tell someone to be quiet, and literally translates to 'the farm'.","target_language_multi_word_term":"la ferme","meaning":"\"shut up\" (implied politely, \"be quiet\").","additional_notes":"Used informally to tell someone to be quiet. Literally translates to 'the farm', but in context, it's an idiomatic expression.","target_language_example":"La ferme, j'essaie de me concentrer.","native_language_example":"Be quiet, I'm trying to concentrate."}]
["la plupart",{"thoughts":"The term 'la plupart' is frequently used in French to mean 'most' and it generally requires a definite article like 'des' when followed by a plural noun.","target_language_multi_word_term":"la plupart","meaning":"'most'.","additional_notes":"Used to indicate the majority of something. Often followed by 'des' when paired with a noun (e.g., 'la plupart des gens').","target_language_example":"La plupart des gens aiment le chocolat.","native_language_example":"Most people like chocolate."}]
["la ramener",{"thoughts":"'La ramener' is an informal French expression that means to boast or to show off. It's often used in a colloquial context to refer to someone who is drawing attention to themselves in a boastful or annoying way.","target_language_multi_word_term":"la ramener","meaning":"'to brag' or 'to show off'.","additional_notes":"This term is colloquial and often used in informal settings to describe someone who is being unnecessarily boastful or arrogant.","target_language_example":"Il aime toujours la ramener quand il réussit quelque chose.","native_language_example":"He always likes to show off when he achieves something."}]
["laisser tomber",{"thoughts":"\"Laisser tomber\" is an informal expression used in French to indicate giving up on something or abandoning a topic of discussion. It's often used like saying \"never mind\" or \"forget it\" in English.","target_language_multi_word_term":"laisser tomber","meaning":"to drop it or forget it.","additional_notes":"Commonly used to suggest stopping an action or discontinuing a conversation. It implies that the matter is no longer of importance.","target_language_example":"Si tu ne veux pas en parler, laisse tomber.","native_language_example":"If you don't want to talk about it, just drop it."}]
["le chercher",{"thoughts":"'Le chercher' in French means 'to look for him' or 'to seek him'. It's a combination of the definite article 'le' (him/it) and the verb 'chercher' (to look for).","target_language_multi_word_term":"le chercher","meaning":"'to look for him' or 'to seek him'.","additional_notes":"Used when referring to seeking, looking for, or searching for a male person or a masculine noun in a sentence.","target_language_example":"Je vais le chercher à la gare.","native_language_example":"I'm going to pick him up at the train station."}]
["le leur",{"thoughts":"'Le leur' is a French phrase that translates idiomatically and is related to possession, equivalent to 'their' or 'theirs' in English. Understanding its usage helps in forming possessive constructions accurately in conversation.","target_language_multi_word_term":"le leur","meaning":"'theirs' or 'their'.","additional_notes":"Used to indicate possession or belonging, emphasizing that the object belongs to them. It's important to note the gender and use the appropriate article: 'le', 'la', 'les', etc.","target_language_example":"Ce livre est le leur.","native_language_example":"This book is theirs."}]
["le mien",{"thoughts":"'Le mien' is a French possessive pronoun that means 'mine' in English.","target_language_multi_word_term":"le mien","meaning":"'mine'.","additional_notes":"Used to indicate possession of something mentioned earlier. The form changes based on the gender and number of the noun it refers to, such as 'la mienne', 'les miens', or 'les miennes'.","target_language_example":"Ce livre est le mien.","native_language_example":"This book is mine."}]
["le nôtre",{"thoughts":"'Le nôtre' is a possessive pronoun in French, meaning 'ours'. It is used to indicate that something belongs to 'us'. A beginner learning French will benefit from understanding this term to express ownership in a sentence.","target_language_multi_word_term":"le nôtre","meaning":"'ours'.","additional_notes":"Used to indicate possession, replacing the noun it refers to. The form 'le nôtre' is masculine singular; other forms exist depending on the gender and number of the noun (e.g., 'la nôtre', 'les nôtres').","target_language_example":"Ce livre est le nôtre.","native_language_example":"This book is ours."}]
["le sien",{"thoughts":"'Le sien' is a possessive pronoun in French used to indicate possession for masculine singular nouns, equivalent to 'his', 'hers', 'its' or 'one's'. It's crucial to understand this when learning possessive pronouns as it helps in constructing sentences that convey ownership or association.","target_language_multi_word_term":"le sien","meaning":"'his', 'hers', 'its', or 'one's'.","additional_notes":"Depends on the context and gender of the noun. Used to show possession or ownership, and can refer to singular masculine nouns previously mentioned.","target_language_example":"Voici son livre, et voilà le sien.","native_language_example":"Here is his book, and there is hers."}]
["le tien",{"thoughts":"'Le tien' is a possessive pronoun in French, used to refer to something that belongs to the person you are talking to, when the noun is masculine and singular.","target_language_multi_word_term":"le tien","meaning":"'yours' (singular, masculine).","additional_notes":"Used to refer to something that is in possession of the second person singular, when the noun is masculine and singular. It replaces the noun itself in a sentence.","target_language_example":"Ce chapeau est le tien.","native_language_example":"This hat is yours."}]
["le vôtre",{"thoughts":"'Le vôtre' is a formal way to say 'yours' in French. It's used for singular or plural nouns that are masculine. It's important for learners to know both the masculine and feminine forms, as they follow noun gender rules in French.","target_language_multi_word_term":"le vôtre","meaning":"'yours'.","additional_notes":"Used to indicate possession in a polite or formal context, matching the gender and number of the noun it refers to.","target_language_example":"Est-ce que ce livre est le vôtre ?","native_language_example":"Is this book yours?"}]
["là-bas",{"thoughts":"The French term 'là-bas' is commonly used in everyday conversation to indicate location, specifically referring to a place that is far away from both the speaker and the listener. It can be translated to 'over there' in English, and is useful for giving directions or describing locations.","target_language_multi_word_term":"là-bas","meaning":"'over there'.","additional_notes":"It is used to refer to a location that is at some distance from the speaker.","target_language_example":"Il y a un bon restaurant là-bas.","native_language_example":"There is a good restaurant over there."}]
["là-dedans",{"thoughts":"The phrase 'là-dedans' is typically used in French to refer to something located 'inside' or 'in there'. It's useful for indicating a location or situation within something or someone previously mentioned in a conversation.","target_language_multi_word_term":"là-dedans","meaning":"'inside' or 'in there'.","additional_notes":"Often used to talk about things located within a defined space or abstract concept previously mentioned.","target_language_example":"Qu'est-ce que tu fais là-dedans ?","native_language_example":"What are you doing in there?"}]
["là-dessus",{"thoughts":"\"Là-dessus\" is a French phrase that translates to 'on that' or 'on top of that'. It can refer literally to a physical position or figuratively to a point in a conversation or argument. This multifaceted usage is typical in conversations and texts.","target_language_multi_word_term":"là-dessus","meaning":"'on that' or 'on top of that'.","additional_notes":"Can refer to a literal physical position on an object or a topic that has been discussed. Often used in conversations to refer back to something that has been mentioned previously.","target_language_example":"Je n'ai pas d'opinion là-dessus.","native_language_example":"I have no opinion on that."}]
["là-haut",{"thoughts":"The term 'là-haut' is a compound of 'là' (there) and 'haut' (up/high) and is used to refer to a place above or upland. It's helpful for learners to recognize it as indicating a higher or elevated position, often in a physical or metaphorical sense.","target_language_multi_word_term":"là-haut","meaning":"'up there' or 'above'.","additional_notes":"It is often used informally to refer to a physical place that is higher up or elevated. Can also be used in a metaphorical sense to indicate a higher status or level in conversation.","target_language_example":"Regarde là-haut dans le ciel.","native_language_example":"Look up there in the sky."}]
["m'en aller",{"thoughts":"The term 'm'en aller' is from the reflexive verb 's'en aller', which is often used in place of 'to leave' or 'to go away'. It implies removing oneself from a particular place and is a common way to express leaving. It's useful for beginners as it helps understand reflexive pronouns and common everyday expressions.","target_language_multi_word_term":"m'en aller","meaning":"'to leave' or 'to go away'.","additional_notes":"The term 'm'en aller' is used to talk about leaving or going away. It is a common, informal expression often used in everyday conversation. It's the first-person singular form of 's'en aller'.","target_language_example":"Je dois m'en aller maintenant.","native_language_example":"I have to leave now."}]
["me direz-vous",{"thoughts":"'Me direz-vous' is a French formal question form using 'vous,' meaning 'will you tell me.' The inversion of the verb and subject pronoun is typical in formal questions.","target_language_multi_word_term":"me direz-vous","meaning":"'will you tell me?'","additional_notes":"This is a formal or polite way of asking someone to tell you something, commonly using the 'vous' form of address. In this construction, the verb and the subject pronoun are inverted, which is typical for forming questions in French.","target_language_example":"Me direz-vous l'heure du rendez-vous ?","native_language_example":"Will you tell me the time of the meeting?"}]
["meilleur ami",{"thoughts":"'Meilleur ami' is a commonly used French term that refers to someone's best friend. This is a foundational concept for learners, as friendships are universal and important in cultural contexts.","target_language_multi_word_term":"meilleur ami","meaning":"'best friend'.","additional_notes":"Typically refers to a male best friend. For a female best friend, use 'meilleure amie'. It expresses a very close friendship.","target_language_example":"Il est mon meilleur ami depuis l'enfance.","native_language_example":"He has been my best friend since childhood."}]
["merci beaucoup",{"thoughts":"'Merci beaucoup' is a polite phrase used frequently to express gratitude in French. It directly translates to a more emphatic 'thank you very much', making it a useful term for learners to know in order to show appreciation or politeness.","target_language_multi_word_term":"merci beaucoup","meaning":"'thank you very much'.","additional_notes":"Used when you want to show a high degree of gratitude. It can be used in both formal and informal situations when responding to a favor, gift, or service.","target_language_example":"Merci beaucoup pour votre aide.","native_language_example":"Thank you very much for your help."}]
["mon Dieu",{"thoughts":"\"Mon Dieu\" is a French exclamation used to express surprise, shock, or strong emotion. It's similar to saying \"Oh my God\" in English.","target_language_multi_word_term":"mon Dieu","meaning":"\"Oh my God.\"","additional_notes":"Used as an exclamation to express surprise, alarm, or exasperation, often similar to the English usage but less formal or religiously intense.","target_language_example":"Mon Dieu, qu'est-ce qui s'est passé ?","native_language_example":"Oh my God, what happened?"}]
["mon vieux",{"thoughts":"\"Mon vieux\" is a casual and friendly term of endearment in French, typically used among friends or to address someone in a familiar manner. It literally translates to \"my old one\" but is equivalent to saying \"my buddy\" or \"pal\" in English. It's important for beginners to recognize that this phrase is informal and should be used in appropriate contexts to match familiarity.","target_language_multi_word_term":"mon vieux","meaning":"my buddy or pal.","additional_notes":"Informal term of endearment or address, usually in conversations between friends or familiar acquaintances.","target_language_example":"Ça va, mon vieux ?","native_language_example":"How's it going, buddy?"}]
["même pas",{"thoughts":"\"Même pas\" is a French phrase used to express disbelief or dismissal, similar to saying \"not even\" or \"didn't even\" in English. It can be used to highlight that something didn't happen as expected or to downplay an action or event.","target_language_multi_word_term":"même pas","meaning":"\"not even\".","additional_notes":"Used to express disbelief or to emphasize that something didn't occur or wasn't done at all.","target_language_example":"Il a dit qu'il allait venir, mais il n'est même pas venu.","native_language_example":"He said he was going to come, but he didn't even show up."}]
["n'est-ce pas",{"thoughts":"'N'est-ce pas' is a phrase often used in French to add a tag question at the end of a sentence for confirmation or agreement, similar to 'isn't it?' or 'right?' in English. It's a way to ask for validation or to ensure someone is following what you are saying.","target_language_multi_word_term":"n'est-ce pas","meaning":"'isn't it?' or 'right?'.","additional_notes":"Commonly used at the end of statements to seek agreement or confirmation from the listener.","target_language_example":"Il fait beau aujourd'hui, n'est-ce pas ?","native_language_example":"It's nice weather today, isn't it?"}]
["n'importe où",{"thoughts":"'N'importe où' is a French phrase used to indicate any location or place without specifying which one.","target_language_multi_word_term":"n'importe où","meaning":"'anywhere' or 'wherever'.","additional_notes":"Used when the specific place is not important. It implies that any place will do, without distinguishing between them.","target_language_example":"Tu peux t'asseoir n'importe où.","native_language_example":"You can sit anywhere."}]
["n'importe quoi",{"thoughts":"The French term 'n'importe quoi' is often used to express indifference, disbelief, or dismissal, and is very common in everyday conversation. It can mean 'anything' in neutral contexts, but in a pejorative sense, it implies 'nonsense' or 'rubbish'.","target_language_multi_word_term":"n'importe quoi","meaning":"'anything', 'nonsense', or 'whatever'.","additional_notes":"Commonly used to express disbelief or to describe something as nonsensical or ridiculous. Can be used in a neutral sense to mean 'anything', but frequently carries a negative connotation in informal speech.","target_language_example":"Ce que tu racontes est n'importe quoi !","native_language_example":"What you're saying is nonsense!"}]
["ne jamais",{"thoughts":"'Ne jamais' is a negation phrase used to express actions that never happen or states that never occur.","target_language_multi_word_term":"ne jamais","meaning":"'never'.","additional_notes":"'Ne jamais' is used as a temporal negation in sentences, often with verbs, to express that an action does not happen at any time.","target_language_example":"Il ne mange jamais de viande.","native_language_example":"He never eats meat."}]
["ne jamais dire jamais",{"thoughts":"The French expression 'ne jamais dire jamais' translates to 'never say never' and is used similarly to the English phrase, often suggesting that one should keep an open mind about possibilities or future changes.","target_language_multi_word_term":"ne jamais dire jamais","meaning":"'never say never'.","additional_notes":"This phrase is used to advise someone to remain open to possibilities, acknowledging that situations can change and things once thought impossible might happen.","target_language_example":"Elle disait qu'elle n'irait jamais vivre à l'étranger, mais ne jamais dire jamais.","native_language_example":"She said she would never live abroad, but never say never."}]
["ne pas",{"thoughts":"'Ne pas' is the standard way to form negations in French. It's similar to the English 'do not' or 'not'. It surrounds the conjugated verb to negate the action or state described by that verb.","target_language_multi_word_term":"ne pas","meaning":"'not' or 'do not'.","additional_notes":"'Ne pas' is used to negate verbs. It typically surrounds the conjugated verb in a sentence. For example, in 'Je ne parle pas', 'parle' is the verb that is being negated.","target_language_example":"Je ne veux pas y aller.","native_language_example":"I do not want to go there."}]
["ne personne",{"thoughts":"'Ne personne' is a negative construction used to indicate 'no one' or 'nobody' in French, often found wrapping a verb to form negatives in formal writing or speech.","target_language_multi_word_term":"ne personne","meaning":"'no one' or 'nobody'.","additional_notes":"Used in negative sentences to signify the absence of people involved in an action or state. It functions similarly to how 'ne...pas' indicates 'not', but specifically negates the presence of people.","target_language_example":"Je n'ai vu personne au parc.","native_language_example":"I didn't see anyone at the park."}]
["ne plus",{"thoughts":"'Ne plus' is a negative construction in French used to indicate that something is no longer occurring or that a certain state hasn't been true since a particular time. It is essential for basic negation comprehension in French.","target_language_multi_word_term":"ne plus","meaning":"'no longer' or 'not anymore'.","additional_notes":"'Ne plus' is used to negate statements, signifying that something that was once true is now no longer the case. It is often used with verbs and requires the appropriate conjugation of the verb being negated.","target_language_example":"Je ne fume plus.","native_language_example":"I don't smoke anymore."}]
["ne que",{"thoughts":"The phrase 'ne que' is used to express limitation or restriction, and operates similarly to the English 'only'. It's useful for learners to understand this structure since 'ne' is also part of negation in French, but here it implies restriction.","target_language_multi_word_term":"ne que","meaning":"'only'.","additional_notes":"Used to express limitation or restriction, denying any alternative beyond what is stated. It forms part of a structure that limits the subject to the condition imposed by the phrase.","target_language_example":"Elle ne mange que des légumes.","native_language_example":"She only eats vegetables."}]
["ne rien",{"thoughts":"\"Ne rien\" is a French construct used in negative sentences to mean \"nothing.\" It's important for beginner learners to understand how negatives are formed in French, typically with \"ne...rien\" serving the role similar to \"do not...anything\".","target_language_multi_word_term":"ne rien","meaning":"\"not anything\" or \"nothing.\"","additional_notes":"Used to form negative sentences. The \"ne\" comes before the verb and \"rien\" comes after the verb.","target_language_example":"Je ne fais rien aujourd'hui.","native_language_example":"I am doing nothing today."}]
["ne savoir que faire",{"thoughts":"'Ne savoir que faire' is an expression in French used to describe a state of indecision or not knowing what to do.","target_language_multi_word_term":"ne savoir que faire","meaning":"'not knowing what to do'.","additional_notes":"Often used when someone is in a situation where they feel uncertain or overwhelmed and unable to decide on the best course of action.","target_language_example":"Il était tellement stressé qu'il ne savait que faire.","native_language_example":"He was so stressed that he didn't know what to do."}]
["non plus",{"thoughts":"'Non plus' is often used to convey agreement in negation, frequently paired with negative statements to indicate 'either' or 'neither'. It's essential for learners to recognize its use in negative contexts to avoid confusion.","target_language_multi_word_term":"non plus","meaning":"'either' or 'neither'.","additional_notes":"Used to agree with a negative statement, signaling that the speaker is in the same negative situation.","target_language_example":"Je n'aime pas ce film non plus.","native_language_example":"I don't like this movie either."}]
["ouvrir les yeux",{"thoughts":"\"Ouvrir les yeux\" translates literally to \"open the eyes,\" but it's commonly used figuratively to mean becoming aware of something or realizing a truth. It's relevant to beginners as an expression indicating understanding or realization.","target_language_multi_word_term":"ouvrir les yeux","meaning":"'to open one's eyes' or 'to become aware'.","additional_notes":"This phrase can be used both literally and figuratively, often in the context of coming to a new understanding or seeing things clearly.","target_language_example":"Il est temps d'ouvrir les yeux et de voir la réalité.","native_language_example":"It's time to open your eyes and see the reality."}]
["par exemple",{"thoughts":"'Par exemple' is a common phrase used in French to introduce an example or illustrate a point, similar to its usage in English.","target_language_multi_word_term":"par exemple","meaning":"'for example'.","additional_notes":"Used to provide clarification or an illustration to help explain a statement or idea.","target_language_example":"Il y a plusieurs choses à faire, par exemple, nous pouvons aller au cinéma.","native_language_example":"There are several things to do, for example, we can go to the cinema."}]
["par ici",{"thoughts":"'Par ici' is a phrase used to indicate a direction or location, roughly translating to 'this way' or 'over here'. It's useful for directing someone somewhere or letting them know where something is located.","target_language_multi_word_term":"par ici","meaning":"'this way' or 'over here'.","additional_notes":"Often used to guide someone physically or indicate a nearby place or direction. It can be accompanied by a gesture pointing to a particular direction.","target_language_example":"Venez par ici, je vais vous montrer le chemin.","native_language_example":"Come this way, I'll show you the way."}]
["par là",{"thoughts":"'Par là' is a French expression used to vaguely indicate direction or location, similar to 'over there' or 'that way' in English. It is often used in informal contexts when giving directions or describing the location of something.","target_language_multi_word_term":"par là","meaning":"'over there' or 'that way'.","additional_notes":"This term is often used in spoken French to give approximate directions or point to a nearby location or direction without specifying exact details.","target_language_example":"La boulangerie est par là.","native_language_example":"The bakery is over there."}]
["parce que",{"thoughts":"\"Parce que\" is a commonly used conjunction in French that introduces a reason or explanation for something. It's often translated as \"because\" in English, making it useful for explaining reasons and cause-and-effect relationships.","target_language_multi_word_term":"parce que","meaning":"'because'.","additional_notes":"Used to provide a reason or explanation for an action or situation.","target_language_example":"Je suis en retard parce que j'ai manqué le bus.","native_language_example":"I am late because I missed the bus."}]
["parle de",{"thoughts":"'Parle de' is a French phrase used to introduce a topic or subject of conversation. It's often used to direct attention to the subject being discussed or to refer to what someone should talk about.","target_language_multi_word_term":"parle de","meaning":"'talks about' or 'talk about'.","additional_notes":"Used to indicate the subject or topic being discussed. Can be modified to suit different subjects and verb forms, such as 'parler de' for infinitive.","target_language_example":"Elle parle de son voyage.","native_language_example":"She talks about her trip."}]
["pas de",{"thoughts":"The phrase 'pas de' is a French negation structure meaning 'no' or 'not any.' It is used when talking about the absence of something.","target_language_multi_word_term":"pas de","meaning":"'no' or 'not any'.","additional_notes":"Commonly used to express the absence or lack of something, similar to 'no' or 'not any' in English.","target_language_example":"Il n'y a pas de pain.","native_language_example":"There is no bread."}]
["pas de ça",{"thoughts":"The phrase 'pas de ça' is often used to prohibit or show disapproval of something.","target_language_multi_word_term":"pas de ça","meaning":"'none of that.'","additional_notes":"Used to indicate that something is not allowed or not acceptable.","target_language_example":"Pas de ça chez moi!","native_language_example":"None of that in my house!"}]
["pas du tout",{"thoughts":"'Pas du tout' is a French phrase used for strong negation or to emphasize 'not at all'. Beginners should understand that it's often used in response to questions or statements.","target_language_multi_word_term":"pas du tout","meaning":"'not at all'.","additional_notes":"Used to deny completely or to strongly negate a statement or implication. Commonly used in everyday conversations when emphasizing disagreement or the absence of something.","target_language_example":"Tu n'es pas fatigué ? - Non, pas du tout.","native_language_example":"Aren't you tired? - No, not at all."}]
["pas encore",{"thoughts":"'Pas encore' is a French phrase that means 'not yet'. It signifies that something has not happened but is expected to happen in the future.","target_language_multi_word_term":"pas encore","meaning":"'not yet'.","additional_notes":"Often used to indicate that an action or event anticipated by the speaker has not occurred at the present moment but is still expected to occur later.","target_language_example":"Je n'ai pas encore fini mes devoirs.","native_language_example":"I haven't finished my homework yet."}]
["pas que",{"thoughts":"'Pas que' is used in French to imply 'not only' or 'not just', often followed by adding more information to what has already been stated. It's a conversational phrase useful in day-to-day interactions.","target_language_multi_word_term":"pas que","meaning":"'not only' or 'not just'.","additional_notes":"Used to express that something is not the sole factor or issue, usually indicating there is more to consider. Often followed by 'mais aussi' (but also) to add information.","target_language_example":"Il est non seulement intelligent, pas que sportif.","native_language_example":"He is not only intelligent, but also athletic."}]
["penser de",{"thoughts":"'Penser de' is used to express an opinion or ask for someone’s opinion on something.","target_language_multi_word_term":"penser de","meaning":"'to think of/about'.","additional_notes":"This phrase is used when asking for an opinion or what someone thinks about something specific. It is often used in questions.","target_language_example":"Que penses-tu de ce film ?","native_language_example":"What do you think of this movie?"}]
["penser à",{"thoughts":"The term 'penser à' is a commonly used French phrasal verb meaning 'to think about'. It is important for learners to understand its usage as it is frequently used in everyday conversation when referring to the act of considering or holding something in mind.","target_language_multi_word_term":"penser à","meaning":"'to think about'.","additional_notes":"Used when considering something or someone in your thoughts. It requires the preposition 'à' to convey the meaning properly.","target_language_example":"Je dois penser à mon futur.","native_language_example":"I have to think about my future."}]
["petit ami",{"thoughts":"The term 'petit ami' is a compound word, with 'petit' meaning small or little and 'ami' meaning friend. Together, they are often used to indicate a boyfriend in a romantic context. This term is fairly informal and common in everyday conversation.","target_language_multi_word_term":"petit ami","meaning":"boyfriend","additional_notes":"This term is used to refer to a male romantic partner. It's more casual than 'copain' but can be used interchangeably in certain contexts.","target_language_example":"Elle a un petit ami qui est très gentil.","native_language_example":"She has a boyfriend who is very kind."}]
["petite amie",{"thoughts":"'Petite amie' literally translates to 'little friend', but in French, it is the common term used to refer to a girlfriend. Understanding this translation is crucial for beginner learners as it helps grasp how different languages can structure common phrases differently than English.","target_language_multi_word_term":"petite amie","meaning":"girlfriend","additional_notes":"Used to refer to a female romantic partner. The masculine equivalent would be 'petit ami', meaning 'boyfriend'.","target_language_example":"Elle est ma petite amie.","native_language_example":"She is my girlfriend."}]
["peu importe",{"thoughts":"\"Peu importe\" is a French term often used to express indifference or nonchalance about a particular detail or outcome. It is similar to saying 'it doesn't matter' or 'it makes no difference' in English. This phrase can be particularly useful in casual conversations where the specifics are not crucial.","target_language_multi_word_term":"peu importe","meaning":"'it doesn't matter' or 'no matter'.","additional_notes":"Used to indicate indifference to whatever is being discussed, often suggesting that any option is acceptable.","target_language_example":"Peu importe la couleur, prends celle que tu préfères.","native_language_example":"It doesn't matter the color, take the one you prefer."}]
["peu importer",{"thoughts":"'Peu importer' is an expression used to indicate that something is of little importance or doesn't matter.","target_language_multi_word_term":"peu importer","meaning":"'it doesn't matter' or 'no matter'.","additional_notes":"Commonly used when the details or circumstances are not significant or to indicate indifference to different outcomes.","target_language_example":"Peu importe ce qu'il dit.","native_language_example":"It doesn't matter what he says."}]
["peut-être",{"thoughts":"'Peut-être' is a common expression in French used to express uncertainty or possibility. It is equivalent to the English word 'maybe', and is frequently used to indicate that something is not certain.","target_language_multi_word_term":"peut-être","meaning":"'maybe' or 'perhaps'.","additional_notes":"Used to suggest uncertainty or a lack of definite knowledge. Often employed when discussing plans, assumptions, or possibilities.","target_language_example":"Peut-être qu'il viendra demain.","native_language_example":"Maybe he will come tomorrow."}]
["pourquoi pas",{"thoughts":"\"Pourquoi pas\" is a common phrase used to suggest agreement or acceptance of a suggestion, similar to the English phrase \"why not.\"","target_language_multi_word_term":"pourquoi pas","meaning":"'why not'","additional_notes":"Used to agree or show willingness to do something that has been suggested or considered. Often used in casual conversations to express openness to an idea.","target_language_example":"On pourrait aller au cinéma ce soir. — Pourquoi pas.","native_language_example":"We could go to the movies tonight. — Why not."}]
["première fois",{"thoughts":"'Première fois' is a French phrase that means 'first time' in English. It's commonly used to describe the first occurrence of an event or experience.","target_language_multi_word_term":"première fois","meaning":"'first time'.","additional_notes":"Often used to describe a first-time experience or event, similar to how 'first time' is used in English.","target_language_example":"C'est ma première fois en France.","native_language_example":"This is my first time in France."}]
["prendre note",{"thoughts":"'Prendre note' is a common French phrase that means 'to take note' or 'to notice something'. It is used when acknowledging or paying attention to a particular detail or statement.","target_language_multi_word_term":"prendre note","meaning":"'to take note' or 'to notice'.","additional_notes":"Used when someone wants to indicate that they are paying attention to something and acknowledging its importance or relevance.","target_language_example":"Il est important de prendre note des instructions du professeur.","native_language_example":"It's important to take note of the teacher's instructions."}]
["prendre place",{"thoughts":"The phrase 'prendre place' can mean to take a seat, to occur, or to assume a certain position. It's a useful term for beginners to learn in order to describe actions involving sitting down or events happening.","target_language_multi_word_term":"prendre place","meaning":"'to take a seat' or 'to occur'.","additional_notes":"It can be used both literally to mean sitting down, or metaphorically to mean something happening or unfolding.","target_language_example":"La réunion va prendre place dans la salle de conférence.","native_language_example":"The meeting will take place in the conference room."}]
["prendre soin",{"thoughts":"'Prendre soin' is a French expression used to indicate caring for someone or something. It's an action-oriented phrase, useful for beginners to understand basic actions related to care and responsibility.","target_language_multi_word_term":"prendre soin","meaning":"'take care' or 'look after'.","additional_notes":"Used when expressing care or responsibility for someone or something. It can be used in reference to physical well-being or a more general sense of attention and care.","target_language_example":"Je dois prendre soin de mon frère ce soir.","native_language_example":"I need to take care of my brother tonight."}]
["prendre un verre",{"thoughts":"The French phrase 'prendre un verre' is used casually to talk about having a drink, often in a social setting. It's commonly used when inviting someone out.","target_language_multi_word_term":"prendre un verre","meaning":"'to have a drink'.","additional_notes":"Often used to suggest going out for a drink at a bar or café, not necessarily implying alcohol.","target_language_example":"Nous devrions prendre un verre après le travail.","native_language_example":"We should have a drink after work."}]
["puis-je",{"thoughts":"'Puis-je' is a formal French construction used to form polite requests or ask for permission. It is the inversion of \"je peux,\" meaning \"I can.\" This form is typically used in formal writing or speech.","target_language_multi_word_term":"puis-je","meaning":"May I?","additional_notes":"A formal way to ask for permission. Often used in formal situations or polite conversation.","target_language_example":"Puis-je vous aider?","native_language_example":"May I help you?"}]
["qu'aurez-vous",{"thoughts":"This phrase 'qu'aurez-vous' is a future tense construction of a question, meaning 'what will you have' or 'what will you be having'. It's useful for asking about future plans or choices.","target_language_multi_word_term":"qu'aurez-vous","meaning":"'what will you have?'.","additional_notes":"Used when inquiring about future plans or selections one might make. Formal or plural 'you' is implied. ","target_language_example":"Qu'aurez-vous pour le dîner?","native_language_example":"What will you have for dinner?"}]
["qu'auriez-vous",{"thoughts":"This phrase is a combination of 'que' (what) and the conditional form of the verb 'avoir' (to have). It is part of a question format and involves polite or hypothetical contexts often used in formal settings.","target_language_multi_word_term":"qu'auriez-vous","meaning":"\"what would you have\"","additional_notes":"Frequently used in questions to ask what someone would choose or prefer in hypothetical scenarios or polite offers. It's a formal way to inquire.","target_language_example":"Qu'auriez-vous fait à ma place ?","native_language_example":"What would you have done in my place?"}]
["qu'aviez-vous",{"thoughts":"The phrase 'qu'aviez-vous' in French is a part of a past tense form of verbs (plus-que-parfait) or can appear in questions. A beginner might encounter this construction when learning about forming questions about past actions.","target_language_multi_word_term":"qu'aviez-vous","meaning":"'what did you have'.","additional_notes":"Used in questions to inquire about possession or experiences in the past, commonly using the formal 'vous'.","target_language_example":"Qu'aviez-vous pour le déjeuner hier ?","native_language_example":"What did you have for lunch yesterday?"}]
["qu'est-ce qu'il y a",{"thoughts":"The phrase 'qu'est-ce qu'il y a' is commonly used in French to ask about the presence or situation of something. It serves as a general inquiry about what is happening, what is present, or what is wrong.","target_language_multi_word_term":"qu'est-ce qu'il y a","meaning":"\"what's there\" or \"what's up\".","additional_notes":"Often used to ask about the situation, to find out what's happening, or to inquire if something is wrong.","target_language_example":"Qu'est-ce qu'il y a dans le frigo ?","native_language_example":"What's in the fridge?"}]
["qu'est-ce que",{"thoughts":"'Qu'est-ce que' is the go-to question starter for beginners; literally 'what is it that', but functionally just 'what' when asking a question.","target_language_multi_word_term":"qu'est-ce que","meaning":"'what' (question starter)","additional_notes":"Used at the beginning of most direct questions to ask about an object or action. Followed by a subject and verb.","target_language_example":"Qu'est-ce que tu fais ?","native_language_example":"What are you doing?"}]
["qu'est-ce que c'est",{"thoughts":"'Qu'est-ce que c'est' is a basic French question phrase used for asking 'What is this?'. This is particularly relevant for beginners as it helps them identify and inquire about objects or situations they are unfamiliar with.","target_language_multi_word_term":"qu'est-ce que c'est","meaning":"'What is this?'","additional_notes":"A fundamental phrase for identifying objects or situations. Often used when you're unsure about something.","target_language_example":"Qu'est-ce que c'est sur la table?","native_language_example":"What is this on the table?"}]
["qu'est-ce qui",{"thoughts":"\"Qu'est-ce qui\" is a French phrase used to introduce questions about the subject of a sentence, often translating to 'what' in English. It's important for learners to note that it focuses on the subject, unlike 'qu'est-ce que', which focuses on the object.","target_language_multi_word_term":"qu'est-ce qui","meaning":"'what' (subject of a question).","additional_notes":"Used to inquire about the subject performing the action in a sentence. Commonly used when asking questions about what is happening or who is doing something.","target_language_example":"Qu'est-ce qui se passe ?","native_language_example":"What is happening?"}]
["qu'eûtes-vous",{"thoughts":"'Qu'eûtes-vous' is the inverted question form using the past anterior tense, which is a literary tense. It's relevant for advanced learners and might still pique interest for beginners interested in literary French, but it's not commonly used in everyday language.","target_language_multi_word_term":"qu'eûtes-vous","meaning":"'what did you have'.","additional_notes":"This phrase uses the past anterior tense (also known as the 'passé antérieur'), which is a literary tense used after expressions like 'après que' in formal writing to indicate a past action that happened directly before another past action. Beginners may not encounter it often outside of classical literature.","target_language_example":"Qu'eûtes-vous fait après son départ ?","native_language_example":"What did you do after he left?"}]
["qu'y a-t-il",{"thoughts":"'Qu'y a-t-il' is a formal way to ask 'what is there?' or 'what's going on?' in French, often used to inquire about a situation or the presence of something.","target_language_multi_word_term":"qu'y a-t-il","meaning":"'what's there?' or 'what is it?'","additional_notes":"Used to inquire about the presence of something or the nature of a situation, typically in formal contexts.","target_language_example":"Qu'y a-t-il dans ce sac?","native_language_example":"What's in this bag?"}]
["quand même",{"thoughts":"'Quand même' is a flexible phrase in French that can express contrast, concession, or emphasize surprise. It's important for beginners to know because it appears in various contexts in both formal and informal speech.","target_language_multi_word_term":"quand même","meaning":"'even so' or 'still'.","additional_notes":"It is often used to indicate that something is true despite previous expectations or assumptions to the contrary, or to soften or modify a previously made statement.","target_language_example":"Il fait froid, mais je vais sortir quand même.","native_language_example":"It's cold, but I'm going out anyway."}]
["que de",{"thoughts":"The phrase 'que de' is used to express a large quantity of something. It is an exclamatory expression often used to emphasize the abundance of a particular object or subject.","target_language_multi_word_term":"que de","meaning":"'so many' or 'so much'.","additional_notes":"Used to emphasize a large quantity of something, followed by a noun. It can be positive or negative, depending on the context.","target_language_example":"Que de livres dans cette bibliothèque !","native_language_example":"So many books in this library!"}]
["que dis-je",{"thoughts":"\"Que dis-je\" is an expression often used in French to correct oneself or to indicate that the speaker is reconsidering or clarifying what they just said. It's equivalent to \"I mean\" or \"what am I saying\" in English, typically used in spoken language for self-correction.","target_language_multi_word_term":"que dis-je","meaning":"'I mean' or 'what am I saying'.","additional_notes":"Used when the speaker wants to modify a previous statement or correct themselves.","target_language_example":"Il est très talentueux, que dis-je, il est un génie!","native_language_example":"He is very talented, I mean, he is a genius!"}]
["que je sache",{"thoughts":"The French term 'que je sache' is a common phrase used to express doubt or uncertainty. It translates to 'as far as I know' in English. This phrase is in the subjunctive mood, which might be less familiar to beginners but important for expressing opinions or uncertain information.","target_language_multi_word_term":"que je sache","meaning":"'as far as I know'.","additional_notes":"Used to indicate the speaker's limited knowledge or awareness of a fact. It is often used to preface statements that the speaker believes to be true but is not completely sure about.","target_language_example":"Il n'a pas encore répondu, que je sache.","native_language_example":"He hasn't replied yet, as far as I know."}]
["que tu crois",{"thoughts":"'Que tu crois' is a relative or subordinate clause that can be used to express doubt, disbelief, or assumptions about a situation or statement.","target_language_multi_word_term":"que tu crois","meaning":"'that you believe'.","additional_notes":"Often used in expressions to challenge or question someone's belief or assumption.","target_language_example":"Tu penses vraiment que tu crois tout ce qu'il dit?","native_language_example":"Do you really think you believe everything he says?"}]
["que veux-tu",{"thoughts":"\"Que veux-tu\" is a question form using inversion, meaning \"what do you want.\" It's useful for learners to recognize this structure as a common way to ask direct questions in French.","target_language_multi_word_term":"que veux-tu","meaning":"what do you want?","additional_notes":"This phrase is a direct question using subject-verb inversion, commonly used in formal or written French. In casual conversation, the structure might change to 'tu veux quoi ?'","target_language_example":"Que veux-tu pour le dîner ?","native_language_example":"What do you want for dinner?"}]
["que voulez-vous",{"thoughts":"This phrase is often used as a formal or polite way to ask 'What do you want?' in French, suitable for adults or in professional settings.","target_language_multi_word_term":"que voulez-vous","meaning":"'what do you want?'","additional_notes":"Used to make polite inquiries when you want to know someone else's preferences or desires. Suitable for formal contexts.","target_language_example":"Bonsoir, que voulez-vous manger ce soir?","native_language_example":"Good evening, what do you want to eat tonight?"}]
["quelqu'un",{"thoughts":"\"Quelqu'un\" is a French pronoun that means \"someone\" or \"somebody.\" It is commonly used to refer to an undefined or unknown person. This is a basic but crucial word for beginner learners to understand and use in conversation.","target_language_multi_word_term":"quelqu'un","meaning":"'someone' or 'somebody'.","additional_notes":"Used to refer to an unspecified person, often in questions, statements, or commands.","target_language_example":"Il y a quelqu'un à la porte.","native_language_example":"There is someone at the door."}]
["quelque chose",{"thoughts":"'Quelque chose' is a common French phrase used to refer to an unspecified or indefinite thing, similar to how we use 'something' in English.","target_language_multi_word_term":"quelque chose","meaning":"'something'.","additional_notes":"Used to indicate an indefinite object, action, or concept, often when the specifics are unknown or unimportant.","target_language_example":"Il y a quelque chose sous la table.","native_language_example":"There is something under the table."}]
["quelque part",{"thoughts":"'Quelque part' is a common phrase in French meaning 'somewhere'. It is often used when referring to an indefinite or unspecified location, similar to how 'somewhere' is used in English. It's important for beginner learners to understand this expression as it is quite frequently used in everyday conversations.","target_language_multi_word_term":"quelque part","meaning":"'somewhere'.","additional_notes":"Used to refer to an unspecified or unknown location. It can also imply a sense of vagueness or abstraction about the location being mentioned.","target_language_example":"Il a caché le livre quelque part dans la maison.","native_language_example":"He hid the book somewhere in the house."}]
["qui parle",{"thoughts":"Qui parle is a phrase constructed from 'qui' (who) and 'parle' (speaks), often used in questions or to indicate the subject of an action.","target_language_multi_word_term":"qui parle","meaning":"'who speaks' or 'who is speaking'.","additional_notes":"Commonly used to ask or talk about the person who is currently speaking or responsible for speaking in a given context.","target_language_example":"Je ne sais pas qui parle pendant la réunion.","native_language_example":"I don't know who is speaking during the meeting."}]
["qui sait",{"thoughts":"\"Qui sait\" is a French phrase used to express uncertainty or the possibility of various outcomes. It is similar to saying \"who knows\" in English and often used when someone is unsure about what will happen or how to answer a question.","target_language_multi_word_term":"qui sait","meaning":"'who knows'.","additional_notes":"Used to express doubt, uncertainty, or the idea that the future is unknown. It can also imply that a situation is beyond one's control or prediction.","target_language_example":"Peut-être qu'il viendra demain, qui sait ?","native_language_example":"Maybe he'll come tomorrow, who knows?"}]
["qui voilà",{"thoughts":"'Qui voilà' is a French phrase often used in informal settings to express surprise at seeing someone or something appear.","target_language_multi_word_term":"qui voilà","meaning":"'who's here' or 'look who's here'.","additional_notes":"Commonly used as an exclamation, typically when someone unexpected arrives or is spotted. Often accompanied by a tone of enthusiasm or surprise.","target_language_example":"Eh bien, qui voilà !","native_language_example":"Well, look who's here!"}]
["quoi de neuf",{"thoughts":"'Quoi de neuf' is a casual French phrase used to ask about recent events or updates, similar to 'what's new' in English. It's an informal, friendly way to start a conversation or inquire about someone's well-being or activities.","target_language_multi_word_term":"quoi de neuf","meaning":"'what's new'.","additional_notes":"Used in informal contexts to casually ask someone about recent happenings or news in their life. It is an equivalent to saying 'what's up'.","target_language_example":"Salut! Quoi de neuf aujourd'hui?","native_language_example":"Hi! What's new today?"}]
["quoi faire",{"thoughts":"'Quoi faire' is an informal French expression used to ask or wonder about what action to take or what should be done. It is often used in casual or conversational contexts.","target_language_multi_word_term":"quoi faire","meaning":"'what to do'.","additional_notes":"Commonly used in informal contexts to discuss or inquire about actions, decisions, or plans.","target_language_example":"Je ne sais pas quoi faire ce week-end.","native_language_example":"I don't know what to do this weekend."}]
["rendez-vous",{"thoughts":"\"Rendez-vous\" is a French term commonly used in English as well. It means an appointment or a meeting and can imply a formal or informal gathering.","target_language_multi_word_term":"rendez-vous","meaning":"an appointment or a meeting.","additional_notes":"Can be used in formal or informal contexts to refer to a planned meeting, date, or gathering. In English, it often implies a meeting with romantic overtones, but in French, it is more general.","target_language_example":"J'ai un rendez-vous chez le médecin demain.","native_language_example":"I have a doctor's appointment tomorrow."}]
["rendre compte",{"thoughts":"'Rendre compte' is a common French expression that is often used to indicate awareness or reporting of something. It's equivalent to 'realize' or 'account (for something)' in English, and is frequently used in business and everyday contexts.","target_language_multi_word_term":"rendre compte","meaning":"'to realize' or 'to report'.","additional_notes":"When used with a reflexive pronoun, se rendre compte (de) means 'to realize'. When used without a reflexive pronoun, it often refers to 'reporting' or 'giving an account of' something.","target_language_example":"Il s'est rendu compte de son erreur.","native_language_example":"He realized his mistake."}]
["rien que",{"thoughts":"'Rien que' is a French phrase used to indicate exclusivity, often translated as \"only\" or \"just.\" This expression emphasizes that the following statement is limited to a specific element or context. It is useful for beginners to understand because it's a commonly used phrase in casual conversation.","target_language_multi_word_term":"rien que","meaning":"'only' or 'just'.","additional_notes":"Used to emphasize that something applies exclusively to the mentioned context or item, often highlighting sufficiency or restriction.","target_language_example":"Il a perdu espoir rien qu'en lisant le début du rapport.","native_language_example":"He lost hope just by reading the beginning of the report."}]
["rien à voir",{"thoughts":"The phrase 'rien à voir' is commonly used in French to indicate that two things are unrelated or not connected. This phrase can be useful for beginner learners when expressing or understanding statements of disconnection or irrelevance.","target_language_multi_word_term":"rien à voir","meaning":"'nothing to do with' or 'unrelated'.","additional_notes":"Used to assert that there is no connection or relevance between two things or situations.","target_language_example":"Ce problème n'a rien à voir avec le dernier.","native_language_example":"This problem has nothing to do with the last one."}]
["s'en aller",{"thoughts":"The phrase 's'en aller' is a reflexive verb that means the action of leaving. It can be a synonym for 'partir' or 'quitter' but with a more informal or conversational tone.","target_language_multi_word_term":"s'en aller","meaning":"to leave or to go away.","additional_notes":"This term is used informally and often indicates leaving a place or situation. It's a reflexive verb and often has a more casual tone than 'partir'.","target_language_example":"Je dois m'en aller maintenant.","native_language_example":"I have to leave now."}]
["s'il te plaît",{"thoughts":"'S'il te plaît' is a common polite expression in French used to make requests. It's the informal version, used with friends or people of the same age group. It's important for learners to understand both formal and informal versions of phrases.","target_language_multi_word_term":"s'il te plaît","meaning":"'please' (informal)","additional_notes":"Used when asking for something in a friendly or informal setting. The formal version is 's'il vous plaît', used for polite requests towards adults, strangers, or in formal scenarios.","target_language_example":"Passe-moi le sel, s'il te plaît.","native_language_example":"Pass me the salt, please."}]
["s'il vous plaît",{"thoughts":"The phrase 's'il vous plaît' is a basic and essential polite term in French, equivalent to the English 'please.' It's important for beginner learners as it is a common courtesy used in everyday interactions. Beginners should learn both \"s'il vous plaît\" for formal situations and \"s'il te plaît\" for informal situations.","target_language_multi_word_term":"s'il vous plaît","meaning":"'please'.","additional_notes":"Used to make requests more polite or to ask for something. 'S'il vous plaît' is the formal version, while 's'il te plaît' is informal.","target_language_example":"Pouvez-vous m'aider, s'il vous plaît ?","native_language_example":"Can you help me, please?"}]
["sa mère",{"thoughts":"The phrase 'sa mère' is commonly used in French to mean 'his/her mother\". It shows possession and is adapted based on the gender of the possessor, but the form 'sa' remains the same because 'mère' is feminine.","target_language_multi_word_term":"sa mère","meaning":"'his/her mother'.","additional_notes":"'Sa mère' can refer to either 'his mother' or 'her mother' depending on the gender of the person whose mother is being referred to. 'Sa' is used because 'mère' is a feminine noun.","target_language_example":"Il est allé chez sa mère ce week-end.","native_language_example":"He went to his mother's house this weekend."}]
["sais pas",{"thoughts":"'Sais pas' is an informal contraction of 'je ne sais pas', often used in casual conversations to express lack of knowledge or uncertainty. It's equivalent to 'don't know' in English.","target_language_multi_word_term":"sais pas","meaning":"'don't know'.","additional_notes":"A colloquial way to say 'I don't know', commonly used in spoken language among friends or family.","target_language_example":"— Tu as vu le film hier ? — Sais pas.","native_language_example":"— Did you see the movie yesterday? — Don't know."}]
["sais-tu",{"thoughts":"The term 'sais-tu' is commonly used to form informal questions about whether someone knows something.","target_language_multi_word_term":"sais-tu","meaning":"'do you know'.","additional_notes":"Used to ask someone if they are aware or knowledgeable about specific information. Often used in informal settings.","target_language_example":"Sais-tu où se trouve la bibliothèque ?","native_language_example":"Do you know where the library is?"}]
["se faire",{"thoughts":"'Se faire' can be a reflexive construction indicating various actions or experiences that happen to oneself. It's versatile and appears in idiomatic expressions, often conveying the idea of becoming or having something done to oneself.","target_language_multi_word_term":"se faire","meaning":"to get/make oneself.","additional_notes":"It is used for various contexts like getting a haircut ('se faire couper les cheveux'), making oneself do something, or being subject to an experience.","target_language_example":"Il s'est fait couper les cheveux hier.","native_language_example":"He got his hair cut yesterday."}]
["se passer",{"thoughts":"'Se passer' is a French reflexive verb often used to describe how an event takes place or to indicate that something is happening.","target_language_multi_word_term":"se passer","meaning":"'to happen' or 'to occur'.","additional_notes":"Commonly used to inquire or comment on the occurrence or how things are unfolding. It is a reflexive verb and can also mean 'to pass' (as in time).","target_language_example":"Que va-t-il se passer ensuite?","native_language_example":"What is going to happen next?"}]
["si ce n'est",{"thoughts":"'Si ce n'est' is a French phrase often used to express an exception or a reservation about a previous statement. It is akin to saying 'except' or 'if not' in English.","target_language_multi_word_term":"si ce n'est","meaning":"'except', 'if not'.","additional_notes":"Combines 'si' meaning 'if' and 'ce n'est' meaning 'it is not', and is used to introduce an exception or a minor counterpoint to the main statement.","target_language_example":"Tout le monde était là, si ce n'est Paul.","native_language_example":"Everyone was there, except Paul."}]
["sortir de",{"thoughts":"The French phrase 'sortir de' means 'to go out of' or 'to leave from'. It is often used to indicate physically exiting a place or moving from one space to another.","target_language_multi_word_term":"sortir de","meaning":"'to go out of' or 'to leave from'.","additional_notes":"Used when indicating the action of leaving an enclosed space or space with a defined boundary.","target_language_example":"Elle est sortie de la salle.","native_language_example":"She left the room."}]
["sortir ensemble",{"thoughts":"The term 'sortir ensemble' is a common French expression used in the context of relationships and social activities, meaning 'to go out together' or 'to date.' It's important for beginners to recognize its social context and appropriateness depending on the nature of the relationship.","target_language_multi_word_term":"sortir ensemble","meaning":"'to go out together' or 'to date'.","additional_notes":"Used to describe romantic dating or spending time together socially. Context helps determine whether it implies dating or just socializing as friends.","target_language_example":"Ils ont commencé à sortir ensemble l'année dernière.","native_language_example":"They started dating last year."}]
["ta mère",{"thoughts":"The expression 'ta mère' translates directly to 'your mother' in English. While it can be a straightforward reference to someone's mother, in French colloquial language, it is often used as a basis for jokes or insults. Its tone can vary widely depending on context, ranging from playful banter among friends to offensive remarks.","target_language_multi_word_term":"ta mère","meaning":"'your mother'.","additional_notes":"Can be a neutral reference to someone's mother, or used in an informal or sometimes offensive way in jokes and insults.","target_language_example":"Il ressemble à ta mère.","native_language_example":"He looks like your mother."}]
["tant mieux",{"thoughts":"'Tant mieux' is an idiomatic French expression used to convey relief, satisfaction, or approval at a fortunate outcome. Beginners should understand it as an equivalent to an English expression that conveys a similar sentiment like 'so much the better' or 'all the better'.","target_language_multi_word_term":"tant mieux","meaning":"'so much the better' or 'all the better'.","additional_notes":"Used to express contentment or relief about a situation turning out well.","target_language_example":"Il va faire beau ce week-end? Tant mieux, je pourrai aller à la plage.","native_language_example":"The weather this weekend will be nice? All the better, I can go to the beach."}]
["tenir au courant",{"thoughts":"Tenir au courant is a useful expression for beginner learners because it is commonly used in both formal and informal situations to talk about keeping someone informed or updated about something.","target_language_multi_word_term":"tenir au courant","meaning":"to keep informed or updated.","additional_notes":"This phrase is often used when discussing news or developments that someone should be aware of. It can be used both in personal contexts (like keeping a friend informed) and professional settings (such as updating a colleague on a project's status).","target_language_example":"Je vais te tenir au courant des nouvelles.","native_language_example":"I will keep you informed of the news."}]
["tenir le coup",{"thoughts":"The phrase 'tenir le coup' is commonly used to describe endurance or the ability to keep going despite challenges.","target_language_multi_word_term":"tenir le coup","meaning":"hold on or endure.","additional_notes":"It's used when referring to someone's ability to endure difficult situations or not give up. Often similar to the English phrase 'hang in there.'","target_language_example":"Il faut tenir le coup pendant cette période difficile.","native_language_example":"We have to hold on during this difficult time."}]
["toi-même",{"thoughts":"'Toi-même' is an emphatic form of 'you' and is used for emphasis or to indicate doing something by oneself.","target_language_multi_word_term":"toi-même","meaning":"'yourself' or 'you yourself'.","additional_notes":"Used to emphasize the person being addressed, often in imperative or reflexive situations. Common in casual or conversational French.","target_language_example":"Fais-le toi-même !","native_language_example":"Do it yourself!"}]
["tous les deux",{"thoughts":"'Tous les deux' is a phrase used to indicate both people or things jointly in French. It translates directly to 'both', and is often used when referring to two specific items or people together.","target_language_multi_word_term":"tous les deux","meaning":"'both'.","additional_notes":"Used to refer collectively to two people or things.","target_language_example":"Nous allons tous les deux au marché.","native_language_example":"We are both going to the market."}]
["tout ce qui",{"thoughts":"'Tout ce qui' is a French phrase often used to refer to everything that belongs in a category or everything related to something. It precedes a verb and refers to 'everything that' or 'all that.' This could be useful for beginners to express broad or comprehensive inclusivity in a sentence.","target_language_multi_word_term":"tout ce qui","meaning":"'all that' or 'everything that'.","additional_notes":"Used to refer to entire categories or complete sets of items or actions related to a subject. It can emphasize inclusivity or entirety.","target_language_example":"Elle mange tout ce qui est sur la table.","native_language_example":"She eats everything that is on the table."}]
["tout comme",{"thoughts":"The term 'tout comme' is used in French to draw a comparison or show similarity, often equivalent to 'just like' or 'just as' in English.","target_language_multi_word_term":"tout comme","meaning":"'just like' or 'just as'.","additional_notes":"Used to make comparisons or indicate that something is similar to something else.","target_language_example":"Il travaille tout comme un professionnel.","native_language_example":"He works just like a professional."}]
["tout de suite",{"thoughts":"'Tout de suite' is a phrase commonly used in French to indicate immediacy or urgency, suggesting that something should be done right away or without delay.","target_language_multi_word_term":"tout de suite","meaning":"right away","additional_notes":"Commonly used to convey a sense of urgency or immediate action. It indicates that there is no time to waste.","target_language_example":"J'arrive tout de suite.","native_language_example":"I'm coming right away."}]
["tout droit",{"thoughts":"\"Tout droit\" is a basic French directional phrase that is important for beginner learners, especially when learning about giving and receiving directions.","target_language_multi_word_term":"tout droit","meaning":"\"straight ahead\" or \"straight on\".","additional_notes":"Used when giving directions to indicate that someone should continue moving in a straight line without turning.","target_language_example":"Continuez tout droit jusqu'à la place.","native_language_example":"Continue straight ahead until the square."}]
["tout le monde",{"thoughts":"'Tout le monde' is a basic French expression used to talk about everyone or everybody. It's a useful phrase for both formal and informal conversations and helps beginners to communicate inclusively about groups of people.","target_language_multi_word_term":"tout le monde","meaning":"'everyone' or 'everybody'.","additional_notes":"Used to refer to all people in a general sense. It's commonly used in daily conversation and includes informal or casual scenarios.","target_language_example":"Tout le monde est prêt pour la réunion.","native_language_example":"Everyone is ready for the meeting."}]
["tout le temps",{"thoughts":"'Tout le temps' is a commonly used phrase in French that means 'all the time' or 'constantly'. A beginner learner would need to understand this as it is often used in everyday conversation to indicate something happens frequently or continuously.","target_language_multi_word_term":"tout le temps","meaning":"'all the time'.","additional_notes":"Used to describe actions or events that occur consistently or repeatedly.","target_language_example":"Il pleut tout le temps ici.","native_language_example":"It rains all the time here."}]
["tout à fait",{"thoughts":"\"Tout à fait\" is a common French expression used for agreement or confirmation. It's similar to saying \"absolutely\" or \"exactly\" in English.","target_language_multi_word_term":"tout à fait","meaning":"\"absolutely\" or \"exactly\".","additional_notes":"Used in conversations to agree completely with someone or to confirm something is entirely true.","target_language_example":"Tu as raison, c'est tout à fait correct.","native_language_example":"You're right, that's absolutely correct."}]
["tout à l'heure",{"thoughts":"The phrase 'tout à l'heure' in French can refer to either a moment shortly before the present or right afterward, depending on the context.","target_language_multi_word_term":"tout à l'heure","meaning":"'a little while ago' or 'in a little while'.","additional_notes":"Context will indicate if it refers to the past or future. It's used to discuss time relative to the present.","target_language_example":"Je l'ai vu tout à l'heure.","native_language_example":"I saw him a little while ago."}]
["tout ça",{"thoughts":"\"Tout ça\" is a colloquial French phrase often used to refer to a collection of things, actions, or situations previously mentioned. It's similar to saying \"all this\" or \"all of that\" in English, often in a summarizing context.","target_language_multi_word_term":"tout ça","meaning":"\"all this\" or \"all of that\".","additional_notes":"Commonly used in conversational French to refer collectively to several items or situations that have been mentioned previously or are known in context.","target_language_example":"J'ai acheté des fruits, des légumes, du pain, tout ça.","native_language_example":"I bought fruits, vegetables, bread, all that."}]
["trop de",{"thoughts":"'Trop de' is a phrase used in French to indicate an excessive amount of something. It's a useful term for expressing too much or too many of a noun.","target_language_multi_word_term":"trop de","meaning":"'too much' or 'too many'.","additional_notes":"Used to express excessive quantities of something. It is followed by a noun without an article.","target_language_example":"Il y a trop de monde ici.","native_language_example":"There are too many people here."}]
["très bien",{"thoughts":"The term 'très bien' is a basic and widely used expression in French to convey approval, satisfaction, or general good feeling. It is generally straightforward and useful for beginner learners to express agreement or convey positivity.","target_language_multi_word_term":"très bien","meaning":"'very well' or 'very good'.","additional_notes":"It can be used to express agreement, satisfaction, or approval. It's similar to saying 'great' or 'very good' in English.","target_language_example":"Tu as fait ton travail, c'est très bien.","native_language_example":"You did your work, that's very good."}]
["tu l'as dit",{"thoughts":"The phrase 'tu l'as dit' literally means 'you said it' and is used similarly to the English expression 'you said it', 'exactly', or 'you got that right'. It's often used in conversational French to agree emphatically with someone else’s statement.","target_language_multi_word_term":"tu l'as dit","meaning":"'you said it' or 'exactly'.","additional_notes":"Used to express strong agreement with someone's statement. It can reflect enthusiasm or emphatic understanding in response to a shared sentiment.","target_language_example":"- Il fait chaud aujourd'hui! \n- Tu l'as dit!","native_language_example":"- It's hot today! \n- You said it!"}]
["tu parles",{"thoughts":"\"Tu parles\" is a common French phrase that can be used either as a statement meaning 'you speak' or in a more colloquial sense to express disbelief, similar to the English phrase 'yeah, right.' It often appears in informal conversations.","target_language_multi_word_term":"tu parles","meaning":"'you speak', 'no kidding', or 'yeah, right'.","additional_notes":"In literal contexts, 'tu parles' means 'you speak'. It is also used idiomatically to express sarcasm or disbelief when someone is exaggerating.","target_language_example":"Tu parles bien français.","native_language_example":"You speak French well."}]
["tu sais",{"thoughts":"'Tu sais' is a common French phrase equivalent to saying 'you know' in English, often used to confirm understanding or as a filler in conversations, similar to 'you know' in English.","target_language_multi_word_term":"tu sais","meaning":"'you know'.","additional_notes":"Used to ask for agreement or confirm understanding, often as a conversational filler.","target_language_example":"Il est déjà parti, tu sais.","native_language_example":"He has already left, you know."}]
["un autre",{"thoughts":"The phrase 'un autre' is a simple, yet commonly used phrase in French, often used to express the idea of 'another' or 'an additional one.' It serves as an adjective or pronoun in different contexts and can refer to people or objects. Especially useful in conversational settings or when making choices or requests.","target_language_multi_word_term":"un autre","meaning":"'another' or 'one more'.","additional_notes":"This phrase is often used when selecting or indicating an additional item or person. It can be accompanied by a noun or used independently depending on the context.","target_language_example":"Je voudrais un autre café, s'il vous plaît.","native_language_example":"I would like another coffee, please."}]
["un coup",{"thoughts":"'Un coup' is a versatile French phrase that can mean different things depending on context, such as suddenly, a hit, a stroke, or an event.","target_language_multi_word_term":"un coup","meaning":"a sudden event, a hit, or a stroke.","additional_notes":"Often used to refer to sudden events or impacts. It appears in many expressions like 'un coup de foudre' (love at first sight) or 'un coup de téléphone' (a phone call).","target_language_example":"J'ai pris un coup de soleil à la plage hier.","native_language_example":"I got sunburned at the beach yesterday."}]
["un jour",{"thoughts":"The term 'un jour' in French translates directly to 'one day' in English and can be used in either the literal or figurative sense to talk about a specific day in the future or a hypothetical day. Commonly used in expressions to signify hope or plans, especially to express something that might happen eventually or at some undefined point in the future.","target_language_multi_word_term":"un jour","meaning":"'one day'.","additional_notes":"Used to express a notion of hope or possibility in the future, often implying something that is not fixed or certain. Similar to the English expression 'someday'.","target_language_example":"Un jour, j'irai à Paris.","native_language_example":"One day, I will go to Paris."}]
["un peu",{"thoughts":"\"Un peu\" is a common French phrase that learners often encounter. It's used to indicate a small amount or degree, similar to 'a little' or 'a bit' in English. It's versatile and can be used with nouns and verbs to temper the meaning or express modesty.","target_language_multi_word_term":"un peu","meaning":"'a little', 'a bit'.","additional_notes":"Used to indicate a small quantity or degree. Can be used with verbs, adjectives, or directly with nouns.","target_language_example":"Je parle un peu français.","native_language_example":"I speak a little French."}]
["un peu de",{"thoughts":"'Un peu de' is a basic French phrase often used to indicate a small or modest quantity of something. It is typically followed by a noun and is useful in daily conversations about cooking, shopping, or describing how much of something is present.","target_language_multi_word_term":"un peu de","meaning":"'a little bit of' or 'a small amount of'.","additional_notes":"Used to describe a small, unspecified quantity of something. Common in contexts like cooking or expressing modest amounts in daily conversation.","target_language_example":"Je voudrais un peu de sucre dans mon café.","native_language_example":"I would like a little bit of sugar in my coffee."}]
["une fois",{"thoughts":"\"Une fois\" is a French phrase that translates literally to \"one time\". It is frequently used to denote a single occurrence of something and is often seen in expressions or instructions.","target_language_multi_word_term":"une fois","meaning":"'once' or 'one time'.","additional_notes":"Often used to express that something happens a single time, or to talk about frequency. It can also appear in expressions like 'il était une fois' (once upon a time).","target_language_example":"J'ai visité Paris une fois.","native_language_example":"I visited Paris once."}]
["va savoir",{"thoughts":"'Va savoir' is an informal French expression used to indicate uncertainty or the impossibility of knowing something. It's often used when discussing speculative or unknown situations.","target_language_multi_word_term":"va savoir","meaning":"'who knows'","additional_notes":"Commonly used in informal conversations to express doubt, mystery, or to rhetorically question the likelihood of something being known or understood.","target_language_example":"Elle est partie sans prévenir, va savoir pourquoi.","native_language_example":"She left without warning, who knows why."}]
["valoir mieux",{"thoughts":"The phrase 'valoir mieux' is often used in French to express the idea of something being preferable or better than something else. It reflects an evaluation or judgment on what might be the best option or alternative in a given situation.","target_language_multi_word_term":"valoir mieux","meaning":"'to be better' or 'to be preferable'.","additional_notes":"It is typically used to suggest a preferred course of action, often translated to mean 'had better' or 'would be better'. Commonly followed by an infinitive verb.","target_language_example":"Il vaut mieux partir tôt.","native_language_example":"It's better to leave early."}]
["vas-y",{"thoughts":"The term 'vas-y' is a familiar imperative expression in French. It's derived from 'aller' (to go) and is used to encourage someone to go ahead with an action or start doing something. It's commonly used in spoken French to offer encouragement or to tell someone to proceed.","target_language_multi_word_term":"vas-y","meaning":"'go ahead', 'go on', or 'do it'.","additional_notes":"Used informally to give someone the green light to proceed with what they are doing or plan to do. It is also used to urge someone to hurry up.","target_language_example":"Tu veux essayer le nouveau restaurant ? Vas-y !","native_language_example":"Do you want to try the new restaurant? Go ahead!"}]
["venir de",{"thoughts":"\"Venir de\" is a French phrase used to indicate a very recent past action or event, similar to the English 'just'. It’s a key part of French grammar for expressing what someone has 'just done'.","target_language_multi_word_term":"venir de","meaning":"'to have just done something'.","additional_notes":"This phrase is used with an infinitive verb to describe an action that has very recently occurred. It is commonly followed by a verb in the infinitive form to indicate what action has just taken place.","target_language_example":"Je viens de manger.","native_language_example":"I just ate."}]
["vite fait",{"thoughts":"The phrase 'vite fait' indicates something done quickly or in a hurry. It's informal and could be relevant for beginners to understand how to express quick actions or tasks. This is useful in everyday conversations about time management or efficiency.","target_language_multi_word_term":"vite fait","meaning":"'quickly' or 'in a jiffy'.","additional_notes":"Used to describe an action done fast, often without much attention to detail. It's informal and commonly used in casual conversation.","target_language_example":"Je vais préparer le dîner vite fait.","native_language_example":"I'll prepare dinner quickly."}]
["voir venir",{"thoughts":"Voir venir is an idiomatic French expression that literally translates to 'see (something) coming'. It's used to describe taking a wait-and-see approach.","target_language_multi_word_term":"voir venir","meaning":"'wait and see'.","additional_notes":"It often conveys a sense of taking a cautious, observant approach in a situation, allowing it to unfold before taking any action. It's a relaxed approach implying no need for haste.","target_language_example":"Pour l'instant, je préfère voir venir avant de décider.","native_language_example":"For now, I prefer to wait and see before deciding."}]
["vouloir bien",{"thoughts":"\"Vouloir bien\" is a phrase that combines \"vouloir\" (to want) with \"bien\" (well) and is often used to express willingness or a polite readiness to do something.","target_language_multi_word_term":"vouloir bien","meaning":"to be willing to or to agree to.","additional_notes":"This phrase is often used to indicate a polite or readiness to consent to something, similar to saying \"I would be happy to\" or \"I don't mind\" in English. It's a way to agree to a request politely.","target_language_example":"Je veux bien aider si tu en as besoin.","native_language_example":"I am willing to help if you need it."}]
["vouloir dire",{"thoughts":"The term 'vouloir dire' is widely used in French to express the meaning or intention behind words.","target_language_multi_word_term":"vouloir dire","meaning":"'to mean'.","additional_notes":"Used to inquire about the meaning or intention behind words, phrases, or actions.","target_language_example":"Qu'est-ce que tu veux dire ?","native_language_example":"What do you mean?"}]
["vous savez",{"thoughts":"'Vous savez' is a French phrase often used to confirm understanding or to provide emphasis, similar to saying \"you know\" in English. It can be used both in statements and in questions.","target_language_multi_word_term":"vous savez","meaning":"'you know'.","additional_notes":"Commonly used in conversation to emphasize a point or check for understanding, equivalent to 'you know' or 'you see' in English.","target_language_example":"C'est important, vous savez.","native_language_example":"It's important, you know."}]
["vous-même",{"thoughts":"'Vous-même' is a polite form of 'yourself,' used when addressing someone formally or when speaking to multiple people.","target_language_multi_word_term":"vous-même","meaning":"'yourself' (formal).","additional_notes":"This term is used for polite or formal situations or when addressing more than one person officially. For informal or singular use, one would commonly use 'toi-même.'","target_language_example":"Pouvez-vous vous présenter, vous-même, s'il vous plaît ?","native_language_example":"Can you introduce yourself, please?"}]
["vous-mêmes",{"thoughts":"'Vous-mêmes' is a French reflexive pronoun for 'yourselves', used when addressing multiple people in a formal way.","target_language_multi_word_term":"vous-mêmes","meaning":"'yourselves'.","additional_notes":"It is used for emphasis or to indicate that the action is performed by the people being addressed. It is formal or plural, as 'vous' is used for both plural and formal singular contexts.","target_language_example":"Faites-le vous-mêmes pour comprendre mieux.","native_language_example":"Do it yourselves to understand better."}]
["voyez-vous",{"thoughts":"The term 'voyez-vous' is derived from the verb 'voir', meaning 'to see'. The phrase is a polite way to ask if someone sees or understands something in a conversation. It can also be used rhetorically to emphasize a point. This phrase might frequently be encountered in formal contexts or conversation to verify comprehension or agreement.","target_language_multi_word_term":"voyez-vous","meaning":"'do you see?' or 'you see'.","additional_notes":"Commonly used to check understanding in a polite or formal manner. It can also serve as a rhetorical flourish when explaining or emphasizing a point.","target_language_example":"Voyez-vous pourquoi cette solution est préférable ?","native_language_example":"Do you see why this solution is preferable?"}]
["voyons voir",{"thoughts":"'Voyons voir' is a colloquial French phrase used to suggest taking a closer look at something or thinking through something together. It is a combination of the verb 'voir' (to see) and 'voyons', the first person plural imperative form of 'voir', essentially meaning 'let's see'.","target_language_multi_word_term":"voyons voir","meaning":"'let's see'","additional_notes":"Often used when someone is about to examine something or consider a decision. It conveys a sense of curiosity or anticipation and is similar to saying 'let's take a look' in English.","target_language_example":"Voyons voir ce qu'il y a dans le frigo.","native_language_example":"Let's see what's in the fridge."}]
["vu que",{"thoughts":"'Vu que' is a common phrase used in French to express a causal relationship, similar to 'since' or 'given that' in English. It precedes a clause that explains a reason or justification for something. This is useful in conversational and written French when explaining motivations or reasoning.","target_language_multi_word_term":"vu que","meaning":"'since' or 'given that'.","additional_notes":"Often used to introduce a cause or reason in both formal and informal contexts.","target_language_example":"Vu que tu es fatigué, tu devrais te reposer.","native_language_example":"Since you are tired, you should rest."}]
["y aller",{"thoughts":"The phrase 'y aller' is composed of the pronoun 'y' and the verb 'aller'. 'Y' usually refers to a place or idea that has already been mentioned, and 'aller' means 'to go'.","target_language_multi_word_term":"y aller","meaning":"'to go there'","additional_notes":"Commonly used to refer to going to a mentioned or understood place, often implies a direction or movement to a specific location.","target_language_example":"Je dois y aller maintenant.","native_language_example":"I have to go there now."}]
["y avoir",{"thoughts":"\"Y avoir\" is used in French as part of existential statements, particularly in the phrase \"il y a,\" which corresponds to \"there is/are\" in English. It's fundamental in expressing existence or presence of something in a neutral manner. Beginners should focus on how it's used in sentences and recognizing its role in expressing presence or occurrence.","target_language_multi_word_term":"y avoir","meaning":"'there is/are'.","additional_notes":"Often used in an impersonal manner to describe existence, occurrence, or availability of things. Used with 'il' as 'il y a'.","target_language_example":"Il y a un chat sur le canapé.","native_language_example":"There is a cat on the sofa."}]
["y compris",{"thoughts":"'Y compris' is a French term that directly translates to 'including'. It is used to specify that certain items or people are part of a broader enumeration or list.","target_language_multi_word_term":"y compris","meaning":"'including'.","additional_notes":"Used to indicate that something is included as part of a larger group or list. It comes from the verb 'comprendre' which means 'to include' or 'to understand'.","target_language_example":"Nous partirons en vacances avec toute la famille, y compris les grands-parents.","native_language_example":"We will go on vacation with the whole family, including the grandparents."}]
["à bientôt",{"thoughts":"'À bientôt' is a French phrase commonly used for saying goodbye with an implication of seeing each other again soon.","target_language_multi_word_term":"à bientôt","meaning":"'see you soon'.","additional_notes":"This phrase is often used in informal contexts when parting from friends, family, or acquaintances, indicating that you expect to meet again in the near future.","target_language_example":"Je dois y aller maintenant. À bientôt!","native_language_example":"I have to go now. See you soon!"}]
["à bord",{"thoughts":"'À bord' is a prepositional phrase commonly used in contexts involving transportation, meaning 'on board' of a vehicle like a ship, plane, or train.","target_language_multi_word_term":"à bord","meaning":"'on board'.","additional_notes":"Commonly used when talking about being inside a vehicle, especially in travel contexts.","target_language_example":"Nous étions à bord du train pour Paris.","native_language_example":"We were on board the train to Paris."}]
["à demain",{"thoughts":"'À demain' is a straightforward French phrase used to indicate plans or intentions to meet the following day. It's commonly used at the end of conversations as a way to say goodbye, holding the meaning similar to 'see you tomorrow' in English.","target_language_multi_word_term":"à demain","meaning":"'see you tomorrow'.","additional_notes":"Used to say goodbye when you expect to see someone the next day.","target_language_example":"Je te verrai à l'école. À demain !","native_language_example":"I'll see you at school. See you tomorrow!"}]
["à droite",{"thoughts":"'À droite' is a French phrase used to indicate direction, meaning 'to the right'. This is useful when asking for or giving directions, which is often necessary for beginners travelling or navigating in French-speaking regions.","target_language_multi_word_term":"à droite","meaning":"'to the right'.","additional_notes":"Commonly used in both spoken and written French to give directions or indicate position.","target_language_example":"Tourne à droite après le feu rouge.","native_language_example":"Turn right after the red light."}]
["à fond",{"thoughts":"The phrase 'à fond' is used to indicate doing something to the fullest, in-depth, or thoroughly. It can also refer to actions done with full intensity or effort.","target_language_multi_word_term":"à fond","meaning":"To the fullest or thoroughly.","additional_notes":"Often used to express putting full effort into an activity or understanding something deeply.","target_language_example":"Il étudie toujours à fond pour ses examens.","native_language_example":"He always studies thoroughly for his exams."}]
["à gauche",{"thoughts":"'À gauche' is a fundamental directional phrase in French for indicating location or direction, much like 'to the left' in English. Beginners learning basic navigation or directions in French will find this phrase essential in both understanding and providing directions.","target_language_multi_word_term":"à gauche","meaning":"'to the left'.","additional_notes":"Used for giving directions or indicating location. Commonly paired with verbs like 'tourner' (to turn) or 'être' (to be).","target_language_example":"Tourne à gauche après le feu.","native_language_example":"Turn left after the traffic light."}]
["à l'heure",{"thoughts":"'À l'heure' is a common French expression meaning 'on time'. It is frequently used to describe punctuality or indicate that something occurs at the scheduled time, which is a concept important for beginner learners to grasp in terms of daily activities and appointments.","target_language_multi_word_term":"à l'heure","meaning":"'on time'.","additional_notes":"Used to describe punctuality or when something happens at the right or expected time. It is often used in both formal and informal contexts.","target_language_example":"Je suis arrivé à l'heure pour la réunion.","native_language_example":"I arrived on time for the meeting."}]
["à l'intérieur",{"thoughts":"The phrase 'à l'intérieur' is a French prepositional phrase used to indicate location or position. It is equivalent to 'inside' or 'within' in English. This phrase is helpful for basic conversations about location, which is important for beginners.","target_language_multi_word_term":"à l'intérieur","meaning":"'inside' or 'within'.","additional_notes":"Used to describe something being located within something else, such as objects in a room or ingredients in a dish.","target_language_example":"Les clés sont à l'intérieur de la maison.","native_language_example":"The keys are inside the house."}]
["à la maison",{"thoughts":"The phrase 'à la maison' is frequently used in French to refer to one's home or house. It is commonly used in everyday conversation when discussing activities or locations related to home life.","target_language_multi_word_term":"à la maison","meaning":"'at home' or 'to the house'.","additional_notes":"Used to indicate location, either one's own home or a general concept of home. Often relates to activities done within or around the house.","target_language_example":"Je vais rester à la maison ce soir.","native_language_example":"I am going to stay at home tonight."}]
["à moi",{"thoughts":"The term 'à moi' is commonly used in French to indicate possession or ownership, often in expressions or directives indicating that something should belong to or be given to the speaker.","target_language_multi_word_term":"à moi","meaning":"'mine' or 'to me'.","additional_notes":"Often used to indicate possession, like 'mine', or in directives indicating something should be directed to the speaker, like 'to me'.","target_language_example":"Ce livre est à moi.","native_language_example":"This book is mine."}]
["à nouveau",{"thoughts":"\"À nouveau\" means 'again' and it's used to indicate that something is being done once more, in a new way or with slight variation. It's often interchangeable with \"de nouveau,\" but \"à nouveau\" can imply a different approach or perspective on the repeated action.","target_language_multi_word_term":"à nouveau","meaning":"'again' or 'once more'.","additional_notes":"Used to express doing something again but often involves a fresh or new approach.","target_language_example":"J'ai réparé la machine à nouveau.","native_language_example":"I fixed the machine again."}]
["à part",{"thoughts":"'À part' is a common French phrase used to indicate exception or exclusion from a group or situation.","target_language_multi_word_term":"à part","meaning":"'apart (from)' or 'except for'.","additional_notes":"This phrase is used to highlight an exception to a general statement or context, similar to the English 'apart from' or 'except for'.","target_language_example":"À part le lundi, je suis libre toute la semaine.","native_language_example":"Apart from Monday, I am free all week."}]
["à plus",{"thoughts":"\"À plus\" is a shortened and informal way of saying 'see you later' in French, often used among friends and in casual conversations.","target_language_multi_word_term":"à plus","meaning":"'see you later'.","additional_notes":"This phrase is informal and often used in casual goodbyes. The full expression is \"à plus tard,\" which means 'see you later,' but it's commonly shortened in speech and informal writing.","target_language_example":"Je dois y aller, à plus !","native_language_example":"I have to go, see you later!"}]
["à propos",{"thoughts":"'À propos' is a French phrase used to indicate that something is relevant to a certain subject or to introduce a new, related topic. It is similar to saying 'by the way' or 'speaking of' in English and is useful for beginner learners to connect topics in conversation.","target_language_multi_word_term":"à propos","meaning":"'by the way' or 'speaking of'.","additional_notes":"Used to smoothly introduce a related subject or topic in a conversation.","target_language_example":"À propos, as-tu vu le dernier film de Spielberg ?","native_language_example":"By the way, did you see the latest Spielberg movie?"}]
["à propos de",{"thoughts":"'À propos de' is a French phrase commonly used when indicating the topic or subject of a conversation or report. It's similar to the English phrase 'about' or 'regarding'. Beginner learners might find it useful for discussing topics or asking about them.","target_language_multi_word_term":"à propos de","meaning":"'about' or 'regarding'.","additional_notes":"Used to introduce the topic of conversation or to refer to the subject of a discussion. It is often followed by a noun or pronoun.","target_language_example":"Nous avons parlé à propos de ses vacances.","native_language_example":"We talked about her vacation."}]
["à toute",{"thoughts":"The French term 'à toute' is a colloquial and casual way to say 'see you later' and is often used among friends or in informal settings. It is a shortened form of 'à tout à l'heure,' which means 'see you later' or 'see you soon.'","target_language_multi_word_term":"à toute","meaning":"'see you later'.","additional_notes":"This is an informal, friendly way to say goodbye when you expect to see the person later in the day.","target_language_example":"Je dois y aller maintenant, à toute !","native_language_example":"I have to go now, see you later!"}]
["ça gaze",{"thoughts":"\"Ça gaze\" is a colloquial French expression that means \"everything is going well\" or \"things are good.\" It's used in casual conversation as a way to ask or state how things are going, similar to asking \"How's it going?\" in English.","target_language_multi_word_term":"ça gaze","meaning":"\"How's it going?\" or \"All good?\"","additional_notes":"Informal greeting or inquiry about someone's well-being. Commonly used among friends or in relaxed settings.","target_language_example":"Salut, ça gaze ?","native_language_example":"Hi, how's it going?"}]
["ça ira",{"thoughts":"'Ça ira' is a French expression commonly used to reassure someone or convey that everything will be fine.","target_language_multi_word_term":"ça ira","meaning":"'it'll be fine' or 'it'll be okay'.","additional_notes":"Often used to reassure or comfort someone in a difficult situation. It implies optimism and looking forward to a positive outcome.","target_language_example":"Ne t'inquiète pas, ça ira.","native_language_example":"Don't worry, it'll be fine."}]
["ça marche",{"thoughts":"'Ça marche' is a casual expression that is frequently used in French to indicate that something is working or to agree with a suggestion, similar to saying 'okay' or 'that works' in English.","target_language_multi_word_term":"ça marche","meaning":"'it works' or 'okay'.","additional_notes":"Commonly used to confirm that something is functioning or to agree to a plan or proposal. It’s a versatile expression for informal agreement or approval.","target_language_example":"On se voit à 15h ? Ça marche.","native_language_example":"We'll see each other at 3 PM? Okay."}]
["ça roule",{"thoughts":"'Ça roule' is an informal French expression used to indicate that everything is going well, or to agree with a plan or suggestion. It is equivalent to saying 'all good' or 'sounds good' in English, often used in casual conversation.","target_language_multi_word_term":"ça roule","meaning":"'it's going well' or 'sounds good'.","additional_notes":"Informal expression to indicate agreement or that everything is fine. Can be used similarly to 'all good'.","target_language_example":"On se retrouve à 18h ? - Ça roule !","native_language_example":"Shall we meet at 6 PM? - Sounds good!"}]
["ça suffit",{"thoughts":"\"Ça suffit\" is a common French expression used to firmly indicate that something is enough or needs to stop. It is often employed in situations requiring authority or when one wants to express frustration or impatience.","target_language_multi_word_term":"ça suffit","meaning":"'that's enough' or 'enough is enough'.","additional_notes":"Used to tell someone to stop an activity or behavior, often with a stern tone. Can be used in both serious and playful contexts.","target_language_example":"Ça suffit, arrête de crier!","native_language_example":"That's enough, stop shouting!"}]
["ça va",{"thoughts":"'Ça va' is a very common French expression used in casual conversation, both as a question and a response. It's versatile and generally understood by most speakers, including beginners.","target_language_multi_word_term":"ça va","meaning":"'how's it going?' or 'it's going fine'.","additional_notes":"Commonly used in informal settings to ask or indicate general well-being. It can be used both as a question (Ça va?) or as an answer (Ça va.) to express that things are fine.","target_language_example":"Ça va?","native_language_example":"How's it going?"}]
["être humain",{"thoughts":"'Être humain' is a simple French expression meaning 'human being', referring to a person regarded as an individual. It's a term that highlights one's humanity and is a basic yet foundational concept relevant to many discussions and dialogues.","target_language_multi_word_term":"être humain","meaning":"'human being'.","additional_notes":"It is used to refer to a person in terms of their humanity, individual existence, and moral considerations.","target_language_example":"Chaque être humain a des droits fondamentaux.","native_language_example":"Every human being has fundamental rights."}]
["être le cas",{"thoughts":"\"Être le cas\" is a phrase used to affirm that a situation or condition is true or applicable. It is similar to saying \"to be the case\" in English, often used in logical or factual contexts.","target_language_multi_word_term":"être le cas","meaning":"'to be the case'.","additional_notes":"Used to indicate that something is true, applies or is happening as assumed or claimed.","target_language_example":"Si c'est ce que tu penses, alors cela doit être le cas.","native_language_example":"If that's what you think, then it must be the case."}]
["être là",{"thoughts":"'Être là' is a simple yet versatile French phrase used to indicate presence or attendance. It is relevant for beginners because it appears in everyday conversation to convey that someone or something is present or available.","target_language_multi_word_term":"être là","meaning":"to be there or to be present.","additional_notes":"This phrase is used to indicate physical presence or availability in a specific place or situation.","target_language_example":"Je serai là à 19 heures.","native_language_example":"I will be there at 7 PM."}]
["être à",{"thoughts":"The phrase 'être à' is most useful for beginners in the sense of expressing ownership or belonging: « C’est à moi » = “It’s mine.” It comes with a stressed pronoun or noun after the preposition à. Less commonly, it can be followed by a place (être à Paris) but beginners usually learn that as just verb + preposition, not as a fixed expression. The possession usage is the one worth highlighting.","target_language_multi_word_term":"être à","meaning":"to belong to","additional_notes":"Used with a stressed pronoun or noun to show possession or ownership (c’est à lui, ce stylo est à Sophie).","target_language_example":"Ce livre est à moi.","native_language_example":"This book is mine."}]
