["a",{"thoughts":"Le graphème anglais « a » le plus courant se prononce /æ/, un son ouvert situé entre le « a » et le « è » français. Les francophones connaissent déjà la lettre, mais pas forcément cette voyelle très spécifique.","pattern":"a","position":"Anywhere","description":"Ouvrez grand la bouche comme pour dire « a », puis avancez légèrement la langue vers l’avant et abaissez-la un peu. Le son est court, tendu, plus ouvert que le « è » et plus frontal que le « a » français : /æ/. Ne laissez pas la voix traîner ; coupez net.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Apple","native":"Apple","position":"Beginning","cultural_context":"Marque de smartphones et d’ordinateurs très utilisée en France"},{"target":"Batman","native":"Batman","position":"Multiple","cultural_context":"Super-héros de films et bandes dessinées mondialement connus"},{"target":"Amazon","native":"Amazon","position":"Beginning","cultural_context":"Plateforme de commerce en ligne souvent utilisée pour les achats"}]}]
["b",{"thoughts":"Le son /b/ existe déjà en français; c’est une consonne occlusive bilabiale voisée identique dans les deux langues. Les apprenants n’ont donc pratiquement rien à ajuster, si ce n’est d’être attentifs à ne pas le transformer en /p/ non voisé en fin de mot anglais.","pattern":"b","position":"Anywhere","description":"Fermez brièvement les deux lèvres, faites vibrer les cordes vocales et relâchez l’air : c’est une occlusive bilabiale voisée. Tout comme le « b » français, mais en anglais on veille à bien garder la vibration, même en fin de mot.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Burger","native":"burger","position":"Beginning","cultural_context":"Mot très courant pour le célèbre sandwich, utilisé tel quel en français"},{"target":"Barbie","native":"Barbie","position":"Multiple","cultural_context":"Poupée iconique et film récent, largement connue en France"},{"target":"Facebook","native":"Facebook","position":"Middle","cultural_context":"Réseau social mondialement utilisé, mot très familier aux francophones"}]}]
["c",{"thoughts":"La lettre « c » en anglais correspond la plupart du temps à /k/ (« cat ») ou à /s/ devant i, e, y (« city »). Ces deux sons existent déjà en français (« cadeau », « science »), donc les francophones les connaissent. La seule vigilance est de ne pas prononcer /k/ devant i, e, y. Peu de difficulté générale.","pattern":"c","position":"Anywhere","description":"En anglais, la lettre « c » se prononce :\n• /k/ (comme le « qu » de « qui ») quand elle est suivie de a, o, u ou d’une consonne : car, cold, cucumber.\n• /s/ (comme le « s » de « science ») quand elle est suivie de e, i, y : center, city, cycle.\nIl n’y a pas d’adoucissement comme en français (« garçon »), et on n’entend jamais /ʃ/ sauf dans quelques mots italiens (cello).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Coca-Cola","native":"Coca-Cola","position":"Multiple","cultural_context":"Marque de boisson gazeuse mondialement connue, omniprésente dans la publicité et la restauration"},{"target":"city","native":"ville","position":"Beginning","cultural_context":"Mot anglais fréquent dans les jeux vidéo (« SimCity »), le tourisme ou la pop-culture"},{"target":"basic","native":"basique","position":"End","cultural_context":"Adjectif anglais souvent utilisé tel quel en français (« un look basic ») et dans le nom du langage informatique « BASIC »"}]}]
["d",{"thoughts":"Le /d/ anglais est pratiquement le même que le /d/ français : consonne occlusive, alvéolaire et sonore. Les francophones l’emploient déjà dans « dîner », « devoir », etc. Il n’y a donc pas de réel piège articulatoire ; le principal point d’attention est de ne pas le transformer en /t/ final par désonorisation.","pattern":"d","position":"Anywhere","description":"Consonne occlusive sonore : la pointe de la langue vient toucher la zone juste derrière les incisives supérieures (alvéoles), bloque brièvement l’air, puis se relève en laissant passer l’air avec vibration des cordes vocales. Même position et voisement qu’en français.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Disney","native":"Disney","position":"Beginning","cultural_context":"Géant du divertissement ; la plupart des francophones connaissent les films et les parcs Disney"},{"target":"McDonald's","native":"McDonald's","position":"Middle","cultural_context":"Chaîne de restauration rapide présente partout en France"},{"target":"red","native":"rouge","position":"End","cultural_context":"Couleur basique souvent rencontrée : \"red wine\", \"Red Bull\", etc."}]}]
["e",{"thoughts":"La lettre « e » représente le son court /ɛ/ le plus fréquent en anglais (comme dans « bed »). Pour un francophone, c’est pratiquement le même son que le « è » de « belle ». Donc très familier et généralement facile à reproduire.","pattern":"e","position":"Anywhere","description":"Son voyelle bref, bouche mi-ouverte : abaissez légèrement la mâchoire, lèvres détendues, langue placée vers l’avant et relativement basse. C’est le même geste que pour le « è / ê » français (« belle, même »). Attention à ne pas allonger le son ; il doit rester court et net.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Emma","native":"Emma","position":"Beginning","cultural_context":"Prénom très répandu (Emma Watson, Emma Stone) souvent cité dans les médias"},{"target":"Pepsi","native":"Pepsi","position":"Middle","cultural_context":"Marque de soda mondialement connue et disponible en France"},{"target":"Tesla","native":"Tesla","position":"Middle","cultural_context":"Constructeur de voitures électriques souvent mentionné dans l’actualité et la publicité"}]}]
["f",{"thoughts":"Le /f/ anglais est pratiquement identique au /f/ français, il ne devrait donc poser aucun problème majeur. Le principal point d’attention est simplement de ne pas voiser le son (ne pas le transformer en /v/) et de maintenir un flux d’air continu.","pattern":"f","position":"Anywhere","description":"Placez la lèvre inférieure juste contre le bord des dents du haut, puis faites passer l’air sans vibration des cordes vocales (c’est un son sourd). C’est exactement le même geste que pour le « f » français, comme dans « famille ».","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"film","native":"film","position":"Beginning","cultural_context":"Mot identique en français, très présent dans le vocabulaire du cinéma"},{"target":"coffee","native":"café","position":"Middle","cultural_context":"Boisson omniprésente; on voit souvent l’inscription \"coffee\" dans les chaînes comme Starbucks"},{"target":"chef","native":"chef","position":"End","cultural_context":"Terme de cuisine repris tel quel en anglais pour désigner le cuisinier principal"}]}]
["g",{"thoughts":"Le /g/ anglais est pratiquement le même « g dur » que dans les mots français comme « gare » ou « gomme ». Les francophones y sont donc déjà exposés et le maîtrisent souvent sans effort particulier. Le défi principal est surtout de ne pas le confondre avec le son /dʒ/ de « j » anglais (comme dans « jump »), ni de le rendre trop mou ou aspiré.","pattern":"g","position":"Anywhere","description":"Son occlusive vélaire sonore : l’arrière de la langue se plaque contre le voile du palais pour bloquer l’air, puis relâche brusquement. Les cordes vocales vibrent. Identique au « g » dur français devant « a, o, u ».","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Google","native":"Google","position":"Multiple","cultural_context":"Moteur de recherche et entreprise technologique mondialement connue, utilisé quotidiennement"},{"target":"Burger","native":"burger","position":"Middle","cultural_context":"Plat de restauration rapide très répandu en France (menus ‘burger’ dans tous les fast-foods)"},{"target":"Big Mac","native":"Big Mac","position":"End","cultural_context":"Nom emblématique du sandwich de McDonald’s, omniprésent dans la publicité"}]}]
["h",{"thoughts":"Le « h » anglais est écrit comme en français, mais il se prononce réellement, ce qui surprend souvent les francophones. Ils le voient partout (hamburger, Harry Potter, Halloween) mais n’activent pas toujours le son dans leur bouche.","pattern":"h","position":"Anywhere","description":"Le « h » anglais se produit en expirant un souffle rapide et audible par la bouche, sans faire vibrer les cordes vocales. C’est comme si vous vouliez désembuer une vitre ou souffler doucement sur une soupe chaude : l’air sort librement, la bouche est ouverte, la langue reste basse et détendue. Aucune voix n’est utilisée ; c’est un simple souffle.\nExemples : [h-] dans « house », [-h-] dans « ahead », [-h] dans « bah! ».","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Harry Potter","native":"Harry Potter","position":"Beginning","cultural_context":"Saga littéraire et cinématographique mondialement connue, fréquemment mentionnée en France."},{"target":"hamburger","native":"hamburger","position":"Beginning","cultural_context":"Plat de restauration rapide omniprésent en France (McDonald’s, Burger King, etc.)."},{"target":"Bahamas","native":"Bahamas","position":"Middle","cultural_context":"Destination touristique et archipel souvent cités dans les médias et les agences de voyage."}]}]
["i",{"thoughts":"Le « i » anglais le plus courant se prononce /ɪ/, une voyelle brève et relâchée absente du français. Les francophones la rencontrent souvent dans des noms connus (Disney, Big Mac…) mais la confondent fréquemment avec leur /i/ tendu.","pattern":"i","position":"Anywhere","description":"En anglais, la lettre « i » se prononce très souvent /ɪ/ : une voyelle brève, un peu plus basse et plus courte que le « i » français de « si ». Ouvrez légèrement la mâchoire, gardez la langue vers l’avant mais moins haute, lèvres détendues (pas de grand sourire). Le son doit rester court, sans prolongation.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Disney","native":"Disney","position":"Beginning","cultural_context":"Géant du divertissement (films, dessins animés, parcs) très présent en France."},{"target":"Big Mac","native":"Big Mac","position":"Middle","cultural_context":"Burger emblématique de McDonald’s, connu de tous les consommateurs français."},{"target":"Liverpool","native":"Liverpool","position":"Beginning","cultural_context":"Ville anglaise célèbre pour les Beatles et son club de football suivi en France."}]}]
["j",{"thoughts":"Le son anglais /dʒ/ écrit « j » est absent du français standard ; les francophones le remplacent souvent par /ʒ/. Toutefois, beaucoup de mots empruntés (jeans, jazz) l’exposent déjà aux apprenants.","pattern":"j","position":"Anywhere","description":"Son affriqué : commencez par un léger « d » (langue contre les alvéoles, comme pour « d »), puis faites glisser aussitôt vers le son « ʒ » (“j” français de « jour »). Les deux phases sont collées ; on entend « d » + « j » en une seule explosion : /dʒ/. Les cordes vocales vibrent tout du long.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"jeans","native":"jean","position":"Beginning","cultural_context":"Vêtement universel, mot utilisé couramment en français (« un jean »)."},{"target":"jazz","native":"jazz","position":"Beginning","cultural_context":"Genre musical très connu, gardant son orthographe anglaise en français."},{"target":"emoji","native":"emoji","position":"Middle","cultural_context":"Icônes utilisées dans les messages; même orthographe dans les applications françaises."}]}]
["k",{"thoughts":"Le son /k/ existe déjà en français (ex. « car », « club »). La principale différence en anglais est l’aspiration qui accompagne souvent le /k/ en début de mot, mais cette nuance n’empêche pas la compréhension si elle est absente. Les apprenants français n’ont donc pas à créer un nouveau geste articulatoire, seulement à gérer éventuellement l’aspiration.","pattern":"k","position":"Anywhere","description":"Consonne occlusive vélaire sourde : l’arrière de la langue se plaque contre le voile du palais, l’air est bloqué puis relâché. En anglais, quand le /k/ est en début de syllabe accentuée, on laisse souvent un petit souffle d’air (aspiration) juste après l’explosion (comme un mini « h »).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"KFC","native":"KFC","position":"Beginning","cultural_context":"Chaîne de fast-food américaine bien implantée en France, souvent prononcée en anglais."},{"target":"Coca-Cola","native":"Coca-Cola","position":"Multiple","cultural_context":"Soda emblématique mondial, nom identique en français."},{"target":"rock","native":"rock","position":"End","cultural_context":"Genre musical fréquemment mentionné dans les médias et festivals français."}]}]
["l",{"thoughts":"Le /l/ anglais est globalement familier aux francophones car ils possèdent déjà un /l/ clair. La nouveauté vient du « dark L » final, un /l/ vélarisé que l’on n’a pas en français ; cela peut rendre les positions finales un peu plus difficiles.","pattern":"l","position":"Anywhere","description":"Placez la pointe de la langue juste derrière les incisives supérieures, comme pour le « l » français, mais veillez à deux variantes :\n• Début/milieu de mot : /l/ clair, identique au français.\n• Fin de mot : /ɫ/ (dark L) – maintenez la même position, mais soulevez l’arrière de la langue vers le voile du palais et laissez résonner la voyelle précédente, sans ajouter de voyelle « e » finale.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"London","native":"Londres","position":"Beginning","cultural_context":"Capitale du Royaume-Uni, souvent mentionnée en cours d’anglais et dans les médias français"},{"target":"hello","native":"hello","position":"Middle","cultural_context":"Salutation anglaise très courante, apprise dès les premières leçons"},{"target":"football","native":"football","position":"End","cultural_context":"Sport mondialement connu ; le mot est utilisé tel quel en français pour parler du sport"}]}]
["m",{"thoughts":"Le son /m/ existe déjà en français, c’est un nasal bilabial très fréquent. Les francophones ne rencontrent donc quasiment aucune nouveauté articulatoire en anglais pour ce son. La seule vigilance concerne le maintien d’une bonne fermeture des lèvres afin d’éviter qu’un /n/ n’apparaisse par erreur dans un débit rapide.","pattern":"m","position":"Anywhere","description":"Fermez les deux lèvres et faites vibrer les cordes vocales en laissant l’air résonner dans le nez ; la mâchoire est détendue, la langue repose naturellement. C’est la même position qu’en français pour les mots « maman » ou « moi ».","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"McDonald's","native":"McDonald's","position":"Beginning","cultural_context":"Chaîne de restauration rapide mondialement connue, présente partout en France"},{"target":"Amazon","native":"Amazon","position":"Middle","cultural_context":"Plateforme de commerce en ligne très utilisée pour les achats en France"},{"target":"team","native":"équipe (anglicisme « team »)","position":"End","cultural_context":"Mot anglais couramment utilisé en français dans le monde du sport et de l’entreprise, ex. « team building »"}]}]
["n",{"thoughts":"Le /n/ anglais est quasi identique au /n/ français : même point d’articulation (alvéolaire) et même passage de l’air par le nez. Les apprenants francophones n’ont donc pratiquement rien à réapprendre, si ce n’est d’être attentifs à le prononcer même en fin de mot, où il n’est pas toujours audible en français (ex. « parleNt »).","pattern":"n","position":"Anywhere","description":"Consonne nasale alvéolaire : le bout de la langue touche la crête des alvéoles (juste derrière les dents du haut) et l’air passe par le nez. Les cordes vocales vibrent. Le geste est le même qu’en français pour la lettre « n ».","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Netflix","native":"Netflix","position":"Beginning","cultural_context":"Plate-forme de streaming très utilisée en France"},{"target":"Amazon","native":"Amazon","position":"End","cultural_context":"Site d’e-commerce mondialement connu, très présent en France"},{"target":"London","native":"Londres","position":"Multiple","cultural_context":"Capitale britannique visitée et évoquée fréquemment dans les médias français"}]}]
["o",{"thoughts":"Le « o » anglais se réalise le plus souvent comme la diphtongue /oʊ/ (ou /əʊ/), donc proche d’un « o » français fermé qui glisse vers un petit « ou ». Les francophones connaissent déjà la lettre mais oublient souvent le glissement final.","pattern":"o","position":"Anywhere","description":"Commencez par un « o » bien fermé (lèvres arrondies, langue vers l’arrière) puis faites rapidement glisser le son vers un léger « ou » tout en relâchant un peu les lèvres. La voyelle est un peu plus longue qu’en français : on maintient le son puis on termine par le petit mouvement vers « ou ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"okay","native":"okay","position":"Beginning","cultural_context":"Mot anglais très courant en français pour signifier « d’accord »"},{"target":"Coca-Cola","native":"Coca-Cola","position":"Multiple","cultural_context":"Marque de soda mondialement connue et largement consommée en France"},{"target":"smartphone","native":"smartphone","position":"Middle","cultural_context":"Terme anglais utilisé tel quel en français pour désigner les téléphones intelligents"}]}]
["p",{"thoughts":"Le son /p/ existe déjà en français. La seule vraie nouveauté pour les francophones est l’aspiration en début de mot accentué, mais la majorité sauront produire un /p/ intelligible dès le départ.","pattern":"p","position":"Anywhere","description":"Consonne occlusive bilabiale sourde : on ferme totalement les deux lèvres, on bloque brièvement l’air puis on relâche brusquement. En anglais, quand /p/ se trouve au début d’un mot ou d’une syllabe accentuée, il est suivi d’une forte bouffée d’air (aspiration). Placez votre main devant votre bouche : vous devriez sentir ce souffle, plus marqué qu’en français. Le larynx reste inactif (pas de vibration). En milieu ou en fin de mot, l’aspiration est plus faible, mais le mécanisme de base reste identique.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Pepsi","native":"Pepsi","position":"Beginning","cultural_context":"Marque de boisson gazeuse mondialement connue, souvent vue dans la publicité et les supermarchés en France."},{"target":"Apple","native":"Apple","position":"Middle","cultural_context":"Nom de la célèbre entreprise de technologie (iPhone, Mac) fréquemment mentionnée dans les médias français."},{"target":"shop","native":"shop","position":"End","cultural_context":"Mot anglais couramment utilisé en français pour désigner une boutique (« concept-store », « pop-up shop »)."}]}]
["q",{"thoughts":"En anglais, la lettre « q » se prononce presque toujours dans le digramme « qu » comme /k/ suivi d’une légère semi-voyelle /w/ : /kw/. Les francophones connaissent déjà « qu » mais le réalisent simplement /k/ (pas de /w/). Ils doivent donc ajouter un petit glissement des lèvres vers la position de /w/. Dans quelques noms propres (Iraq, Qatar) le /w/ disparaît ; le son reste alors un /k/ net.","pattern":"q","position":"Anywhere","description":"En anglais, « q » s’entend majoritairement dans « qu- ». On prononce d’abord un /k/ (arrière de la langue contre le voile du palais), puis on relâche en arrondissant brièvement les lèvres comme pour /w/ : /kw/. Le flux d’air reste continu, aucune vibration des cordes vocales. Pensez à dire « k-oua » très rapide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Qatar","native":"Qatar","position":"Beginning","cultural_context":"Pays du Golfe régulièrement cité dans les infos sportives (Coupe du monde de football 2022) et économiques"},{"target":"Iraq","native":"Irak","position":"End","cultural_context":"Pays du Moyen-Orient souvent mentionné dans l’actualité internationale"},{"target":"Queen","native":"Queen","position":"Beginning","cultural_context":"Groupe de rock britannique célèbre (« Bohemian Rhapsody ») et titre honorifique pour la monarchie britannique"}]}]
["r",{"thoughts":"Le « r » anglais /ɹ/ est souvent confondu avec le « r » français [ʁ]. Il exige une toute autre position de langue (pointe relevée et reculée) et aucune friction; cela surprend la plupart des francophones.","pattern":"r","position":"Anywhere","description":"Pour produire le « r » anglais, placez la pointe de la langue légèrement relevée vers le palais dur, sans le toucher. Les bords de la langue peuvent effleurer les molaires du haut, la langue forme une « cuillère ». Gardez la gorge détendue, faites passer l’air librement sans faire vibrer ni rouler la langue (pas de battement ni de gutturalité). Les lèvres peuvent être légèrement arrondies mais ne serrent pas.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Rock'n'Roll","native":"Rock'n'Roll","position":"Multiple","cultural_context":"Expression musicale mondialement connue, souvent reprise telle quelle en français"},{"target":"burger","native":"burger","position":"Middle","cultural_context":"Plat de restauration rapide omniprésent en France (fast-food, menus « burger »)"},{"target":"Harry","native":"Harry","position":"Middle","cultural_context":"Prénom du héros de la saga « Harry Potter », extrêmement populaire"}]}]
["s",{"thoughts":"Le /s/ anglais est presque identique au « s » français non-voisé. Les apprenants n’auront donc pas de nouveau placement articulatoire à acquérir, simplement à veiller à ne pas le faire sonner /z/ ou à l’aspirer comme /ʃ/.","pattern":"s","position":"Anywhere","description":"Son fricatif alvéolaire sourd : la pointe de la langue touche presque les alvéoles (derrière les dents du haut) en laissant passer un filet d’air continu et non voisé. C’est le même geste que pour le « s » de « souris » en français.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Skype","native":"Skype","position":"Beginning","cultural_context":"Logiciel d’appels vidéo très utilisé, même mentionné dans les médias français"},{"target":"Paris","native":"Paris","position":"End","cultural_context":"Nom de la capitale française ; en anglais on prononce clairement le -s final /pærɪs/"},{"target":"Starbucks","native":"Starbucks","position":"Multiple","cultural_context":"Chaîne de cafés internationale présente dans de nombreuses villes françaises"}]}]
["t",{"thoughts":"Le /t/ anglais est globalement familier aux francophones, mais l’aspiration forte en début de syllabe et la prononciation obligatoire du /t/ final peuvent surprendre.","pattern":"t","position":"Anywhere","description":"Consonne occlusive alvéolaire sourde. Pointe de la langue contre la crête alvéolaire (juste derrière les dents du haut), explosion d’air courte. En anglais, on ajoute une aspiration audible au début d’une syllabe accentuée (petit souffle après le /t/, comme dans « to » ou « Toyota »). À la fin d’un mot, le /t/ se prononce toujours, contrairement à beaucoup de mots français où le « t » final est muet.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Toyota","native":"Toyota","position":"Beginning","cultural_context":"Marque automobile japonaise très présente en France"},{"target":"Internet","native":"Internet","position":"Multiple","cultural_context":"Terme universel utilisé tel quel en français pour désigner le réseau mondial"},{"target":"cat","native":"chat","position":"End","cultural_context":"Mot anglais basique souvent entendu dans les chansons, films ou applications d’apprentissage"}]}]
["u",{"thoughts":"La lettre « u » peut représenter plusieurs sons en anglais ; le plus déroutant pour un francophone est le “short u” /ʌ/ (comme dans « cup »). Ce son n’existe pas en français ; on a donc tendance à le remplacer par /u/ (« ou ») ou /ø/ (« eu »), ce qui crée immédiatement un accent fort. Les exemples choisis – Subway, fun, cupcake – sont déjà connus des apprenants, ce qui facilite la prise de conscience.","pattern":"u","position":"Anywhere","description":"En anglais, le « u » court se prononce /ʌ/ : la langue est abaissée et légèrement avancée, la mâchoire est détendue, les lèvres restent neutres (ni arrondies ni étirées). Le son est bref, central ; il se situe entre le « a » de « papa » et le « eu » français, sans arrondi. Attention : ne surtout pas arrondir comme pour « ou » français (« loup ») ni fermer comme pour « u » français (« lune »).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Subway","native":"Subway","position":"Middle","cultural_context":"Chaîne de sandwichs américaine présente en France et visible dans les films/séries"},{"target":"fun","native":"fun","position":"Middle","cultural_context":"Mot anglais couramment utilisé en français familier pour dire « amusant »"},{"target":"cupcake","native":"cupcake","position":"Middle","cultural_context":"Petit gâteau américain populaire dans les cafés, pâtisseries et émissions culinaires"}]}]
["v",{"thoughts":"Le son /v/ existe déjà en français, avec la même articulation labio-dentale voisée. Les apprenants n’auront donc presque aucune nouveauté articulatoire à gérer, mais devront rester attentifs à ne pas le remplacer par un /w/ anglais ou un /f/ non voisé.","pattern":"v","position":"Anywhere","description":"Consonne fricative labio-dentale voisée : placez la lèvre inférieure contre les incisives supérieures, faites passer l’air en continu en vibrant les cordes vocales. C’est le même geste que pour le « v » français.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Visa","native":"Visa","position":"Beginning","cultural_context":"Carte de paiement internationale très utilisée, publicité fréquente en France"},{"target":"love","native":"amour","position":"End","cultural_context":"Mot anglais basique souvent entendu dans les chansons et expressions comme « I love you »"},{"target":"Avengers","native":"Avengers","position":"Multiple","cultural_context":"Série de films Marvel extrêmement populaire en France"}]}]
["w",{"thoughts":"Le son /w/ existe dans des mots anglais très courants entendus en France (week-end, wifi…), mais la réalisation exacte n’existe pas en français : les francophones ont donc tendance à le remplacer par /v/ ou par « ou ». Il est donc familier à l’oreille mais pas toujours bien produit.","pattern":"w","position":"Anywhere","description":"Le /w/ anglais est une semi-consonne labio-vélaire. Pour le produire :\n• Arrondissez les lèvres comme pour dire « ou » mais sans les avancer exagérément.\n• Ne serrez pas les lèvres ni ne touchez les dents (sinon vous ferez un /v/).\n• Laissez l’air passer librement pendant que la langue reste en arrière, puis enchaînez immédiatement avec la voyelle qui suit.\nC’est un mouvement très bref, presque comme un petit glissement vers la voyelle suivante.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"week-end","native":"week-end","position":"Beginning","cultural_context":"Mot anglais utilisé tel quel en français pour parler des deux jours de repos."},{"target":"wifi","native":"wifi","position":"Beginning","cultural_context":"Nom de la connexion sans fil présent sur tous les téléphones et box internet."},{"target":"cowboy","native":"cowboy","position":"Middle","cultural_context":"Personnage des westerns et déguisements connus, mot emprunté depuis longtemps."}]}]
["x",{"thoughts":"La lettre « x » existe déjà en français avec des réalisations /ks/ ou /gz/, donc le concept n’est pas nouveau. En anglais, elle suit des règles proches mais avec quelques variantes (début de mot = /z/). Le défi principal pour un francophone est de penser à l’alternance /gz/ entre deux voyelles sonores, moins fréquente en français, et de ne pas aspirer exagérément le /k/.","pattern":"x","position":"Anywhere","description":"En anglais, la lettre « x » se prononce le plus souvent /ks/ : d’abord une petite occlusion à l’arrière de la bouche (/k/), immédiatement suivie du frottement /s/. Entre deux voyelles sonores, elle devient /gz/ (voisement du /k/ et du /s/). Au début d’un mot, elle se réalise généralement /z/. Ces trois variantes sont les plus courantes ; le contexte du mot indique laquelle utiliser.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"xylophone","native":"xylophone","position":"Beginning","cultural_context":"Instrument de musique étudié à l’école et présent dans les dictionnaires français"},{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Mot identique en français pour le véhicule de transport urbain"},{"target":"Netflix","native":"Netflix","position":"End","cultural_context":"Plateforme de streaming mondialement connue et utilisée en France"}]}]
["y",{"thoughts":"La lettre « y » ne pose pas de problème de reconnaissance aux francophones car elle existe en français, mais la variété de sons qu’elle représente en anglais (/j/, /ɪ/, /i/, ou la diphtongue /aɪ/) peut surprendre. Le plus sûr est de retenir qu’en début de mot elle est presque toujours la semi-voyelle /j/, alors qu’en fin de mot elle se comporte comme une voyelle courte /i/.","pattern":"y","position":"Anywhere","description":"En anglais, la lettre « y » sert souvent :\n1. Comme consonne /j/ : un petit « i » glissé. Étirez légèrement les lèvres, placez le milieu de la langue près du palais sans le toucher et laissez l’air passer (« yes »).\n2. Comme voyelle non accentuée /ɪ/ ou /i/ en fin de mot (« baby », « happy ») : un « i » bref, plus court que le « i » français.\n3. Dans certains mots monosyllabiques terminés par « y » (« my », « sky »), il est la moitié finale de la diphtongue /aɪ/ (aïe).\nLa clé : identifier sa position dans le mot pour choisir la bonne valeur sonore.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"YouTube","native":"YouTube","position":"Beginning","cultural_context":"Plateforme vidéo mondialement utilisée, mot vu quotidiennement sur internet"},{"target":"New York","native":"New York","position":"Middle","cultural_context":"Ville emblématique souvent mentionnée dans les films, séries et cours d’anglais"},{"target":"baby","native":"bébé","position":"End","cultural_context":"Mot présent dans de nombreuses chansons pop et expressions courantes (« baby, baby »)"}]}]
["z",{"thoughts":"Le son /z/ existe déjà en français (« zéro », « rose »). Les apprenants n’ont donc pas de nouvelle articulation à apprendre, seulement à veiller à ne pas le remplacer par /s/ en fin de mot anglais.","pattern":"z","position":"Anywhere","description":"Consonne fricative alvéolaire voisée : faites vibrer vos cordes vocales tout en laissant l’air passer entre le bout de la langue et les alvéoles (juste derrière les dents du haut), comme dans le français « zéro ». Le flux d’air est continu, sans arrêt ni explosion.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Zara","native":"Zara","position":"Beginning","cultural_context":"Marque de prêt-à-porter internationale très présente en France"},{"target":"Amazon","native":"Amazon","position":"Middle","cultural_context":"Site de commerce en ligne que presque tout le monde utilise"},{"target":"jazz","native":"jazz","position":"End","cultural_context":"Genre musical populaire et mot identique en français"}]}]
["ch",{"thoughts":"Le digramme « ch » en anglais correspond le plus souvent au son affriqué sourd /tʃ/, absent du français. Les francophones le rencontrent dans de nombreux mots empruntés à l’anglais, ce qui crée une certaine familiarité auditive, mais l’articulation (enchaînement [t] + [ʃ]) reste peu naturelle et demande un peu de pratique.","pattern":"ch","position":"Anywhere","description":"Prononcez /tʃ/ : commencez par placer la langue comme pour un /t/ (pointe contre les alvéoles), bloquez brièvement l’air puis relâchez-le en faisant glisser la langue vers la position du /ʃ/ (le \"ch\" français). Le tout doit s’enchaîner rapidement, comme un petit « t-ch » fusionné.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"chips","native":"chips","position":"Beginning","cultural_context":"Mot très courant en France pour désigner les croustilles de pommes de terre, écrit et entendu dans la publicité et les supermarchés."},{"target":"sandwich","native":"sandwich","position":"End","cultural_context":"Même mot qu’en français ; on le lit sur les menus et emballages, mais la prononciation anglaise finit par /tʃ/ et non par /ʃ/."},{"target":"beach","native":"plage","position":"End","cultural_context":"Terme fréquent dans le tourisme (beach volley, beach club) et dans les chansons anglophones populaires."}]}]
["sh",{"thoughts":"Le son « sh » existe rarement en français standard, mais les francophones l’ont déjà entendu dans des anglicismes comme « shopping » ou dans des noms propres (Washington, Shakespeare). Ils le confondent parfois avec le « ch » français ou prononcent un mélange des deux.","pattern":"sh","position":"Anywhere","description":"Pour produire « sh », arrondissez légèrement les lèvres (comme pour dire « chou ») et placez la langue proche mais sans toucher le palais dur, derrière les dents. L’air passe de façon continue et sourde, sans vibration des cordes vocales (c’est un son non voisé). Il est plus doux et plus prolongé que le « ch » français de « chat ».","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"shopping","native":"shopping","position":"Beginning","cultural_context":"Anglicisme très utilisé en français pour parler des courses de vêtements ou loisirs"},{"target":"Washington","native":"Washington","position":"Middle","cultural_context":"Capitale des États-Unis, souvent mentionnée dans les actualités et les films"},{"target":"cash","native":"cash","position":"End","cultural_context":"Mot anglais employé en français pour parler d’argent liquide ou d’une franchise directe (« être cash »)"}]}]
["th",{"thoughts":"Le digramme « th » n’existe pas en français ; il correspond à deux fricatives dentales anglaises (/θ/ sourde et /ð/ sonore). Les francophones les assimilent souvent à /s/, /z/ ou /d/ et doivent apprendre un nouveau geste articulatoire.","pattern":"th","position":"Anywhere","description":"Placez le bout de la langue légèrement entre les incisives supérieures et inférieures ; faites passer l’air.\n• Version sourde /θ/ (comme dans « think ») : les cordes vocales ne vibrent pas, on entend un léger souffle.\n• Version sonore /ð/ (comme dans « the ») : même position mais avec vibration des cordes vocales.\nAttention : ne pas coller la langue derrière les dents comme pour un « s » français, sinon le son devient /s/ ou /z/.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Thor","native":"Thor","position":"Beginning","cultural_context":"Super-héros Marvel mondialement connu grâce aux films au cinéma"},{"target":"South Park","native":"South Park","position":"End","cultural_context":"Série d’animation américaine culte diffusée en France depuis les années 1990"},{"target":"Game of Thrones","native":"Game of Thrones","position":"Beginning","cultural_context":"Série télévisée à succès massive, régulièrement citée dans les médias français"}]}]
["ph",{"thoughts":"Le digramme « ph » se prononce généralement /f/ en anglais, exactement comme en français. Les francophones rencontrent déjà cette graphie dans des mots comme « philosophie », donc la correspondance graphie/son est familière. La seule éventuelle surprise vient de quelques mots grecs où « ph » peut être aspiré en anglais académique (/pʰ/) mais c’est rarissime dans la langue courante.","pattern":"ph","position":"Anywhere","description":"« ph » se prononce presque toujours comme le son /f/ (comme dans « f comme “four” »). Il suffit de placer la lèvre inférieure contre les dents du haut et de souffler, sans vibration des cordes vocales. C’est exactement le même geste que pour la lettre « f » en français.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"phone","native":"téléphone","position":"Beginning","cultural_context":"Mot technologique omniprésent (« smartphone », « phone ») et proche du français « téléphone »."},{"target":"photo","native":"photo","position":"Beginning","cultural_context":"Utilisé quotidiennement sur les réseaux sociaux (« poster une photo »), orthographe identique au français."},{"target":"elephant","native":"éléphant","position":"Middle","cultural_context":"Animal emblématique appris dès l’enfance ; l’orthographe anglaise diffère peu du français."}]}]
["wh",{"thoughts":"Le digramme « wh » se voit surtout au début des mots; les francophones l’ont déjà rencontré dans des marques (WhatsApp, whisky). Ils savent donc l’orthographe, mais la prononciation /w/ anglais reste piège : dire un vrai /w/ arrondi (comme un court « ou ») sans glisser vers /v/ ni ajouter une voyelle est moins intuitif. L’aspiration /hw/ n’est utile que dans quelques accents; on peut la mentionner mais se concentrer sur /w/. Globalement, son connu mais articulation encore à travailler.","pattern":"wh","position":"Anywhere","description":"« wh » se prononce presque toujours /w/ en anglais standard : faites un petit rond avec les lèvres comme pour dire « ou », puis laissez l’air sortir très brièvement avant de passer à la voyelle suivante ; la langue reste en arrière, sans contact avec les dents. N’ajoutez pas de son [v] ni de voyelle « oua ». Dans certains accents (écossais, certaines régions des États-Unis), on entend une légère aspiration avant le /w/ ([hw] ou [ʍ]), mais comprendre cette variante suffit.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"whisky","native":"whisky","position":"Beginning","cultural_context":"Spiritueux très connu et mot déjà utilisé tel quel en français"},{"target":"WhatsApp","native":"WhatsApp","position":"Beginning","cultural_context":"Application de messagerie largement installée sur les smartphones en France"},{"target":"Whopper","native":"Whopper","position":"Beginning","cultural_context":"Nom du hamburger emblématique de Burger King, chaîne présente en France"}]}]
["ck",{"thoughts":"En anglais, la suite de lettres « ck » ne représente qu’un seul son, /k/. Pour des francophones, le son lui-même est familier, mais ils doivent se rappeler que les deux lettres ne se prononcent pas séparément et qu’aucune voyelle intermédiaire n’existe.","pattern":"ck","position":"Anywhere","description":"« ck » se prononce comme la consonne occlusive vélaire sourde /k/ (comme le « k » français dans « kilo »). Les deux lettres servent simplement à indiquer un /k/ court immédiatement après une voyelle courte ; on n’ajoute ni voyelle ni pause entre le « c » et le « k ». En début de syllabe, le /k/ anglais est souvent légèrement aspiré, mais à la fin il est sec et net, sans schwa après.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"black","native":"black","position":"End","cultural_context":"Mot souvent utilisé en français : « Black Friday », genres musicaux (black metal), ou pour décrire une couleur"},{"target":"rock","native":"rock","position":"End","cultural_context":"Genre musical très connu en France ; on parle couramment de « musique rock »"},{"target":"snack","native":"snack","position":"End","cultural_context":"Mot courant dans la restauration rapide en France ; on voit des enseignes « snack » un peu partout"}]}]
["ng",{"thoughts":"French speakers rencontrent déjà /ŋ/ dans des emprunts comme “parking”, mais ils ajoutent souvent un léger /g/ final. Ils connaissent donc le graphème « ng », mais la réalisation purement nasale, sans explosion /g/, reste à travailler.","pattern":"ng","position":"Anywhere","description":"Son nasal dit « nasale vélaire » : placez l’arrière de la langue contre le voile du palais (même zone que pour /k/ ou /g/), laissez l’air sortir uniquement par le nez et ne relâchez PAS avec un /g/. La bouche reste ouverte, les cordes vocales vibrent.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ping-pong","native":"ping-pong","position":"Multiple","cultural_context":"Jeu de raquette très populaire ; le mot est couramment utilisé en français"},{"target":"parking","native":"parking","position":"End","cultural_context":"Emprunt anglais intégré au vocabulaire français pour désigner un stationnement"},{"target":"Burger King","native":"Burger King","position":"End","cultural_context":"Chaîne de restauration rapide présente en France, connue via la publicité et la culture pop"}]}]
["nk",{"thoughts":"Le groupe de lettres « nk » est souvent rencontré par les francophones dans des mots d’emprunt (tank, punk, Bangkok). Il représente en anglais une succession rapide de la nasale vélaire /ŋ/ suivie de la consonne occlusive sourde /k/. Le son /ŋ/ existe déjà dans beaucoup d’anglicismes français (« parking », « camping »), mais on ne prononce généralement pas la consonne /k/ qui suit. Il faut donc apprendre à enchaîner /ŋ/ + /k/ sans insérer de voyelle entre les deux.","pattern":"nk","position":"Anywhere","description":"Prononcez d’abord une consonne nasale vélaire : l’arrière de la langue touche le voile du palais et l’air sort par le nez (/ŋ/, comme la fin de « sing »). Sans relâcher complètement la langue, fermez aussitôt le passage d’air pour produire le /k/ (occlusive vélaire sourde). Surtout, ne glissez aucune voyelle entre les deux ; l’ensemble doit faire un seul bloc « ŋk ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"tank","native":"tank","position":"End","cultural_context":"Mot d’origine anglaise largement utilisé en français pour désigner un char ou un gros véhicule, voire un aquarium « fish tank »."},{"target":"punk","native":"punk","position":"End","cultural_context":"Style musical et mouvement culturel connus depuis les années 1970, terme courant dans les médias français."},{"target":"Bangkok","native":"Bangkok","position":"Middle","cultural_context":"Capitale thaïlandaise, destination touristique populaire souvent citée dans les guides et reportages voyage."}]}]
["qu",{"thoughts":"En français, la suite de lettres « qu » existe mais se prononce simplement /k/. En anglais, on ajoute presque toujours un « w » après le /k/, donnant /kw/. Le vrai défi pour un francophone est donc d’ajouter ce petit glissement arrondi sans faire une voyelle complète.","pattern":"qu","position":"Anywhere","description":"En anglais, « qu » se prononce généralement /kw/ : on commence par un /k/ net (comme le « c » de « cadeau »), puis on enchaîne tout de suite avec un léger /w/ (les lèvres se rapprochent rapidement comme pour le « ou » français, mais très bref). On entend donc deux sons collés : /k/ + /w/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Quick","native":"Quick","position":"Beginning","cultural_context":"Chaîne de restauration rapide présente en France depuis les années 1970"},{"target":"Queen","native":"Queen","position":"Beginning","cultural_context":"Groupe de rock britannique mondialement connu (\"Bohemian Rhapsody\")"},{"target":"aqua","native":"aqua","position":"Middle","cultural_context":"Mot latin pour « eau », présent dans des noms de marques (eau minérale), dans \"aquarium\", et dans le groupe pop danois « Aqua »"}]}]
["gh",{"thoughts":"« gh » est très irrégulier : parfois muet, parfois /f/, parfois /g/. Cela déroute souvent les francophones parce qu’il n’existe pas d’équivalent direct en français et qu’aucune règle simple ne couvre tous les cas.","pattern":"gh","position":"Anywhere","description":"Le digramme « gh » n’a pas de prononciation unique en anglais :\n1. Muet quand il se trouve après une voyelle, surtout en fin de mot (high, though). La voyelle précédente devient longue.\n2. /f/ lorsqu’il apparaît en fin de mot après une voyelle courte (laugh, enough, cough).\n3. /g/ lorsqu’il se trouve avant une voyelle, le plus souvent en début ou au milieu de mot (ghost, ghastly) ou dans certains emprunts comme spaghetti.\nAucun de ces sons ne correspond au \\[g\\] ou au \\[ʒ\\] français, il faut donc vérifier la prononciation mot par mot dans un dictionnaire ou un guide audio.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"high","native":"haut","position":"End","cultural_context":"Employé en français dans l’expression « high-tech », dans des titres comme « High School Musical » ou « high five »"},{"target":"laugh","native":"rire","position":"End","cultural_context":"Mot très présent sur internet (LOL = laugh out loud) et dans de nombreuses chansons ou séries anglophones"},{"target":"ghost","native":"fantôme","position":"Beginning","cultural_context":"Connu grâce au film culte « Ghostbusters », aux jeux vidéo et aux histoires de fantômes"}]}]
["dge",{"thoughts":"Le groupe de lettres « dge » correspond au son /dʒ/, inexistant comme phonème distinct en français mais déjà rencontré dans quelques anglicismes (« DJ », « jeans »). Les apprenants l’entendent donc, mais le produisent rarement.","pattern":"dge","position":"Anywhere","description":"Son consonantique / dʒ / : commence comme un « d » (contact langue–alvéoles) puis se relâche en un souffle proche du « j » anglais (comme dans « job »). Imaginez un mélange entre le « d » et le « j » français de « jardin ». Les cordes vocales vibrent (son voisé) et l’air est brièvement bloqué puis libéré en sifflant.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"badge","native":"badge","position":"End","cultural_context":"Mot courant en français pour désigner un petit insigne ou un pass d’accès"},{"target":"bridge","native":"bridge","position":"End","cultural_context":"Nom du jeu de cartes populaire, souvent utilisé tel quel en français"},{"target":"budget","native":"budget","position":"Middle","cultural_context":"Terme anglais omniprésent dans le langage économique et politique français"}]}]
["tch",{"thoughts":"Le son /tʃ/ écrit « tch » est déjà présent en français dans plusieurs emprunts (« match », « ketchup », « Scotch »). Les francophones l’entendent donc souvent, mais ils peuvent le réduire à un simple « ch » /ʃ/. Il faut insister sur la brève occlusion du /t/ avant le /ʃ/.","pattern":"tch","position":"Anywhere","description":"« tch » correspond à l’affriquée sourde /tʃ/. Commencez comme pour un « t » : langue contre les alvéoles, bloquez l’air. Relâchez aussitôt en glissant la langue vers la position du « ch » /ʃ/ (lèvres légèrement avancées, langue proche du palais dur). Le tout forme un unique bruit explosif puis fricatif : /tʃ/, sans vibration des cordes vocales.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ketchup","native":"ketchup","position":"Middle","cultural_context":"Condiment très courant, nom identique en français et en anglais"},{"target":"match","native":"match","position":"End","cultural_context":"Mot utilisé en français pour parler d’une rencontre sportive"},{"target":"Scotch","native":"Scotch","position":"End","cultural_context":"Marque de ruban adhésif et type de whisky bien connus des francophones"}]}]
["ll",{"thoughts":"Le digramme « ll » ne change généralement pas la prononciation par rapport à un simple /l/ en anglais, mais il apparaît fréquemment et se place aussi bien en attaque qu’en coda syllabique. Le défi principal pour les francophones n’est pas la quantité (ce n’est pas un /lː/ long) mais la qualité : en fin de syllabe, l’anglais produit souvent un « dark L » [ɫ] plus vélarisé que le /l/ français clair.","pattern":"ll","position":"Anywhere","description":"En anglais, « ll » se prononce comme un seul /l/. En début de syllabe (light L), la langue touche l’alvéole comme en français ; en fin de syllabe, il devient souvent ‘dark L’ [ɫ] : le bout de la langue reste contre les alvéoles mais l’arrière de la langue se soulève légèrement vers le voile du palais, donnant un timbre plus sourd. Il n’y a pas de redoublement ni d’allongement.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Hello","native":"Hello","position":"Middle","cultural_context":"Salutation anglaise extrêmement courante, souvent utilisée telle quelle en français dans les pubs ou chansons"},{"target":"Hollywood","native":"Hollywood","position":"Middle","cultural_context":"Nom du centre mondial du cinéma, omniprésent dans les médias français"},{"target":"Yellow","native":"yellow","position":"Middle","cultural_context":"Couleur “jaune” connue grâce à la chanson “Yellow Submarine” ou aux expressions pop-culturelles"}]}]
["ss",{"thoughts":"Le digramme anglais « ss » se prononce exactement comme le /s/ français ; les francophones le rencontrent déjà dans des mots empruntés comme « stress » ou « dessert ». La seule vigilance concerne la différence anglais : un « s » isolé entre voyelles devient souvent /z/, alors que « ss » reste toujours /s/.","pattern":"ss","position":"Anywhere","description":"« ss » se prononce /s/ : consonne fricative alvéolaire sourde. Placez la pointe (ou le bord) de la langue juste derrière les dents du haut, laissez passer un filet d’air continu sans faire vibrer les cordes vocales, exactement comme dans le « s » de « serpent ».","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"stress","native":"stress","position":"End","cultural_context":"Mot anglais très utilisé en français pour parler de pression psychologique"},{"target":"dessert","native":"dessert","position":"Middle","cultural_context":"Mot identique en français et en anglais pour la dernière partie d’un repas"},{"target":"Miss","native":"Miss","position":"End","cultural_context":"Titre de civilité connu grâce aux concours de beauté et aux films/séries en version originale"}]}]
["zz",{"thoughts":"Le digramme « zz » ne pose guère de problème aux francophones : il se prononce le plus souvent comme le « z » français. Les apprenants risquent surtout de croire qu’il faut allonger ou redoubler le son, alors qu’en anglais il reste bref et continu. Quelques mots d’origine italienne (« pizza ») font exception, mais la réalisation /z/ est la règle générale.","pattern":"zz","position":"Anywhere","description":"Deux z consécutifs se prononcent en anglais comme un seul /z/ : une consonne fricative alvéolaire voisée. Placez la pointe de la langue juste derrière les dents du haut, laissez vibrer les cordes vocales et faites sortir l’air en un souffle continu (/zzzz/). Le doublement des lettres sert surtout à indiquer la brièveté de la voyelle précédente, pas à doubler la consonne.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"jazz","native":"jazz","position":"End","cultural_context":"Musique mondialement connue ; même mot en français pour désigner le style musical."},{"target":"pizza","native":"pizza","position":"Middle","cultural_context":"Plat très populaire en France ; orthographe identique, on voit le « zz » partout sur les menus."},{"target":"buzz","native":"buzz","position":"End","cultural_context":"Anglicisme utilisé en marketing et dans la presse (« faire le buzz »)."}]}]
["ff",{"thoughts":"Le son /f/ est déjà présent en français, et la double consonne \"ff\" n’en change pas la prononciation ; elle sert surtout à signaler une voyelle courte en anglais. Les apprenants français connaissent donc le son, mais doivent se rappeler qu’en anglais la voyelle qui précède « ff » est souvent brève (cof-fee, muf-fin).","pattern":"ff","position":"Anywhere","description":"Le digramme « ff » se prononce exactement comme un simple /f/ français : les dents du haut touchent légèrement la lèvre inférieure, l’air s’échappe sans vibration des cordes vocales. En anglais, la présence de la double consonne indique généralement que la voyelle précédente est courte (comme le « o » bref de « coffee »).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"coffee","native":"café","position":"Middle","cultural_context":"Boisson internationale que l’on commande facilement au café ou au Starbucks"},{"target":"muffin","native":"muffin","position":"Middle","cultural_context":"Petite pâtisserie très courante dans les chaînes comme McDonald’s ou Starbucks"},{"target":"staff","native":"staff","position":"End","cultural_context":"Mot déjà utilisé en français pour parler de l’équipe d’une entreprise ou d’un événement"}]}]
["pp",{"thoughts":"Le double p n’affecte pas vraiment la prononciation : on produit simplement un /p/ unique, mais bien aspiré comme en anglais. Les francophones connaissent déjà la lettre p et voient souvent « pp » dans leur propre orthographe, donc le concept est familier.","pattern":"pp","position":"Anywhere","description":"« pp » se prononce comme un seul /p/ anglais : occlusive bilabiale sourde, explosion nette suivie d’une légère aspiration (un souffle court) qu’on n’entend pas en français. On ne rallonge pas le son ; la double consonne signale plutôt l’accentuation ou la voyelle courte qui précède.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Apple","native":"Apple","position":"Middle","cultural_context":"Marque très populaire d’iPhone, Mac, etc. largement utilisée et mentionnée en France"},{"target":"shopping","native":"shopping","position":"Middle","cultural_context":"Anglicisme intégré ; « faire du shopping » est courant en français"},{"target":"Happy","native":"happy","position":"Middle","cultural_context":"Chanson mondiale de Pharrell Williams diffusée partout et souvent chantée en France"}]}]
["bb",{"thoughts":"Le digramme « bb » ne change pas réellement le son pour un francophone : il se prononce comme un /b/ unique, identique au /b/ français. Le doublement concerne surtout l’orthographe anglaise (indication de voyelle courte) mais n’exige aucune consonne geminée. La plupart des francophones ont déjà rencontré ce graphème dans des mots empruntés ou des références culturelles.","pattern":"bb","position":"Anywhere","description":"« bb » se prononce simplement /b/ : consonne occlusive bilabiale voisée, les deux lèvres se touchent brièvement puis l’air est relâché. Aucune prolongation ou vibration supplémentaire ; c’est le même geste articulatoire qu’en français.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hobby","native":"hobby","position":"Middle","cultural_context":"Mot anglais largement utilisé en français pour désigner un passe-temps"},{"target":"Hobbit","native":"Hobbit","position":"Middle","cultural_context":"Titre du livre et des films de Tolkien, très populaire en France"},{"target":"Abba","native":"Abba","position":"Middle","cultural_context":"Groupe pop suédois des années 70 connu pour ses nombreux tubes entendus en France"}]}]
["mm",{"thoughts":"Le double m ne change pas vraiment la nature du /m/ pour un francophone ; il invite simplement à maintenir la consonne un peu plus longtemps, ce qui existe déjà en français dans certaines positions (ex. « immense »). Le son est donc familier et la difficulté faible.","pattern":"mm","position":"Anywhere","description":"Le double « m » se prononce en fermant les lèvres comme pour le /m/ français, en faisant résonner l’air dans le nez (son nasal bilabial). La présence de deux « m » indique simplement que l’on peut faire durer légèrement le /m/, mais aucune nouvelle articulation n’est requise.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hummus","native":"houmous","position":"Middle","cultural_context":"Plat du Moyen-Orient très populaire en France, souvent servi en apéritif ou dans les restaurants végétariens"},{"target":"summer","native":"été","position":"Middle","cultural_context":"Mot anglais de base abondamment utilisé dans les chansons, la mode (« summer collection ») et les publicités"},{"target":"comment","native":"commentaire","position":"Middle","cultural_context":"Terme omniprésent sur les réseaux sociaux (« laisser un comment ») et dans l’interface de nombreux sites web"}]}]
["rr",{"thoughts":"Le double « rr » ne change pas vraiment la prononciation du /r/ anglais ; il rappelle simplement qu’il y a un « r » dans la syllabe. Pour un francophone, le vrai défi n’est pas le doublon de consonnes mais le fait que l’anglais utilise un /ɹ/ alvéolaire (la pointe de la langue se rapproche du palais sans le toucher) alors que le français emploie un /ʁ/ uvulaire. Les apprenants connaissent déjà la lettre « r », ils voient souvent des mots avec « rr » (Harry, Ferrari…). Reste à apprendre le geste articulatoire anglais.","pattern":"rr","position":"Anywhere","description":"En anglais, « rr » se prononce comme un seul /ɹ/ : la pointe de la langue se place juste derrière les dents supérieures, légèrement relevée vers le palais, sans le toucher. Les bords de la langue peuvent effleurer les molaires, les lèvres sont légèrement arrondies, et l’air passe librement sans vibration comme dans le « r » français. Il n’y a ni roulement ni friction comme en espagnol ou en français ; pensez plutôt à “reculer” la langue qu’à “gratter” au fond de la gorge.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Harry (Harry Potter)","native":"Harry","position":"Middle","cultural_context":"Personnage principal de la saga mondiale « Harry Potter » souvent lue ou vue en français"},{"target":"Ferrari","native":"Ferrari","position":"Middle","cultural_context":"Marque automobile de luxe très médiatisée, même dans les médias francophones"},{"target":"curry","native":"curry","position":"Middle","cultural_context":"Épice et plat très répandus en France, présent sur les menus et dans les supermarchés"}]}]
["nn",{"thoughts":"Le digramme « nn » représente simplement le son /n/ déjà présent en français ; la difficulté est donc minime. Je choisis des mots très connus des francophones pour illustrer.","pattern":"nn","position":"Anywhere","description":"Le double n se prononce comme le /n/ français : la pointe de la langue touche l’arrière des incisives supérieures (alvéoles) tandis que l’air passe par le nez. Il n’y a pas d’allongement : on n’entend qu’un seul /n/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tennis","native":"tennis","position":"Middle","cultural_context":"Sport mondial très populaire, terme identique en français"},{"target":"Johnny","native":"Johnny","position":"Middle","cultural_context":"Prénom célèbre grâce à Johnny Hallyday et de nombreux artistes anglophones"},{"target":"Tennessee","native":"Tennessee","position":"Multiple","cultural_context":"État américain connu pour sa musique country et le whiskey Jack Daniel’s"}]}]
["ai",{"thoughts":"Le digramme « ai » se prononce le plus souvent /eɪ/ en anglais (diphthongue qui glisse de /e/ vers /ɪ/). Les francophones connaissent bien la graphie « ai » mais l’associent à /ɛ/ ou /e/. Le défi est donc d’ajouter le glissement final sans trop refermer la bouche.","pattern":"ai","position":"Anywhere","description":"Commencez par la voyelle fermée /e/ (comme dans « été »), puis faites rapidement glisser la langue légèrement vers la position de /i/ sans la fermer complètement ; gardez la mâchoire assez immobile et laissez la diphthongue durer un peu plus longtemps qu’une voyelle française pure.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"train","native":"train","position":"Middle","cultural_context":"Mot identique en français pour le moyen de transport, très présent dans la vie quotidienne"},{"target":"captain","native":"capitaine","position":"End","cultural_context":"Connu grâce aux films et comics (Captain America, Captain Marvel) et aux grades militaires"},{"target":"Raid","native":"Raid","position":"Middle","cultural_context":"Marque d’insecticide largement vendue et vue dans les publicités en France"}]}]
["ay",{"thoughts":"Le digramme « ay » en fin de mot représente en anglais la diphtongue /eɪ/, proche du « é » français mais avec une légère terminaison en « i ». Les francophones l’ont déjà rencontrée dans de nombreux mots empruntés à l’anglais.","pattern":"ay","position":"End","description":"Pour prononcer /eɪ/, commencez comme pour un « é » français, puis laissez glisser la langue très légèrement vers la position d’un « i » sans fermer complètement la bouche. Les lèvres restent plutôt détendues ; la mâchoire se relève un tout petit peu en fin de son. Le résultat est une voyelle glissante d’environ deux temps : « é-i ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"okay","native":"d’accord / ok","position":"End","cultural_context":"Le mot « ok/okay » est universel, utilisé en français courant pour signifier l’accord."},{"target":"Subway","native":"Subway","position":"End","cultural_context":"Chaîne de restauration rapide présente en France et vue dans de nombreuses publicités."},{"target":"spray","native":"spray","position":"End","cultural_context":"Le mot « spray » est directement emprunté en français pour désigner un aérosol (parfum, déodorant, etc.)."}]}]
["au",{"thoughts":"Le digramme anglais « au » se prononce le plus souvent /ɔː/ (comme le « o » ouvert et long) – un son que le français n’a pas exactement, mais qui se rapproche du « o » de « or » tenu plus longtemps. Les apprenants confondent parfois avec /o/ français ou avec le diphtongue /aʊ/ de « now ».","pattern":"au","position":"Anywhere","description":"En anglais général, « au » se réalise généralement comme une voyelle longue, ouverte et légèrement arrondie /ɔː/ : ouvrez la bouche comme pour le « o » de « porte », reculez la langue vers l’arrière et maintenez le son plus longtemps sans fermer vers /o/. Dans quelques mots (surtout « aul », « aunt » en AmE, ou certains noms propres), la prononciation peut glisser vers /æ/ ou /aʊ/, mais la valeur la plus sûre est /ɔː/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Australia","native":"Australie","position":"Beginning","cultural_context":"Pays anglophone fréquemment mentionné dans le sport (Open d’Australie, rugby) et dans les médias"},{"target":"August","native":"août","position":"Beginning","cultural_context":"Nom du mois d’août, appris dès les premiers cours de calendrier en anglais"},{"target":"because","native":"parce que","position":"Middle","cultural_context":"Mot de liaison très courant, vu dans quasiment toutes les leçons d’anglais de base"}]}]
["aw",{"thoughts":"Le digramme « aw » représente généralement la voyelle longue anglaise /ɔː/. Les francophones connaissent déjà un son voisin /ɔ/ (comme dans « porte »), mais ils n’allongent pas naturellement la voyelle et n’ouvrent pas toujours assez la bouche. Le défi principal est donc la longueur et l’ouverture.","pattern":"aw","position":"Anywhere","description":"Voyelle longue, ouverte et postérieure (/ɔː/). Ouvrez la bouche plus que pour un « o » français, reculez légèrement la langue et laissez les lèvres détendues (pas arrondies comme pour « eau »). Maintenez ce son plus longtemps qu’en français : /ɔ…/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Saw","native":"Saw","position":"End","cultural_context":"Titre de la saga de films d’horreur largement diffusée en France"},{"target":"coleslaw","native":"coleslaw","position":"End","cultural_context":"Salade de chou souvent proposée dans les fast-foods et nommée ainsi en France"},{"target":"shawarma","native":"shawarma","position":"Middle","cultural_context":"Sandwich oriental populaire dans la restauration de rue en France"}]}]
["ea",{"thoughts":"« ea » est très fréquent en anglais mais se prononce de plusieurs façons (/iː/, /ɛ/, /eɪ/). Les Francophones ont déjà vu ce digramme dans des noms célèbres (Beatles, Mr Bean, Great Britain), mais hésitent souvent sur la bonne valeur sonore. Difficulté moyenne : chaque mot doit être mémorisé.","pattern":"ea","position":"Anywhere","description":"Le digramme « ea » peut se prononcer de trois manières principales :\n1. /iː/ – un « i » long, la bouche légèrement étirée, plus long que le « i » français : sea, team.\n2. /ɛ/ – le « è » français ouvert : head, dead.\n3. /eɪ/ – un « é » qui glisse vers un léger « y » final, proche de « é-i » : great, steak.\nIl n’y a pas de règle unique ; il faut souvent apprendre la prononciation mot par mot.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Beatles","native":"les Beatles","position":"Middle","cultural_context":"Groupe de rock britannique mondialement connu, souvent mentionné en France"},{"target":"Mr Bean","native":"Mister Bean","position":"Middle","cultural_context":"Personnage comique très populaire à la télévision française"},{"target":"Great Britain","native":"Grande-Bretagne","position":"Middle","cultural_context":"Nom du pays entendu dans le sport, les informations et les cours d’anglais"}]}]
["ee",{"thoughts":"Le digramme « ee » se prononce /iː/, une voyelle longue très proche du /i/ français mais tenue plus longtemps. Les francophones rencontrent déjà ce son dans de nombreux anglicismes (cheeseburger, weekend, etc.). Le principal piège n’est pas la position de la langue mais la durée : en anglais cette voyelle est nettement allongée, alors qu’en français on a tendance à la raccourcir.","pattern":"ee","position":"Anywhere","description":"Voyelle longue /iː/ : lèvres légèrement étirées, mâchoire relativement fermée, langue haute et avancée. Maintenez le son plus longtemps que le /i/ français (≈ une fraction de seconde de plus) sans le faire glisser vers /j/ ni ouvrir la bouche.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Queen","native":"Queen","position":"Middle","cultural_context":"Groupe de rock britannique mondialement célèbre (« Bohemian Rhapsody »), souvent mentionné dans les médias et playlists françaises."},{"target":"Jeep","native":"Jeep","position":"Middle","cultural_context":"Marque automobile tout-terrain bien connue, présente sur les routes et dans la publicité en France."},{"target":"cheeseburger","native":"cheeseburger","position":"Multiple","cultural_context":"Classique de la restauration rapide, mot déjà employé tel quel en français pour désigner le sandwich au fromage."}]}]
["ei",{"thoughts":"Le digramme « ei » se prononce le plus souvent en anglais comme la diphtongue /eɪ/, identique au nom de la lettre « A ». Les francophones connaissent déjà le /e/ (comme « é ») mais pas la glissade finale vers /ɪ/. Il suffit de commencer sur un « é » net et de laisser la mâchoire et la langue se détendre légèrement vers un petit « i » bref. Sonorité assez courante dans des mots ou marques connues, mais la présence de la diphtongue peut surprendre.","pattern":"ei","position":"Anywhere","description":"Commencez par le son « é » français, puis faites glisser rapidement la langue vers un /i/ très court sans refermer complètement la bouche : /eɪ/. On sent donc deux voyelles qui se fondent en une seule syllabe, un peu comme si l’on disait « é-i » très vite. Les lèvres restent légèrement étirées tout du long.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"weight","native":"poids","position":"Middle","cultural_context":"Vu dans « Weight Watchers », dans les sports et les régimes ; mot fréquent dans les médias anglophones."},{"target":"reindeer","native":"renne","position":"Beginning","cultural_context":"Animal emblématique du traîneau du Père Noël, présent dans films et chansons de Noël."},{"target":"sleigh","native":"traîneau","position":"Middle","cultural_context":"Mot entendu dans le refrain de « Jingle Bells » (« one-horse open sleigh »)."}]}]
["ey",{"thoughts":"Le digramme « ey » en fin de mot se prononce le plus souvent /iː/. Les francophones rencontrent ce son dans des marques et sports connus (« Disney », « hockey », « whiskey »). La voyelle existe en français (« i »), mais l’orthographe peut dérouter et certains apprenants le confondent avec /eɪ/ de « they ».","pattern":"ey","position":"End","description":"« ey » à la fin d’un mot anglais se prononce comme un /i/ long : la langue est haute et vers l’avant, les lèvres légèrement étirées, le son est tenu. Il ne faut pas glisser vers un « é » ni ajouter une diphtongue ; pensez simplement au « i » français mais maintenu un peu plus longtemps.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Disney","native":"Disney","position":"End","cultural_context":"Groupe de divertissement extrêmement connu (parcs, films, chaînes TV) ; le nom est partout en France."},{"target":"whiskey","native":"whisky","position":"End","cultural_context":"Boisson alcoolisée bien connue ; le mot apparaît dans les bars, films et chansons."},{"target":"hockey","native":"hockey","position":"End","cultural_context":"Sport sur glace ou sur gazon ; fréquemment mentionné dans les médias sportifs francophones."}]}]
["ie",{"thoughts":"Le digramme « ie » est trompeur pour les francophones : il peut se prononcer /iː/ (long « ii ») comme dans « Diesel » ou /aɪ/ (comme l’anglais « eye ») dans des mots courts comme « pie ». Les deux sons existent déjà en français (/i/ est familier, /aɪ/ ressemble au son ’aï’ de « ail »), mais l’alternance oblige à mémoriser le mot.","pattern":"ie","position":"Anywhere","description":"En anglais, « ie » se prononce le plus souvent :\n• /iː/ : un « i » long, lèvres étirées, langue haute (comme le « i » français mais tenu plus longtemps).\n• Parfois /aɪ/ : la diphtongue « aï », qui part d’un « a » ouvert vers un « i » bref (similaire à dire « ail »).\nIl n’existe pas de règle absolue ; il faut donc associer chaque mot à sa prononciation.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Diesel","native":"diesel","position":"Middle","cultural_context":"Carburant bien connu et marque de vêtements italienne ; mot fréquemment utilisé en français"},{"target":"pie","native":"tarte","position":"End","cultural_context":"Dessert américain souvent mentionné dans les films et séries (pumpkin pie, apple pie, etc.)"},{"target":"Siemens","native":"Siemens","position":"Beginning","cultural_context":"Grand groupe industriel/électronique allemand dont le nom apparaît dans l’actualité et sur des appareils électroménagers"}]}]
["igh",{"thoughts":"Le groupe graphique « igh » donne presque toujours le son /aɪ/. Les francophones l’ont déjà rencontré dans plusieurs anglicismes courants (light, high-tech). Ils connaissent donc visuellement le groupe, mais la réalisation exacte du diphtongue reste moins intuitive, puisqu’il n’existe pas en français standard sous cette forme glissante.","pattern":"igh","position":"Anywhere","description":"« igh » se prononce en anglais comme le diphtongue /aɪ/ : commencez par un « a » ouvert (comme dans « papa »), puis faites rapidement glisser la langue vers un « i » bref, sans fermer complètement la bouche. Ni le « g » ni le « h » ne se prononcent ; le groupe est purement vocalique. Exemple : high /haɪ/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"high-tech","native":"high-tech","position":"End","cultural_context":"Terme anglais passé tel quel en français pour parler de technologie de pointe ; très utilisé dans les médias et la conversation courante."},{"target":"light","native":"light","position":"Middle","cultural_context":"Mention omniprésente sur les boissons (ex. « Coca-Cola Light ») et les produits allégés en calories."},{"target":"night-club","native":"night-club","position":"Middle","cultural_context":"Mot courant pour désigner une discothèque ; figure sur les devantures et dans la presse loisirs."}]}]
["eigh",{"thoughts":"« eigh » est presque toujours réalisé /eɪ/, le même son que dans « day ». Les francophones connaissent déjà un /e/ fermé (« é »), mais doivent ajouter une légère glisse vers /j/. Quelques mots fréquents comme « eight » ou « weight » permettent de l’identifier facilement.","pattern":"eigh","position":"Anywhere","description":"Se prononce généralement /eɪ/ : commence par un « é » français, puis on laisse glisser très brièvement la langue vers la semi-voyelle /j/ (le « y » anglais). La mâchoire reste plutôt fermée, les lèvres légèrement étirées. Attention : dans quelques rares mots (« height », « sleight ») « eigh » se prononce /aɪ/, mais la grande majorité suit /eɪ/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"eight","native":"huit","position":"Beginning","cultural_context":"On apprend très tôt les nombres en anglais ; « eight » est vu dès le collège et dans les jeux vidéo ou films VO"},{"target":"Weight","native":"poids","position":"Middle","cultural_context":"Mot présent dans la marque internationale « Weight Watchers », souvent citée dans la presse et la publicité"},{"target":"Neighbours","native":"voisins","position":"Beginning","cultural_context":"Titre de la série TV australienne et mot courant entendu dans des films ou chansons (« Love Thy Neighbour »)"}]}]
["oa",{"thoughts":"Le digramme « oa » correspond dans la majorité des cas au même son que la voyelle longue/diphthongue anglaise /oʊ/ (BrE /əʊ/). C’est l’équivalent d’un « o » français qui commence fermé puis qui glisse légèrement vers un « ou ». Les francophones connaissent ce timbre dans certains mots empruntés (« toast », « goal »), mais l’écriture « oa » n’existe pas en français, d’où quelques hésitations possibles.","pattern":"oa","position":"Anywhere","description":"Prononcez un « o » fermé (comme dans « eau ») puis terminez rapidement par un léger « ou » sans fermer complètement les lèvres : /oʊ/. La mâchoire remonte un peu à la fin et les lèvres se resserrent. Il ne faut pas nasaliser le son (éviter le « on » français) ni le couper trop court.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"toast","native":"toast","position":"Middle","cultural_context":"Mot emprunté couramment en français pour désigner une tranche de pain grillé ou un discours lors d’un verre."},{"target":"goal","native":"but","position":"Middle","cultural_context":"Terme omniprésent dans le football que les francophones entendent dans les retransmissions sportives."},{"target":"Broadway","native":"Broadway","position":"Middle","cultural_context":"Avenue célèbre de New York et synonyme de comédies musicales, souvent citée dans les médias et la pop-culture."}]}]
["oe",{"thoughts":"Le digramme final « oe » se prononce /uː/ (comme le « oo » anglais). Les francophones connaissent déjà ce timbre grâce au « ou » français, mais devront allonger la voyelle et ne pas fermer autant la bouche.","pattern":"oe","position":"End","description":"Le « oe » final se prononce /uː/ : une voyelle longue, arrondie, semblable au « ou » de « tout », mais plus tendue et tenue plus longtemps. Les lèvres sont légèrement arrondies, la langue est en arrière et l’on maintient le son ; surtout, la lettre « e » reste muette.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"shoe","native":"chaussure","position":"End","cultural_context":"Mot courant dans la mode et le shopping (« running shoes », etc.)."},{"target":"canoe","native":"canoë","position":"End","cultural_context":"Sport de plein air ; même mot qu’en français, souvent vu dans le tourisme ou les JO."},{"target":"Joe","native":"Joe","position":"End","cultural_context":"Prénom très présent dans la culture pop (« G.I. Joe », « Cup of Joe »)."}]}]
["oi",{"thoughts":"En anglais, le digramme « oi » représente presque toujours la diphtongue /ɔɪ/. Les francophones connaissent déjà le graphème, mais pas la diphtongue (le français n’a pas de vrai glissement vocalique sur ce modèle). Ils risquent donc de dire un simple « o-i » ou de remplacer par « wa ».","pattern":"oi","position":"Anywhere","description":"La séquence « oi » se prononce comme une diphtongue : on commence par un « o » assez ouvert et arrondi (/ɔ/), puis on fait glisser rapidement la langue vers un « i » bref et non arrondi (/ɪ/). Il faut donc passer d’une bouche ouverte et arrondie à une bouche plus fermée et étirée, tout en maintenant un son continu (aucune cassure entre les deux voyelles).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"oil","native":"huile","position":"Beginning","cultural_context":"On voit ce mot partout : « olive oil » sur les bouteilles, « engine oil » dans les garages, etc."},{"target":"coin","native":"pièce de monnaie","position":"Middle","cultural_context":"Mot quasi identique au français et omniprésent depuis la popularité du « Bitcoin » et des cryptomonnaies."},{"target":"voice","native":"voix","position":"Middle","cultural_context":"Titre de l’émission TV mondiale « The Voice », diffusée en prime time en France."}]}]
["oy",{"thoughts":"Le groupe de lettres « oy » se prononce en anglais comme la diphtongue /ɔɪ/, qu’on entend dans « boy ». Ce son n’existe pas tel quel en français mais il est présent dans plusieurs emprunts familiers (boy-scout, cowboy). Les francophones passent souvent trop vite de « o » à « i » ou ferment trop le premier son. Il faut garder un « o » ouvert puis glisser vers un « i » bref, sans créer deux syllabes distinctes.","pattern":"oy","position":"End","description":"Commencez par un « o » assez ouvert (entre le “o” de « porte » et celui de « eau »), lèvres arrondies. Puis faites glisser la langue et les lèvres vers un « i » court, comme si vous alliez sourire. Le tout doit rester une seule syllabe fluide : /ɔɪ/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"cowboy","native":"cow-boy","position":"End","cultural_context":"Terme très utilisé dans les films et les bandes dessinées western, présent en français depuis longtemps"},{"target":"toy","native":"jouet","position":"End","cultural_context":"Connu grâce au film d’animation « Toy Story » et aux rayons « toys » des magasins"},{"target":"joy","native":"joie","position":"End","cultural_context":"Mot anglais fréquent dans les chansons de Noël (« Joy to the World ») et nom d’un parfum célèbre"}]}]
["oo",{"thoughts":"Le digramme « oo » correspond le plus souvent à la voyelle longue /uː/. Les francophones connaissent déjà la qualité « ou », mais pas la longueur ni la tension anglo-saxonne, d’où quelques confusions possibles (food vs. foot). Ils ont déjà rencontré ce graphème dans des marques et emprunts.","pattern":"oo","position":"Anywhere","description":"« oo » se prononce généralement /uː/ : une voyelle fermée, postérieure et arrondie, proche du « ou » français mais tenue plus longtemps et avec la langue légèrement plus en arrière. Gardez les lèvres bien arrondies, gardez la voyelle plus longue qu’en français, et évitez de glisser vers un « o ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Google","native":"Google","position":"Middle","cultural_context":"Moteur de recherche mondialement utilisé, nom inchangé en français"},{"target":"zoo","native":"zoo","position":"End","cultural_context":"Mot identique en français pour désigner un parc zoologique"},{"target":"Scooby-Doo","native":"Scooby-Doo","position":"Multiple","cultural_context":"Dessins animés populaires diffusés à la télévision française"}]}]
["ou",{"thoughts":"Le digramme anglais « ou » est surtout rencontré comme la diphtongue /aʊ/ (comme dans “out”), ce qui n’existe pas en français. Les mots-culture pop contenant « ou » (South Park, SoundCloud, House of the Dragon) aideront le francophone à associer l’écriture à ce glissement sonore.","pattern":"ou","position":"Anywhere","description":"En anglais, « ou » se prononce très souvent comme la diphtongue /aʊ/ : on commence par un « a » ouvert (comme dans « patte ») puis on glisse rapidement vers un « ou » bref. La bouche s’ouvre largement, puis les lèvres se rapprochent pour finir arrondies. Il ne faut pas prolonger le « ou » final comme en français ; la transition doit être rapide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"South Park","native":"South Park","position":"Middle","cultural_context":"Série télévisée d’animation américaine très connue diffusée en France"},{"target":"SoundCloud","native":"SoundCloud","position":"Multiple","cultural_context":"Plateforme de musique en ligne populaire auprès des artistes et auditeurs français"},{"target":"House of the Dragon","native":"House of the Dragon","position":"Beginning","cultural_context":"Série dérivée de Game of Thrones largement médiatisée en France"}]}]
["ue",{"thoughts":"Le digramme final « ue » note presque toujours la voyelle longue /uː/. Les francophones connaissent déjà le son « ou », donc le principal enjeu est de l’allonger et de ne pas prononcer le « e ».","pattern":"ue","position":"End","description":"En fin de mot, « ue » se prononce /uː/ : une voyelle longue, similaire au « ou » de « loup », mais tenue un peu plus longtemps et avec les lèvres légèrement plus serrées. Le « e » est totalement muet ; on ne prononce qu’une seule voyelle longue, sans ajouter de « eu » ni de schwa.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"blue","native":"bleu","position":"End","cultural_context":"Couleur très fréquente : blue jeans, chansons comme « Blue Monday »."},{"target":"glue","native":"colle","position":"End","cultural_context":"On voit le mot sur les tubes de colle « super glue »."},{"target":"true","native":"vrai","position":"End","cultural_context":"Mots et titres populaires (« True story », série « True Detective »)."}]}]
["ui",{"thoughts":"Le digramme anglais « ui » se prononce le plus souvent /uː/, une voyelle longue proche du « ou » français mais sans la semi-voyelle /ɥ/ de « nuit ». Les francophones voient ce groupe dans des mots familiers comme « fruit », mais doivent penser à allonger la voyelle et éviter de glisser vers /i/.","pattern":"ui","position":"Anywhere","description":"En anglais, « ui » se réalise généralement comme la voyelle longue /uː/ : les lèvres sont arrondies comme pour le « ou » français, la langue est légèrement reculée, et l’on maintient le son plus longtemps. Surtout, on n’ajoute pas la petite consonne /ɥ/ (« y » français) qui existe dans le « ui » français. Il existe quelques exceptions (ex. « build » /bɪld/), mais la prononciation /uː/ couvre la majorité des cas courants.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fruit","native":"fruit","position":"Middle","cultural_context":"Même mot qu’en français, souvent vu sur les emballages ou dans les recettes en anglais"},{"target":"juice","native":"jus","position":"Middle","cultural_context":"Mot très fréquent dans les boissons (« orange juice ») et la culture populaire anglophone"},{"target":"suit","native":"costume","position":"Middle","cultural_context":"Terme courant en mode/business (« business suit »), entendu dans les séries et films en VO"}]}]
["ew",{"thoughts":"Les francophones rencontrent déjà « ew » dans des mots empruntés comme « chewing-gum » ou des noms propres comme « New York ». Le son principal est /juː/ ou /uː/, proches du « you » anglais ou d’un « ou » long français. La présence éventuelle de la semi-voyelle [j] et la longueur vocalique peuvent cependant poser des difficultés.","pattern":"ew","position":"Anywhere","description":"« ew » se prononce le plus souvent /juː/ (y + ou long). 1) Commencez par la semi-voyelle [j] comme dans « yes » : langue haute, près du palais. 2) Faites immédiatement glisser vers une voyelle /uː/ très longue : lèvres bien arrondies, langue tirée vers l’arrière. 3) Maintenez la voyelle plus longtemps qu’en français. Après certaines consonnes (r, l, ch, sh, c, g), la semi-voyelle disparaît et on n’entend qu’un /uː/ long, toujours arrondi et prolongé.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"New York","native":"New York","position":"End","cultural_context":"Grande ville américaine évoquée dans les films, séries et cours d’anglais."},{"target":"chewing-gum","native":"chewing-gum","position":"Middle","cultural_context":"Mot anglais passé dans le langage courant français pour désigner la gomme à mâcher."},{"target":"Chewbacca","native":"Chewbacca","position":"Middle","cultural_context":"Personnage culte de Star Wars, connu mondialement."}]}]
["ar",{"thoughts":"Le groupe \"ar\" combine une voyelle longue /ɑː/ (proche de « a » dans « pâte ») et, en anglais général, un /ɹ/ rétroflexe. Les francophones connaissent déjà beaucoup de mots contenant « ar », mais l’articulation du /ɹ/ anglais reste inhabituelle.","pattern":"ar","position":"Anywhere","description":"On prononce « ar » en deux temps rapides : 1) ouvrez grand la bouche pour produire un « a » long et profond (/ɑː/), la langue abaissée et un peu reculée ; 2) faites glisser immédiatement la langue vers l’arrière en formant le /ɹ/ anglais : pointe de la langue légèrement relevée vers le palais, sans toucher, et sans vibration. Ne roulez pas le « r » comme en français ni ne le grasseyez. En anglais britannique standard, on n’entend le /ɹ/ que devant une voyelle, alors qu’en anglais américain il reste toujours audible.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Starbucks","native":"Starbucks","position":"Middle","cultural_context":"Chaîne de café très présente dans les grandes villes françaises ; on voit le logo partout"},{"target":"Marvel","native":"Marvel","position":"Middle","cultural_context":"Univers de super-héros extrêmement populaire grâce aux films et BD, souvent mentionné en français"},{"target":"Avatar","native":"Avatar","position":"End","cultural_context":"Film à succès de James Cameron, largement diffusé et discuté en France"}]}]
["er",{"thoughts":"Les francophones connaissent bien l’orthographe « er », mais ils l’associent souvent au son français [ɛʁ] ou à la terminaison des verbes. En anglais, c’est une voyelle centrale longue et r-colorée (/ɜː/ ou /ər/), donc nouvelle pour eux. La vraie difficulté vient du « r » anglais non roulé qui colore la voyelle.","pattern":"er","position":"Anywhere","description":"Le digramme « er » se prononce la plupart du temps /ɜː/ (version accent britannique) ou /ɚ/ (accent américain). C’est une voyelle centrale, longue et légèrement tendue : ouvrez modérément la bouche, gardez la langue au centre sans toucher le palais, la pointe légèrement relevée. Le « r » anglais est entendu en continu ; il ne se roule pas et la gorge reste détendue. Évitez de rapprocher ce son du « eu » français ou du « eur » final : la voyelle est plus longue et l’« r » est audible, pas simplement la consonne française.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Ernest","native":"Ernest","position":"Beginning","cultural_context":"Prénom populaire en français (ex. « Ernest et Célestine »); facile à reconnaître."},{"target":"burger","native":"burger","position":"End","cultural_context":"Plat de restauration rapide très courant (McDonald’s, Burger King)."},{"target":"internet","native":"internet","position":"Middle","cultural_context":"Terme international utilisé tel quel en français pour désigner le réseau mondial."}]}]
["ir",{"thoughts":"Le digramme \"ir\" se prononce généralement comme une voyelle centrale longue (« eu » français de “peur”) aussitôt suivie de l’“r” anglais non battu /ɹ/, ce qui crée une voyelle « colourée » par le r. Le français n’a pas ce couplage voyelle-r, d’où risque de dire seulement « eu » ou de rouler le r.","pattern":"ir","position":"Anywhere","description":"On commence par une voyelle centrale entre /ə/ et /œ/ (pensez au « eu » de “peur” mais un peu plus longue), puis on laisse la langue se rétracter légèrement sans toucher le palais pour former l’« r » anglais /ɹ/. La pointe de la langue reste basse, les bords légers contre les molaires, et on ne roule pas l’r.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"T-shirt","native":"T-shirt","position":"Middle","cultural_context":"Mot d’emprunt très courant en français pour le vêtement casual"},{"target":"birthday","native":"anniversaire","position":"Middle","cultural_context":"Expression « Happy birthday! » souvent utilisée même en France"},{"target":"Birmingham","native":"Birmingham","position":"Middle","cultural_context":"Grande ville britannique connue pour ses clubs de foot et son accent typique"}]}]
["ur",{"thoughts":"Le graphème anglais « ur » correspond généralement au son vocalique /ɜː/ (britannique) ou /ɝ/ (américain), souvent dit « er accentué ». Pour un francophone, la voyelle se rapproche de « eu » (comme dans « peur ») mais avec la langue légèrement plus basse et surtout une coloration du ‑r anglais, qui n’est pas roulé ni uvulaire mais réalisé comme l’approximante [ɹ]. La difficulté vient donc à la fois de la position de la langue pour la voyelle et de la tenue du ‑r anglais qui suit immédiatement.","pattern":"ur","position":"Anywhere","description":"Ouvrez légèrement la bouche. La langue est au centre, un peu abaissée, les côtés touchant mollement les dents du haut. Produisez une voyelle entre le « eu » de « peur » et le « œ» de « cœur », puis sans bouger la langue vers l’avant, faites résonner le ‑r anglais [ɹ] : la pointe se rapproche du palais sans le toucher. Tout cela se fait d’un seul tenant, comme si le son « eu » était teinté par le r.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"burger","native":"burger","position":"Beginning","cultural_context":"Mot très utilisé en français pour désigner un sandwich issu du fast-food"},{"target":"surf","native":"surf","position":"Beginning","cultural_context":"Sport de glisse connu et mot courant dans les médias et la culture populaire"},{"target":"burn-out","native":"burn-out","position":"Beginning","cultural_context":"Terme anglais passé tel quel en français pour parler d’épuisement professionnel"}]}]
["or",{"thoughts":"Les francophones connaissent déjà la suite de lettres « or » en français (« or, encore, port »). En anglais, la voyelle /ɔː/ est proche du « o » français ouvert, mais l’élément vraiment nouveau est le R anglais /ɹ/ qui se prononce sans frottement, langue en arrière. Cette combinaison est donc globalement familière mais demande un effort sur le R.","pattern":"or","position":"Anywhere","description":"En anglais, « or » se prononce généralement /ɔːɹ/ : commencez par un « o » ouvert et long (comme dans le français « porte », mais maintenu un peu plus longtemps), puis enchaînez avec le R anglais. Pour ce R, reculez légèrement la langue sans toucher le palais et laissez l’air passer librement — pas de grattement dans la gorge comme le R français. Dans les syllabes non accentuées, la voyelle peut se réduire vers /əɹ/ (« er » neutre), mais le principe reste : voyelle + R anglais.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"sport","native":"sport","position":"Middle","cultural_context":"Mot identique en français pour désigner l’activité physique ; utilisé quotidiennement."},{"target":"Ford","native":"Ford","position":"Middle","cultural_context":"Marque automobile américaine très présente sur les routes et dans la culture populaire."},{"target":"New York","native":"New York","position":"Middle","cultural_context":"Ville emblématique souvent mentionnée dans les films, les séries et le tourisme."}]}]
["ear",{"thoughts":"La suite de lettres « ear » produit le plus souvent la diphtongue anglaise /ɪə/ (un « i » bref qui glisse vers un « euh » schwa). Les Français n’ont pas d’équivalent exact, mais le couple « i » + « euh » rapproché existe dans « pied » si l’on fait durer la voyelle.","pattern":"ear","position":"Anywhere","description":"Commencez par un « i » très court (comme dans « vite »), puis laissez la langue reculer légèrement et relâchez la bouche pour finir sur un son neutre « euh ». La mâchoire reste assez fermée du début à la fin ; ne faites pas deux syllabes distinctes, c’est un seul glissement continu : /ɪə/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"beer","native":"bière","position":"End","cultural_context":"Boisson alcoolisée internationale, commandée dans les bars (« a beer, please »)."},{"target":"year","native":"année","position":"End","cultural_context":"Mot entendu dans « Happy New Year ! » à chaque Nouvel An."},{"target":"cheers","native":"santé / merci","position":"End","cultural_context":"Expression courante pour trinquer ou dire merci, souvent utilisée par les anglophones dans les pubs."}]}]
["air",{"thoughts":"Le groupe de sons « air » (/eə/ en anglais britannique, /ɛr/ en anglais américain) ressemble au « è » français suivi d’un léger « e» très bref, puis du r anglais. Les francophones rencontrent ce motif dans plusieurs marques et expressions (Airbnb, fair-play). Le principal piège est de bien articuler le r anglais, non roulé, et de ne pas transformer le son en simple « èr » français.","pattern":"air","position":"Anywhere","description":"Commencez par une voyelle ouverte proche du « è » français, puis faites glisser rapidement vers un son neutre /ə/ (schwa) avant de terminer par le r anglais (l’arrière de la langue se rapproche légèrement du palais sans vibrer). En anglais américain, la voyelle et le r se fondent davantage (/ɛr/). Évitez de rouler le r ou de le prononcer comme en français.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Airbnb","native":"Airbnb","position":"Beginning","cultural_context":"Plateforme de location de logements très utilisée et médiatisée en France"},{"target":"fair","native":"fair (comme dans « fair-play »)","position":"End","cultural_context":"Expression « fair-play » courante dans le sport et les médias français"},{"target":"hair","native":"hair (cheveux)","position":"End","cultural_context":"Mot souvent vu dans les enseignes de coiffeurs (« hair stylist », « hair design »), publicités et titres de films/séries"}]}]
["ire",{"thoughts":"Le groupe de lettres « ire » se prononce en anglais comme la diphtongue /aɪ/ (semblable à « aïe ») immédiatement suivie d’un schwa /ə/ et d’un « r » anglais non roulé (/ɹ/). Les Francophones connaissent déjà plusieurs mots contenant « ire » (fire, vampire, Ireland), mais la combinaison diphtongue + schwa + r, surtout le r final anglais, peut demander un effort.","pattern":"ire","position":"Anywhere","description":"Commencez par la diphtongue /aɪ/ : ouvrez la bouche sur un « a » bref puis glissez rapidement vers un « i » fermé, comme quand on dit « aïe ». Tout de suite après, relâchez la langue pour un schwa très court /ə/ sans re-fermer complètement la bouche, puis terminez par un « r » anglais /ɹ/ : la langue ne touche pas le palais ; elle se recule légèrement et la pointe reste basse. Le résultat ressemble à « aï-eurr ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fire","native":"feu","position":"End","cultural_context":"Mot entendu dans les films ou alarmes incendie (« Fire! »), et dans l’expression « fire alarm »."},{"target":"Ireland","native":"Irlande","position":"Beginning","cultural_context":"Nom du pays anglophone voisin du Royaume-Uni, connu pour sa culture celtique et la fête de la Saint-Patrick."},{"target":"vampire","native":"vampire","position":"End","cultural_context":"Présent dans la culture populaire : romans de Dracula, films et séries comme « Twilight » ou « Buffy »."}]}]
["our",{"thoughts":"“our” est une suite de lettres très fréquente qui se réalise en anglais par plusieurs voyelles : le plus courant est la diphtongue /aʊ/ suivie d’un « schwa » + /r/ en anglais américain (« hour »), ou bien la voyelle longue /ɔː/ + /r/ en anglais britannique (« four », « tour »). Le R final est toujours audible en américain, absent ou très léger en britannique. Le défi principal pour les francophones est donc la diphtongue (passer de /a/ à /ʊ/) et le R anglais non roulé.","pattern":"our","position":"Anywhere","description":"En anglais, « our » se prononce le plus souvent comme une diphtongue : commencez par un « a » ouvert (bouche bien ouverte), glissez rapidement vers un « ou » court, puis terminez par un très léger « e » neutre (schwa) et un R anglais non roulé si vous imitez l’américain (hour : /ˈaʊər/). Dans d’autres mots (surtout quand « our » est en fin de mot avec une seule syllabe), la réalisation se rapproche de /ɔː(r)/ ou /ʊər/ (tour, four). Retenez : 1) commencez ouvert, 2) fermez vers /ou/, 3) terminez par le R anglais légèrement aspiré, langue reculée sans vibrer.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"happy hour","native":"happy hour","position":"End","cultural_context":"Expression courante dans les bars et restaurants, utilisée telle quelle en français pour indiquer une période de boissons à prix réduit."},{"target":"tour","native":"tour","position":"End","cultural_context":"Mot fréquemment rencontré grâce au \"Tour de France\", au tourisme (« tour operator »), et utilisé tel quel dans les médias."},{"target":"glamour","native":"glamour","position":"End","cultural_context":"Mot emprunté directement à l’anglais, omniprésent dans la presse mode et people française (« look glamour »)."}]}]
["ore",{"thoughts":"Le groupe de lettres « ore » se prononce en anglais généralement /ɔːɹ/ (accent américain) ou /ɔː/ (accent britannique non-rhotic). Le son voyelle /ɔː/ est proche du « o » ouvert français (comme dans « or »), mais la présence éventuelle d’un /ɹ/ anglais peut perturber les francophones.","pattern":"ore","position":"Anywhere","description":"En anglais, « ore » se prononce le plus souvent /ɔːɹ/ : commencez par un « o » bien ouvert (bouche ronde, langue basse vers l’arrière) similaire au « o» de « or » en français, puis – en accent américain ou rhotique – faites suivre d’un /ɹ/ : la pointe de la langue se rapproche du palais sans le toucher (pas de roulement). En accent britannique non-rhotic, le /ɹ/ final n’est pas prononcé : on garde seulement la voyelle longue /ɔː/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Oreo","native":"Oreo (biscuit)","position":"Beginning","cultural_context":"Marque de biscuits mondialement connue, disponible dans presque tous les supermarchés français."},{"target":"store","native":"magasin","position":"End","cultural_context":"Mot souvent vu dans « App Store », « Google Play Store » ou « Microsoft Store »."},{"target":"more","native":"plus","position":"End","cultural_context":"Mot anglais de base (« more options », « learn more ») fréquemment aperçu sur les sites web et interfaces logicielles."}]}]
["are",{"thoughts":"Le groupe de lettres « are » produit généralement le son /ɑːr/ (voyelle longue ouverte + r américain). Les francophones connaissent déjà la voyelle /a/, mais la longueur et surtout le r battu-alveolaire anglais /ɹ/ peuvent poser problème. On le retrouve fréquemment en fin de mot (« care », « software ») mais aussi au milieu (« hardware », « square »).","pattern":"are","position":"Anywhere","description":"En anglais, « are » se prononce la plupart du temps /ɑːr/ : ouvrez bien la bouche comme pour un « a » français, maintenez la voyelle plus longtemps, puis faites suivre d’un r anglais /ɹ/ (langue légèrement courbée vers le palais, sans vibration ni friction comme le r français). Dans certains accents non-rhotiques (britannique sud), le r final disparaît et on n’entend qu’un « a » long /ɑː/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"care","native":"soin","position":"End","cultural_context":"Le mot apparaît sur de nombreux produits cosmétiques (« skin care », « hair care ») souvent vendus en France."},{"target":"Times Square","native":"Times Square","position":"End","cultural_context":"Place emblématique de New York citée dans les médias, films et voyages scolaires."},{"target":"software","native":"logiciel","position":"End","cultural_context":"Terme informatique couramment utilisé tel quel en français dans la presse et l’entreprise."}]}]
["ear",{"thoughts":"Le groupe « ear » placé en fin de mot produit le son voyelle /ɪə/ (anglais britannique) ou /ɪɹ/ (anglais américain). Ce son combine une voyelle courte « i » qui glisse vers un « e » neutre, immédiatement suivie d’un « r » semi-vocalique. Les francophones entendent souvent ce son dans des mots courants (beer, year) mais n’ont pas l’habitude de placer un « r » si tardif après la voyelle, ce qui peut entraîner un « i-euh » trop marqué ou un « birr » trop roulé.","pattern":"ear","position":"End","description":"Prononcez d’abord un « i » bref (comme dans le français « vite »), faites-le glisser vers un schwa léger /ə/ sans fermer complètement la bouche, puis terminez par un « r » anglais non roulé : la langue reste basse et recule légèrement vers l’arrière du palais sans vibrer. En anglais américain, la diphtongue est plus courte et le « r » est plus audible ; en anglais britannique, le « r » se réalise surtout comme allongement vocalique si aucun son suit.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"beer","native":"bière","position":"End","cultural_context":"Le mot apparaît sur les menus et publicités internationales pour la boisson populaire « beer »."},{"target":"year","native":"année","position":"End","cultural_context":"Mot basique entendu dans les chansons (« New Year’s Day ») et lors de conversations sur les dates."},{"target":"gear","native":"équipement","position":"End","cultural_context":"Terme anglais courant dans les jeux vidéo et les sports (« mountain bike gear », « camping gear »)."}]}]
["air",{"thoughts":"Le groupe de lettres « air » en fin de mot donne un son proche de /ɛə/ (Brit.) ou /ɛɹ/ (Am.). Les francophones reconnaissent l’orthographe « air » mais ont tendance à le prononcer simplement /ɛʁ/ comme dans le mot français « air ». Ils doivent donc ajouter un léger glissement (diphtongue) puis un /ɹ/ anglais non roulé. Le son n’existe pas tel quel en français, mais il est fréquent dans des noms propres ou mots anglais connus.","pattern":"air","position":"End","description":"Commencez par un « è » ouvert (/ɛ/), faites glisser la langue vers un schwa très bref (/ə/) tout en maintenant la bouche ouverte, puis terminez par un /ɹ/ anglais : la langue se recule légèrement sans toucher le palais (pas de /ʁ/ guttural français). En anglais américain, le /ɹ/ est clairement articulé ; en anglais britannique non rhotique il est à peine audible sauf si un mot suit commençant par une voyelle.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hair","native":"cheveux","position":"End","cultural_context":"Titre de la célèbre comédie musicale « Hair » et du film éponyme, souvent mentionnés en France"},{"target":"fair","native":"foire / juste","position":"End","cultural_context":"Employé dans l’expression « fair-play », très répandue dans le sport et les médias français"},{"target":"Blair","native":"Blair","position":"End","cultural_context":"Nom de Tony Blair, ancien Premier ministre britannique souvent cité dans l’actualité"}]}]
["ire",{"thoughts":"Le groupe final « ire » se prononce le plus souvent /aɪər/ : une diphtongue « aï » qui glisse vers un schwa, puis un /r/ américain. Les francophones connaissent plusieurs mots internationaux contenant « ire », mais ils emploient souvent la prononciation française /iʁ/ ou /iʀ/. Il faut donc mettre l’accent sur la diphtongue et le /r/ rétroflexe anglais.","pattern":"ire","position":"End","description":"On ouvre d’abord la bouche comme pour dire « a » puis on glisse rapidement vers « ï » (comme l’anglais « eye »). Immédiatement après, on relâche dans un schwa très bref /ə/ avant de faire vibrer le /r/ américain, langue reculée sans contact avec le palais. Tout le bloc dure deux syllabes : « aï-e(r) ».","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fire","native":"feu","position":"End","cultural_context":"Mot courant dans les films, jeux vidéo (« Fire! »), titres de chansons comme « We Didn’t Start the Fire »."},{"target":"vampire","native":"vampire","position":"End","cultural_context":"Créature emblématique de films, séries et romans (« Dracula », «  Twilight »)."},{"target":"Empire","native":"empire","position":"End","cultural_context":"Terme historique courant et univers « Star Wars » (Galactic Empire) ; nom de la série TV « Empire »."}]}]
["ore",{"thoughts":"Le groupe \"ore\" en fin de mot correspond en anglais GB à la voyelle longue /ɔː/ et en anglais US à /ɔr/. Le /ɔ/ existe en français, donc la vraie nouveauté est la longueur de la voyelle et, en anglais US, le « r » anglophone.","pattern":"ore","position":"End","description":"En fin de mot, «-ore» se prononce généralement comme une voyelle ouverte et arrondie, proche du « o » français de « or », mais prolongée : /ɔː/. En anglais américain, on fait suivre cette voyelle d’un « r » anglophone /ɹ/ : la langue reste vers l’arrière sans vibrer comme en français. Pour bien la réaliser : lèvres arrondies, mâchoire légèrement abaissée, maintenez le son plus longtemps que votre « o » français, puis ajoutez éventuellement le /r/ doux américain.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"store","native":"magasin","position":"End","cultural_context":"Souvent employé en français : \"Apple Store\", \"concept store\" pour parler d’un magasin branché."},{"target":"score","native":"score","position":"End","cultural_context":"Terme sportif très courant utilisé tel quel en français pour indiquer le résultat d’un match."},{"target":"more","native":"plus","position":"End","cultural_context":"Mot présent dans de nombreux slogans publicitaires, chansons et répliques de films (« More and more »)."}]}]
["our",{"thoughts":"Le groupe de lettres « our » placé en fin de mot correspond le plus souvent au son faible /ər/ (comme le « e » muet de « butter » suivi du r anglais). C’est la même terminaison que -er ou -or américains (colour vs color). Le r est à peine roulé, pas comme en français.","pattern":"our","position":"End","description":"En fin de mot, « our » se prononce généralement /əɹ/ : une voyelle très réduite, proche du « e » très court de « le » en français, immédiatement suivie d’un r anglais non roulé (la langue recule légèrement sans toucher le palais). On n’entend ni « ou » ni « aou ». Exemple : colour /ˈkʌlə(ɹ)/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"colour","native":"couleur","position":"End","cultural_context":"Orthographe britannique courante dans les menus de logiciels, l’art ou la mode, souvent comparée au spelling américain « color »."},{"target":"flavour","native":"saveur","position":"End","cultural_context":"Vu sur les emballages alimentaires britanniques (« salt & vinegar flavour ») ou dans les émissions culinaires anglophones."},{"target":"neighbour","native":"voisin","position":"End","cultural_context":"Titre d’une série TV australienne (« Neighbours ») et expression courante dans les leçons d’anglais (« love thy neighbour »)."}]}]
["oor",{"thoughts":"Le groupe graphique « oor » se prononce le plus souvent /ɔː/ en anglais standard, un son long qui n’existe pas tel quel en français. Les francophones reconnaissent visuellement ces mots (door, floor, poor) grâce à l’exposition scolaire, aux films et à la musique, mais ont tendance à raccourcir la voyelle ou à la confondre avec /o/ français.","pattern":"oor","position":"Anywhere","description":"Il s’agit d’un « o » long et ouvert : la bouche s’ouvre un peu plus que pour le « o » français, les lèvres sont légèrement arrondies, la langue est reculée. Le son est tenu (longueur), sans diphtongue ni /r/ audible dans la plupart des accents britanniques et américains courants (« dooorr »).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"door","native":"porte","position":"End","cultural_context":"Expression récurrente dans les films/séries (« Open the door! ») et apprise dès le collège."},{"target":"dancefloor","native":"dancefloor (piste de danse)","position":"End","cultural_context":"Terme anglais passé tel quel en français pour parler des clubs et soirées (« sur le dancefloor »)."},{"target":"poor","native":"pauvre","position":"End","cultural_context":"Entendu dans les chansons et expressions populaires (« poor boy », « poor thing ») étudiées en cours d’anglais."}]}]
["oor",{"thoughts":"Le groupe final « oor » renvoie le plus souvent à la voyelle longue /ɔː/ (ou /ɔːr/ en accent rhotique). Les francophones connaissent déjà la voyelle /ɔ/ mais pas sa durée ni l’éventuel « r » anglophone. Ils rencontrent ces mots dans les séries, la musique et les voyages, d’où une certaine familiarité, mais la longueur vocalique et l’“r” peuvent poser problème.","pattern":"oor","position":"End","description":"« oor » en fin de mot se prononce généralement /ɔː/ en anglais britannique : un « o » ouvert (comme dans le français « corps »), mais tenu plus longtemps, la mâchoire légèrement abaissée et les lèvres arrondies. En anglais nord-américain, on ajoute un « r » non roulé (/ɔːr/) : la langue se rétracte vers l’arrière sans toucher le palais. Le secret : bien allonger la voyelle puis, si nécessaire, laisser résonner un « r » doux et continu, sans vibration à la française.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"door","native":"porte","position":"End","cultural_context":"Entendu dans presque tous les films/séries : « Open the door! »"},{"target":"floor","native":"sol / étage","position":"End","cultural_context":"Mot courant dans les ascenseurs ou pour parler des étages lors d’un voyage"},{"target":"poor","native":"pauvre","position":"End","cultural_context":"Présent dans des chansons célèbres (« Poor boy », Queen) et expressions de films"}]}]
["ough",{"thoughts":"« ough » est un groupe de lettres très fréquent en anglais, mais il se prononce de nombreuses façons différentes ( /ʌf/, /oʊ/, /uː/, /ɔː/, etc.). Pour un francophone, l’absence de règle unique et la présence de sons qui n’existent pas toujours en français compliquent son acquisition.","pattern":"ough","position":"Anywhere","description":"Il n’existe PAS une seule prononciation ! Selon le mot, « ough » peut être :\n• /ʌf/ comme dans “enough” (similaire à « e » ouvert + f)\n• /oʊ/ comme dans “doughnut” (le o long anglais, proche du “oh” français suivi d’un léger “ou”)\n• /uː/ comme dans “through” (le ou long anglais, lèvres arrondies, langue en arrière)\nLe seul moyen fiable est de mémoriser la prononciation mot par mot. Astuce : repérez les mots que vous connaissez déjà et ancrez la combinaison orthographe-son dans votre tête.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"doughnut","native":"beignet","position":"Middle","cultural_context":"Le beignet américain culte, souvent vu chez Homer Simpson ou dans les cafés ; le mot est repris tel quel en français (« doughnut/donut »)."},{"target":"enough","native":"assez / suffisamment","position":"End","cultural_context":"Vocabulaire de base appris à l’école et expression répétée dans les médias anglophones (« Enough is enough! »)."},{"target":"through","native":"à travers","position":"End","cultural_context":"Apparaît dans les consignes (« go through the door »), les jeux vidéo et les cours d’anglais, donc souvent rencontré."}]}]
["augh",{"thoughts":"Le groupe de lettres « augh » est trompeur : il cache plusieurs prononciations possibles et la consonne « gh » est toujours muette. Les francophones l’ont déjà rencontré dans quelques mots courants (« laugh », « daughter »), mais le son réel varie selon le mot, ce qui crée une incertitude.","pattern":"augh","position":"Anywhere","description":"« augh » peut produire principalement deux sons : 1) /ɔː/ : voyelle longue et ouverte, proche du « o » de « or » britannique (« daughter », « caught »). 2) /æf/ : voyelle courte /æ/ suivie d’un « f » (« laugh »). Dans tous les cas, les lettres « gh » sont muettes. La bouche s’ouvre largement ; pour /ɔː/, les lèvres sont légèrement arrondies et la voyelle est longue ; pour /æf/, la langue est vers l’avant, la voyelle est brève puis on finit par un [f] soufflé.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"laugh","native":"rire","position":"End","cultural_context":"Connu grâce à l’abréviation « LOL » (laugh out loud) largement utilisée sur Internet"},{"target":"daughter","native":"fille","position":"Middle","cultural_context":"Vocabulaire de base enseigné dès les premiers cours d’anglais au collège/lycée"},{"target":"caught","native":"attrapé","position":"End","cultural_context":"Entendu dans le sport (« he caught the ball ») ou dans l’expression « caught red-handed » souvent utilisée dans les films et séries"}]}]
["ould",{"thoughts":"Le groupe de lettres « ould » se prononce toujours /ʊd/ en anglais : le « l » et le « u » écrits ne correspondent pas à des sons distincts. La seule difficulté réelle pour un francophone est la voyelle courte /ʊ/, qui n’existe pas exactement en français et qu’il ne faut pas confondre avec le « ou » long /uː/.","pattern":"ould","position":"End","description":"« ould » se prononce /ʊd/ : \n• Voyelle /ʊ/ : bouche légèrement arrondie, plus ouverte et plus courte que le « ou » français de « mou ». \n• Pas de son [l] malgré la lettre « l ». \n• Le mot se termine par une consonne [d] claire. \nEx. /wʊd/ (« would »), /kʊd/ (« could »).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"would","native":"conditionnel de \"will\" (« voudrais », « serait »...)","position":"End","cultural_context":"Vu très tôt dans les cours d’anglais (« Would you like...? ») et dans les films en VO sous-titrée"},{"target":"could","native":"prétérit de \"can\" (« pourrait »)","position":"End","cultural_context":"Employé dans les manuels scolaires et les chansons (« Could you be loved » de Bob Marley)"},{"target":"should","native":"devoir au conditionnel (« devrait »)","position":"End","cultural_context":"Apparaît dans les guides de conversation (« You should visit Paris »), séries et sous-titres"}]}]
["igh",{"thoughts":"Le trigramme « igh » se prononce /aɪ/ (comme « aïe »). Les francophones le croisent surtout dans « high-tech », « high five », etc., mais n’identifient pas toujours la règle orthographe→son. Le g et le h sont muets, le i devient la diphtongue /aɪ/.","pattern":"igh","position":"End","description":"« igh » se prononce comme le son français « aïe » : ouvrez la bouche pour un [a] bref puis glissez rapidement vers un [ɪ] très court. Le g et le h ne se prononcent pas ; ils servent seulement à signaler cette diphtongue /aɪ/. Exemple : « high » se prononce /haɪ/, à peu près comme « haï ».","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"high","native":"haut / high","position":"End","cultural_context":"Employé tel quel en français dans « high-tech », « high five », ou les séries US, donc souvent vu/entendu."},{"target":"sigh","native":"soupir","position":"End","cultural_context":"Sur les réseaux sociaux ou dans les BD anglaises on lit *sigh* pour marquer un soupir, mot reconnu par de nombreux internautes francophones."},{"target":"high-tech","native":"high-tech","position":"Middle","cultural_context":"Terme courant en français pour désigner la technologie de pointe ; tout le monde connaît le mot même s’il est partiellement anglais."}]}]
["tion",{"thoughts":"Les francophones rencontrent -tion partout (information, situation…). Ils croient donc connaître le son, mais en anglais il change complètement : il devient /ʃən/ alors qu’en français on dit /sjɔ̃/. Il faut donc désapprendre la nasalisation et remplacer le /s/ par un /ʃ/ plus doux, suivi d’un schwa à peine audible.","pattern":"tion","position":"End","description":"En anglais, la terminaison « -tion » se prononce /ʃən/ :\n• Le « t » est muet.\n• « ti » fusionne pour donner le son /ʃ/ (comme « ch » dans « chaud », mais plus bref).\n• Le « o » se réduit à un schwa /ə/ : un petit « e » très court et relâché.\n• On évite toute nasalisation : on finit sur /n/ légère, la langue touche juste les alvéoles.\nRésultat : « station » → /ˈsteɪʃən/ (sté-CHƏN), pas */stasjɔ̃/*.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"station","native":"station","position":"End","cultural_context":"Mot identique en français (gare, station-service), donc très courant"},{"target":"PlayStation","native":"PlayStation","position":"End","cultural_context":"Console de jeux vidéo extrêmement populaire en France"},{"target":"action","native":"action","position":"End","cultural_context":"Terme fréquent : « film d’action », « action en bourse »"}]}]
["sion",{"thoughts":"Le digramme final « sion » est fréquent en anglais dans des mots d’origine latine proches du français. Le principal piège pour un francophone est de ne PAS nasaliser « on » et de remplacer la voyelle pleine /ɔ̃/ par un schwa /ə/ très bref suivi d’un n léger. Selon le mot, le « s » se prononce /ʒ/ (le plus courant) ou /ʃ/.","pattern":"sion","position":"End","description":"En anglais, « sion » en fin de mot se prononce le plus souvent /ʒən/ : le son /ʒ/ comme dans « je », suivi d’un schwa /ə/ très court puis d’un n quasi muet. Après certaines consonnes sourdes (p, t, k), il peut se réaliser /ʃən/ (/ʃ/ comme « ch » de « chat »). Aucune nasalisation : la bouche reste ouverte et l’air sort seulement par la bouche, pas par le nez.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"television","native":"télévision","position":"End","cultural_context":"Mot international désignant la TV, identique au français à l’exception de l’accent aigu"},{"target":"decision","native":"décision","position":"End","cultural_context":"Terme courant en affaires et en politique, très proche du mot français"},{"target":"mission","native":"mission","position":"End","cultural_context":"Utilisé pour parler des missions spatiales (NASA), diplomatiques ou humanitaires, même orthographe qu’en français"}]}]
["cian",{"thoughts":"Le groupe graphique « cian » apparaît surtout à la fin de noms d’agent comme « musician ». Il se prononce en anglais /ʃən/ : consonne ch-anglaise + voyelle schwa + n léger. Pour un francophone, la graphie rappelle le français « -cien » mais la prononciation diffère nettement.","pattern":"cian","position":"End","description":"En anglais, « cian » se prononce /ʃən/. 1) Commencez par le son « ch » anglais /ʃ/, comme dans « ship ». 2) Enchaînez immédiatement sur la voyelle réduite schwa /ə/ : un son très court et neutre, semblable au « e » muet français, mais non accentué ni nasalisé. 3) Terminez par un /n/ rapide, la langue touchant brièvement l’arrière des dents supérieures. L’accent tonique porte sur la syllabe précédente (muSI-cian, maGI-cian). Le /n/ n’est pas fortement articulé ; évitez de prononcer « si-en » comme en français, ni de nasaliser la voyelle.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"musician","native":"musicien","position":"End","cultural_context":"Mot cognat presque identique au français, entendu dans la musique et les médias anglophones"},{"target":"magician","native":"magicien","position":"End","cultural_context":"Spectacles de magie, films et séries parlent souvent d’un « magician »"},{"target":"technician","native":"technicien","position":"End","cultural_context":"Utilisé dans le milieu professionnel et dans les notices en anglais"}]}]
["xion",{"thoughts":"Le groupe de lettres « xion » est très courant dans des mots transparents entre le français et l’anglais comme « action ». Les francophones connaissent déjà ces mots mais ignorent parfois que, côté anglais, « x » se prononce /kʃ/ et non /ks/. Il s’agit donc d’un son familier à l’œil, mais avec un détail phonétique à maîtriser.","pattern":"xion","position":"End","description":"« xion » se prononce /kʃən/ :  \n1. /k/ rapide (comme le « c » dur dans « quand »).  \n2. enchaîné sans voyelle avec /ʃ/ (le « ch » français de « chat »).  \n3. voyelle réduite /ə/ (schwa anglaise, son neutre, bouche détendue) suivie d’un /n/ léger.  \nOn entend donc « k-cheun ». Ne laissez pas s’échapper un /i/ ou un /o/ ; la voyelle est très courte et centrale.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"action","native":"action","position":"End","cultural_context":"Mot identique en français et très fréquent dans les films (« Action movie ») et les commandes (« Take action »)."},{"target":"crucifixion","native":"crucifixion","position":"End","cultural_context":"Terme religieux et historique souvent rencontré dans les cours d’histoire ou les films sur la Bible."},{"target":"complexion","native":"complexion (teint)","position":"End","cultural_context":"Utilisé en cosmétique (« complexion cream ») et entendu dans les séries ou vidéos beauté anglophones."}]}]
["ssion",{"thoughts":"Le groupe de lettres « ssion » est très répandu dans les mots anglais d’origine latine similaires au français (« mission, passion, discussion »). Le danger pour un francophone est de garder la prononciation française (/sisjɔ̃/) ou nasale. En anglais, le double s se transforme en son « sh » /ʃ/ et le « ion » devient une voyelle réduite /ən/ non nasalisée.","pattern":"ssion","position":"End","description":"En anglais, « ssion » se prononce /ʃən/ :\n1. Commencez par le son « sh » /ʃ/ : langue légèrement reculée, les côtés frôlent les molaires, lèvres un peu avancées comme pour « chut ».\n2. Enchaînez sur une voyelle neutre très brève, le « schwa » /ə/, bouche détendue, sans accent.\n3. Terminez par un /n/ clair (langue qui touche les alvéoles, sans nasalisation française).\nLe tout est rapide et non accentué car ce groupe se trouve en syllabe finale et non porteuse d’accent en anglais.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"mission","native":"mission","position":"End","cultural_context":"Connu via la saga de films « Mission : Impossible » souvent diffusée en France"},{"target":"passion","native":"passion","position":"End","cultural_context":"Mot identique en français, utilisé fréquemment dans la vie courante et la culture pop (« fashion passion », etc.)"},{"target":"discussion","native":"discussion","position":"End","cultural_context":"Mot courant présent sur les réseaux sociaux et forums (« ouvrir une discussion »), même orthographe en français"}]}]
["gion",{"thoughts":"Le groupe \"gion\" se trouve surtout en syllabe finale dans des mots anglais d’origine latine proches du français. Le sens est familier aux francophones (religion, région…), mais la prononciation anglaise change totalement : pas de voyelle nasale, et le « g » devient l’affriquée /dʒ/. Il faut donc réapprendre un mot connu avec une finition sonore différente.","pattern":"gion","position":"End","description":"En anglais, « gion » se prononce /dʒən/ : \n• Commencez par l’affriquée /dʒ/ : placez la pointe de la langue juste derrière les incisives supérieures (comme pour « dj »), faites un léger blocage puis relâchez avec friction.\n• Enchaînez rapidement sur un schwa /ə/ très réduit, presque muet (bouche détendue, son bref).\n• Terminez par un /n/ léger ; la langue touche les alvéoles, mais la voyelle reste non nasale. \nImportant : aucune nasalisation — ne dites pas /jɔ̃/ comme en français « région ». Le tout forme une syllabe très courte « -djeun » (sans accent tonique).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"religion","native":"religion","position":"End","cultural_context":"Mot identique en français et en anglais, entendu dans les médias et les cours d’histoire."},{"target":"region","native":"région","position":"End","cultural_context":"Terme géographique courant, presque le même qu’en français « région »."},{"target":"legion","native":"légion","position":"End","cultural_context":"Connu via l’expression « Légion étrangère » ou dans la culture pop (« a legion of fans »)."}]}]
["tious",{"thoughts":"Le groupe \"tious\" se trouve uniquement en fin de mot et se prononce /ʃəs/. Le « t » est muet, le « iou » se réduit à un schwa /ə/, et le « s » final est clairement audible. Le son /ʃ/ existe déjà en français (« ch »), mais la combinaison avec un schwa suivi d’un /s/ final est moins habituelle.","pattern":"tious","position":"End","description":"\"tious\" se prononce /ʃəs/ : commencez par le son « ch » français (/ʃ/), puis relâchez la langue pour un petit « e » très court et neutre (/ə/), enfin terminez avec un /s/ net. Le « t » écrit n’est pas prononcé.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ambitious","native":"ambitieux","position":"End","cultural_context":"Mot fréquent dans le milieu professionnel et académique, souvent rencontré dans les CV et les séries américaines."},{"target":"cautious","native":"prudent","position":"End","cultural_context":"Ressemble au mot français \"caution\" et apparaît souvent dans les manuels d’anglais et les films."},{"target":"nutritious","native":"nutritif","position":"End","cultural_context":"Utilisé sur les emballages alimentaires et dans les publicités pour vanter les qualités d’un produit."}]}]
["cious",{"thoughts":"Le groupe de lettres « cious » se prononce toujours à la fin des mots et sonne /ʃəs/. Le /ʃ/ est familier aux francophones (comme dans « chat »), puis on enchaîne un schwa très bref (« e » neutre) et un /s/ net. La principale difficulté est de bien réduire la voyelle centrale et d’éviter de prononcer « ious » comme /jus/ ou /iʊs/.","pattern":"cious","position":"End","description":"On prononce « cious » comme /ʃəs/ : 1) commencez par le son « ch » français (/ʃ/) ; 2) relâchez immédiatement la mâchoire pour un schwa très court, proche d’un « e » muet ; 3) finissez par un /s/ clair. L’ensemble doit être rapide : « ʃəs ».","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"delicious","native":"délicieux","position":"End","cultural_context":"Mot fréquent dans la publicité, les menus et l’expression « so delicious » que l’on voit souvent en France"},{"target":"Precious","native":"précieux","position":"End","cultural_context":"Titre du film primé « Precious » (2009) et citation culte « My precious! » du Seigneur des Anneaux"},{"target":"vicious","native":"vicieux","position":"End","cultural_context":"Expression courante « vicious circle » dans les médias, et chanson « Vicious » de Lou Reed"}]}]
["sure",{"thoughts":"Le groupe final « -sure » se prononce le plus souvent /ʒə/ (britannique) ou /ʒɚ/ (américain). Le /ʒ/ est identique au « j » français dans « jour ». Vient ensuite un schwa très bref, parfois suivi d’un « r » non roulé en anglais US. Le son ne se prononce donc ni /sjuːɹ/ ni comme le mot isolé « sure » (/ʃɔː/). Les francophones connaissent déjà /ʒ/ et le schwa, mais le « r » américain final peut poser problème.","pattern":"sure","position":"End","description":"Prononcez d’abord le son /ʒ/ (comme le « j » de « journal »), puis un schwa (un « e » muet très rapide). En anglais américain, ajoutez un « r » relâché mais audible juste après le schwa (/ʒɚ/). En anglais britannique, le mot se termine simplement par le schwa (/ʒə/). Veillez à ne pas produire /s-/ ou /ʃ-/ comme dans le mot « sure » isolé.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pleasure","native":"plaisir","position":"End","cultural_context":"Mot courant en anglais, très proche du français « plaisir » souvent rencontré dans les expressions « my pleasure », séries ou voyages."},{"target":"measure","native":"mesure","position":"End","cultural_context":"Ressemble presque exactement au mot français « mesure » ; entendu en science (« unit of measure ») ou en musique (« time signature measure »)."},{"target":"treasure","native":"trésor","position":"End","cultural_context":"Connu grâce aux films d’aventure (« treasure hunt », « National Treasure »), jeux vidéo et contes parlant de trésors."}]}]
["ture",{"thoughts":"Le groupe de lettres « ture » en fin de mot se réalise en anglais par la consonne affriquée [tʃ] (« tch ») suivie d’un schwa, et éventuellement d’un /r/ final dans l’accent américain. Les francophones connaissent déjà les mots « culture, nature, future », mais la prononciation anglaise diffère beaucoup de la française : pas de voyelle pleine /y/ ou /yʁ/, mais un bref schwa et une consonne « tch ».","pattern":"ture","position":"End","description":"Se prononce généralement /tʃər/ : commencez par le son « tch » (comme dans « tchèque »), puis relâchez rapidement la mâchoire pour articuler un schwa très court (voyelle neutre, bouche détendue). En anglais américain, terminez par un /r/ légèrement rétroflexe ; en anglais britannique, le /r/ final est souvent inaudible.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"culture","native":"culture","position":"End","cultural_context":"Mot identique en français, utilisé quotidiennement et dans les médias"},{"target":"nature","native":"nature","position":"End","cultural_context":"Même orthographe qu’en français ; thème récurrent (documentaires, écologie)"},{"target":"future","native":"future","position":"End","cultural_context":"Employé en français (science-fiction, expression « le futur »), même orthographe"}]}]
["ment",{"thoughts":"Le suffixe anglais “-ment” ressemble visuellement au “-ment” français, mais la réalisation phonétique est différente : pas de nasalisation, schwa très court, et consonne finale /t/ nettement prononcée. Les francophones connaissent beaucoup de mots qui le contiennent, mais ont tendance à le prononcer à la française.","pattern":"ment","position":"End","description":"Se prononce généralement /mənt/ :\n• Commencez par /m/ comme en français.\n• Enchaînez avec un schwa très bref /ə/ (bouche détendue, son presque neutre).\n• Ajoutez /n/ clair (la langue touche brièvement les alvéoles, sans nasaliser la voyelle précédente).\n• Terminez par /t/ audible ; la pointe de la langue revient aux alvéoles et l’air s’échappe brusquement.  \nImportant : pas de voyelle nasale, pas d’allongement, et le /t/ ne disparaît pas.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"government","native":"gouvernement","position":"End","cultural_context":"Mot souvent rencontré dans l’actualité internationale et les cours d’anglais"},{"target":"management","native":"management","position":"End","cultural_context":"Terme business très utilisé en français pour parler de gestion d’entreprise"},{"target":"document","native":"document","position":"End","cultural_context":"Mot identique en français, courant en bureautique et informatique"}]}]
["less",{"thoughts":"Le suffixe «-less » est fréquent en anglais et les apprenants francophones le rencontrent vite. Le principal piège est de prononcer le « e » comme en français [lɛs] alors qu’il s’agit d’un schwa très bref et inaccentué /ləs/.","pattern":"less","position":"End","description":"-less se prononce /ləs/ : commencez par un [l] clair (la pointe de la langue contre les alvéoles), enchaînez immédiatement sur un schwa très court [ə] – un son neutre, bouche détendue – puis terminez par un [s] net et non voisé. Le suffixe est toujours atone : on accentue la syllabe qui le précède (wi-RE-less, HO-me-less). Évitez de dire [lɛs] ou d’allonger le « e » comme en français.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"wireless","native":"wireless / sans fil","position":"End","cultural_context":"Terme courant dans la technologie : réseaux Wi-Fi, souris « wireless »."},{"target":"homeless","native":"sans-abri","position":"End","cultural_context":"Mot entendu dans les médias anglophones pour désigner les sans-abri, parfois repris tel quel en français."},{"target":"careless","native":"imprudent / négligent","position":"End","cultural_context":"Connu grâce à la chanson célèbre « Careless Whisper » de George Michael, souvent diffusée."}]}]
["ful",{"thoughts":"Le groupe « ful » final se réduit en anglais à une syllabe très courte /fəl/. Le /ə/ (schwa) n’existe pas vraiment en français, d’où une petite difficulté ; le /l/ final clair demande aussi un placement précis de la langue. Les mots « beautiful », « wonderful » et « colorful » sont fréquemment entendus dans la culture populaire francophone (chansons, films, réseaux sociaux), ce qui facilite la reconnaissance.","pattern":"ful","position":"End","description":"En fin de mot, « ful » se prononce /fəl/ :\n• /f/ : même consonne que dans le français « feu », non voisée.\n• /ə/ : voyelle très courte et neutre – bouche relâchée, langue au repos, similaire à l’« e » muet de « petite » quand on le prononce à peine.\n• /l/ clair : pointe de la langue contre l’arrière des dents supérieures, sans obscurcissement.\nLe tout forme une syllabe ultra-brève, jamais accentuée.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"beautiful","native":"beau/belle","position":"End","cultural_context":"Mot fréquent dans les chansons anglophones et les réseaux sociaux (« You are beautiful »)."},{"target":"wonderful","native":"merveilleux","position":"End","cultural_context":"Entendu dans l’expression « What a wonderful world » et d’autres titres connus."},{"target":"colorful","native":"coloré","position":"End","cultural_context":"Utilisé dans la mode et le design ; souvent lu dans la presse ou sur Internet pour décrire des looks « colorful »."}]}]
["ble",{"thoughts":"Le groupe final « ble » existe aussi en français, ce qui rend les mots très familiers. Toutefois, la réalisation phonétique diffère : l’anglais insère un schwa ou un L syllabique /bəl, bl̩/ alors que le français garde /bl/. L’apprenant doit donc ajouter un petit « e » très court avant ou dans le L, tout en évitant de prononcer une voyelle pleine (« bleu »).","pattern":"ble","position":"End","description":"En anglais, la succession « ble » en fin de mot se prononce généralement /bəl/ : on dit [b] suivi d’un schwa très bref /ə/ qui se fond dans un L sombre (« dark l ») souvent syllabique. Cela donne un son proche de « beul » mais très réduit ; la langue reste basse après le /b/ puis recule vers l’arrière pour former le L, sans exploser une voyelle claire comme en français.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"table","native":"table","position":"End","cultural_context":"Objet courant, même orthographe qu’en français ; utilisé dans les cours d’anglais dès le début."},{"target":"cable","native":"câble","position":"End","cultural_context":"Terme technologique (TV, internet) fréquemment vu dans les menus et notices."},{"target":"possible","native":"possible","position":"End","cultural_context":"Même adjectif qu’en français, entendu dans les médias et séries (« Mission: Impossible »)."}]}]
["cle",{"thoughts":"Le groupe orthographique « cle » en fin de mot ne se réalise pas en consonnes collées /kl/ comme en français, mais en syllabe séparée /kəl/ (k + schwa + l). Les francophones doivent surtout penser à ajouter un schwa très bref avant le l clair anglais.","pattern":"cle","position":"End","description":"En anglais, la terminaison « -cle » se prononce /kəl/ : on articule d’abord [k], puis un schwa très rapide /ə/ (voyelle neutre, bouche détendue), et on termine par un l clair, pointe de la langue juste derrière les dents du haut. On entend donc deux syllabes (« ar-ti-kel », « mi-ra-kel »), contrairement au français où l’on dit souvent /kl/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"article","native":"article","position":"End","cultural_context":"Mot identique en français et très fréquent dans la presse ou la grammaire – les apprenants le voient souvent dans les deux langues."},{"target":"miracle","native":"miracle","position":"End","cultural_context":"Mot courant dans les médias et les expressions religieuses ; l’orthographe est la même qu’en français."},{"target":"Oracle","native":"Oracle","position":"End","cultural_context":"Nom de la grande entreprise informatique américaine, souvent citée dans l’actualité tech."}]}]
["gle",{"thoughts":"Les francophones rencontrent déjà « Google » ou « jungle ». Le /ə/ et surtout le « dark L » final peuvent toutefois poser problème, car ils n’existent pas en français.","pattern":"gle","position":"End","description":"En fin de mot, « gle » se prononce généralement /gəl/ : on commence par un /g/ dur (comme « g » dans « gare »), on enchaîne avec un schwa très bref /ə/ (voyelle neutre, bouche détendue), puis on termine par un « L obscur » (dark L) : la pointe de la langue reste basse ou touche légèrement l’arrière des dents inférieures, tandis que l’arrière de la langue se soulève vers le voile du palais. Il ne faut pas accentuer le /ə/ ni articuler un « gue-le » français ; l’ensemble doit rester compact, presque « geul ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Google","native":"Google","position":"End","cultural_context":"Moteur de recherche et marque mondiale que tout le monde utilise quotidiennement"},{"target":"jungle","native":"jungle","position":"End","cultural_context":"Mot identique en français et présent dans l’expression « la jungle » ou dans des titres de films/livres"},{"target":"beagle","native":"beagle","position":"End","cultural_context":"Race de chien souvent citée dans les médias et les séries, nom inchangé en français"}]}]
["kn",{"thoughts":"En français, aucune consonne n’est muette devant un /n/ en début de mot ; les francophones ont donc tendance à vouloir prononcer le « k ». Ils ont néanmoins souvent déjà rencontré des mots comme « know » ou « knife » dans les cours d’anglais. Le principal défi est de supprimer complètement le /k/ et de commencer directement par le /n/.","pattern":"kn","position":"Beginning","description":"Au début d’un mot anglais, la lettre « k » est muette ; on prononce uniquement la consonne /n/. Il faut coller la pointe de la langue contre l’arrière des dents supérieures (comme pour le « n » français) et passer directement à la voyelle suivante, sans aucun petit coup de glotte ni explosion de /k/. Évitez donc tout son [k].","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"know","native":"savoir / connaître","position":"Beginning","cultural_context":"Verbe d’anglais basique rencontré dès le niveau débutant (phrases comme « I know »)."},{"target":"knife","native":"couteau","position":"Beginning","cultural_context":"Objet de cuisine courant; souvent vu dans les émissions culinaires ou dans l’emballage « Swiss Army Knife »."},{"target":"knock","native":"frapper (à la porte)","position":"Beginning","cultural_context":"Expression familière « knock knock » dans les blagues ou scènes de film (« Knock, knock, who’s there? »)."}]}]
["gn",{"thoughts":"En anglais, le groupe de lettres « gn » placé au début d’un mot se prononce simplement /n/, le « g » étant muet. Les francophones, habitués au /ɲ/ (comme dans « montagne ») ou à prononcer le « g », risquent de faire deux erreurs : soit utiliser le son /ɲ/, soit articuler le /g/. Quelques mots courants (gnome, gnocchi, gnu) permettent d’illustrer cette particularité.","pattern":"gn","position":"Beginning","description":"Au début d’un mot anglais, le « g » est complètement muet ; on prononce seulement un /n/ net, comme le « n » de « neuf ». Il n’y a ni son nasal palatal /ɲ/ (comme en français « gn »), ni attaque du /g/. On commence immédiatement par le /n/ suivi du reste du mot.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gnome","native":"gnome","position":"Beginning","cultural_context":"Mot identique en français pour les petites statues de jardin, souvent vu dans la culture pop"},{"target":"gnocchi","native":"gnocchi","position":"Beginning","cultural_context":"Pâtes italiennes populaires, présentes dans les supermarchés et restaurants français"},{"target":"gnu","native":"gnu","position":"Beginning","cultural_context":"Nom de l’animal (antilope) et du célèbre projet logiciel libre, mentionné dans l’informatique et les documentaires"}]}]
["wr",{"thoughts":"Le digramme « wr » apparaît surtout au début de mots d’origine germanique. Le « w » est complètement muet ; seule la consonne /r/ anglaise se prononce. Le piège pour un francophone est double : on a tendance à vouloir prononcer le « w » ou à réaliser un /ʁ/ français au lieu du /ɹ/ anglais.","pattern":"wr","position":"Beginning","description":"« wr- » se prononce simplement /ɹ/ : la langue se recourbe légèrement vers l’arrière sans toucher le palais (r anglais), et le « w » n’émet aucun son. On n’entend donc que un ‘r’ anglais, plus doux et plus rétroflexe que le ‘r’ guttural français.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"wrap","native":"wrap (sandwich roulé)","position":"Beginning","cultural_context":"Mot courant dans la restauration rapide en France ; beaucoup de chaînes proposent des « wraps »."},{"target":"Wrangler","native":"Wrangler","position":"Beginning","cultural_context":"Marque internationale de jeans vendue en France, visible dans la publicité et les magasins."},{"target":"wrestling","native":"wrestling","position":"Beginning","cultural_context":"Sport-spectacle (WWE) diffusé à la télévision française ; le mot est souvent utilisé tel quel."}]}]
["ps",{"thoughts":"Le groupe consonantique « ps » au début d’un mot est très visible à l’écrit et apparaît dans des mots savants que les francophones connaissent déjà. Cependant, l’habitude française de prononcer /p/ + /s/ entraîne souvent une hyper-articulation du « p » qui n’existe pas en anglais, d’où des interférences possibles.","pattern":"ps","position":"Beginning","description":"En anglais, lorsque « ps » ouvre un mot, le « p » est totalement muet. On démarre directement sur un /s/ doux et continu : dents presque jointes, langue basse, soufflerie régulière sans vibration des cordes vocales. Aucune fermeture des lèvres ni petite explosion du « p » ne doit précéder le /s/. C’est l’inverse du français où l’on dit /ps/-.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psychology","native":"psychologie","position":"Beginning","cultural_context":"Discipline universitaire connue ; même racine grecque que le mot français « psychologie »."},{"target":"pseudo","native":"pseudo","position":"Beginning","cultural_context":"Employé en français pour parler d’un surnom ou de quelque chose de faux (« pseudo-science »)."},{"target":"psycho","native":"psycho","position":"Beginning","cultural_context":"Titre du film culte d’Alfred Hitchcock, souvent cité dans la culture pop."}]}]
["pn",{"thoughts":"En anglais, quand un mot commence par « pn- », le « p » n’est pas articulé ; on attaque directement sur le /n/. Les francophones connaissent l’orthographe (pneu, pneumonie…), mais en français on prononce bien le « p ». Le réflexe de le garder rend la prononciation anglaise un peu piégeuse.","pattern":"pn","position":"Beginning","description":"Au début d’un mot anglais, la suite de lettres « pn » se réalise simplement comme le son /n/ : le flux d’air sort par le nez, la pointe de la langue touche les alvéoles, et le « p » reste totalement muet. On démarre donc le mot par un /n/ franc et net, sans plosive préalable.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pneumonia","native":"pneumonie","position":"Beginning","cultural_context":"Terme médical entendu aux infos ou chez le médecin pour désigner une infection pulmonaire"},{"target":"pneumatic","native":"pneumatique","position":"Beginning","cultural_context":"Parle d’outils ou de pneus fonctionnant à air comprimé ; souvent cité dans le bricolage et l’automobile"},{"target":"pneumothorax","native":"pneumothorax","position":"Beginning","cultural_context":"Mot régulièrement entendu dans les séries ou films médicaux quand un poumon s’affaisse"}]}]
["rh",{"thoughts":"Les francophones connaissent l’orthographe « rh » via des mots d’origine grecque en français, mais en anglais ils ignorent souvent que cela se prononce tout simplement /ɹ/ comme un « r » anglais normal; l’aspect inhabituel vient donc plus de l’articulation du r anglais (alvéolaire approximant) que de la présence du h.","pattern":"rh","position":"Beginning","description":"En anglais, le groupe « rh » placé au début d’un mot se prononce exactement comme le « r » anglais /ɹ/. Il n’y a aucun son [h] : le h est muet. Pour le réaliser : laissez la pointe de la langue s’approcher de la gencive derrière les dents du haut sans la toucher, les côtés de la langue contre les molaires, lèvres légèrement arrondies, et faites vibrer la voix sans frottement. Ne roulez pas le r et ne produisez pas le \"/ʁ/\" uvulaire français.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Rhapsody","native":"Bohemian Rhapsody","position":"Beginning","cultural_context":"Titre mythique de Queen souvent diffusé à la radio et dans les films"},{"target":"Rhubarb","native":"rhubarbe","position":"Beginning","cultural_context":"Légume-fruit utilisé en tartes, mot très proche du français « rhubarbe »"},{"target":"Rhodes","native":"Rhodes","position":"Beginning","cultural_context":"Île grecque célèbre pour le Colosse et destination touristique connue"}]}]
["pt",{"thoughts":"En anglais, « pt- » en début de mot est d’origine grecque et la consonne p n’est jamais prononcée ; on démarre directement par un /t/ nettement aspiré. Les francophones connaissent déjà ces mots dans leur forme française mais, en français, on garde le /p/. Il faut donc apprendre à l’effacer en anglais.","pattern":"pt","position":"Beginning","description":"En anglais, quand un mot commence par « pt- », le p est totalement muet : on attaque immédiatement par un /t/ aspiré (un petit souffle d’air, comme dans « table »). La langue reste en position pour un /t/ classique, mais on n’explose pas le /p/ avant. Exemple : « pterodactyl » se prononce /ˈtɛrəˌdæktɪl/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pterodactyl","native":"ptérodactyle","position":"Beginning","cultural_context":"Dinosaure célèbre, souvent vu dans Jurassic Park et les documentaires"},{"target":"Ptolemy","native":"Ptolémée","position":"Beginning","cultural_context":"Nom de l’astronome grec souvent cité dans l’histoire des sciences"},{"target":"Pteranodon","native":"ptéranodon","position":"Beginning","cultural_context":"Autre dinosaure volant connu des expositions et films sur la préhistoire"}]}]
["ts",{"thoughts":"Le groupe consonantique « ts » n’existe pratiquement pas en position initiale en français, sauf dans quelques emprunts. Les francophones l’ont déjà rencontré dans des mots internationaux comme « tsunami » ou « tsar », mais ont tendance à omettre le /t/ et dire seulement /s/. Il faut donc insister sur la présence très brève du /t/ suivi sans pause du /s/.","pattern":"ts","position":"Beginning","description":"Prononcez d’abord un /t/ alvéolaire non aspiré (la pointe de la langue touche légèrement l’arrière des incisives supérieures) puis, sans relâcher complètement la langue, laissez l’air siffler pour enchaîner immédiatement sur un /s/. Le /t/ est très court ; le /s/ est continu. L’enchaînement doit être fluide, presque comme un seul son « /ts/ ».","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"tsunami","native":"tsunami","position":"Beginning","cultural_context":"Phénomène naturel souvent évoqué dans les médias depuis le tsunami de 2004"},{"target":"tsar","native":"tsar","position":"Beginning","cultural_context":"Titre des empereurs russes, vu en cours d’histoire et dans la culture populaire"},{"target":"tsetse fly","native":"mouche tsé-tsé","position":"Beginning","cultural_context":"Insecte africain évoqué dans les documentaires animaliers et les cours de sciences"}]}]
["mb",{"thoughts":"En anglais, la séquence finale « mb » se réduit presque toujours à un simple /m/ : le « b » est muet. Les francophones risquent de le prononcer, car en français la lettre « b » se prononce presque toujours. Cependant ils ont déjà rencontré quelques mots connus où le « b » est muet (« bomb », « lamb », etc.), ce qui augmente la familiarité.","pattern":"mb","position":"End","description":"À la fin d’un mot anglais, « mb » se prononce tout simplement /m/ : on ferme les lèvres comme pour un /m/, la voix résonne dans le nez, puis on relâche—on n’ajoute PAS de /b/ ni d’explosion finale. Le « b » est complètement silencieux, il sert seulement à marquer l’orthographe.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"bomb","native":"bombe","position":"End","cultural_context":"Mot très présent dans les films, les infos et l’expression « photo-bomb » ; ressemble au français « bombe »."},{"target":"lamb","native":"agneau","position":"End","cultural_context":"Plat courant (« lamb curry », « rack of lamb ») dans la cuisine anglo-saxonne, vu sur les menus ou émissions culinaires."},{"target":"thumb","native":"pouce","position":"End","cultural_context":"Geste « thumbs up » omniprésent sur les réseaux sociaux et dans la pop-culture."}]}]
["mn",{"thoughts":"Le groupe « mn » final est déjà connu des francophones grâce à des cognats comme « autumn / automne ». Le piège principal est de ne PAS faire entendre le « n ». On serre simplement les lèvres pour un /m/ final.","pattern":"mn","position":"End","description":"En fin de mot anglais, la combinaison « mn » se prononce comme un simple /m/ : les lèvres se ferment, aucune vibration de la langue contre les dents, le « n » est complètement muet. Exemple : /ˈɔːtəm/ pour « autumn ».","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"autumn","native":"automne","position":"End","cultural_context":"Nom de saison vu dès les premiers cours d’anglais et souvent comparé au français « automne »"},{"target":"damn","native":"zut/merde","position":"End","cultural_context":"Interjection très présente dans les films, séries et chansons anglophones"},{"target":"column","native":"colonne","position":"End","cultural_context":"Mot fréquent en bureautique (Excel, bases de données) et en architecture"}]}]
["lk",{"thoughts":"Le groupe consonantique final /lk/ existe rarement en français, mais les francophones l’ont déjà rencontré dans des mots courants (milk, Hulk). La principale difficulté est d’enchaîner le /l/ « clair » anglais directement avec le /k/ sans insérer de voyelle parasite.","pattern":"lk","position":"End","description":"Prononcez d’abord un /l/ clair : la pointe de la langue touche juste derrière les dents du haut, la voix résonne. Sans relâcher totalement l’air ni ajouter de voyelle, reculez instantanément l’arrière de la langue pour fermer puis ouvrir le voile du palais et produire un /k/ sourd. Les deux consonnes se suivent donc directement, et la syllabe se termine net, sans son final ajouté.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"milk","native":"lait (milk)","position":"End","cultural_context":"Boisson de base (« milkshake », « milk » sur les emballages) souvent lue ou entendue en France"},{"target":"Hulk","native":"Hulk (personnage)","position":"End","cultural_context":"Super-héros Marvel très populaire dans les films et comics"},{"target":"silk","native":"soie (silk)","position":"End","cultural_context":"Terme textile fréquent (« Silk road », écharpes en « silk ») entendu dans la mode et l’histoire"}]}]
["lm",{"thoughts":"Le groupe consonantique final “-lm” existe très peu en français (on dit rarement deux consonnes différentes en fin de mot). Pourtant les francophones rencontrent très souvent le mot « film » en anglais comme en français. Ils connaissent donc visuellement le motif, mais l’enchaînement [lm] sans intercaler de voyelle reste inhabituel et peut provoquer la suppression du /l/ (« fim ») ou l’ajout d’un schwa (« fi-leum »).","pattern":"lm","position":"End","description":"À la fin d’un mot anglais, “lm” se prononce en enchaînant deux consonnes : 1. /l/ clair : pointe de la langue contre l’arrière des dents du haut, bouche encore ouverte. 2. /m/ : lèvres qui se ferment complètement, l’air sortant par le nez. Il ne faut pas insérer de voyelle entre les deux sons et il faut veiller à garder le /l/, contrairement à certains mots comme « calm » où le /l/ est muet.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"film","native":"film","position":"End","cultural_context":"Mot identique en français (cinéma). Très utilisé au quotidien."},{"target":"calm","native":"calme","position":"End","cultural_context":"Mot proche du français « calme », souvent rencontré dans les cours d’anglais ou la méditation (« stay calm »)."},{"target":"palm","native":"palmier / paume","position":"End","cultural_context":"Nom de la marque historique « Palm Pilot » et référence courante aux palmiers dans la culture pop (voyages, cocktails)."}]}]
["gn",{"thoughts":"En anglais, « gn » placé en fin de mot se prononce uniquement /n/ ; le g est totalement muet. Le piège pour un francophone est d’éviter le son /ɲ/ (comme dans « montagne »). Heureusement, beaucoup de mots courants ou d’emprunts (design, champagne…) montrent cette orthographe, donc le graphème sera familier, mais le geste articulatoire diffère.","pattern":"gn","position":"End","description":"En fin de mot anglais, la suite de lettres « gn » se réduit à un simple /n/ : placez la langue contre les alvéoles (comme pour un “n” français) et laissez l’air sortir par le nez. Ne faites aucun son pour le « g ». Contrairement au français, il n’y a pas de /ɲ/ (“gn” doux) ; on n’entend que le “n”.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"design","native":"design","position":"End","cultural_context":"Mot d’emprunt très utilisé en français pour parler de conception graphique ou industrielle"},{"target":"campaign","native":"campagne électorale","position":"End","cultural_context":"Terme politique fréquent dans les médias internationaux et les séries américaines"},{"target":"champagne","native":"champagne","position":"End","cultural_context":"Vin pétillant français mondialement connu, servi dans les fêtes et mentionné dans la culture pop"}]}]
["gh",{"thoughts":"Pour un francophone, la terminaison « gh » est source de confusion : tantôt muette (high), tantôt prononcée /f/ (enough, laugh). Il n’y a pas de règle unique, il faut mémoriser mot par mot.","pattern":"gh","position":"End","description":"À la fin d’un mot, le digramme « gh » n’a généralement plus la valeur /g/ ; il est soit muet (ex. high /haɪ/), soit prononcé /f/ (ex. enough /ɪˈnʌf/, laugh /læf/). Il modifie souvent la voyelle qui le précède (diphthongue ‘igh’ → /aɪ/). Il faut donc apprendre la prononciation au cas par cas.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"high","native":"haut","position":"End","cultural_context":"Souvent entendu dans « high school », « high-tech », ou dans des chansons anglophones."},{"target":"enough","native":"assez","position":"End","cultural_context":"Expression courante « That’s enough! » entendue dans les films et séries."},{"target":"laugh","native":"rire","position":"End","cultural_context":"Mot fréquent sur Internet (LOL : Laugh Out Loud) et dans les dialogues basiques."}]}]
["ck",{"thoughts":"Le digramme « ck » n’ajoute pas un nouveau son ; il sert surtout, en anglais écrit, à signaler un /k/ bref juste après une voyelle courte. Les francophones connaissent déjà le /k/, donc la nouveauté est surtout orthographique (deux lettres pour un seul son).","pattern":"ck","position":"End","description":"« ck » se prononce comme un /k/ sec et non aspiré : bloquez rapidement l’air à l’arrière de la bouche (voile du palais remonté), puis relâchez-le sans vocaliser. Le son est identique au « k » français de « kiwi », mais il vient souvent en fin de mot anglais après une voyelle courte.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"snack","native":"snack / en-cas","position":"End","cultural_context":"Mot d’emprunt courant en français pour désigner une petite restauration rapide"},{"target":"rock","native":"rock","position":"End","cultural_context":"Genre musical mondialement connu, souvent cité en français (musique rock)"},{"target":"Black","native":"black","position":"End","cultural_context":"Employé en français dans des expressions populaires comme « Black Friday » ou « Black Lives Matter »"}]}]
