["Dieu merci",{"thoughts":"'Dieu merci' is an expression of relief or gratitude common in French, similar to the English expression 'thank God'.","target_language_multi_word_term":"Dieu merci","meaning":"'thank God'.","additional_notes":"Used to express relief, gratitude, or fortune. It can be employed in both religious and non-religious contexts.","target_language_example":"Dieu merci, nous sommes arrivés à l'heure.","native_language_example":"Thank God, we arrived on time."}]
["Dieu sait",{"thoughts":"\"Dieu sait\" means \"God knows\" in English, and is used to express uncertainty or the unknowable nature of something, attributing it to a higher power's knowledge.","target_language_multi_word_term":"Dieu sait","meaning":"\"God knows\".","additional_notes":"Used to indicate that something is beyond human knowledge, often with a sense of exasperation or resignation. It's similar to saying 'Only God knows' to express that something is unknown or mysterious.","target_language_example":"Dieu sait quand il reviendra.","native_language_example":"God knows when he'll come back."}]
["Votre Altesse",{"thoughts":"'Votre Altesse' is an honorific title used in French to address or refer to someone of royal status, such as a prince or princess. Beginners may encounter this term when learning about French culture, history, or in stories involving royalty.","target_language_multi_word_term":"Votre Altesse","meaning":"'Your Highness'.","additional_notes":"Used to address or refer to a person of royal or noble status. It's a formal term showing respect and acknowledgment of the person's rank.","target_language_example":"Bienvenue, Votre Altesse, dans notre humble demeure.","native_language_example":"Welcome, Your Highness, to our humble abode."}]
["Votre Majesté",{"thoughts":"'Votre Majesté' is a formal phrase used to address royalty, equivalent to 'Your Majesty' in English. It's important for learners to know this when learning about formal and respectful address in French.","target_language_multi_word_term":"Votre Majesté","meaning":"'Your Majesty'.","additional_notes":"Typically used when addressing a king or queen, showing respect and formality.","target_language_example":"Bienvenue en France, Votre Majesté.","native_language_example":"Welcome to France, Your Majesty."}]
["aimer bien",{"thoughts":"The phrase 'aimer bien' is used to express a liking for something or someone, but indicates less intensity than 'aimer'. It's closer to saying you like something, rather than love it.","target_language_multi_word_term":"aimer bien","meaning":"'to like'.","additional_notes":"This phrase is often used to express a moderate level of liking someone or something, similar to the way 'like' is used in English. It is less strong than 'aimer' on its own, which can imply 'love'.","target_language_example":"J'aime bien ce film.","native_language_example":"I like this movie."}]
["aller au lit",{"thoughts":"'Aller au lit' is a phrase used to describe the action of going to bed or preparing to sleep. It is commonly used in everyday conversations about routine, rest, or ending the day.","target_language_multi_word_term":"aller au lit","meaning":"'to go to bed'.","additional_notes":"This phrase is used when indicating that someone is going to sleep or retire for the night. It can be used in various contexts, such as talking about bedtime routines or simply expressing the intention to sleep.","target_language_example":"Je vais aller au lit tôt ce soir.","native_language_example":"I am going to bed early tonight."}]
["aller chercher",{"thoughts":"'Aller chercher' is a French expression used to describe the action of going somewhere to pick up or fetch something or someone. This phrase is practical in everyday situations when you need to retrieve an item or collect a person from a location.","target_language_multi_word_term":"aller chercher","meaning":"to go get; to fetch.","additional_notes":"Commonly used when going somewhere specifically to retrieve an item or person.","target_language_example":"Je dois aller chercher les enfants à l'école.","native_language_example":"I need to go get the kids from school."}]
["allez savoir",{"thoughts":"The phrase 'allez savoir' is an informal way in French to express curiosity or uncertainty about something. It's akin to saying 'who knows' or questioning an unknowable situation.","target_language_multi_word_term":"allez savoir","meaning":"'who knows'.","additional_notes":"It's used to express uncertainty or to indicate that something is puzzling or unknown. Commonly used in casual speech to convey that finding an answer is unlikely or difficult.","target_language_example":"Il n'est pas venu à la réunion, allez savoir pourquoi.","native_language_example":"He didn't come to the meeting, who knows why."}]
["allez-y",{"thoughts":"The phrase 'allez-y' is often used to tell someone to go ahead or to encourage them to proceed. It's a polite way to give permission or to prompt action, which can be particularly important to beginners for understanding formal or situational contexts.","target_language_multi_word_term":"allez-y","meaning":"'go ahead' or 'go on'.","additional_notes":"Used as an encouragement or permission for someone to proceed with an action. It's formal and polite, and can be used in various contexts, such as starting a meeting, presentation, or any activity when coordinating with people.","target_language_example":"Allez-y, commencez quand vous êtes prêts.","native_language_example":"Go ahead, start when you are ready."}]
["allons-y",{"thoughts":"'Allons-y' is a French phrase used to express readiness or encouragement to proceed with something and is equivalent to 'Let's go' in English.","target_language_multi_word_term":"allons-y","meaning":"'Let's go.'","additional_notes":"It is often used to encourage a group to begin or continue an action, like starting a journey or an activity. The phrase can be used in casual contexts and is similar to English expressions like \"Here we go\" or \"Off we go.\"","target_language_example":"Allons-y, nous allons être en retard pour le train.","native_language_example":"Let's go, we'll be late for the train."}]
["alors que",{"thoughts":"'Alors que' is a French conjunction often used to express contrast or a simultaneous occurrence.","target_language_multi_word_term":"alors que","meaning":"'while' or 'whereas'.","additional_notes":"Used to highlight a contrast between two clauses or indicate two events happening at the same time.","target_language_example":"Il continue à travailler alors que ses amis sont en vacances.","native_language_example":"He continues to work while his friends are on vacation."}]
["après tout",{"thoughts":"\"Après tout\" is a common French expression used to refer to everything considered or after everything has been taken into account.","target_language_multi_word_term":"après tout","meaning":"'after all'.","additional_notes":"It is often used to express a conclusion or justification after consideration.","target_language_example":"Il a pris la bonne décision, après tout.","native_language_example":"He made the right decision, after all."}]
["après-midi",{"thoughts":"'Après-midi' refers to the time of day from noon until evening.","target_language_multi_word_term":"après-midi","meaning":"'afternoon'.","additional_notes":"Used to refer to the period after 12 PM and before evening. Often used in greetings or to specify time slots.","target_language_example":"Je viendrai te voir cet après-midi.","native_language_example":"I will come to see you this afternoon."}]
["arriver à",{"thoughts":"The phrase 'arriver à' in French is commonly used to indicate achieving a goal or succeeding in doing something. It can also mean arriving at a physical destination, but in terms of challenging actions or objectives, it provides a nuance of overcoming difficulty.","target_language_multi_word_term":"arriver à","meaning":"'manage to' or 'succeed in'.","additional_notes":"Used to describe the successful completion of an action, often implying that it was challenging or required effort.","target_language_example":"Elle a finalement réussi à arriver à résoudre le problème.","native_language_example":"She finally managed to solve the problem."}]
["attendu que",{"thoughts":"'Attendu que' is a phrase used to introduce reasons or premises, often seen in formal or legal contexts.","target_language_multi_word_term":"attendu que","meaning":"'considering that' or 'given that'.","additional_notes":"Commonly used to state a reason for a conclusion or decision. It is often seen in formal documents like laws, resolutions, or rulings.","target_language_example":"Attendu que les preuves démontrent sa culpabilité, il a été condamné.","native_language_example":"Given that the evidence shows his guilt, he was convicted."}]
["au chaud",{"thoughts":"\"Au chaud\" is a phrase used to express warmth or being in a warm place or condition.","target_language_multi_word_term":"au chaud","meaning":"'warm' or 'in the warm'.","additional_notes":"Used to describe something that is kept warm or someone who is in a warm place, often implying comfort and coziness.","target_language_example":"Elle reste au chaud sous sa couverture.","native_language_example":"She stays warm under her blanket."}]
["au contraire",{"thoughts":"The term 'au contraire' is used to express disagreement or contradiction, similar to saying 'on the contrary' in English. It's a phrase that might appear in conversations where someone is correcting or providing an alternative viewpoint. This term can be useful for learners to know conversationally and in arguments or debates.","target_language_multi_word_term":"au contraire","meaning":"'on the contrary'.","additional_notes":"Used to contradict a previous statement or assumption. Common in both formal and informal contexts.","target_language_example":"Je pensais que le film serait ennuyeux, mais au contraire, il était incroyable.","native_language_example":"I thought the movie would be boring, but on the contrary, it was incredible."}]
["au courant",{"thoughts":"\"Au courant\" is a French adjective phrase meaning to be knowledgeable or well-informed, often used to describe someone aware of current events or trends. This term might be useful for a beginner when trying to say that they are up-to-date with something in a conversation.","target_language_multi_word_term":"au courant","meaning":"\"in the know\" or \"up-to-date.\"","additional_notes":"Used to describe someone who is well-informed about current events, fashion, or any specific topic.","target_language_example":"Elle est toujours au courant des dernières nouvelles.","native_language_example":"She is always up-to-date with the latest news."}]
["au début",{"thoughts":"'Au début' is a common French phrase used to indicate the point at which something starts.","target_language_multi_word_term":"au début","meaning":"'at the beginning'.","additional_notes":"Useful for indicating starting points in time sequences, stories, or processes.","target_language_example":"Au début du film, on voit la ville de Paris.","native_language_example":"At the beginning of the movie, we see the city of Paris."}]
["au fait",{"thoughts":"'Au fait' is a common French expression used to introduce a new topic or remind someone of something. It's similar to saying 'by the way' in English and is often used in conversations to transition smoothly or add information.","target_language_multi_word_term":"au fait","meaning":"'by the way'.","additional_notes":"Used to smoothly transition or add information in a conversation. Can also indicate a minor change in topic or reminder.","target_language_example":"Au fait, as-tu vu le nouveau film de Spielberg ?","native_language_example":"By the way, have you seen the new Spielberg movie?"}]
["au lit",{"thoughts":"'Au lit' is a phrase in French that literally translates to 'in bed'. It is often used to indicate going to bed, staying in bed, or lying in bed. It's a practical phrase for daily activities related to rest and sleep.","target_language_multi_word_term":"au lit","meaning":"in bed","additional_notes":"Commonly used in contexts related to sleeping or resting. Can be part of expressions indicating going to sleep or staying in bed.","target_language_example":"Il est temps d'aller au lit.","native_language_example":"It's time to go to bed."}]
["au revoir",{"thoughts":"Au revoir is a French term used for saying goodbye. It is a formal way to indicate you are leaving and expect to see the person again in the future.","target_language_multi_word_term":"au revoir","meaning":"'goodbye'.","additional_notes":"Used for formal or semi-formal goodbyes, implying a future meeting.","target_language_example":"Au revoir, Marie !","native_language_example":"Goodbye, Marie!"}]
["au travail",{"thoughts":"'Au travail' is a French phrase literally meaning 'to work' or 'at work'. It can be a colloquial encouragement similar to 'Let's get to work!' or simply refer to one's presence at a workplace.","target_language_multi_word_term":"au travail","meaning":"'at work' or 'to work'.","additional_notes":"Used when referring to someone being at their workplace, or as an expression to encourage starting work.","target_language_example":"Elle est déjà au travail.","native_language_example":"She is already at work."}]
["autant que",{"thoughts":"\"Autant que\" is a French term that can be used to express the idea of equality or similarity in quantity or degree. It's often used in comparisons.","target_language_multi_word_term":"autant que","meaning":"'as much as' or 'as many as'.","additional_notes":"Used in comparisons to indicate equality in terms of quantity or degree.","target_language_example":"Il mange autant que son frère.","native_language_example":"He eats as much as his brother."}]
["autre chose",{"thoughts":"The phrase 'autre chose' literally translates to 'other thing' or 'something else' and it's commonly used to refer to additional items or the fact that there is an alternative or something different. It's a useful term for shopping, eating out, or anytime you might be asked if you need anything else.","target_language_multi_word_term":"autre chose","meaning":"'something else' or 'another thing'.","additional_notes":"Used to refer to something additional or different when you are asked if you want or need anything more.","target_language_example":"Voulez-vous autre chose?","native_language_example":"Do you want something else?"}]
["autre à",{"thoughts":"The term 'autre à' is not a standard or common phrase in French. It may appear in certain contexts where 'autre' (meaning 'other') is followed by 'à' (which is a preposition often used for 'to' or 'at'). The understanding of 'autre à' would depend heavily on the context of the sentence or expression.","target_language_multi_word_term":"autre à","meaning":"'other to' or 'different at'.","additional_notes":"'Autre' means 'other' and is often used to indicate something different or another. When followed by 'à', it introduces a prepositional phrase whose exact meaning depends on the context. It is not a fixed expression and may not make sense without additional words.","target_language_example":"Il y a un autre à l'entrée.","native_language_example":"There is another at the entrance."}]
["avant tout",{"thoughts":"'Avant tout' is a French expression that prioritizes something above all else. It's useful for learners to understand expressions of importance and priority.","target_language_multi_word_term":"avant tout","meaning":"'above all' or 'first of all'.","additional_notes":"It is used to emphasize something as the most important point or aspect. Common in both formal and informal contexts.","target_language_example":"Avant tout, assurez-vous d'apporter votre passeport.","native_language_example":"Above all, make sure to bring your passport."}]
["avec plaisir",{"thoughts":"\"Avec plaisir\" is a polite way in French to accept a request or show willingness to do something. It's similar to saying \"You're welcome\" or \"Gladly\" in English.","target_language_multi_word_term":"avec plaisir","meaning":"'with pleasure'.","additional_notes":"This phrase is used to express willingness or enthusiastic consent to do something. It can be used in response to a request or expression of thanks.","target_language_example":"Tu peux m'aider avec ce projet ? Bien sûr, avec plaisir.","native_language_example":"Can you help me with this project? Of course, with pleasure."}]
["avoir besoin de",{"thoughts":"'Avoir besoin de' is a phrase used to express a need or requirement in French. It is quite common and useful and functions similarly to 'need' in English. Beginner learners will benefit from understanding its structure as it involves the verb 'avoir' and the preposition 'de'.","target_language_multi_word_term":"avoir besoin de","meaning":"'to need'.","additional_notes":"Used to express a necessity for something. Followed by a noun or infinitive verb to specify what is needed. Remember, the 'de' is required, and if followed by a definite article, the usual contraction (du, des) occurs.","target_language_example":"J'ai besoin de pain.","native_language_example":"I need bread."}]
["avoir bon",{"thoughts":"'Avoir bon' is a French expression that means to have a good feeling, to be right, or to have good luck. It is less about possession and more about state of being or perception, which can be tricky for beginners to grasp.","target_language_multi_word_term":"avoir bon","meaning":"'to be lucky' or 'to be right'.","additional_notes":"This expression is often used to describe a feeling or perception of being fortunate or correct in a situation. It is a colloquial way to express satisfaction or positive outcome.","target_language_example":"Il a eu bon en pariant sur ce cheval.","native_language_example":"He was lucky to bet on that horse."}]
["avoir confiance",{"thoughts":"The phrase 'avoir confiance' is a French expression meaning 'to trust' or 'to have confidence.' It is often used in both personal and professional contexts to indicate trust in people, processes, or outcomes. This phrase is very useful for learners to understand expressions of trust and confidence in French-speaking environments.","target_language_multi_word_term":"avoir confiance","meaning":"'to trust' or 'to have confidence'.","additional_notes":"This phrase is often used to express trust in someone or something, such as having confidence in one's abilities or trusting another person. It is commonly followed by 'en' when referencing trust in someone or something.","target_language_example":"J'ai confiance en toi pour terminer ce projet.","native_language_example":"I trust you to finish this project."}]
["avoir de la chance",{"thoughts":"'Avoir de la chance' is a common French expression meaning 'to be lucky'. It is useful for beginner learners as it uses the basic verb 'avoir'.","target_language_multi_word_term":"avoir de la chance","meaning":"'to be lucky'.","additional_notes":"This phrase is used to describe situations where someone experiences good fortune. It can be used in various contexts, from everyday luck to specific fortunate events.","target_language_example":"Il a de la chance de trouver un emploi si vite.","native_language_example":"He is lucky to find a job so quickly."}]
["avoir droit",{"thoughts":"Avoir droit is a French expression used to indicate having the right or entitlement to something. It is often followed by 'à' to specify what one has the right to.","target_language_multi_word_term":"avoir droit","meaning":"'to have the right' or 'to be entitled'.","additional_notes":"Used when referring to a legal or moral entitlement, often followed by 'à' and a noun to specify the entitlement.","target_language_example":"Tu as droit à une pause.","native_language_example":"You are entitled to a break."}]
["avoir en tête",{"thoughts":"\"Avoir en tête\" is an idiomatic French expression that translates to thinking about or having something in mind. It is often used to indicate what someone is considering or intending.","target_language_multi_word_term":"avoir en tête","meaning":"to have in mind","additional_notes":"Used when someone is thinking about or considering something. It can imply intention or preoccupation with an idea.","target_language_example":"J'ai en tête de partir en vacances bientôt.","native_language_example":"I have in mind to go on vacation soon."}]
["avoir envie",{"thoughts":"The phrase 'avoir envie' is used to express a desire or longing for something. Beginner learners might encounter it often when learning expressions related to wants, needs, or preferences.","target_language_multi_word_term":"avoir envie","meaning":"to feel like or to want.","additional_notes":"Often used to express a desire or inclination towards something or an activity. It is followed by 'de' plus a noun or infinitive verb.","target_language_example":"J'ai envie de manger une glace.","native_language_example":"I feel like eating an ice cream."}]
["avoir faim",{"thoughts":"The phrase 'avoir faim' is a basic expression in French that beginner learners should know. It's used to express hunger, which is a common feeling that people frequently talk about in everyday conversation. Understanding how to express needs such as hunger is important for communication in any language.","target_language_multi_word_term":"avoir faim","meaning":"'to be hungry'.","additional_notes":"Literally translates to 'to have hunger.' Used to express that someone feels hungry. Note that in French, you say 'to have hunger' instead of 'to be hungry' as in English.","target_language_example":"J'ai faim, allons manger.","native_language_example":"I'm hungry, let's eat."}]
["avoir intérêt",{"thoughts":"The expression 'avoir intérêt' means 'to have a stake or reason' and is used to indicate when someone should have an interest or concern in doing something because it's beneficial for them. It often implies urgency or necessity for an action due to personal benefit or reason.","target_language_multi_word_term":"avoir intérêt","meaning":"'to have a reason to' or 'should'.","additional_notes":"This phrase is used to emphasize a strong recommendation or necessity for someone to take action because it benefits them or affects them in some way.","target_language_example":"Tu as intérêt à finir tes devoirs avant de sortir.","native_language_example":"You should finish your homework before going out."}]
["avoir l'air",{"thoughts":"The French phrase 'avoir l'air' is commonly used to describe someone's appearance or how something seems.","target_language_multi_word_term":"avoir l'air","meaning":"'to look' or 'to seem'.","additional_notes":"Often used to express impressions or perceptions about someone's appearance, mood, or manner. The phrase can be followed by an adjective, adverb, infinitive, or even a noun (with 'de').","target_language_example":"Elle a l'air fatiguée.","native_language_example":"She looks tired."}]
["avoir raison",{"thoughts":"The phrase 'avoir raison' is a fixed expression in French that translates directly to 'to have reason,' but it means to be correct or right about something. It's commonly used in everyday conversation when affirming someone's correctness.","target_language_multi_word_term":"avoir raison","meaning":"to be right.","additional_notes":"Used to indicate that someone is correct in their opinion or statement. It's the opposite of 'avoir tort,' which means 'to be wrong.'","target_language_example":"Tu as raison sur cette question.","native_language_example":"You are right about this issue."}]
["avoir soif",{"thoughts":"'Avoir soif' is a basic French phrase meaning 'to be thirsty'. It follows the common French construction of using 'avoir' (to have) with a noun to describe a state or need, similar to 'avoir faim' meaning 'to be hungry'. This construction often initially puzzles English speakers, who use the verb 'to be' instead.","target_language_multi_word_term":"avoir soif","meaning":"to be thirsty.","additional_notes":"This phrase is used to express the feeling of thirst plainly. In French, physical states or feelings related to needs or conditions often use 'avoir'.","target_language_example":"Il a soif après sa course.","native_language_example":"He is thirsty after his run."}]
["avoir à",{"thoughts":"'Avoir à' is a common French expression used to indicate an obligation or necessity to do something, similar to 'have to' or 'must' in English. It's useful for beginners to understand basic obligation phrases.","target_language_multi_word_term":"avoir à","meaning":"'to have to' or 'must'.","additional_notes":"Used to express the necessity to perform a certain action or duty. Often paired with an infinitive verb to indicate the specific action that is obligatory.","target_language_example":"J'ai à finir mon travail.","native_language_example":"I have to finish my work."}]
["avoir à voir",{"thoughts":"'Avoir à voir' is a French phrase which is commonly used to indicate a connection or relation to something. It literally translates to 'to have to see' but figuratively means 'to have to do' or 'to relate to'.","target_language_multi_word_term":"avoir à voir","meaning":"to do with, to relate to.","additional_notes":"This phrase is often used to discuss whether something is related or connected to a matter or issue. It is a way of saying 'to be related to' or 'to have something to do with'. It's commonly used in both everyday conversation and formal situations.","target_language_example":"Cela n'a rien à voir avec moi.","native_language_example":"That has nothing to do with me."}]
["ayant droit",{"thoughts":"\"Ayant droit\" is a legal and administrative term in French commonly used in contexts involving rights to receive benefits, inheritances, or legal entitlements. It's crucial for beginners learning about legal rights and obligations.","target_language_multi_word_term":"ayant droit","meaning":"'person entitled to' or 'beneficiary'.","additional_notes":"Used in legal or administrative contexts to identify someone who has the right to receive certain benefits, such as social security, insurance payouts, or inheritance, due to their particular relationship or status.","target_language_example":"Dans le système de sécurité sociale, les ayants droit peuvent recevoir des prestations.","native_language_example":"In the social security system, beneficiaries can receive benefits."}]
["beau gosse",{"thoughts":"The term 'beau gosse' is an informal French expression often used to describe an attractive or handsome young man, commonly used among younger people and in casual settings. It combines the word 'beau' (beautiful, handsome) with 'gosse' (kid, youngster).","target_language_multi_word_term":"beau gosse","meaning":"'handsome guy' or 'good-looking young man'.","additional_notes":"Frequently used informally among friends to compliment a male's appearance. It can also imply someone is well-dressed and stylish.","target_language_example":"Il est vraiment un beau gosse.","native_language_example":"He is really a handsome guy."}]
["bien dit",{"thoughts":"'Bien dit' is a French phrase often used to acknowledge that something was well said. It's similar to complimenting someone on their choice of words or the way they expressed themselves.","target_language_multi_word_term":"bien dit","meaning":"'well said'.","additional_notes":"Used as a compliment regarding spoken words or phrasing. Often expresses approval or agreement with a statement.","target_language_example":"Tu as raison, c'était bien dit.","native_language_example":"You're right, that was well said."}]
["bien entendu",{"thoughts":"The phrase 'bien entendu' is used to indicate agreement or confirmation, often equivalent to saying 'of course' in English. It's commonly used in conversations to affirm what has already been understood or what is obvious.","target_language_multi_word_term":"bien entendu","meaning":"'of course' or 'naturally'.","additional_notes":"Used to agree with a statement or to clarify understanding, similar to 'obviously' or 'naturally' in certain contexts.","target_language_example":"Bien entendu, nous serons là à l'heure.","native_language_example":"Of course, we will be there on time."}]
["bien fait",{"thoughts":"'Bien fait' is a phrase that means 'well done,' often used to express approval or praise for something done well. However, context can change its meaning to imply 'serves you right' or 'you got what you deserved,' when used sarcastically or in a negative context.","target_language_multi_word_term":"bien fait","meaning":"'well done' or 'serves you right'.","additional_notes":"The phrase is commonly used to praise someone's accomplishment or task. It may also convey a sense of justice or irony depending on the context.","target_language_example":"Tu as gagné le match! Bien fait!","native_language_example":"You won the match! Well done!"}]
["bien joué",{"thoughts":"'Bien joué' is a French phrase used to compliment someone on their performance, whether in sports, work, or any kind of achievement. It's similar to saying 'well done' or 'good job' in English. This expression is useful for showing appreciation or approval and might be used in casual conversations or supportive contexts.","target_language_multi_word_term":"bien joué","meaning":"'well done' or 'good job'.","additional_notes":"Often used to commend someone for their performance or achievement. Can be used in various contexts where praise or recognition is deserved.","target_language_example":"Tu as gagné la partie? Bien joué!","native_language_example":"You won the game? Well done!"}]
["bien plus",{"thoughts":"'Bien plus' is a French phrase that is used to emphasize a significantly greater degree or amount of something.","target_language_multi_word_term":"bien plus","meaning":"even more","additional_notes":"This expression is often used when comparing quantities, intensities, or extents, indicating a significantly greater level or degree.","target_language_example":"Elle est bien plus grande que son frère.","native_language_example":"She is even taller than her brother."}]
["bien que",{"thoughts":"'Bien que' is a common conjunction in French, used to introduce a subordinate clause that expresses a contrasting idea. It often translates to 'although' or 'even though', indicating that the main statement holds true despite the concession made by the clause introduced by 'bien que'. This is relevant for beginner learners to express contrast or exception in complex sentences.","target_language_multi_word_term":"bien que","meaning":"'although' or 'even though'.","additional_notes":"Typically used at the beginning of a sentence or clause to introduce a contrast or contradiction to the main idea, often followed by the subjunctive mood.","target_language_example":"Bien que fatigué, il a continué à travailler.","native_language_example":"Although tired, he continued to work."}]
["bien sûr",{"thoughts":"'Bien sûr' is a commonly used French phrase to express agreement, consent, or to assure someone similar to saying 'of course' in English. It is useful in daily conversations.","target_language_multi_word_term":"bien sûr","meaning":"'of course'.","additional_notes":"Used to express agreement or to reassure someone confidently. It's informal but commonly used in polite conversations as well.","target_language_example":"Bien sûr, je vais t'aider avec tes devoirs.","native_language_example":"Of course, I will help you with your homework."}]
["bien vu",{"thoughts":"'Bien vu' is an expression used in French to commend someone for having observed something accurately or having a good idea. It's often used informally, similar to saying \"good call\" or \"well spotted\" in English.","target_language_multi_word_term":"bien vu","meaning":"\"well spotted\" or \"good call\".","additional_notes":"It's a colloquial expression that praises someone's insight or observation. Can be used in various contexts, from noticing something to having a clever idea.","target_language_example":"Bien vu, c'était la meilleure solution !","native_language_example":"Good call, that was the best solution!"}]
["bien à vous",{"thoughts":"Bien à vous is a formal closing phrase often used in letters or emails when addressing someone respectfully.","target_language_multi_word_term":"bien à vous","meaning":"'yours sincerely' or 'yours truly'.","additional_notes":"Used in formal written communication, such as emails or letters, similar to 'yours sincerely' in English. It conveys respect and cordiality.","target_language_example":"Je vous remercie pour votre aide précieuse et reste à votre disposition pour toute question. Bien à vous, Marie.","native_language_example":"Thank you for your valuable help and I remain at your disposal for any questions. Yours sincerely, Marie."}]
["bon anniversaire",{"thoughts":"'Bon anniversaire' is a common French phrase used for birthdays, similar to saying 'Happy Birthday' in English.","target_language_multi_word_term":"bon anniversaire","meaning":"'Happy Birthday'.","additional_notes":"Used to wish someone well on their birthday, often accompanied by celebration or gift-giving.","target_language_example":"Je te souhaite un bon anniversaire !","native_language_example":"I wish you a happy birthday!"}]
["bon vieux temps",{"thoughts":"\"Bon vieux temps\" is a nostalgic expression often used to reminisce about the past.","target_language_multi_word_term":"bon vieux temps","meaning":"'good old days'.","additional_notes":"It is used to evoke nostalgia and fond memories of a time in the past perceived as better. Commonly used in casual and conversational contexts.","target_language_example":"On se souvient bien du bon vieux temps quand on jouait dans la rue.","native_language_example":"We fondly remember the good old days when we played in the street."}]
["bon voyage",{"thoughts":"'Bon voyage' is a common French farewell phrase used to wish someone a good journey or trip. It is often said to someone who is embarking on travel, whether for business, leisure, or any other purpose.","target_language_multi_word_term":"bon voyage","meaning":"'have a good trip'.","additional_notes":"Commonly used as a parting phrase when someone is about to travel, to express good wishes for a safe and pleasant journey.","target_language_example":"Ils partent pour Paris demain. Bon voyage !","native_language_example":"They're leaving for Paris tomorrow. Have a good trip!"}]
["bonne chance",{"thoughts":"'Bonne chance' is a phrase used to wish someone good luck. It's commonly used in various situations, such as exams, competitions, or any event where the person might need fortune on their side.","target_language_multi_word_term":"bonne chance","meaning":"'good luck'.","additional_notes":"Commonly used to wish someone success or good fortune in an endeavor.","target_language_example":"Elle a un examen demain. Bonne chance !","native_language_example":"She has an exam tomorrow. Good luck!"}]
["bonne journée",{"thoughts":"The French phrase 'bonne journée' is commonly used in daily conversation as a polite way to wish someone a good day. It is often used when parting ways in the morning or early afternoon.","target_language_multi_word_term":"bonne journée","meaning":"'have a good day'.","additional_notes":"Used as a polite farewell, typically said in the context of morning to early afternoon departures.","target_language_example":"Je dois y aller maintenant, bonne journée !","native_language_example":"I have to go now, have a good day!"}]
["bonne nouvelle",{"thoughts":"\"Bonne nouvelle\" is a French expression that translates to good news or good tidings. It's straightforward and is typically used in everyday conversation to convey excitement or happiness about recent positive developments. This is useful for beginner learners as it can be easily incorporated into basic dialogues discussing current events or personal experiences.","target_language_multi_word_term":"bonne nouvelle","meaning":"good news","additional_notes":"Used to express that something positive or fortunate has happened. It's a common phrase to react to favorable events or announcements.","target_language_example":"J'ai une bonne nouvelle, j'ai réussi mon examen !","native_language_example":"I have good news, I passed my exam!"}]
["bonne nuit",{"thoughts":"'Bonne nuit' is a commonly used expression in French as a way of wishing someone a good night before they go to sleep.","target_language_multi_word_term":"bonne nuit","meaning":"'good night'.","additional_notes":"Used when saying goodbye to someone in the evening or before bed.","target_language_example":"Bonne nuit, à demain !","native_language_example":"Good night, see you tomorrow!"}]
["bonne soirée",{"thoughts":"'Bonne soirée' is a common French phrase used to wish someone a nice evening. This expression is similar to saying 'Have a good evening' in English, and it's typically used in departing or saying goodbye during the evening hours.","target_language_multi_word_term":"bonne soirée","meaning":"'good evening'.","additional_notes":"Used when parting ways or ending a conversation in the evening, to wish someone a pleasant remainder of their evening.","target_language_example":"Merci pour ce dîner, bonne soirée !","native_language_example":"Thanks for the dinner, have a good evening!"}]
["c'est",{"thoughts":"\"C'est\" is the contraction of \"ce + est\" and is extremely common, used to say \"it is/this is\" before nouns, adjectives, dates, etc.","target_language_multi_word_term":"c'est","meaning":"'it is' or 'this is'.","additional_notes":"Used to introduce or identify something, express opinions, or give general statements. Equivalent to English \"it's\" / \"that's\".","target_language_example":"C'est un livre intéressant.","native_language_example":"It's an interesting book."}]
["c'est la meilleure",{"thoughts":"\"C'est la meilleure\" translates to \"it's the best\" in English. This phrase is commonly used to express that something is the best among others, showing high praise or appreciation. Understanding this expression is useful for learners to discuss preferences and make recommendations.","target_language_multi_word_term":"c'est la meilleure","meaning":"\"it's the best\"","additional_notes":"Used to express that something is of the highest quality or the best option available.","target_language_example":"Cette glace, c'est la meilleure que j'ai jamais goûtée.","native_language_example":"This ice cream is the best I've ever tasted."}]
["c'est moi",{"thoughts":"\"C'est moi\" literally means \"it is me\" in English. This phrase is used to indicate oneself, either while introducing oneself or when identifying oneself in different contexts.","target_language_multi_word_term":"c'est moi","meaning":"'it's me'.","additional_notes":"Commonly used to identify oneself. It can be used in casual conversations, answering a door, or identifying oneself in a group.","target_language_example":"Qui a mangé le dernier gâteau? C'est moi.","native_language_example":"Who ate the last cake? It's me."}]
["c'est tout",{"thoughts":"The term 'c'est tout' translates to 'that's all' or 'that's it' in English. It's often used to conclude a statement or indicate completeness.","target_language_multi_word_term":"c'est tout","meaning":"'that's all' or 'that's it'.","additional_notes":"Used to indicate completion or a final statement. Common in both formal and informal contexts to signify that there is nothing more to add.","target_language_example":"J'ai fini mes devoirs, c'est tout.","native_language_example":"I've finished my homework, that's all."}]
["c'est ça",{"thoughts":"The phrase 'c'est ça' is a versatile expression commonly used in French conversations. It serves as an affirmation, agreement, or confirmation, similar to the English 'that's it' or 'that's right'.","target_language_multi_word_term":"c'est ça","meaning":"'that's it' or 'that's right'.","additional_notes":"Often used to confirm or agree with what someone else has said. It can also express understanding or realization of a certain fact or situation.","target_language_example":"A: Il faut tourner à gauche ici ? B: Oui, c'est ça.","native_language_example":"A: We need to turn left here? B: Yes, that's right."}]
["ce dont",{"thoughts":"The phrase 'ce dont' is used with verbs or adjectives that are followed by 'de' and refers to something previously mentioned in the conversation or text.","target_language_multi_word_term":"ce dont","meaning":"'what about' or 'that which about'.","additional_notes":"'Ce dont' is used to connect clauses when the verb or adjective requires the preposition 'de'. It essentially functions like 'what... about' in English.","target_language_example":"Je ne sais pas ce dont tu parles.","native_language_example":"I don't know what you're talking about."}]
["ce faisant",{"thoughts":"'Ce faisant' is a formal expression used to indicate that while doing one thing, another thing happens simultaneously. It combines the idea of 'by doing so' or 'in doing so'.","target_language_multi_word_term":"ce faisant","meaning":"'in doing so' or 'by doing so'.","additional_notes":"It is often used in more formal or written contexts to describe that two actions are happening simultaneously or as a result of one another.","target_language_example":"Elle a corrigé l'erreur, ce faisant, elle a gagné la confiance de ses collègues.","native_language_example":"She corrected the error, and in doing so, she earned the trust of her colleagues."}]
["ce fut un plaisir",{"thoughts":"\"Ce fut un plaisir\" is a polite French phrase often used to express enjoyment or satisfaction, usually at the end of an interaction or event.","target_language_multi_word_term":"ce fut un plaisir","meaning":"'it was a pleasure'.","additional_notes":"Typically used in formal or semi-formal settings, often upon departure to convey politeness and appreciation for a pleasant experience.","target_language_example":"Ce fut un plaisir de vous rencontrer.","native_language_example":"It was a pleasure to meet you."}]
["ce que",{"thoughts":"\"Ce que\" is a very frequent connector in French, introducing either an object in indirect questions or a relative clause. Important for beginners to recognize pattern and word order differences from English.","target_language_multi_word_term":"ce que","meaning":"‘what’, ‘that which’.","additional_notes":"Used to refer back to an idea or thing already mentioned or implied, often introducing a clause that functions as the object of the sentence.","target_language_example":"Je ne comprends pas ce que tu dis.","native_language_example":"I don’t understand what you’re saying."}]
["ce qui",{"thoughts":"'Ce qui' is a common French construction used to introduce relative clauses or indirect questions, similar to 'ce que'. It is often used when the preceding clause's subject is being referred to.","target_language_multi_word_term":"ce qui","meaning":"'what' or 'that which'.","additional_notes":"Used to refer back to something previously mentioned, specifically focusing on the subject of the preceding clause.","target_language_example":"Je ne comprends pas ce qui se passe.","native_language_example":"I don't understand what is happening."}]
["celui-ci",{"thoughts":"'Celui-ci' is a demonstrative pronoun used in French to indicate a specific object or person that is nearby or previously mentioned. It's equivalent to saying 'this one' in English and must agree in gender and number with the noun it replaces.","target_language_multi_word_term":"celui-ci","meaning":"'this one'.","additional_notes":"Used to specify a particular object or person. It replaces a masculine singular noun and indicates proximity to the speaker.","target_language_example":"Je préfère celui-ci.","native_language_example":"I prefer this one."}]
["celui-là",{"thoughts":"'Celui-là' is a demonstrative pronoun in French that means 'that one.' It's used to refer to a specific thing or person that is distant in space or time. Beginners should know how to use demonstrative pronouns to help identify and specify objects in conversation.","target_language_multi_word_term":"celui-là","meaning":"'that one'.","additional_notes":"Used to point to a specific item or person that is not close by. It is often used to emphasize distance or a particular choice out of multiple options.","target_language_example":"Je préfère celui-là.","native_language_example":"I prefer that one."}]
["chose faite",{"thoughts":"'Chose faite' literally translates to 'thing done' and is used to indicate that something has been completed or is finished. For beginner learners, it's important to understand the context in which they can use this phrase to signify completion or finality of an action.","target_language_multi_word_term":"chose faite","meaning":"'thing done' or 'completed'.","additional_notes":"Used to express that something has been accomplished or resolved. It conveys finality or conclusion of an event or task.","target_language_example":"C'est une chose faite!","native_language_example":"It's a done deal!"}]
["combien ça coûte",{"thoughts":"\"Combien ça coûte \" is a common phrase used in French to ask about the price or cost of an item or service. This is a key question for beginners to know when shopping or dealing with money transactions in French-speaking countries.","target_language_multi_word_term":"combien ça coûte","meaning":"'How much does it cost?'","additional_notes":"Used to inquire about the price of goods or services. Essential for shopping, traveling, or bargaining.","target_language_example":"Combien ça coûte cette robe ?","native_language_example":"How much does this dress cost?"}]
["comme si",{"thoughts":"The phrase 'comme si' is used to express a hypothetical scenario or an analogy, often translated as 'as if' or 'like'. It can introduce a comparison that might not be real but is imagined. Beginner learners should understand its use in creating hypothetical comparisons.","target_language_multi_word_term":"comme si","meaning":"'as if' or 'like'.","additional_notes":"Used to describe hypothetical or imagined scenarios, often followed by a verb clause. It implies that something isn't actually true.","target_language_example":"Il agissait comme si de rien n'était.","native_language_example":"He acted as if nothing happened."}]
["comme ça",{"thoughts":"'Comme ça' is a versatile French phrase often used to mean 'like this' or 'this way'. It can be used in various contexts to refer to a manner, style, or simply to indicate a method of doing something.","target_language_multi_word_term":"comme ça","meaning":"'like this' or 'this way'.","additional_notes":"Commonly used to indicate how something is done or to demonstrate a method or style. It's versatile and can also be used in expressions of indifference or to emphasize a repetition in actions.","target_language_example":"Tu fais ça comme ça.","native_language_example":"You do it like this."}]
["comment cela",{"thoughts":"\"Comment cela\" is a French phrase used to ask 'how come' or 'why', often used to seek clarification or an explanation.","target_language_multi_word_term":"comment cela","meaning":"'how come' or 'why'.","additional_notes":"Typically used in conversations to ask for clarification or reasons. It is a way to inquire about the cause or rationale behind something.","target_language_example":"Comment cela fonctionne-t-il ?","native_language_example":"How does that work?"}]
["comment ça",{"thoughts":"'Comment ça' is a common phrase in French used to start a question, often informal and equivalent to 'how's that' in English.","target_language_multi_word_term":"comment ça","meaning":"'how's that'.","additional_notes":"Often used at the beginning of a sentence to ask for clarification or to question something that was just mentioned. It can also be used informally to ask how something works or functions.","target_language_example":"Comment ça fonctionne?","native_language_example":"How does that work?"}]
["compter faire",{"thoughts":"'Compter faire' is a French phrase that indicates an intention or plan, similar to 'intend to do' in English. It's useful for stating future plans or expectations. Beginner learners should understand that it's often followed by a verb, indicating an action they plan to take.","target_language_multi_word_term":"compter faire","meaning":"'intend to do'.","additional_notes":"Used to express a plan or intention to take an action. Often followed by another verb.","target_language_example":"Je compte faire mes devoirs ce soir.","native_language_example":"I intend to do my homework tonight."}]
["compter sur",{"thoughts":"'Compter sur' is a phrasal verb in French that is used to express reliance or dependency on someone or something. It's commonly used in everyday conversation when mentioning trust or assurance that someone will do something.","target_language_multi_word_term":"compter sur","meaning":"to rely on or count on.","additional_notes":"This phrase is often used in contexts where one wants to express trust, dependency, or expectation that something will be done by someone else.","target_language_example":"Je peux compter sur toi pour m'aider?","native_language_example":"Can I rely on you to help me?"}]
["contrairement à",{"thoughts":"'Contrairement à' is a useful phrase for contrasting or making comparisons, indicating the opposite or difference between what follows and what has been mentioned before.","target_language_multi_word_term":"contrairement à","meaning":"unlike or in contrast to.","additional_notes":"Used to express a difference or opposition between two things or people. It sets up a comparison where the next statements or descriptions oppose or differ from what has been previously mentioned.","target_language_example":"Contrairement à Pierre, Marie aime le chocolat.","native_language_example":"Unlike Pierre, Marie loves chocolate."}]
["coup de feu",{"thoughts":"'Coup de feu' can literally mean 'gunshot,' but it has extended meanings in different contexts, such as referring to a flurry of activity or a crucial moment, especially in cooking.","target_language_multi_word_term":"coup de feu","meaning":"'gunshot' or 'rush of activity'.","additional_notes":"In cooking, 'coup de feu' is the busy rush period when orders come in quickly and must be prepared simultaneously. In general contexts, it can mean a sudden, intense effort.","target_language_example":"Pendant le coup de feu, le chef doit rester concentré.","native_language_example":"During the rush, the chef must stay focused."}]
["coup de fil",{"thoughts":"The term 'coup de fil' is an informal French expression meaning a phone call. It's composed of 'coup,' which can mean a hit or a blow, and 'fil,' which refers to a line, reflecting older landline telephones when calls were conversations over wires.","target_language_multi_word_term":"coup de fil","meaning":"a phone call.","additional_notes":"It's an informal way to refer to making or receiving a phone call. Similar to saying 'give me a ring' in English.","target_language_example":"Je te passerai un coup de fil demain.","native_language_example":"I'll give you a call tomorrow."}]
["coup de main",{"thoughts":"The phrase 'coup de main' in French literally translates to 'a blow of the hand,' but it is used to mean 'a helping hand' or 'assistance.' It is often utilized in conversational French to ask for or offer help. Understanding this phrase can improve a beginner's ability to engage in everyday interactions where help might be requested or offered.","target_language_multi_word_term":"coup de main","meaning":"a helping hand; assistance.","additional_notes":"Commonly used to request assistance or to offer to help someone.","target_language_example":"Peux-tu me donner un coup de main avec ce projet?","native_language_example":"Can you give me a helping hand with this project?"}]
["d'un coup",{"thoughts":"The phrase 'd'un coup' is often used in French to express the suddenness or swiftness of an action.","target_language_multi_word_term":"d'un coup","meaning":"'all of a sudden' or 'suddenly'.","additional_notes":"This term is used to describe something happening quickly or unexpectedly in a single instance.","target_language_example":"Il s'est levé d'un coup et est parti.","native_language_example":"He suddenly got up and left."}]
["d'une minute à l'autre",{"thoughts":"'D'une minute à l'autre' implies an immediate or sudden change, similar to saying 'at any moment.' It indicates something that can happen very soon or with little notice.","target_language_multi_word_term":"d'une minute à l'autre","meaning":"'at any moment' or 'from one minute to the next'.","additional_notes":"Used when expecting something to happen suddenly or very soon, expressing a sense of immediacy or unpredictability.","target_language_example":"Il peut arriver d'une minute à l'autre.","native_language_example":"He can arrive at any moment."}]
["de deux",{"thoughts":"The term 'de deux' in French means 'two of' or 'of two', and is used to specify an amount or a pair of items. It's generally part of a longer phrase.","target_language_multi_word_term":"de deux","meaning":"'of two' or 'two of'.","additional_notes":"Typically used to express a quantity or pair, often found in phrases indicating something involving two components or options.","target_language_example":"Un choix de deux options est disponible.","native_language_example":"A choice of two options is available."}]
["de jour",{"thoughts":"'De jour' is a French phrase commonly used in expressions like 'soup of the day' or 'dish of the day'. It implies that something is currently in season, in fashion, or the special offering for the day.","target_language_multi_word_term":"de jour","meaning":"'of the day'.","additional_notes":"Often used in culinary contexts to refer to a special menu item available for a limited time, like 'soup of the day'. It suggests a daily rotation or special.","target_language_example":"La soupe de jour est à la tomate.","native_language_example":"The soup of the day is tomato."}]
["de nouveau",{"thoughts":"'De nouveau' is a French phrase that means 'again' or 'once more'. It is interchangeable with the word 'encore' but usually applied in more formal contexts or when talking about something that happens again after a change. It is useful for beginner learners to differentiate between 'de nouveau' and 'encore' to understand different nuances in French expressions.","target_language_multi_word_term":"de nouveau","meaning":"'again' or 'once more'.","additional_notes":"'De nouveau' is often used to indicate repetition after some interruption or change, emphasizing the concept of 'anew'.","target_language_example":"Il a essayé de nouveau après s'être reposé.","native_language_example":"He tried again after resting."}]
["de nuit",{"thoughts":"The phrase \"de nuit\" means \"at night\" and is often used to indicate something that occurs during nighttime. This is a very basic and useful phrase for beginners, as it helps them understand time contexts.","target_language_multi_word_term":"de nuit","meaning":"'at night'.","additional_notes":"This phrase is used to specify actions, events, or states that take place during the nighttime.","target_language_example":"Il travaille de nuit comme vigile.","native_language_example":"He works at night as a security guard."}]
["de plus",{"thoughts":"'De plus' is often used in written and spoken French to add information or argument. It's equivalent to 'besides' or 'in addition' in English, making it useful for linking ideas and adding supplementary information. It's a good term for beginners to use when they want to sound more fluent by linking sentences or points with this smooth connector.","target_language_multi_word_term":"de plus","meaning":"'besides' or 'in addition'.","additional_notes":"Commonly used to add additional information to a statement or argument.","target_language_example":"Elle est intelligente et, de plus, elle est très drôle.","native_language_example":"She is intelligent and, in addition, she is very funny."}]
["de quoi",{"thoughts":"'De quoi' is a common phrase in French typically used in questions to mean 'about what' or 'of what'. It is often preceded by a preposition or used in expressions where it suggests the concern or subject of a discussion or interest.","target_language_multi_word_term":"de quoi","meaning":"'about what' or 'of what'.","additional_notes":"Commonly used in questions when asking for clarification or information about a specific topic or subject. Can also appear in idiomatic expressions.","target_language_example":"De quoi parles-tu?","native_language_example":"What are you talking about?"}]
["de retour",{"thoughts":"The term 'de retour' is often used to indicate someone or something coming back to a place. It is similar to the English phrase 'back' when describing a return to a previous state or location.","target_language_multi_word_term":"de retour","meaning":"'back', as in returned.","additional_notes":"Used to indicate returning to a previous position or place after a period of absence.","target_language_example":"Je suis de retour chez moi.","native_language_example":"I am back home."}]
["de rien",{"thoughts":"The phrase 'de rien' is commonly used in French after someone has expressed gratitude, similar to how 'you're welcome' is used in English. It implies that the favor or help was not a big deal and there is no need for thanks.","target_language_multi_word_term":"de rien","meaning":"'you're welcome' or 'it's nothing'.","additional_notes":"Used in response to 'thank you' or 'merci'. It signifies that the help or favor was gladly given.","target_language_example":"Merci pour votre aide! - De rien!","native_language_example":"Thank you for your help! - You're welcome!"}]
["de suite",{"thoughts":"The French phrase 'de suite' means 'right away' or 'immediately'. It's useful for beginners to learn this as it's commonly used in everyday conversation when expressing urgency or immediate actions.","target_language_multi_word_term":"de suite","meaning":"'right away', 'immediately'.","additional_notes":"Commonly used to indicate that something should be done without delay. Often used in spoken language.","target_language_example":"Je vais le faire de suite.","native_language_example":"I will do it right away."}]
["de un",{"thoughts":"The term 'de un' can sometimes be confusing for beginner learners as it can resemble 'de' and 'un,' two separate words that get used frequently in French. The construction 'de un' is not a standard or common phrase in French; rather, it is more often a typo or a result of specific constructions where 'de' is followed by the number 'un.'","target_language_multi_word_term":"de un","meaning":"rarely used; often a spacing error.","additional_notes":"'De un' is not commonly a set phrase in French. It's more likely to appear as a typing or spacing mistake between 'de' and 'un' or in specific contexts like measurements or informal speech where precision isn't needed.","target_language_example":"C'est une erreur de un centimètre.","native_language_example":"It is an error of one centimeter."}]
["de ça",{"thoughts":"'De ça' is a French phrase that commonly means 'of that' or 'from that'. It's often used to refer to something already mentioned in conversation.","target_language_multi_word_term":"de ça","meaning":"'of that' or 'from that'.","additional_notes":"Used to refer to or emphasize something previously mentioned or in the general context. Common in informal conversation.","target_language_example":"Je ne veux pas parler de ça.","native_language_example":"I don't want to talk about that."}]
["des familles",{"thoughts":"'Des familles' is a French plural noun phrase meaning 'families'. It is commonly used to refer to more than one family and can be found in various contexts relating to households or family groups.","target_language_multi_word_term":"des familles","meaning":"families, multiple families.","additional_notes":"It is used when talking about several families together or in general terms about different family units.","target_language_example":"Des familles sont venues au parc pour le pique-nique.","native_language_example":"Families came to the park for the picnic."}]
["des fois",{"thoughts":"'Des fois' is a French expression used to describe frequency or uncertainty, similar to 'sometimes' in English. It is useful for beginners when talking about habits or events that don't happen regularly.","target_language_multi_word_term":"des fois","meaning":"sometimes or occasionally.","additional_notes":"Commonly used in casual conversation to indicate that something happens but not regularly or consistently.","target_language_example":"Je vais des fois au parc le dimanche.","native_language_example":"I sometimes go to the park on Sundays."}]
["devine quoi",{"thoughts":"'Devine quoi' is a casual French expression used to draw someone's attention or to create suspense before sharing news or information.","target_language_multi_word_term":"devine quoi","meaning":"'guess what'.","additional_notes":"Used to introduce surprising or exciting news.","target_language_example":"Devine quoi ! J'ai eu une promotion.","native_language_example":"Guess what! I got a promotion."}]
["dire au revoir",{"thoughts":"The phrase 'dire au revoir' is a common way to say goodbye in French. It's simple and frequently used, making it relevant for a beginner learner.","target_language_multi_word_term":"dire au revoir","meaning":"to say goodbye.","additional_notes":"Used when parting with someone. 'Au revoir' is the French equivalent of 'goodbye'.","target_language_example":"Elle m'a dit au revoir à la gare.","native_language_example":"She said goodbye to me at the station."}]
["dire que",{"thoughts":"\"Dire que\" is a common phrase in French used to introduce reported speech or to emphasize disbelief or surprise about a situation. It is equivalent to 'to say that' or 'to think that' in English depending on context.","target_language_multi_word_term":"dire que","meaning":"'to say that' or 'to think that'.","additional_notes":"It is often used to introduce a statement or opinion. Can also express disbelief or irony.","target_language_example":"Il a dit que tu étais malade.","native_language_example":"He said that you were sick."}]
["dire quelque chose",{"thoughts":"The phrase 'dire quelque chose' is a common expression in French that means 'to say something'. It's a straightforward phrase that can be used in many contexts where one might want to indicate they are making a statement or verbally expressing an idea.","target_language_multi_word_term":"dire quelque chose","meaning":"'to say something'.","additional_notes":"Used when indicating the act of saying or expressing verbally any content. Often used in conversations to confirm if information or a statement needs to be communicated.","target_language_example":"Est-ce que tu veux dire quelque chose?","native_language_example":"Do you want to say something?"}]
["dire quoi",{"thoughts":"The French phrase 'dire quoi' is commonly used in informal contexts, especially in spoken language. It can be equated to the English phrase 'say what' or 'say what?' when expressing surprise or incredulity. It might confuse beginner learners without additional context, since it directly translates to 'say what', not immediately indicating its expressive purpose. It's often used to show confusion or to request repetition.","target_language_multi_word_term":"dire quoi","meaning":"'say what' or express surprise.","additional_notes":"Frequently used in informal scenarios to show disbelief or request clarification.","target_language_example":"Quand il m'a dit qu'il avait vendu la maison, j'étais là, dire quoi ?!","native_language_example":"When he told me he had sold the house, I was like, say what?!"}]
["du bon",{"thoughts":"\"Du bon\" is a French phrase used to describe something as good or of good quality. It's like emphasizing the positive attributes of something, often used in informal conversation.","target_language_multi_word_term":"du bon","meaning":"'some good' or 'of good quality'.","additional_notes":"Often used to describe food, experiences, or abstract qualities. It conveys a sense of positive or high quality in something.","target_language_example":"Il y a du bon dans cette situation.","native_language_example":"There is some good in this situation."}]
["du calme",{"thoughts":"The term 'du calme' is often used as a command or suggestion to encourage someone to be calm or to settle down. It is useful in situations where emotions or stress levels are high, and someone needs to be reminded to stay calm.","target_language_multi_word_term":"du calme","meaning":"Calm down.","additional_notes":"Often used to soothe or reassure someone, urging them to take it easy or not to worry.","target_language_example":"Il faut du calme dans cette situation.","native_language_example":"We need calm in this situation."}]
["du coup",{"thoughts":"\"Du coup\" is a colloquial French expression frequently used in casual conversations. It can express a consequence or result (similar to \"therefore,\" \"so,\" or \"as a result\") and is often used similarly to \"like\" or \"you know\" in English to fill pauses.","target_language_multi_word_term":"du coup","meaning":"'so', 'as a result', or filler similar to 'like'.","additional_notes":"Commonly used in informal spoken French to indicate a result or simply as a conversational filler. It's often used to connect ideas or sentences.","target_language_example":"Il a plu toute la journée, du coup nous sommes restés à la maison.","native_language_example":"It rained all day, so we stayed at home."}]
["du côté de",{"thoughts":"'Du côté de' is a French expression often used to indicate location or affiliation. It can be translated as 'on the side of' or 'towards'. It's important for beginners to recognize it as it often appears in directional contexts or when discussing organizations and support.","target_language_multi_word_term":"du côté de","meaning":"'on the side of' or 'towards'.","additional_notes":"Often used to indicate location, direction, or affiliation. Can apply to both physical spaces and abstract concepts like allegiance or perspective.","target_language_example":"Il habite du côté de la rivière.","native_language_example":"He lives on the side of the river."}]
["du monde",{"thoughts":"'Du monde' is a French expression often used to denote 'people' or 'crowd' in casual contexts. Combining 'de' and 'le monde', the phrase can imply the presence of many individuals depending on use. Beginner learners might associate it with places or events with large gatherings.","target_language_multi_word_term":"du monde","meaning":"'people' or 'crowd'.","additional_notes":"Used to describe a group of people or sometimes in expressions highlighting a large number of people in a place.","target_language_example":"Il y a beaucoup de monde au concert ce soir.","native_language_example":"There are a lot of people at the concert tonight."}]
["du temps de",{"thoughts":"'Du temps de' is a French phrase that refers to a certain period in the past, similar to saying 'in the time of' or 'during the era of' in English. It is often used to evoke nostalgia or to set a historical context.","target_language_multi_word_term":"du temps de","meaning":"'in the time of'.","additional_notes":"Used to indicate a period or era specific to a person, event, or period of history.","target_language_example":"C'était du temps de Napoléon.","native_language_example":"It was during Napoleon's time."}]
["du tout",{"thoughts":"'Du tout' is often used for emphasis, usually in negations, to mean 'at all'. It intensifies the negative aspect of a sentence in French.","target_language_multi_word_term":"du tout","meaning":"'at all'.","additional_notes":"Used in negative statements to emphasize the absence of something, often paired with 'ne ... pas' or 'ne ... rien'.","target_language_example":"Je n'aime pas du tout le chocolat.","native_language_example":"I don't like chocolate at all."}]
["dès que",{"thoughts":"The phrase 'dès que' is used to indicate an action that will happen immediately after another action. It often connects two clauses where one follows the other in time.","target_language_multi_word_term":"dès que","meaning":"as soon as","additional_notes":"Commonly used to specify that something will occur directly after a specified event. It often involves future tense in subordinate clauses.","target_language_example":"Je partirai dès que tu arriveras.","native_language_example":"I will leave as soon as you arrive."}]
["déjà vu",{"thoughts":"Déjà vu is a French term that has been adopted into English. Its usage in French is similar to its usage in English, conveying a sense of having experienced something before, even though that might not be the case.","target_language_multi_word_term":"déjà vu","meaning":"'already seen' or 'a feeling of familiarity'.","additional_notes":"Déjà vu describes the sensation of reliving a moment or feeling that it has happened before. Common in both languages, beginners might encounter it more in cultural contexts (films, books) than in everyday conversation.","target_language_example":"J'ai eu un sentiment de déjà vu en entrant dans la pièce.","native_language_example":"I had a feeling of déjà vu when I walked into the room."}]
["en arrière",{"thoughts":"'En arrière' is a common French phrase used to describe a direction or position, implying something is behind or towards the back. This is simple and useful for beginners as it often comes up in contexts discussing movement or positioning.","target_language_multi_word_term":"en arrière","meaning":"'backwards' or 'behind'.","additional_notes":"Used to describe movement or position towards the back or a past time reference.","target_language_example":"Reculez en arrière.","native_language_example":"Step back."}]
["en avoir assez",{"thoughts":"The phrase 'en avoir assez' is used in French to convey the feeling of being fed up or tired with something or someone. It's a common expression to indicate that someone has reached a limit of patience or tolerance.","target_language_multi_word_term":"en avoir assez","meaning":"'to be fed up' or 'to have had enough'.","additional_notes":"This phrase is used to express dissatisfaction, frustration, or the feeling of being overwhelmed. It can be used in a variety of contexts, such as work, personal relationships, or any situation where one is tired of dealing with something.","target_language_example":"J'en ai assez de ce bruit.","native_language_example":"I'm fed up with this noise."}]
["en bas",{"thoughts":"\"En bas\" is a French prepositional phrase meaning 'downstairs' or 'below'. It's used to describe the location of something that is situated on a lower level relative to a point of reference.","target_language_multi_word_term":"en bas","meaning":"'downstairs' or 'below'.","additional_notes":"Commonly used when indicating direction or level, such as referring to the lower floor of a building or something situated at the bottom.","target_language_example":"Les toilettes sont en bas.","native_language_example":"The restrooms are downstairs."}]
["en cours",{"thoughts":"The term 'en cours' is often used to describe something that is ongoing or currently happening, which is useful for beginners to understand ongoing actions or processes.","target_language_multi_word_term":"en cours","meaning":"'in progress' or 'ongoing'.","additional_notes":"It is used to indicate that an activity, event, or process is currently taking place.","target_language_example":"Le projet est en cours.","native_language_example":"The project is in progress."}]
["en effet",{"thoughts":"'En effet' is a French term that is often used to confirm or emphasize something that has already been stated. It is similar to saying 'indeed' or 'in fact' when you want to reinforce what you have just mentioned.","target_language_multi_word_term":"en effet","meaning":"'indeed' or 'in fact'.","additional_notes":"Used to confirm a statement or provide further explanation or justification. Often serves as an agreement or to further elucidate a point just made.","target_language_example":"Il a beaucoup travaillé, en effet, il a mérité sa promotion.","native_language_example":"He worked hard; indeed, he deserved his promotion."}]
["en faire",{"thoughts":"The phrase 'en faire' is commonly used in French and can have different meanings depending on the context, such as 'to do something about it' or 'to make a big deal out of something'. It's useful for learners to know the flexibility of this expression in everyday contexts.","target_language_multi_word_term":"en faire","meaning":"'to do something about' or 'to make a fuss about'.","additional_notes":"The phrase 'en faire' can indicate action or making an issue of something, often depending on the tone or other words used with it. It requires context for full understanding.","target_language_example":"Pourquoi en faire toute une histoire ?","native_language_example":"Why make a big deal about it?"}]
["en fait",{"thoughts":"'En fait' is a phrase used in French to clarify or emphasize a statement, similar to saying 'actually' or 'in fact' in English. It's used to correct or add new information to what was previously assumed or stated.","target_language_multi_word_term":"en fait","meaning":"'actually' or 'in fact'.","additional_notes":"Used to clarify a previous statement or correct misunderstanding, often emphasizing truth or reality.","target_language_example":"En fait, je n'aime pas beaucoup le chocolat.","native_language_example":"Actually, I don't like chocolate very much."}]
["en finir",{"thoughts":"The phrase 'en finir' is often used in French to express the idea of completing or bringing an end to something, similar to the English phrases 'to finish with' or 'to be done with.' It can be used in a wide variety of contexts when talking about ending tasks, projects, or problematic situations.","target_language_multi_word_term":"en finir","meaning":"'to finish with' or 'to be done with'.","additional_notes":"Used to express the completion or termination of a task or situation. Commonly used when someone wants to imply that they want something to end or be resolved.","target_language_example":"J'ai hâte d'en finir avec ce projet.","native_language_example":"I can't wait to be done with this project."}]
["en forme",{"thoughts":"'En forme' is a French expression used to describe someone who is in good physical or mental condition. It's often used to ask or state someone's well-being, similar to saying 'fit' or 'in good shape' in English. Beginner learners might encounter this phrase in various contexts, such as talking about health, exercise, or someone's mood.","target_language_multi_word_term":"en forme","meaning":"'in shape' or 'in good form'.","additional_notes":"Used to describe a good state of physical health or mental well-being. It can be used to ask how someone is feeling or to positively affirm someone's state.","target_language_example":"Après les vacances, je suis en pleine forme.","native_language_example":"After the holiday, I am in great shape."}]
["en haut",{"thoughts":"The phrase 'en haut' is commonly used to indicate location or direction. It translates to 'upstairs' or 'at the top'. Beginners might encounter it in contexts involving descriptions of where things are situated or directional instructions.","target_language_multi_word_term":"en haut","meaning":"'upstairs' or 'at the top'.","additional_notes":"Useful for giving directions or describing where something is placed or located.","target_language_example":"Les chambres sont en haut.","native_language_example":"The bedrooms are upstairs."}]
["en jeu",{"thoughts":"The term 'en jeu' is used to indicate that something is involved, at stake, or in play in a given situation. It's often associated with discussions about risks, stakes, or elements that are part of a process or situation.","target_language_multi_word_term":"en jeu","meaning":"'at stake' or 'in play'.","additional_notes":"Used to refer to elements that are being risked or considered in a situation.","target_language_example":"Il y a beaucoup d'argent en jeu dans ce projet.","native_language_example":"There is a lot of money at stake in this project."}]
["en retard",{"thoughts":"\"En retard\" is a common French phrase used to describe being late or delayed. It is relevant to beginner learners as it addresses time management and punctuality, which are important in daily interactions.","target_language_multi_word_term":"en retard","meaning":"\"late\" or \"delayed.\"","additional_notes":"Used to indicate that someone or something is arriving or happening later than expected or scheduled. Commonly used in everyday conversations regarding meetings, events, or transportation.","target_language_example":"Je suis désolé, je suis en retard.","native_language_example":"I'm sorry, I'm late."}]
["en route",{"thoughts":"The term 'en route' is borrowed from French into English, so it might be more familiar to learners. It is used to indicate that someone or something is on the way to a destination.","target_language_multi_word_term":"en route","meaning":"on the way.","additional_notes":"This term is used to describe the action of being in transit towards a specific destination. It can be used in both casual and formal contexts, and it can be applied to people, vehicles, or objects in transit.","target_language_example":"Nous sommes en route pour Paris.","native_language_example":"We are on the way to Paris."}]
["en tout",{"thoughts":"The phrase 'en tout' is often used to refer to 'in total' or 'all together' in French, especially when summing up or giving a total account of something.","target_language_multi_word_term":"en tout","meaning":"'in total'.","additional_notes":"Used to sum up quantities or amounts, often seen in contexts involving addition or final tallies.","target_language_example":"Il y a dix personnes en tout.","native_language_example":"There are ten people in total."}]
["en train de",{"thoughts":"'En train de' is used in French to express that an action is currently taking place. It is similar to the English continuous tense using '-ing.' For beginners, it's important to recognize this structure to talk about actions happening at the moment of speaking.","target_language_multi_word_term":"en train de","meaning":"'in the middle of' or 'in the process of'.","additional_notes":"Always followed by an infinitive verb to indicate an ongoing action. It's used to emphasize that something is happening right now.","target_language_example":"Je suis en train de manger.","native_language_example":"I am eating."}]
["en tête",{"thoughts":"This phrase literally translates to 'in the head' but is used in contexts about having something 'in mind' or being 'at the front'. It often refers to leading or being foremost in an order or a thought process.","target_language_multi_word_term":"en tête","meaning":"'in mind' or 'at the front'.","additional_notes":"Can refer to ideas or physical positioning, often used when discussing priorities, rankings, or leadership contexts.","target_language_example":"Il est toujours en tête dans les sondages.","native_language_example":"He is always in the lead in the polls."}]
["en vouloir",{"thoughts":"'En vouloir' is a unique French phrase that translates to 'to be mad at' or 'to hold a grudge.' It is often used when someone is upset with another person for a specific reason, and it's a useful phrase for beginners to understand emotional expressions in French.","target_language_multi_word_term":"en vouloir","meaning":"'to hold a grudge' or 'to be mad at'.","additional_notes":"Used when expressing that someone is upset with or holding something against another person. The phrase often requires a pronoun object, such as 'en vouloir à quelqu'un' (to hold a grudge against someone).","target_language_example":"Elle m'en veut d'avoir oublié son anniversaire.","native_language_example":"She's mad at me for forgetting her birthday."}]
["en échange",{"thoughts":"The phrase 'en échange' is commonly used to mean 'in exchange' or 'in return'. It is often utilized in contexts where one thing is given or done as an equivalent or substitute for another. This concept is relevant for beginning learners as it surfaces in various everyday transactions and reciprocal actions.","target_language_multi_word_term":"en échange","meaning":"'in exchange' or 'in return'.","additional_notes":"Used to indicate a situation where something is given, received, or done as a counterpart to something else.","target_language_example":"Je lui ai donné mon livre en échange de son aide.","native_language_example":"I gave him my book in return for his help."}]
["en être",{"thoughts":"The term 'en être' is a French expression used idiomatically. It often appears in phrases where the word 'en' replaces a part of the sentence related to quantity or objects already in context. It's a construction that can translate to 'where things stand,' 'to be out of something,' or in questions like 'how much is left' or 'do you have any left?' It's versatile in expressing states or quantities.","target_language_multi_word_term":"en être","meaning":"'to be there,' 'to be at that point.'","additional_notes":"This phrase is used to indicate a point reached in a process or an amount of something remaining. 'En' replaces the object or concept previously mentioned. It's context-dependent and often needs reference to another part of the conversation or text.","target_language_example":"Où est-ce que j'en suis ?","native_language_example":"Where am I with it?"}]
["entendre dire",{"thoughts":"'Entendre dire' is a French expression meaning 'to hear (it said)'. It's often used to convey something that a person has heard from someone else, usually as a rumor or piece of information that’s not firsthand.","target_language_multi_word_term":"entendre dire","meaning":"'to hear (it said)'.","additional_notes":"Used when someone receives information through second-hand sources, and not from direct experience.","target_language_example":"J'ai entendu dire qu'il va déménager.","native_language_example":"I heard that he is going to move."}]
["entendre parler",{"thoughts":"The phrase 'entendre parler' is common in French and means 'to hear about'. It's used to indicate receiving information about something through others or indirectly.","target_language_multi_word_term":"entendre parler","meaning":"'to hear about'.","additional_notes":"Used when someone has learned information or rumors through second-hand sources or informal communication.","target_language_example":"J'ai entendu parler de la nouvelle exposition au musée.","native_language_example":"I heard about the new exhibition at the museum."}]
["entendre parler de",{"thoughts":"The French phrase 'entendre parler de' is used when someone hears about something. It is akin to the English 'hear about' and is frequently followed by mentioning the subject or topic.","target_language_multi_word_term":"entendre parler de","meaning":"'to hear about'.","additional_notes":"Used when you hear a mention or discussion of something or someone, often indirectly.","target_language_example":"As-tu entendu parler de ce film ?","native_language_example":"Have you heard about that movie?"}]
["est passé",{"thoughts":"The term 'est passé' is the third-person singular form of the verb 'passer' in the past tense, often used to describe an event or action that has occurred. It's important for learners to understand its use in past tense contexts.","target_language_multi_word_term":"est passé","meaning":"'has passed' or 'went by'.","additional_notes":"Typically used in the context of something that has occurred or a time that has gone by. It can refer to both physical and abstract events.","target_language_example":"Il est passé par ici hier.","native_language_example":"He passed by here yesterday."}]
["est-ce que",{"thoughts":"\"Est-ce que\" is the go-to phrase for turning a statement into a yes/no question in everyday French. It’s neutral, works with any subject or verb tense, and doesn’t require inversion, which beginners often find tricky.","target_language_multi_word_term":"est-ce que","meaning":"introduces a yes/no question (literally “is it that”).","additional_notes":"Placed at the very start of the sentence before the subject and verb. No inversion needed. Often omitted in informal spoken French where rising intonation alone signals a question.","target_language_example":"Est-ce que tu aimes le café ?","native_language_example":"Do you like coffee?"}]
["est-il",{"thoughts":"'Est-il' is a common inversion used to form questions in French, typically found in formal writing or speech. It translates to 'is he' or 'is it' in English. Understanding this inversion can help learners identify questions, even in French literature or news articles.","target_language_multi_word_term":"est-il","meaning":"'is he' or 'is it'.","additional_notes":"This structure is used to form questions by inverting the subject and verb, typical in formal contexts.","target_language_example":"Est-il déjà arrivé ?","native_language_example":"Has he arrived yet?"}]
["et alors",{"thoughts":"'Et alors' is a French phrase commonly used in conversation. It can convey a sense of indifference or dismissal, similar to saying 'so what?' in English. It's often used when someone wants to downplay the importance of what was just said.","target_language_multi_word_term":"et alors","meaning":"'so what?'","additional_notes":"Used to express indifference or suggest that something is not important or impressive.","target_language_example":"Il a encore fait une erreur, et alors?","native_language_example":"He made another mistake, so what?"}]
["et des",{"thoughts":"\"Et des\" is a contraction of \"and\" (et) with the partitive article \"some\" (des). It's used when listing items and adding an indefinite amount of something.","target_language_multi_word_term":"et des","meaning":"'and some' or 'plus some'.","additional_notes":"Used when you want to add additional items from a non-specific quantity. Typically occurs in lists where you add more indefinite items.","target_language_example":"J'ai acheté des pommes, des oranges, et des bananes.","native_language_example":"I bought apples, oranges, and some bananas."}]
["et si",{"thoughts":"'Et si' is a phrase that can be used to introduce a hypothetical scenario or a suggestion. It is often used to propose an idea or to speculate about a situation.","target_language_multi_word_term":"et si","meaning":"'what if' or 'and if'.","additional_notes":"'Et si' is used to express hypothetical situations, proposals, or to introduce what could happen if a certain condition is met.","target_language_example":"Et si on allait au cinéma ce soir ?","native_language_example":"What if we went to the movies tonight?"}]
["ex-femme",{"thoughts":"The term 'ex-femme' refers to a previous wife, which is a commonly used phrase in both French and English. It can come up in conversations about relationships, personal history, or family.","target_language_multi_word_term":"ex-femme","meaning":"'ex-wife'.","additional_notes":"This term is used to describe a woman who was previously married to someone. It is similar to the English term 'ex-wife'.","target_language_example":"Il a gardé de bonnes relations avec son ex-femme.","native_language_example":"He has maintained a good relationship with his ex-wife."}]
["excuse-moi",{"thoughts":"'Excuse-moi' is a polite and informal French expression used to ask for forgiveness or to get someone's attention. As a beginner, understanding how to apologize or politely interrupt is important. It's crucial to note that this phrase is more casual, while 'excusez-moi' is the formal equivalent.","target_language_multi_word_term":"excuse-moi","meaning":"'excuse me' or 'pardon me'.","additional_notes":"Used informally to ask for forgiveness or attention. Use 'excusez-moi' in formal situations.","target_language_example":"Excuse-moi, tu sais l'heure qu'il est ?","native_language_example":"Excuse me, do you know what time it is?"}]
["excusez-moi",{"thoughts":"'Excusez-moi' is a polite phrase commonly used in French to attract attention, apologize or ask for clarification. It's essential for beginners to express courtesy.","target_language_multi_word_term":"excusez-moi","meaning":"'excuse me'.","additional_notes":"Used to politely get someone's attention, to apologize, or to request repetition. It's a versatile phrase in everyday conversation.","target_language_example":"Excusez-moi, où se trouve la bibliothèque ?","native_language_example":"Excuse me, where is the library?"}]
["faire aller",{"thoughts":"'Faire aller' is an informal French phrase which roughly translates to 'make do' in English, implying managing with whatever is available.","target_language_multi_word_term":"faire aller","meaning":"'make do'.","additional_notes":"Used to express managing with existing resources or dealing with situations with the available means.","target_language_example":"Je n'ai pas assez de plats, alors je vais faire aller.","native_language_example":"I don't have enough plates, so I'll make do."}]
["faire attention",{"thoughts":"An important phrase that warns or advises someone to be cautious or considerate about something.","target_language_multi_word_term":"faire attention","meaning":"'to pay attention' or 'to be careful'.","additional_notes":"Used to express the need for caution or attentiveness in various situations, such as crossing the street, handling something fragile, or paying attention in class.","target_language_example":"Il faut faire attention en traversant la rue.","native_language_example":"You have to pay attention when crossing the street."}]
["faire avec",{"thoughts":"'Faire avec' is a French expression meaning to cope with or manage with something, often something less than ideal. It implies an acceptance of a situation and the need to make do with what is available.","target_language_multi_word_term":"faire avec","meaning":"to make do with.","additional_notes":"Used when accepting a less than ideal situation or resource and deciding to manage or continue despite it. Often suggests a sense of resignation or resourcefulness.","target_language_example":"Je voulais une voiture neuve, mais je vais devoir faire avec celle-ci pour le moment.","native_language_example":"I wanted a new car, but I'll have to make do with this one for now."}]
["faire bien",{"thoughts":"'Faire bien' combines the verb 'faire' (to do/make) with the adverb 'bien' (well). It's used to express doing something well or correctly, often with emphasis on skill or effectiveness.","target_language_multi_word_term":"faire bien","meaning":"'to do well'.","additional_notes":"Used to describe performing an action correctly or skillfully. It's often used in contexts where the quality of the action is being evaluated.","target_language_example":"Il faut faire bien son travail.","native_language_example":"You have to do your work well."}]
["faire bon",{"thoughts":"'Faire bon' is part of various expressions in French, often used to describe favorable conditions or outcomes. It's not typically used on its own but rather as part of idiomatic expressions such as 'faire bon ménage', 'faire bonne impression', etc, which beginner learners might encounter.","target_language_multi_word_term":"faire bon","meaning":"'to be favorable' or 'to do well'.","additional_notes":"'Faire bon' is used in expressions to indicate that something is going well or is favorable. It is often combined with other words to form expressions like 'faire bon ménage' (to get along well) or 'faire bonne impression' (to make a good impression).","target_language_example":"Il est important de faire bonne impression lors d'un entretien.","native_language_example":"It's important to make a good impression during an interview."}]
["faire bon voyage",{"thoughts":"Faire bon voyage is a common French way of wishing someone a pleasant journey. It's typically used before someone leaves for a trip.","target_language_multi_word_term":"faire bon voyage","meaning":"to have a good trip.","additional_notes":"It's akin to the English phrase 'have a nice trip' and is used as a form of farewell or good wishes to someone about to travel.","target_language_example":"Je vous souhaite de faire bon voyage !","native_language_example":"I wish you a good trip!"}]
["faire comme si",{"thoughts":"The phrase 'faire comme si' is commonly used in French to express the idea of pretending that something is the case when it is not. This is a useful phrase in daily conversations when discussing hypothetical or imaginary scenarios, often involving a pretense or act.","target_language_multi_word_term":"faire comme si","meaning":"'to pretend as if' or 'to act as though'.","additional_notes":"Used to describe actions that mimic reality or feign a situation different from the current one. Often introduces a hypothetical scenario.","target_language_example":"Il fait comme si de rien n'était.","native_language_example":"He acts as if nothing happened."}]
["faire confiance",{"thoughts":"'Faire confiance' is a French expression meaning to trust or have confidence in someone or something, which is a fundamental concept in everyday interactions.","target_language_multi_word_term":"faire confiance","meaning":"'to trust'.","additional_notes":"This phrase is used when you want to express belief in someone's honesty, ability, or reliability. It often requires a direct or indirect object, indicating who you trust.","target_language_example":"Je lui fais confiance.","native_language_example":"I trust him."}]
["faire diversion",{"thoughts":"'Faire diversion' is a French phrase that means to create a distraction. It's often used in scenarios where someone wants to change the focus or attention from one thing to another. This can come in handy in everyday conversations or when learning about strategies in different contexts.","target_language_multi_word_term":"faire diversion","meaning":"to create a distraction.","additional_notes":"Used to indicate the act of diverting attention from one thing to something else. This could be in a context of teamwork, acting, or in everyday life when trying to shift focus.","target_language_example":"Il a fait diversion pour que nous puissions partir discrètement.","native_language_example":"He created a distraction so we could leave quietly."}]
["faire du bien",{"thoughts":"The phrase 'faire du bien' means 'to do good' or 'to be good for'. It's used to indicate that something is beneficial or makes someone feel better. This can refer to physical or emotional well-being. Learners should note the context in which it's used to understand the type of benefit being referred to.","target_language_multi_word_term":"faire du bien","meaning":"'to do good' or 'to be good for'.","additional_notes":"Often used to describe something that has a positive, refreshing, or beneficial effect on a person physically or mentally.","target_language_example":"Une promenade à l'air frais te fera du bien.","native_language_example":"A walk in the fresh air will do you good."}]
["faire gaffe",{"thoughts":"'Faire gaffe' is an informal French expression meaning to be careful or watch out. It's crucial for beginners to know casual expressions as they are often used in conversational French. This phrase is similar to the more formal 'faire attention'.","target_language_multi_word_term":"faire gaffe","meaning":"'to be careful' or 'watch out'.","additional_notes":"Commonly used in informal spoken French to warn someone to be cautious. Equivalent to the English 'watch out' or 'be careful'.","target_language_example":"Fais gaffe à la marche, elle est glissante.","native_language_example":"Watch out for the step, it's slippery."}]
["faire mieux de",{"thoughts":"'Faire mieux de' is a construction used to give advice or suggest a preferable action, similar to 'had better' in English.","target_language_multi_word_term":"faire mieux de","meaning":"'had better'.","additional_notes":"Used to suggest an advisable action or a preferred course of action, often to avoid negative consequences.","target_language_example":"Tu ferais mieux de te dépêcher.","native_language_example":"You had better hurry."}]
["faire plaisir",{"thoughts":"'Faire plaisir' is a phrase used to express the act of giving pleasure or delight to someone. It's commonly used in everyday conversations when talking about making someone happy or doing something nice for others.","target_language_multi_word_term":"faire plaisir","meaning":"'to please' or 'to make happy'.","additional_notes":"It is often used when you do something considerate for someone, like giving a gift or dedicating time to make someone feel special.","target_language_example":"Je veux faire plaisir à ma mère pour son anniversaire.","native_language_example":"I want to please my mother for her birthday."}]
["faire pour",{"thoughts":"'Faire pour' is a phrase in French often used to discuss the means or methods for achieving something. It is commonly used when discussing solutions, goals, or intentions.","target_language_multi_word_term":"faire pour","meaning":"'to do (in order) to'.","additional_notes":"Used when discussing the necessary actions to achieve something or solve a problem. Often followed by an infinitive verb to express purpose.","target_language_example":"Je vais faire pour réussir cet examen.","native_language_example":"I will do what I need to in order to pass this exam."}]
["faire savoir",{"thoughts":"'Faire savoir' is a French phrase meaning to inform or let someone know. This phrase is pertinent for beginner learners as it is commonly used in everyday conversations to convey messages or information.","target_language_multi_word_term":"faire savoir","meaning":"'to inform' or 'to let know'.","additional_notes":"Used to indicate conveying information to someone. It is often followed by a clause indicating what is to be communicated to someone.","target_language_example":"Il faut lui faire savoir que la réunion est annulée.","native_language_example":"We should let him know that the meeting is cancelled."}]
["faire semblant",{"thoughts":"'Faire semblant' is a French expression used to describe the act of pretending or feigning something, which is a useful concept in many conversational settings.","target_language_multi_word_term":"faire semblant","meaning":"'to pretend'.","additional_notes":"Used when someone is acting as if something is true, but it is not. This expression can be applied to various situations where there is a need or desire to create a false impression.","target_language_example":"Elle fait semblant d'être malade pour ne pas aller à l'école.","native_language_example":"She pretends to be sick to avoid going to school."}]
["faire un tour",{"thoughts":"\"Faire un tour\" is a versatile phrase in French that can mean taking a walk, going for a ride, or even taking a short trip. It's useful for beginner learners to understand its flexible application in various contexts.","target_language_multi_word_term":"faire un tour","meaning":"to take a walk or a ride.","additional_notes":"Used for casual outings or short trips, either on foot or using a vehicle. The context determines whether it refers to a leisurely walk, a drive, or any brief excursion.","target_language_example":"Dimanche, nous allons faire un tour au parc.","native_language_example":"On Sunday, we're going to take a walk in the park."}]
["fait que",{"thoughts":"The phrase 'fait que' is commonly used to express causation or result, similar to saying 'means that' or 'makes it so that' in English. It often links a result or consequence to its cause.","target_language_multi_word_term":"fait que","meaning":"results in 'that' or 'means that'.","additional_notes":"Typically used to indicate the cause behind a result or situation. It can often be seen in sentences that explain why something is the case.","target_language_example":"Il a beaucoup plu, ce qui fait que la rivière a débordé.","native_language_example":"It rained a lot, which means that the river overflowed."}]
["grand jour",{"thoughts":"\"Grand jour\" translates to \"big day\" in English, commonly referencing a significant occasion like a wedding or a major event.","target_language_multi_word_term":"grand jour","meaning":"\"big day\" or \"important day\".","additional_notes":"Used to describe a day of great importance or special occasion, often involving celebrations or significant events.","target_language_example":"Aujourd'hui, c'est le grand jour de leur mariage.","native_language_example":"Today is the big day of their wedding."}]
["grand-mère",{"thoughts":"'Grand-mère' translates directly to 'grandmother' in English. It is used to refer to the mother of one's parent. This term might be relevant to beginner learners as it is related to family vocabulary, a common introductory topic in language study.","target_language_multi_word_term":"grand-mère","meaning":"'grandmother'.","additional_notes":"Used to refer to the mother of your mother or father. It's a familial term often used in conversations about family and relatives.","target_language_example":"Ma grand-mère fait toujours des biscuits délicieux.","native_language_example":"My grandmother always makes delicious cookies."}]
["grand-père",{"thoughts":"The term 'grand-père' is common in the context of family and relationships. It simply refers to one's grandfather.","target_language_multi_word_term":"grand-père","meaning":"'grandfather'.","additional_notes":"Used to refer to or address one's grandfather, or any elderly man who holds a grandfather-like role.","target_language_example":"Mon grand-père raconte toujours des histoires intéressantes.","native_language_example":"My grandfather always tells interesting stories."}]
["grâce à",{"thoughts":"'Grâce à' is a useful French prepositional phrase that indicates something happening due to a positive cause or reason. It's equivalent to the English 'thanks to.'","target_language_multi_word_term":"grâce à","meaning":"'thanks to'.","additional_notes":"Used to express gratitude or indicate a positive cause for a situation. It can be followed by a noun or a pronoun.","target_language_example":"Nous avons réussi grâce à votre aide.","native_language_example":"We succeeded thanks to your help."}]
["hors de",{"thoughts":"The phrase 'hors de' is commonly used to express the concept of being 'out of' or 'outside of' and is frequently used in a physical, situational, or metaphorical context.","target_language_multi_word_term":"hors de","meaning":"'outside of' or 'out of'.","additional_notes":"Used to indicate being beyond the boundaries, limits, or standard range of a location, condition, or situation.","target_language_example":"Il est hors de question de partir maintenant.","native_language_example":"It is out of the question to leave now."}]
["il faut",{"thoughts":"'Il faut' is a versatile French phrase used to express necessity or obligation, often translated as 'one must' or 'it is necessary.' It introduces general statements or rules, similar to impersonal expressions in English.","target_language_multi_word_term":"il faut","meaning":"'one must' or 'it is necessary'.","additional_notes":"Used to express necessity, obligation, or requirement. Often appears with an infinitive verb following it to indicate what action is required. It’s an impersonal phrase without a defined subject.","target_language_example":"Il faut aller à l'école.","native_language_example":"One must go to school."}]
["il le faut",{"thoughts":"'Il le faut' is a French phrase used to express necessity, often translated to 'it's necessary' or 'it must be done'. This might not be intuitive for English speakers as the literal translation doesn't carry the same meaning, so it's important to note when learning.","target_language_multi_word_term":"il le faut","meaning":"it's necessary","additional_notes":"Used to express that something must be done or is required. It's an impersonal phrase often used when talking about obligations or necessity.","target_language_example":"Pour réussir, il le faut.","native_language_example":"To succeed, it's necessary."}]
["il y a",{"thoughts":"'Il y a' is a very common French phrase that means 'there is' or 'there are'. It's used to refer to the existence or presence of something and is often used in various tenses.","target_language_multi_word_term":"il y a","meaning":"'there is' or 'there are'.","additional_notes":"It can be used in different tenses to refer to events or things in the past, present, or future. In a question, it helps form queries like 'Is there…?' or 'Are there…?'.","target_language_example":"Il y a un chat sur le toit.","native_language_example":"There is a cat on the roof."}]
["il y en a",{"thoughts":"'Il y en a' is a French expression used to indicate that there is some quantity of something, often referring to things already mentioned or understood. The phrase incorporates 'en,' a pronoun that usually replaces 'de' + a noun (partitive articles, quantities). It's an important structural component in French.","target_language_multi_word_term":"il y en a","meaning":"'there are some' or 'there is some'.","additional_notes":"This phrase is often used to refer to an unspecified amount of something already mentioned. 'En' is a pronoun that replaces a noun introduced by 'de' and is crucial for correct sentence construction in French.","target_language_example":"Il y a des pommes? Oui, il y en a.","native_language_example":"Are there apples? Yes, there are some."}]
["j'ai une question",{"thoughts":"\"J'ai une question\" is a phrase used when someone wants to ask a question, frequently employed in both formal and informal settings.","target_language_multi_word_term":"j'ai une question","meaning":"\"I have a question.\"","additional_notes":"Commonly used to politely interrupt or preface asking for information.","target_language_example":"Excusez-moi, j'ai une question sur le devoir.","native_language_example":"Excuse me, I have a question about the homework."}]
["j'ai à faire",{"thoughts":"The phrase 'j'ai à faire' translates to having things to do or tasks to complete. This expression is common in everyday conversations when people talk about their obligations or activities they need to attend to.","target_language_multi_word_term":"j'ai à faire","meaning":"I have things to do.","additional_notes":"This phrase is used to express that someone has obligations, tasks, or chores that they need to attend to. It's informal and often used in daily conversations when explaining why one is busy or cannot commit to something else.","target_language_example":"Je ne peux pas sortir ce soir, j'ai à faire.","native_language_example":"I can't go out tonight, I have things to do."}]
["j'sais pas",{"thoughts":"\"J'sais pas\" is an informal contraction of \"je ne sais pas,\" which means \"I don't know.\" It's commonly used in spoken French, especially in casual or colloquial settings. This contraction reflects the way people often speak in a relaxed, everyday context.","target_language_multi_word_term":"j'sais pas","meaning":"\"I don't know.\"","additional_notes":"This is an informal, spoken contraction of \"je ne sais pas,\" used in casual conversations. It's similar to saying \"dunno\" in English instead of \"I don't know.\"","target_language_example":"A: Où est passé le chat ? B: J'sais pas.","native_language_example":"A: Where did the cat go? B: I don't know."}]
["je fais aller",{"thoughts":"\"Je fais aller\" translates to a response typically used when someone asks how you are doing. It's more nuanced than a direct answer like 'good' or 'bad', often indicating that things are okay, but not great. It's a colloquial way to express that you are getting by or managing despite not being in the best situation. This would be useful for beginner learners to understand casual conversation.","target_language_multi_word_term":"je fais aller","meaning":"\"I'm getting by\" or \"I'm managing.\"","additional_notes":"Used as a response to 'How are you?' when you're not doing great but are managing. It's a more nuanced, casual answer.","target_language_example":"- Comment ça va ? - Je fais aller.","native_language_example":"- How's it going? - I'm getting by."}]
["je ne comprends pas",{"thoughts":"'Je ne comprends pas' is a simple phrase used to express a lack of understanding, making it very useful for beginners learning French, especially in classrooms or when traveling.","target_language_multi_word_term":"je ne comprends pas","meaning":"'I don't understand'.","additional_notes":"Often used in everyday conversation when someone does not grasp what is being said. Useful for travelers or beginners in French.","target_language_example":"Excusez-moi, je ne comprends pas.","native_language_example":"Excuse me, I don't understand."}]
["je ne dis pas",{"thoughts":"The phrase 'je ne dis pas' is a French negative construction used to express denial, disagreement, or to say that one is not saying something explicitly. It falls under the category of negation sentences, which are important to understand when learning French because they form a fundamental part of expressing negatives in the language.","target_language_multi_word_term":"je ne dis pas","meaning":"'I am not saying'.","additional_notes":"Used to deny or clarify a statement by specifying that the speaker does not say or agree with something.","target_language_example":"Je ne dis pas que tu as tort.","native_language_example":"I am not saying that you are wrong."}]
["je ne pense pas",{"thoughts":"The phrase 'je ne pense pas' is useful for beginners as it negates thoughts or opinions, commonly used in conversation to express disagreement or uncertainty.","target_language_multi_word_term":"je ne pense pas","meaning":"I don't think.","additional_notes":"Used to express disagreement or uncertainty. It's a polite way to indicate doubt or a lack of belief in something.","target_language_example":"Je ne pense pas que ce soit une bonne idée.","native_language_example":"I don't think that's a good idea."}]
["je ne sais pas",{"thoughts":"The phrase 'je ne sais pas' is very common and essential for beginner learners. It is the standard way to say 'I don't know' in French and is useful in many contexts, such as when answering questions or indicating uncertainty.","target_language_multi_word_term":"je ne sais pas","meaning":"'I don't know'.","additional_notes":"Used to express ignorance or uncertainty about something.","target_language_example":"Pardon, je ne sais pas où c'est.","native_language_example":"Sorry, I don't know where it is."}]
["je ne te dis pas",{"thoughts":"French speakers often use 'je ne te dis pas' in conversational speech to emphasize the extent of something that they previously explained, often to underscore its significance or surprising nature.","target_language_multi_word_term":"je ne te dis pas","meaning":"'I'm telling you' or 'let me tell you'.","additional_notes":"This phrase is often used to underline a point the speaker has made, usually to convey emphasis or incredulity. It can set up a statement meant to surprise, impress, or emphasize the importance of what follows.","target_language_example":"C'était incroyable, je ne te dis pas!","native_language_example":"It was incredible, let me tell you!"}]
["je t'aime",{"thoughts":"The phrase 'je t'aime' is a quintessential expression of love and affection in French, akin to 'I love you' in English, often used in both romantic and familial contexts. It is essential for beginner learners to understand both the emotional weight and common usage of this phrase.","target_language_multi_word_term":"je t'aime","meaning":"'I love you'.","additional_notes":"A common and intimate expression used to convey deep affection or love, typical in romantic relationships, as well as between family members or close friends.","target_language_example":"Je t'aime plus que tout au monde.","native_language_example":"I love you more than anything in the world."}]
["je t'en prie",{"thoughts":"'Je t'en prie' is a polite expression used in French that has versatile meanings, commonly used in conversational settings to reply to thanks or requests. It's an important phrase in terms of etiquette and understanding this can help beginners sound polite.","target_language_multi_word_term":"je t'en prie","meaning":"'you're welcome' or 'go ahead'.","additional_notes":"Typically used in response to someone thanking you or when giving someone permission. It conveys politeness and can vary slightly depending on context.","target_language_example":"Merci pour ton aide. - Je t'en prie.","native_language_example":"Thank you for your help. - You're welcome."}]
["je vais aller",{"thoughts":"'Je vais aller' is a phrase that uses the near future tense in French, similar to 'I am going to go' in English. This construction is made with the verb 'aller' and is commonly used to talk about immediate or future plans.","target_language_multi_word_term":"je vais aller","meaning":"'I am going to go'.","additional_notes":"This phrase uses the near future tense, composed of 'aller' plus another infinitive verb, to express upcoming intentions or plans.","target_language_example":"Je vais aller au marché demain.","native_language_example":"I am going to go to the market tomorrow."}]
["je vois",{"thoughts":"'Je vois' is a simple yet versatile phrase that can be used to express understanding or acknowledgment in a conversation.","target_language_multi_word_term":"je vois","meaning":"'I see' or 'I understand'.","additional_notes":"Used to acknowledge that someone has explained something to you or when you comprehend a situation. It is similar to expressing that you've grasped the concept or information shared.","target_language_example":"Je vois ce que tu veux dire.","native_language_example":"I see what you mean."}]
["je vous en prie",{"thoughts":"The phrase 'je vous en prie' is a polite expression in French, commonly used in formal settings. It can act as a polite response to 'merci' and is also used to invite someone to go ahead or not hesitate.","target_language_multi_word_term":"je vous en prie","meaning":"'you're welcome' or 'please go ahead'.","additional_notes":"Often used to respond to thanks or to grant permission. It is the formal version of 'je t'en prie'.","target_language_example":"Après que quelqu'un dit merci, vous pouvez répondre : 'Je vous en prie'.","native_language_example":"After someone says thank you, you can respond: 'You're welcome'."}]
["jeune homme",{"thoughts":"Jeune homme literally translates to 'young man' in English. It is used to describe a male who is either a teenager or a young adult.","target_language_multi_word_term":"jeune homme","meaning":"'young man'.","additional_notes":"Used to address or refer to a young male, often someone in their teens or early twenties. It can be used formally or informally.","target_language_example":"Ce jeune homme a beaucoup de talent.","native_language_example":"This young man has a lot of talent."}]
["joyeux anniversaire",{"thoughts":"'Joyeux anniversaire' is a standard way to wish someone a happy birthday in French. It's a simple phrase that beginner learners will find useful when interacting with French-speaking friends or during cultural events where birthdays are celebrated.","target_language_multi_word_term":"joyeux anniversaire","meaning":"'happy birthday'.","additional_notes":"Used to wish someone well on the anniversary of their birth. 'Joyeux' means 'joyful' or 'merry', and 'anniversaire' means 'birthday'.","target_language_example":"Joyeux anniversaire, Monique!","native_language_example":"Happy birthday, Monique!"}]
["la faire",{"thoughts":"'La faire' is a verb phrase used to mean 'do it' or 'make it' where 'faire' is the verb \"to do/make\" and 'la' is a direct object pronoun referring to a feminine singular noun or an understood concept.","target_language_multi_word_term":"la faire","meaning":"'do it' or 'make it'.","additional_notes":"Used when referring to an action involving a feminine noun. Context often clarifies what 'it' refers to. Can indicate completing a task or solving a problem.","target_language_example":"Je vais la faire demain.","native_language_example":"I will do it tomorrow."}]
["la ferme",{"thoughts":"La ferme is a French phrase that can be used in different contexts. It may refer to a 'farm' or the expression 'be quiet'. For beginners, knowing both uses is beneficial as they're quite different.","target_language_multi_word_term":"la ferme","meaning":"'the farm' or 'be quiet'.","additional_notes":"When used as 'the farm', it's a noun referring to a rural area where crops are grown or animals are raised. As an expression, it's a casual, often direct way to tell someone to be quiet.","target_language_example":"Nous visitons la ferme demain.","native_language_example":"We are visiting the farm tomorrow."}]
["la plupart",{"thoughts":"The phrase 'la plupart' is commonly used in French to indicate the majority of something, often followed by the preposition 'de' to specify the group being referenced.","target_language_multi_word_term":"la plupart","meaning":"'most' or 'the majority'.","additional_notes":"Usually followed by 'de' when specifying a group or category. It is used to express that something applies to the largest part of a group.","target_language_example":"La plupart des gens aiment le chocolat.","native_language_example":"Most people like chocolate."}]
["la ramener",{"thoughts":"\"La ramener\" is an informal French phrase commonly used to describe someone who boasts or shows off, often without adding value to a situation.","target_language_multi_word_term":"la ramener","meaning":"to show off or boast.","additional_notes":"Used informally, often with a negative connotation. It implies talking unnecessarily for attention or making oneself seem important.","target_language_example":"Il ne peut pas s'empêcher de la ramener à chaque réunion.","native_language_example":"He can't help showing off at every meeting."}]
["laisser tomber",{"thoughts":"\"Laisser tomber\" is an informal phrase in French which translates to the English \"to drop it\" or \"to let it go\". It is often used to advise someone to stop pursuing a current topic or to abandon a plan.","target_language_multi_word_term":"laisser tomber","meaning":"\"to drop it\" or \"to let it go\".","additional_notes":"Used informally to suggest giving up on something, often to avoid unnecessary trouble or frustration. Can also be a casual way to dismiss a topic of conversation.","target_language_example":"Ne t'inquiète pas pour ça, laisse tomber.","native_language_example":"Don't worry about it, let it go."}]
["le chercher",{"thoughts":"'Le chercher' involves the verb 'chercher' which means 'to look for' or 'to search.' When 'le' is added, it usually means 'to look for it' or 'to find him/her'. In casual speech, it could also reflect an idiom or slang meaning, depending on context. It might be used to describe someone looking for trouble in certain colloquial phrases.","target_language_multi_word_term":"le chercher","meaning":"'to look for it' or 'to search for him/her'.","additional_notes":"In specific contexts, especially colloquial ones, 'le chercher' can imply looking for trouble, like inviting conflict or a fight. It can be used to suggest that someone is deliberately seeking a problematic outcome.","target_language_example":"Il va le chercher partout.","native_language_example":"He is going to look for it everywhere."}]
["le leur",{"thoughts":"'Le leur' is a French possessive pronoun meaning 'theirs' or 'the ones that belong to them'. It is used to refer to something owned or possessed by a group of people ('leur' indicates plural ownership).","target_language_multi_word_term":"le leur","meaning":"'theirs' (masculine singular).","additional_notes":"Used when referring to a singular masculine noun possessed by multiple people. It indicates ownership and is often used in contexts where you want to specify the gender and number of the objects being possessed. 'Le leur' becomes 'la leur', 'les leurs' based on the gender and number.","target_language_example":"Ce livre est le leur.","native_language_example":"This book is theirs."}]
["le mien",{"thoughts":"'Le mien' is a French possessive pronoun used to indicate ownership, translated as 'mine' in English.","target_language_multi_word_term":"le mien","meaning":"'mine'.","additional_notes":"Used to refer to something owned or associated with the speaker, replacing a noun previously mentioned.","target_language_example":"Ce livre est le mien.","native_language_example":"This book is mine."}]
["le nôtre",{"thoughts":"'Le nôtre' is a French possessive pronoun often used in place of the possessive adjective and noun combination to simplify expressions and avoid repetition.","target_language_multi_word_term":"le nôtre","meaning":"'ours'.","additional_notes":"Used to refer to something previously mentioned that belongs to the speaker or the speaker's group. Ensure the agreement with the gender and number of the thing possessed (e.g., 'la nôtre' for singular feminine objects).","target_language_example":"La maison, c'est le nôtre.","native_language_example":"The house, it's ours."}]
["le sien",{"thoughts":"The term 'le sien' is a French possessive pronoun, generally used to refer to something that belongs to a previously mentioned masculine noun. It's important for beginners to recognize this as it frequently appears in both spoken and written French.","target_language_multi_word_term":"le sien","meaning":"his, hers, its (referring to a masculine noun).","additional_notes":"Used to refer back to a masculine noun that has been previously mentioned, indicating possession by someone or something else.","target_language_example":"Il a perdu son livre, mais j'ai trouvé le sien.","native_language_example":"He lost his book, but I found his."}]
["le tien",{"thoughts":"'Le tien' is a possessive pronoun in French, often used to indicate possession. It's the masculine singular form and is equivalent to 'yours' when referring to something previously mentioned.","target_language_multi_word_term":"le tien","meaning":"'yours' (masculine).","additional_notes":"'Le tien' is used when referring to a singular masculine noun. It replaces the noun and refers to something that belongs to the person you are talking to.","target_language_example":"Ton livre est sur la table, le tien est à droite.","native_language_example":"Your book is on the table, yours is on the right."}]
["le vôtre",{"thoughts":"'Le vôtre' is a French possessive pronoun used to indicate ownership or belonging and is equivalent to 'yours' in English. It is formal and agrees in gender and number with the noun it replaces.","target_language_multi_word_term":"le vôtre","meaning":"'yours'.","additional_notes":"Used to refer back to something that belongs to the person or people being addressed. 'Le vôtre' is masculine singular, and there are variants ('la vôtre,' 'les vôtres') depending on gender and number.","target_language_example":"Ce livre est le vôtre.","native_language_example":"This book is yours."}]
["là-bas",{"thoughts":"The term 'là-bas' is an adverbial phrase in French that translates to 'over there' in English. It's useful for beginners to learn this phrase when talking about locations that are not close to the speaker.","target_language_multi_word_term":"là-bas","meaning":"'over there'.","additional_notes":"It is commonly used to indicate a distant location in relation to the speaker. It is often used in everyday conversation when pointing out something or describing where something is located relative to where the speaker currently is.","target_language_example":"Regarde là-bas, c'est un château!","native_language_example":"Look over there, it's a castle!"}]
["là-dedans",{"thoughts":"The phrase 'là-dedans' is commonly used in French to indicate something inside a specified location. It combines 'là' (there) and 'dedans' (inside), making it equivalent to saying 'in there' in English.","target_language_multi_word_term":"là-dedans","meaning":"'in there'.","additional_notes":"Used to refer to something located inside a specific place previously mentioned or known to the speaker and listener.","target_language_example":"Il y a quelque chose là-dedans.","native_language_example":"There is something in there."}]
["là-dessus",{"thoughts":"The French term 'là-dessus' literally translates to 'there-on', but it's commonly used to express the concept of 'on that' or 'about that'. It connects a response or action to something previously mentioned, often transitioning to the next topic or dealing with what was said before.","target_language_multi_word_term":"là-dessus","meaning":"'on that' or 'about that'.","additional_notes":"Typically used when referencing something just mentioned and indicating a transition to discussing, explaining, or taking action about it.","target_language_example":"Il y a un rapport sur le bureau, tu peux lire là-dessus.","native_language_example":"There is a report on the desk, you can read about that."}]
["là-haut",{"thoughts":"This term is an adverbial phrase that can describe a physical location, especially in reference to something higher or elevated. It's used in both literal and figurative senses.","target_language_multi_word_term":"là-haut","meaning":"'up there' or 'above'.","additional_notes":"Used to indicate something that is physically or metaphorically above or at a higher place. It can be used in both literal and figurative contexts.","target_language_example":"Il fait froid là-haut dans la montagne.","native_language_example":"It's cold up there in the mountains."}]
["m'en aller",{"thoughts":"The term 'm'en aller' combines 'me' (m') which means 'myself' and 'en aller,' which means 'to go away.' It conveys the notion of leaving or going away from a place. The verb used here is 'aller,' which means 'to go,' and the pronoun 'en' adds the sense of 'from here' to the verb phrase. This phrase is useful in everyday conversation when someone wants to indicate that they are leaving; it is informal and common in spoken French. It is similar to the English phrase 'to be off' or 'to leave.'","target_language_multi_word_term":"m'en aller","meaning":"'to leave' or 'to be off'.","additional_notes":"Used to indicate that the speaker is planning to leave a place. It is a reflexive form and combines 'me' as the reflexive pronoun with 'en aller.' It is informal and commonly used in conversational French.","target_language_example":"Il est temps que je m'en aille.","native_language_example":"It's time for me to leave."}]
["me direz-vous",{"thoughts":"The phrase 'me direz-vous' is in future tense and is a formal way to ask someone if they will tell you something. It typically gets used in formal or polite contexts, such as when addressing someone you don't know very well.","target_language_multi_word_term":"me direz-vous","meaning":"'will you tell me'.","additional_notes":"This phrase is often used in formal or polite conversations and typically appears in a question structure. It addresses expectations for providing information in the future.","target_language_example":"Me direz-vous pourquoi vous êtes en retard?","native_language_example":"Will you tell me why you are late?"}]
["meilleur ami",{"thoughts":"Meilleur ami is a term used to describe someone who holds a special place as your closest friend.","target_language_multi_word_term":"meilleur ami","meaning":"best friend.","additional_notes":"In French, \"meilleur\" means \"best\" and \"ami\" means \"friend\". This term is commonly used to describe a friendship that is stronger and more significant than usual.","target_language_example":"Il est mon meilleur ami depuis l'enfance.","native_language_example":"He has been my best friend since childhood."}]
["merci beaucoup",{"thoughts":"'Merci beaucoup' is a very common French expression used to express gratitude and is equivalent to 'thank you very much' in English. This phrase is essential for polite conversations and is often one of the first things beginners learn when starting to speak French. It consists of 'merci' (thank you) and 'beaucoup' (very much), which together intensify the gratitude expressed.","target_language_multi_word_term":"merci beaucoup","meaning":"'thank you very much'.","additional_notes":"Widely used in both formal and informal contexts to express sincere gratitude. It's an upgrade from simply saying 'merci'.","target_language_example":"Merci beaucoup pour votre aide.","native_language_example":"Thank you very much for your help."}]
["mon Dieu",{"thoughts":"\"Mon Dieu\" is a common French expression used similarly to \"Oh my God\" in English. It is an exclamation that expresses surprise, shock, or strong emotion, both positive and negative. This phrase is typically used in everyday conversations, especially when something unexpected happens.","target_language_multi_word_term":"mon Dieu","meaning":"\"Oh my God\".","additional_notes":"Used to express surprise, shock, or strong feelings in reaction to something unexpected.","target_language_example":"Mon Dieu ! Quel désordre ici !","native_language_example":"Oh my God! What a mess here!"}]
["mon vieux",{"thoughts":"'Mon vieux' is a casual French term often used as an informal way to address a male friend, akin to saying 'buddy' or 'mate' in English. It's literally translated as 'my old' but isn't necessarily about someone's age.","target_language_multi_word_term":"mon vieux","meaning":"'buddy' or 'mate'.","additional_notes":"This term is informal and typically used among friends. While 'vieux' means 'old', in this context, it is used affectionately and doesn't imply age.","target_language_example":"Salut, mon vieux ! Comment ça va ?","native_language_example":"Hi, buddy! How are you?"}]
["même pas",{"thoughts":"The term 'même pas' is a colloquial expression used to emphasize a negation, often equivalent to saying 'not even' in English. It is frequently used to express disbelief or emphasize that something didn't occur.","target_language_multi_word_term":"même pas","meaning":"'not even'.","additional_notes":"Used to emphasize a negative response or to highlight the absence of something, often in a way that conveys surprise or disappointment.","target_language_example":"Il n'est même pas venu.","native_language_example":"He didn't even come."}]
["n'est-ce pas",{"thoughts":"\"N'est-ce pas\" is a commonly used tag question in French. It's equivalent to the English \"isn't it?\" or \"right?\" and is often used at the end of statements to seek confirmation.","target_language_multi_word_term":"n'est-ce pas","meaning":"isn't it?","additional_notes":"Used to confirm or seek agreement from the listener. It transforms a statement into a question.","target_language_example":"Il fait beau aujourd'hui, n'est-ce pas ?","native_language_example":"It's nice out today, isn't it?"}]
["n'importe où",{"thoughts":"'N'importe où' is a French phrase used to mean any place or anywhere. A beginner learner would likely encounter this phrase in everyday conversations when referring to non-specific locations.","target_language_multi_word_term":"n'importe où","meaning":"'anywhere'.","additional_notes":"Commonly used to indicate a non-specific location, similar to 'anyplace' in English. Often used to show indifference or flexibility about location.","target_language_example":"Nous pouvons aller n'importe où pour dîner.","native_language_example":"We can go anywhere for dinner."}]
["n'importe quoi",{"thoughts":"The term 'n'importe quoi' translates to something like 'anything' or 'whatever'. It's often used informally to dismiss something nonsensical or to express disbelief.","target_language_multi_word_term":"n'importe quoi","meaning":"'anything', 'whatever', 'nonsense'.","additional_notes":"It is commonly used to dismiss something as irrelevant or nonsensical. In conversations, it can also imply skepticism or disbelief about something said.","target_language_example":"Ce qu'il dit, c'est vraiment n'importe quoi.","native_language_example":"What he's saying is really nonsense."}]
["ne jamais",{"thoughts":"'Ne jamais' is a phrase used to express 'never' in French. It is a common expression that a beginner will encounter often since it's foundational for negative sentences.","target_language_multi_word_term":"ne jamais","meaning":"'never'.","additional_notes":"Used for negating actions to indicate that they have never happened or are not done.","target_language_example":"Il ne mange jamais de viande.","native_language_example":"He never eats meat."}]
["ne jamais dire jamais",{"thoughts":"The French phrase \"ne jamais dire jamais\" translates to a common English phrase that suggests one should remain open to possibilities. It emphasizes the unpredictability of the future and advises against ruling anything out permanently.","target_language_multi_word_term":"ne jamais dire jamais","meaning":"'never say never'.","additional_notes":"It's an idiomatic expression encouraging openness to future possibilities. Often used when someone makes a definitive statement they might later contradict.","target_language_example":"Il a dit qu'il ne retournerait jamais là-bas, mais je lui ai dit de ne jamais dire jamais.","native_language_example":"He said he'd never go back there, but I told him never to say never."}]
["ne pas",{"thoughts":"'Ne pas' is a basic and essential part of French grammar used in negating verbs. It is crucial for beginners to understand how to form negative sentences.","target_language_multi_word_term":"ne pas","meaning":"'not'.","additional_notes":"Used to make a verb negative. 'Ne' is placed before the verb, and 'pas' follows it.","target_language_example":"Je ne comprends pas.","native_language_example":"I do not understand."}]
["ne personne",{"thoughts":"'Ne personne' is a negation construct in French used to express 'no one' or 'nobody'. It encapsulates both the subject and auxiliary parts of negation and is not to be confused with 'n'importe qui', which means 'anyone'. For beginner learners, it's crucial to understand its positioning in the sentence structure.","target_language_multi_word_term":"ne personne","meaning":"'no one' or 'nobody'.","additional_notes":"Used in negative sentences to express the absence of people. 'Ne' is placed before the verb and 'personne' is placed where it complements the sentence, often after the verb or object.","target_language_example":"Je ne vois personne ici.","native_language_example":"I see no one here."}]
["ne plus",{"thoughts":"'Ne plus' is a negation phrase in French, used to indicate the cessation of an action or state. It's comparable to the English 'no longer' or 'not anymore.' This phrase is essential for beginners to understand as it's commonly used in everyday conversation.","target_language_multi_word_term":"ne plus","meaning":"'no longer' or 'not anymore'.","additional_notes":"'Ne plus' is used to signal that something that was previously happening or in effect is no longer the case. It forms part of a negative expression and requires a verb to provide context.","target_language_example":"Je ne fume plus.","native_language_example":"I don't smoke anymore."}]
["ne que",{"thoughts":"'Ne que' is a limiting construction in French used to express a form of restriction or exclusivity, often translated to English as 'only'. This can be confusing to beginners because it involves a negative particle, but it results in a positive or restricted meaning.","target_language_multi_word_term":"ne que","meaning":"'only'.","additional_notes":"Used to indicate that only the elements specified are involved, similar to 'only' in English. Even though 'ne' is present, it doesn't convey a negative meaning but restricts the sentence to what follows 'que'.","target_language_example":"Je ne mange que des légumes.","native_language_example":"I only eat vegetables."}]
["ne rien",{"thoughts":"'Ne rien' is a French phrase used to form negative sentences, indicating the absence of 'anything' or 'nothing'. It is commonly used in negation along with the verb, enclosing the verb to emphasize negation.","target_language_multi_word_term":"ne rien","meaning":"'nothing' or 'not anything'.","additional_notes":"Used to express a complete lack of something, typically placing 'ne' before the verb and 'rien' after it.","target_language_example":"Je ne vois rien.","native_language_example":"I see nothing."}]
["ne savoir que faire",{"thoughts":"The phrase 'ne savoir que faire' is commonly used in French to express a state of not knowing what to do. It's an expression of uncertainty or confusion. This is useful for learners to understand when people are in situations where they feel lost or unsure.","target_language_multi_word_term":"ne savoir que faire","meaning":"don't know what to do.","additional_notes":"This expression is used when someone feels uncertain or puzzled about what action to take.","target_language_example":"Je ne sais que faire dans cette situation.","native_language_example":"I don't know what to do in this situation."}]
["non plus",{"thoughts":"The term 'non plus' is used in French to express a negative addition, similar to the English phrase 'neither' or 'not either'. It is typically used after a negative statement to indicate agreement with the negativity.","target_language_multi_word_term":"non plus","meaning":"'neither' or 'not either'.","additional_notes":"Used to agree with a negative statement or to add information in a negative context.","target_language_example":"Je n'aime pas ce film, et lui non plus.","native_language_example":"I don't like this movie, and neither does he."}]
["nouveau départ",{"thoughts":"The phrase 'nouveau départ' translates to 'new beginning' or 'new start' in English. It is often used in contexts related to starting over, whether in life, work, relationships, or personal development. Beginners in French might encounter this phrase in motivational contexts or when discussing life changes.","target_language_multi_word_term":"nouveau départ","meaning":"'new start' or 'new beginning'.","additional_notes":"Commonly used to describe a significant change or reset in various aspects of life, such as after a personal or professional setback.","target_language_example":"Après son licenciement, il a décidé de faire un nouveau départ dans une autre ville.","native_language_example":"After his layoff, he decided to make a new start in another city."}]
["ouvrir les yeux",{"thoughts":"\"Ouvrir les yeux\" literally translates to \"open the eyes\" in English. Novice learners might not immediately recognize its figurative meaning as it is often used metaphorically in French to imply becoming aware of something or gaining insight.","target_language_multi_word_term":"ouvrir les yeux","meaning":"\"to open one's eyes\" or \"to realize\".","additional_notes":"Commonly used to express the act of becoming conscious or aware of a reality or truth.","target_language_example":"Il a enfin ouvert les yeux sur ses véritables intentions.","native_language_example":"He has finally become aware of her true intentions."}]
["par exemple",{"thoughts":"The phrase 'par exemple' is commonly used to provide examples or illustrate a point, similar to the English 'for example'. It's a useful phrase for everyday conversation and writing.","target_language_multi_word_term":"par exemple","meaning":"'for example'.","additional_notes":"Used to introduce an example or illustration to clarify or support a preceding statement.","target_language_example":"Vous pouvez visiter plusieurs sites historiques, par exemple, la tour Eiffel ou le Louvre.","native_language_example":"You can visit several historical sites, for example, the Eiffel Tower or the Louvre."}]
["par ici",{"thoughts":"'Par ici' is a common phrase in French, often used to indicate a direction or location close by or in the vicinity. It is useful for beginners to know as it is frequently used in everyday language when giving directions or showing someone a path or location.","target_language_multi_word_term":"par ici","meaning":"'this way' or 'over here'.","additional_notes":"Often used when giving directions or indicating a nearby location. It can mean either 'around this area' or 'in this direction'. It is useful in contexts like showing someone where to go or indicating one's own location.","target_language_example":"La sortie est par ici.","native_language_example":"The exit is this way."}]
["par là",{"thoughts":"The term 'par là' is a prepositional phrase in French used in informal contexts to refer to a nonspecific location or direction.","target_language_multi_word_term":"par là","meaning":"'that way' or 'over there'.","additional_notes":"Used to give directions or indicate a rough location without specifying a precise destination.","target_language_example":"Il faut passer par là pour rejoindre le village.","native_language_example":"You have to go that way to reach the village."}]
["parce que",{"thoughts":"'Parce que' is a common conjunction in French used to provide reasons or explanations, similar to 'because' in English. It's a vital term for beginners to help construct causal sentences.","target_language_multi_word_term":"parce que","meaning":"'because'.","additional_notes":"Used to introduce a reason or cause behind a previously mentioned statement. Essential for forming logical, causal sentences in French.","target_language_example":"Je suis en retard parce que j'ai raté le bus.","native_language_example":"I am late because I missed the bus."}]
["parle de",{"thoughts":"The phrase 'parle de' is commonly used to express speaking about a topic, person, or thing. It is a crucial term for conversations and can be useful for beginners in various contexts.","target_language_multi_word_term":"parle de","meaning":"speaks about","additional_notes":"Used to indicate discussing or mentioning a subject or person.","target_language_example":"Il parle de son voyage en France.","native_language_example":"He speaks about his trip to France."}]
["pas de",{"thoughts":"'Pas de' is a crucial French phrase used to indicate the absence of something. It's frequently used in negative sentences to say 'no' or 'not any'. Beginner learners should recognize this pattern to form negative statements, particularly in contexts like 'no more cookies' or 'not any water', etc.","target_language_multi_word_term":"pas de","meaning":"'no' or 'not any'.","additional_notes":"Used to express the non-existence or absence of something in singular or plural form. In negative sentences, usually placed before a noun.","target_language_example":"Il n'y a pas de lait dans le frigo.","native_language_example":"There is no milk in the fridge."}]
["pas de ça",{"thoughts":"'Pas de ça' is a French phrase that negates or expresses a rejection of something just mentioned. It can be a firm way to refuse or prohibit an action.","target_language_multi_word_term":"pas de ça","meaning":"'none of that' or 'not that'.","additional_notes":"Used to clearly deny or reject something mentioned in a conversation. It can express disapproval or prohibition.","target_language_example":"Je veux commencer à fumer. Réponse : Pas de ça!","native_language_example":"I want to start smoking. Response: None of that!"}]
["pas du tout",{"thoughts":"'Pas du tout' is a common expression in French used to convey strong negation or disagreement with something, similar to saying 'not at all' in English.","target_language_multi_word_term":"pas du tout","meaning":"'not at all'.","additional_notes":"Used to express complete disagreement or to emphasize a negative response.","target_language_example":"Il n'est pas fatigué ? Pas du tout.","native_language_example":"Isn't he tired? Not at all."}]
["pas encore",{"thoughts":"'Pas encore' is a phrase that is useful in everyday conversations, especially when expressing that something has not happened up to the present moment but may happen in the future. It's often used in spoken and written French.","target_language_multi_word_term":"pas encore","meaning":"'not yet'.","additional_notes":"It's used when talking about something that hasn't occurred yet but is expected to happen at some point. This phrase is often used in response to questions regarding the completion or occurrence of an event.","target_language_example":"Je n'ai pas encore fini mes devoirs.","native_language_example":"I haven't finished my homework yet."}]
["pas que",{"thoughts":"'Pas que' is a phrase often used to indicate that there is more than one reason or more than one option, similar to the English phrase 'not just'.","target_language_multi_word_term":"pas que","meaning":"'not just'.","additional_notes":"Used to suggest that something is more than what is initially perceived or mentioned. It often follows a statement to imply that there are additional factors or elements.","target_language_example":"Je suis fatigué, pas que à cause du travail.","native_language_example":"I'm tired, not just because of work."}]
["penser de",{"thoughts":"'Penser de' is a common French expression used to ask for someone's opinion about something. It often appears in questions.","target_language_multi_word_term":"penser de","meaning":"'to think of/about'.","additional_notes":"Used when inquiring about someone's opinion or thoughts on a particular subject or person.","target_language_example":"Que penses-tu de ce film ?","native_language_example":"What do you think about this movie?"}]
["penser à",{"thoughts":"\"Penser à\" is a useful French phrase that expresses the idea of thinking about someone or something. It's a basic yet important phrase for beginners to communicate thoughts or considerations involving specific people or situations.","target_language_multi_word_term":"penser à","meaning":"'to think about' someone or something.","additional_notes":"It is used when you are considering or giving thought to a person, situation, or idea. It indicates a focus or preoccupation with the object following 'à'.","target_language_example":"Je pense à mes amis.","native_language_example":"I am thinking about my friends."}]
["petit ami",{"thoughts":"'Petit ami' is a term used in French for a romantic male partner, typically equivalent to the English term 'boyfriend'. A beginner learner should know that this phrase involves two words and it's important to understand the gendered nature of French nouns, as 'petit amie' would refer to a girlfriend.","target_language_multi_word_term":"petit ami","meaning":"'boyfriend', a male romantic partner.","additional_notes":"This phrase is gender-specific and refers to a male romantic partner. 'Petit' means small or little, and 'ami' means friend. Together, colloquially, they refer to a boyfriend.","target_language_example":"Marie a rencontré son petit ami au lycée.","native_language_example":"Marie met her boyfriend in high school."}]
["petite amie",{"thoughts":"The French term 'petite amie' means 'girlfriend'. It literally translates to 'little friend', but in the context of relationships, it refers to a romantic partner who is female. This term appears frequently in conversations about relationships and is important for understanding interpersonal dynamics in French-speaking regions.","target_language_multi_word_term":"petite amie","meaning":"girlfriend.","additional_notes":"Used to describe a female romantic partner. It can be used informally among friends or in more formal contexts.","target_language_example":"Il a une nouvelle petite amie.","native_language_example":"He has a new girlfriend."}]
["peu importe",{"thoughts":"The phrase 'peu importe' is used to express indifference or lack of concern about the specifics of something.","target_language_multi_word_term":"peu importe","meaning":"'it doesn't matter' or 'never mind'.","additional_notes":"Used to indicate that the specifics of a situation are not important or significant. Often utilized to convey nonchalance or to downplay the importance of a detail.","target_language_example":"Peu importe ce qu'il a dit, allons-y.","native_language_example":"It doesn't matter what he said, let's go."}]
["peu importer",{"thoughts":"The phrase 'peu importer' is commonly used to express that something does not matter or is of little importance. It reflects a nonchalant or indifferent attitude, useful for a learner to understand when discussing preferences or priorities.","target_language_multi_word_term":"peu importer","meaning":"'no matter' or 'it doesn't matter'.","additional_notes":"Used to indicate that something is irrelevant or insignificant to the situation.","target_language_example":"Peu importe ce qu'il dit.","native_language_example":"It doesn't matter what he says."}]
["peut-être",{"thoughts":"'Peut-être' is a common French adverb that equates to 'maybe' or 'perhaps' in English. It is often used to express uncertainty or possibility about an action or situation.","target_language_multi_word_term":"peut-être","meaning":"'maybe' or 'perhaps'.","additional_notes":"This term is used to indicate uncertainty or a possibility, similar to 'maybe' or 'perhaps' in English. It is a versatile word that can be used in a variety of sentences involving speculation or doubt.","target_language_example":"Peut-être qu'il va pleuvoir demain.","native_language_example":"Maybe it will rain tomorrow."}]
["pourquoi pas",{"thoughts":"'Pourquoi pas' is a common French expression used to give a noncommittal affirmative or to suggest that something is possible.","target_language_multi_word_term":"pourquoi pas","meaning":"'why not'.","additional_notes":"This expression is often used to show openness or willingness to try or consider something.","target_language_example":"On pourrait aller au cinéma ce soir. - Pourquoi pas ?","native_language_example":"We could go to the movies tonight. - Why not?"}]
["première fois",{"thoughts":"'Première fois' translates to 'first time' and is used to describe an initial occurrence or experience.","target_language_multi_word_term":"première fois","meaning":"first time.","additional_notes":"This phrase is commonly used to express that something is happening for the first time. It can be used both in literal and metaphorical contexts.","target_language_example":"C'est ma première fois en France.","native_language_example":"This is my first time in France."}]
["prendre note",{"thoughts":"The phrase 'prendre note' is useful for beginners as it is commonly used in both formal and informal contexts to express the idea of taking notes or acknowledging information. It's a direct activity that is often relatable in both learning environments and professional settings.","target_language_multi_word_term":"prendre note","meaning":"'take note' or 'to note'.","additional_notes":"Used to indicate the act of writing down information or acknowledging an important point. Common in academic and professional situations.","target_language_example":"Je vais prendre note des points importants de la réunion.","native_language_example":"I will take note of the important points from the meeting."}]
["prendre place",{"thoughts":"The phrase 'prendre place' is used to describe the act of sitting down or occupying a seat, similar to 'take a seat' in English, and can also mean 'to happen' or 'to occur'. This is relevant for events or situations.","target_language_multi_word_term":"prendre place","meaning":"'to take place' or 'to happen'.","additional_notes":"Often used in formal contexts to indicate the start of an event or for someone to sit down. It's a versatile phrase useful for both casual and formal situations.","target_language_example":"La réunion prendra place dans la salle de conférence à 15 heures.","native_language_example":"The meeting will take place in the conference room at 3 PM."}]
["prendre soin",{"thoughts":"The expression 'prendre soin' means 'to take care' in French. It can be used in various contexts, such as looking after someone or something, or ensuring that an action is done carefully. This phrase combines the verb 'prendre' (to take) with 'soin' (care), and it's important for learners to recognize this structured way of expressing caring or careful actions.","target_language_multi_word_term":"prendre soin","meaning":"'to take care'.","additional_notes":"Used when talking about caring for someone or something or being careful with something. Can refer to both physical care and metaphorical or emotional care.","target_language_example":"Il faut prendre soin de sa santé.","native_language_example":"You must take care of your health."}]
["prendre un verre",{"thoughts":"'Prendre un verre' is a colloquial French expression that literally means 'to take a glass', but it commonly refers to going out for a drink, usually alcoholic.","target_language_multi_word_term":"prendre un verre","meaning":"'have a drink'.","additional_notes":"Used in social contexts, similar to saying 'grab a drink' in English. It implies going out for drinks with friends, colleagues, or acquaintances.","target_language_example":"On pourrait prendre un verre ce soir.","native_language_example":"We could have a drink tonight."}]
["puis-je",{"thoughts":"The phrase 'puis-je' is a polite and formal way of asking for permission in French, often used in formal settings or written communication. It is important for beginners to learn as it's akin to asking 'may I' in English, which is essential in polite exchanges.","target_language_multi_word_term":"puis-je","meaning":"'may I'","additional_notes":"Used to formally ask for permission or introduce a polite question. It is the inversion of 'je puis', which is an older and more formal form of 'je peux'.","target_language_example":"Puis-je utiliser votre téléphone ?","native_language_example":"May I use your phone?"}]
["qu'aurez-vous",{"thoughts":"'Qu'aurez-vous' is a formal phrase typically used in questions about future actions or states, equivalent to 'what will you have' in English. It's a future tense construction in French.","target_language_multi_word_term":"qu'aurez-vous","meaning":"'what will you have'","additional_notes":"This phrase is often used in polite or formal settings, such as when ordering food or making inquiries about future plans or possessions.","target_language_example":"Au restaurant : Qu'aurez-vous comme dessert ?","native_language_example":"At the restaurant: What will you have for dessert?"}]
["qu'auriez-vous",{"thoughts":"The phrase 'qu'auriez-vous' is used in questions to formulate polite inquiries or hypothetical scenarios in formal or polite language.","target_language_multi_word_term":"qu'auriez-vous","meaning":"'what would you have?' (conditional).","additional_notes":"This phrase is typically used to ask someone about their preferences or choices in hypothetical situations. It's often utilized in more formal or polite contexts.","target_language_example":"Qu'auriez-vous fait à ma place ?","native_language_example":"What would you have done in my place?"}]
["qu'aviez-vous",{"thoughts":"This is a formal way to ask someone what they had in French, using inversion for questions in the imparfait tense. It would be commonly used when asking about past possessions or situations.","target_language_multi_word_term":"qu'aviez-vous","meaning":"'what did you have?'","additional_notes":"This question is in the imperfect tense, used when talking about an ongoing situation in the past. It is a formal question due to the use of 'vous'.","target_language_example":"Qu'aviez-vous comme voiture à l'époque ?","native_language_example":"What car did you have at the time?"}]
["qu'est-ce qu'il y a",{"thoughts":"The phrase 'qu'est-ce qu'il y a' is a common French question equivalent to the English 'what is there' or 'what's wrong'. It is often used colloquially to inquire about the state of things or to ask what's happening.","target_language_multi_word_term":"qu'est-ce qu'il y a","meaning":"'what is there' or 'what's wrong'.","additional_notes":"Used when asking about the presence of something or the reason for a situation. It can be used in various contexts, from checking if something is present to inquiring about a problem or situation.","target_language_example":"Qu'est-ce qu'il y a dans ce sac?","native_language_example":"What is there in this bag?"}]
["qu'est-ce que",{"thoughts":"Common question phrase used to ask 'what…?' in everyday French. Literally 'what is it that,' but functionally just 'what'. Often followed by a subject + verb to form open questions.","target_language_multi_word_term":"qu'est-ce que","meaning":"‘what (is it that)…?’","additional_notes":"Placed at the start of a question to ask about an object, idea, or action. Follow it with subject + verb: Qu'est-ce que + subject + verb ? Spoken more than written questions with inversion.","target_language_example":"Qu'est-ce que tu fais ce soir ?","native_language_example":"What are you doing tonight?"}]
["qu'est-ce que c'est",{"thoughts":"'Qu'est-ce que c'est' is a basic, essential question in French used to ask for explanations or to identify objects. Its literal meaning translates to 'what is it?' and it is frequently used by French learners influencing their language acquisition.","target_language_multi_word_term":"qu'est-ce que c'est","meaning":"'what is it?'","additional_notes":"Commonly used to ask for the identity or nature of a thing, often when you are unsure or learning. It's a staple in beginner conversations.","target_language_example":"Qu'est-ce que c'est ce bruit?","native_language_example":"What is that noise?"}]
["qu'est-ce qui",{"thoughts":"Qu'est-ce qui is a French question phrase used to ask about the subject of a sentence, usually meaning 'what'. It's a key phrase in forming questions in French and useful for beginner learners who want to ask what is happening or being referred to.","target_language_multi_word_term":"qu'est-ce qui","meaning":"'what' (subject of the sentence).","additional_notes":"Used in questions to ask about the subject of a verb, often inquiring the cause or reason for something.","target_language_example":"Qu'est-ce qui se passe ici ?","native_language_example":"What is happening here?"}]
["qu'eûtes-vous",{"thoughts":"The term 'qu'eûtes-vous' is an inverted form used for questions in past historic tense, which is not commonly used in spoken French but may appear in literature or formal writing. Beginner learners may benefit from understanding its structure and context of use.","target_language_multi_word_term":"qu'eûtes-vous","meaning":"\"what did you have\", in past historic tense.","additional_notes":"This phrase structure is typically used in formal or literary contexts. The past historic tense (passé simple) is generally found in written narratives. In spoken French, you'll use the passé composé instead, such as 'qu'avez-vous eu ?' for the same meaning in a more conversational setting.","target_language_example":"Qu'eûtes-vous pour le dîner hier soir ?","native_language_example":"What did you have for dinner last night?"}]
["qu'y a-t-il",{"thoughts":"The French phrase 'qu'y a-t-il' is an interrogative construction used to ask what is present or what exists in a particular situation. It is an inversion of the phrase 'il y a' used for forming questions.","target_language_multi_word_term":"qu'y a-t-il","meaning":"'what is there?'","additional_notes":"Used to ask what exists or is happening in a certain place or situation. Often used when inquiring about the presence or state of something.","target_language_example":"Qu'y a-t-il dans le sac?","native_language_example":"What is there in the bag?"}]
["quand même",{"thoughts":"The French phrase 'quand même' is used for a variety of expressions indicating concession or emphasis. It's quite common in daily conversation and its use can be nuanced, meaning anything like 'all the same', 'nevertheless', or 'anyway'. Beginners might hear it often and benefit from understanding its flexible use.","target_language_multi_word_term":"quand même","meaning":"'all the same', 'nevertheless', 'anyway'.","additional_notes":"Used to express a concession, an unexpected result, or to emphasize a point, often reflecting surprise or persistence.","target_language_example":"Il pleuvait, mais nous sommes sortis quand même.","native_language_example":"It was raining, but we went out anyway."}]
["que de",{"thoughts":"The phrase 'que de' is used for emphasis, indicating a large quantity or a lot of something. It often precedes a plural noun to express an intense feeling or surprise about the abundance of something.","target_language_multi_word_term":"que de","meaning":"'so many/much'.","additional_notes":"Used to emphasize the abundance or high quantity of something. Often indicates surprise or admiration.","target_language_example":"Que de gens à la fête !","native_language_example":"So many people at the party!"}]
["que dis-je",{"thoughts":"The French phrase 'que dis-je' is often used as a rhetorical device to emphasize or correct something previously said. It's similar to saying \"what am I saying?\" and can suggest a moment of self-correction or adding emphasis.","target_language_multi_word_term":"que dis-je","meaning":"\"what am I saying?\" or \"let me correct myself.\"","additional_notes":"Often used rhetorically or to emphasize that a correction or clarification is about to be made.","target_language_example":"Je suis fatigué, que dis-je, épuisé après ce voyage.","native_language_example":"I am tired, what am I saying, exhausted after this trip."}]
["que je sache",{"thoughts":"'Que je sache' is a French expression often used to suggest that to the speaker's knowledge, something is true or correct. It's used to express a degree of uncertainty or to clarify that the statement is based on the speaker's current understanding.","target_language_multi_word_term":"que je sache","meaning":"'as far as I know'.","additional_notes":"This phrase is commonly used to indicate a lack of absolute certainty about information being given. It's a way to moderately express what you believe to be true.","target_language_example":"Que je sache, elle n'est pas encore arrivée.","native_language_example":"As far as I know, she hasn't arrived yet."}]
["que tu crois",{"thoughts":"The phrase 'que tu crois' is often used in relative clauses or in expressing doubt or assumption. It's a versatile construction where 'que' functions as a conjunction, linking clauses together, and 'tu crois' means 'you believe'.","target_language_multi_word_term":"que tu crois","meaning":"'that you believe' or 'you think'.","additional_notes":"Used to express a belief or thought. Often part of a larger construction where it introduces something that the speaker assumes or suspects.","target_language_example":"C'est possible que tu crois que j'ai tort, mais je suis sûr de ce fait.","native_language_example":"It's possible that you believe I'm wrong, but I'm sure of this fact."}]
["que veux-tu",{"thoughts":"\"Que veux-tu\" is a common phrase used to ask what someone wants, structured in the informal inversion format, suitable for beginner learners to understand due to its frequent use in daily conversation.","target_language_multi_word_term":"que veux-tu","meaning":"'what do you want?'","additional_notes":"Used in informal contexts to ask someone about their desires or preferences. It is a direct question and uses inversion, swapping the subject ('you') and verb ('want').","target_language_example":"Que veux-tu pour le dîner ?","native_language_example":"What do you want for dinner?"}]
["que voulez-vous",{"thoughts":"The phrase 'que voulez-vous' is a common way to ask what someone wants in a formal context. It's useful for business or polite situations.","target_language_multi_word_term":"que voulez-vous","meaning":"'what do you want?' (formal).","additional_notes":"Used to politely inquire about someone's desires or requests. Appropriate for formal or respectful situations.","target_language_example":"Que voulez-vous boire ?","native_language_example":"What would you like to drink?"}]
["quelqu'un",{"thoughts":"\"Quelqu'un\" is a French pronoun used to refer to an unspecified person. It's important for beginner learners to understand this as it is frequently used in everyday conversations.","target_language_multi_word_term":"quelqu'un","meaning":"someone, anyone.","additional_notes":"Used when referring to an unspecified or unknown person. Can be used in both affirmative and interrogative sentences.","target_language_example":"Est-ce que quelqu'un peut m'aider ?","native_language_example":"Can someone help me?"}]
["quelque chose",{"thoughts":"\"Quelque chose\" is a common phrase used to refer to some unspecified thing. It's equivalent to \"something\" in English and is often helpful for beginners when they don't know or can't recall a specific word.","target_language_multi_word_term":"quelque chose","meaning":"\"something.\"","additional_notes":"It is a noun phrase used to indicate an indefinite or unspecified object or thing. Very useful in everyday conversations when discussing general topics.","target_language_example":"J'ai besoin de quelque chose pour écrire.","native_language_example":"I need something to write with."}]
["quelque part",{"thoughts":"'Quelque part' literally translates to 'somewhere' in English and is used to express an indeterminate location. This phrase is often used when the exact location is unknown or irrelevant.","target_language_multi_word_term":"quelque part","meaning":"somewhere.","additional_notes":"Used to refer to an unspecified or unknown location.","target_language_example":"J'ai laissé mes clés quelque part dans la maison.","native_language_example":"I left my keys somewhere in the house."}]
["qui parle",{"thoughts":"'Qui parle' is commonly used to ask or identify who is speaking. It's useful in everyday conversations, particularly on the phone or in meetings.","target_language_multi_word_term":"qui parle","meaning":"'who is speaking'","additional_notes":"Typically used to inquire about the person speaking, especially in phone conversations or other settings where the speaker is not visible.","target_language_example":"Excusez-moi, qui parle ?","native_language_example":"Excuse me, who is speaking?"}]
["qui sait",{"thoughts":"'Qui sait' is a phrase used in French to express uncertainty or speculate about a situation, similar to saying 'who knows' in English.","target_language_multi_word_term":"qui sait","meaning":"'who knows'.","additional_notes":"Used when the speaker is uncertain or when the result of a situation is uncertain. It can reflect doubt, speculation, or resignation about the unknown.","target_language_example":"Peut-être qu'il viendra demain. Qui sait ?","native_language_example":"Maybe he'll come tomorrow. Who knows?"}]
["qui voilà",{"thoughts":"'Qui voilà' is generally used to express recognition or surprise upon someone's arrival. It's similar to the English phrase 'Look who's here!'.","target_language_multi_word_term":"qui voilà","meaning":"'Look who's here!'","additional_notes":"This phrase is used when you see someone unexpectedly or want to draw attention to someone's arrival.","target_language_example":"Ah, qui voilà ! C'est toi, Jean !","native_language_example":"Ah, look who's here! It's you, Jean!"}]
["quoi de neuf",{"thoughts":"'Quoi de neuf' is a casual French greeting used to ask about what's new in someone's life. It's similar to asking 'what's up?' in English, making it useful in informal conversations. Beginners will need to understand it as a form of greeting.","target_language_multi_word_term":"quoi de neuf","meaning":"'what's new?'","additional_notes":"Commonly used as an informal greeting among friends, and indicates curiosity about recent happenings.","target_language_example":"Salut, quoi de neuf ?","native_language_example":"Hi, what's new?"}]
["quoi faire",{"thoughts":"'Quoi faire' translates to 'what to do' in English. It is commonly used to express uncertainty or a decision point, often seen in situations where someone is questioning what action to take next.","target_language_multi_word_term":"quoi faire","meaning":"'what to do'.","additional_notes":"Used when considering options or when faced with indecision. Often used in situations when asking for suggestions or guidance.","target_language_example":"Je ne sais pas quoi faire.","native_language_example":"I don't know what to do."}]
["rendez-vous",{"thoughts":"The term 'rendez-vous' is a French phrase commonly used in English as well, meaning 'meeting' or 'appointment.' It's universally applicable whether in a formal or informal context, often used in scheduling or planning scenarios.","target_language_multi_word_term":"rendez-vous","meaning":"meeting or appointment.","additional_notes":"Used for both informal meet-ups with friends or formal appointments, such as with doctors or for business.","target_language_example":"J'ai un rendez-vous chez le médecin demain.","native_language_example":"I have a doctor's appointment tomorrow."}]
["rendre compte",{"thoughts":"The French term 'rendre compte' is often used in contexts related to reporting or explaining a situation. It's a phrasal verb that carries a similar meaning to 'realize' or 'report on.'","target_language_multi_word_term":"rendre compte","meaning":"'to report', 'to give an account'.","additional_notes":"Typically used in formal or professional settings when one needs to provide details about an event or situation to others. It can also mean to realize or become aware of something when used reflexively as 'se rendre compte.'","target_language_example":"Il doit rendre compte de ses actions au conseil.","native_language_example":"He must report on his actions to the board."}]
["rien que",{"thoughts":"'Rien que' is a French expression used to imply exclusivity or limitation. It's akin to saying 'just' or 'only'. Often, it's part of a bigger statement that underscores it's the sole reason or component involved. This phrase might come up in daily life to underline the exclusiveness of an action or request.","target_language_multi_word_term":"rien que","meaning":"'just' or 'only'.","additional_notes":"It emphasizes exclusivity or limitation, often used to highlight that something is sufficient on its own.","target_language_example":"Il a dépensé 100 euros, rien que pour des bonbons.","native_language_example":"He spent 100 euros just on candies."}]
["rien à voir",{"thoughts":"The phrase 'rien à voir' is used in French to indicate that something has no relation or connection to something else. It's common in everyday conversation to dismiss or refute a supposed link between two topics or objects.","target_language_multi_word_term":"rien à voir","meaning":"'nothing to do with' or 'no connection'.","additional_notes":"Used to express that two things are unrelated. Often used to deny or clarify misunderstandings.","target_language_example":"Ce qu'il dit n'a rien à voir avec la réalité.","native_language_example":"What he's saying has nothing to do with reality."}]
["s'en aller",{"thoughts":"The term 's'en aller' is a reflexive verb in French that signifies leaving or going away.","target_language_multi_word_term":"s'en aller","meaning":"to go away, to leave.","additional_notes":"It's a pronominal verb where 'en' refers to the place you're leaving. It is often used informally.","target_language_example":"Il est temps de s'en aller.","native_language_example":"It's time to leave."}]
["s'il te plaît",{"thoughts":"'S'il te plaît' is a polite expression in French used to make a request or ask for assistance. It is a fundamental part of polite conversation.","target_language_multi_word_term":"s'il te plaît","meaning":"'please'.","additional_notes":"Used in informal settings, when addressing someone you are on familiar terms with (i.e., 'tu' form). Equivalent to 'please' in English when speaking to friends or family.","target_language_example":"Pourrais-tu passer le sel, s'il te plaît?","native_language_example":"Could you pass the salt, please?"}]
["s'il vous plaît",{"thoughts":"S'il vous plaît is a polite phrase used to make requests or ask for something. It's important to be aware that it uses the formal 'vous' and should be used accordingly.","target_language_multi_word_term":"s'il vous plaît","meaning":"'please'.","additional_notes":"Used to make polite requests, it literally means 'if it pleases you'. The phrase uses the formal 'vous', so it's suitable for addressing strangers, superiors, or anyone you'd speak to formally.","target_language_example":"Pouvez-vous m'aider, s'il vous plaît ?","native_language_example":"Can you help me, please?"}]
["sa mère",{"thoughts":"'Sa mère' is a common way in French to refer to someone's mother, but it can also be used as slang to express strong feelings or surprise.","target_language_multi_word_term":"sa mère","meaning":"his/her mother.","additional_notes":"It can indicate possession of either a male or female subject depending on the context. In slang, 'sa mère' is often used to express shock or exasperation, similar to 'damn' or 'oh my God' in English.","target_language_example":"Il a dit ça à sa mère.","native_language_example":"He said that to his mother."}]
["sais pas",{"thoughts":"The phrase 'sais pas' is a colloquial contraction of 'je ne sais pas', frequently used in spoken French to mean 'I don't know'. Beginner learners should recognize this informal use as it's common in conversation.","target_language_multi_word_term":"sais pas","meaning":"'don't know'.","additional_notes":"An informal, shortened version of 'je ne sais pas', used in casual conversation. It omits the subject pronoun and the negation particle.","target_language_example":"Sais pas pourquoi il est en retard.","native_language_example":"Don't know why he is late."}]
["sais-tu",{"thoughts":"The term 'sais-tu' is a question phrase that directly translates to 'do you know' in English. It's used to inquire if someone has knowledge or information about something.","target_language_multi_word_term":"sais-tu","meaning":"'do you know'.","additional_notes":"Used to ask if someone is aware of or knows a fact, person, or event. It is the informal second-person singular form, relevant when speaking to someone you address as 'tu'.","target_language_example":"Sais-tu où est la bibliothèque ?","native_language_example":"Do you know where the library is?"}]
["se faire",{"thoughts":"'Se faire' is a reflexive verb construction often used to describe actions that happen to oneself, or to describe changes or states. It can be used in various contexts, making it an important phrase to understand for beginner learners of French.","target_language_multi_word_term":"se faire","meaning":"'to get' or 'to become'.","additional_notes":"Often used to express undergoing an action or becoming something. It highlights a transition or resulting condition. Can be used in numerous expressions such as 'se faire mal' (to hurt oneself) or 'se faire tard' (to get late).","target_language_example":"Il s'est fait mal en tombant.","native_language_example":"He hurt himself by falling."}]
["se passer",{"thoughts":"'Se passer' is a reflexive verb commonly used in French to describe events occurring, often in terms of time and place, similar to 'happen', 'pass', or 'occur'. It is frequently used in conversational and written French to talk about events or situations.","target_language_multi_word_term":"se passer","meaning":"to happen or occur.","additional_notes":"This term is used to talk about situations or events taking place, typically requiring a subject but not always detailing an agent. Often used in the context of events, incidents or things unfolding.","target_language_example":"Qu'est-ce qui s'est passé ici ?","native_language_example":"What happened here?"}]
["si ce n'est",{"thoughts":"'Si ce n'est' is a French phrase typically used to express an exception or to mean 'if not' or 'unless it is'. It can be used to introduce a contrast or highlight an exception to what was previously said.","target_language_multi_word_term":"si ce n'est","meaning":"'if not', 'except' or 'unless it is'.","additional_notes":"It is used to contrast an exception to a general rule or statement that has just been provided.","target_language_example":"Tout le monde était présent, si ce n'est Jean.","native_language_example":"Everyone was present, except Jean."}]
["si fait",{"thoughts":"'Si fait' is a somewhat archaic French expression used to give a positive reply to a negative question or statement, equivalent to saying 'yes, indeed' or 'yes, actually' in English.","target_language_multi_word_term":"si fait","meaning":"'yes, indeed' or 'yes, actually'.","additional_notes":"This expression is not commonly used in modern French, but you may encounter it in literature or historical contexts.","target_language_example":"- Tu n'as pas fait tes devoirs ? - Si fait, je les ai finis hier soir.","native_language_example":"- You didn’t do your homework? - Yes, indeed, I finished them last night."}]
["sortir de",{"thoughts":"'Sortir de' is a French verb phrase that constructs sentences about leaving or exiting from a specific place. It is important for learners to distinguish it from 'sortir,' which simply means to go out.","target_language_multi_word_term":"sortir de","meaning":"'to exit from' or 'to go out of'.","additional_notes":"It is used to indicate leaving or exiting a specific place or situation. Often followed by a noun indicating where you are exiting from.","target_language_example":"Il est sorti de la maison très tôt.","native_language_example":"He left the house very early."}]
["sortir ensemble",{"thoughts":"The phrase 'sortir ensemble' in French is commonly used in social contexts to describe going out together, often as a couple or dating. It's relevant for a beginner learner to understand its social implications and context.","target_language_multi_word_term":"sortir ensemble","meaning":"to go out together (often romantically).","additional_notes":"Used to describe romantic or date-like outings, but can also mean just going out together in other contexts.","target_language_example":"Ils ont commencé à sortir ensemble il y a deux mois.","native_language_example":"They started going out together two months ago."}]
["ta mère",{"thoughts":"\"Ta mère\" literally translates to \"your mother\" and can be used both literally to refer to someone's mother and in a more informal way as part of jokes or insults.","target_language_multi_word_term":"ta mère","meaning":"\"your mother\".","additional_notes":"Literally refers to someone's mother. In informal contexts, it can be used humorously or offensively, similar to 'yo mama' jokes in English.","target_language_example":"J'ai parlé à ta mère hier.","native_language_example":"I spoke to your mother yesterday."}]
["tant mieux",{"thoughts":"The expression 'tant mieux' is a commonly used phrase in French that conveys a sense of relief, satisfaction, or approval. It's often used in response to good news or when something turns out better than expected.","target_language_multi_word_term":"tant mieux","meaning":"'so much the better' or 'all the better'.","additional_notes":"Used to express contentment or approval when a situation turns out favorably or when something goes well. Often used in conversational settings.","target_language_example":"On a trouvé une place de parking juste devant le restaurant. Tant mieux !","native_language_example":"We found a parking spot right in front of the restaurant. All the better!"}]
["tenir au courant",{"thoughts":"\"Tenir au courant\" is a French expression used to indicate keeping someone informed or updated. It's a casual phrase, often heard in everyday conversation, making it relevant for beginners learning real-life language use.","target_language_multi_word_term":"tenir au courant","meaning":"to keep informed or updated.","additional_notes":"Used to express the act of keeping someone in the loop about developments. Common in both informal and formal settings.","target_language_example":"Je te tiendrai au courant des avancements.","native_language_example":"I'll keep you updated on the progress."}]
["tenir le coup",{"thoughts":"The term 'tenir le coup' is an idiomatic expression in French, which literally translates to 'hold the blow', but it's used more metaphorically. It means to endure, survive, or hold up in difficult situations, similar to the English phrase 'keep it together' or 'hang in there'. This phrase could be particularly relevant for beginner learners when expressing resilience.","target_language_multi_word_term":"tenir le coup","meaning":"'to hold up' or 'to endure'.","additional_notes":"Used to describe staying strong or maintaining one's composure through challenging times or circumstances.","target_language_example":"Malgré tous les problèmes, il arrive à tenir le coup.","native_language_example":"Despite all the problems, he's managing to hold up."}]
["toi-même",{"thoughts":"'Toi-même' is a French reflexive pronoun phrase commonly used for emphasis, typically meaning 'yourself' or to refer back to the person spoken to. In conversation, it can be used to highlight or respond in a specific context.","target_language_multi_word_term":"toi-même","meaning":"'yourself'.","additional_notes":"It is used to refer to the second person singular reflexively or for emphasis. Often employed in conversations for emphasis or to return a compliment.","target_language_example":"Prends soin de toi-même.","native_language_example":"Take care of yourself."}]
["tous les deux",{"thoughts":"The phrase 'tous les deux' translates directly to 'both' in English. It is used to refer to two people, objects, or concepts simultaneously. It's a common phrase for expressing inclusion of both items or individuals in conversation and applies to contexts where ensuring both parties are acknowledged is important.","target_language_multi_word_term":"tous les deux","meaning":"both","additional_notes":"Used to refer to two people or things together, often after a plural noun or pronoun. It emphasizes inclusion or the involvement of both entities mentioned.","target_language_example":"Ils sont tous les deux fatigués.","native_language_example":"They are both tired."}]
["tout ce qui",{"thoughts":"The phrase 'tout ce qui' is commonly used in French to refer to 'all that' or 'everything that.' It introduces relative clauses describing a broader set or entire category of things.","target_language_multi_word_term":"tout ce qui","meaning":"'all that' or 'everything that'.","additional_notes":"Used to refer broadly to all items or actions in a category, often introducing a clause that provides further detail.\n\nNote that 'tout ce qui' is usually followed by a clause that describes what is included in 'everything that.'","target_language_example":"J'aime tout ce qui est sucré.","native_language_example":"I like everything that is sweet."}]
["tout comme",{"thoughts":"The phrase 'tout comme' is used in French to express similarity or likeness, often equivalent to saying 'just like' or 'as well as' in English. Beginner learners should understand it as a way to relate two things by likeness.","target_language_multi_word_term":"tout comme","meaning":"'just like' or 'as well as'.","additional_notes":"Used to indicate that something is similar to another thing, often emphasizing the similarity or equality between the two.","target_language_example":"Elle danse tout comme sa mère.","native_language_example":"She dances just like her mother."}]
["tout de suite",{"thoughts":"'Tout de suite' is a phrase beginners might hear often, especially in conversational settings. It's helpful for understanding when someone wants something done immediately or as soon as possible. Learning this expression can help in daily communication and in situations where timing is important.","target_language_multi_word_term":"tout de suite","meaning":"immediately or right away.","additional_notes":"Used to indicate that something should be done without delay. It can vary slightly in urgency based on context but generally implies prompt action.","target_language_example":"Je vais le faire tout de suite.","native_language_example":"I will do it right away."}]
["tout droit",{"thoughts":"'Tout droit' is a directional phrase used in French that translates to going straight ahead. It's commonly used for giving directions and is essential for beginners learning navigation-related vocabulary.","target_language_multi_word_term":"tout droit","meaning":"'straight ahead'.","additional_notes":"The phrase is often used in the context of giving directions or explaining routes. It's straightforward, indicating the path should not deviate.","target_language_example":"Continuez tout droit jusqu'à la deuxième rue.","native_language_example":"Continue straight ahead until the second street."}]
["tout le monde",{"thoughts":"The term 'tout le monde' is a common expression in French to refer to 'everyone' or 'everybody'. It is a basic phrase useful in everyday conversation and often appears when talking about people collectively.","target_language_multi_word_term":"tout le monde","meaning":"'everyone' or 'everybody'.","additional_notes":"Used to refer to all people collectively in a group or situation. It's a standard phrase to know when discussing general actions or events involving groups of people.","target_language_example":"Tout le monde est prêt ?","native_language_example":"Is everyone ready?"}]
["tout le temps",{"thoughts":"'Tout le temps' is a commonly used French phrase which means 'all the time' or 'always'. It's a helpful phrase for beginners to express frequency and repetition.","target_language_multi_word_term":"tout le temps","meaning":"'all the time' or 'always'.","additional_notes":"Used to describe something that happens frequently or continuously.","target_language_example":"Il pleut tout le temps ici.","native_language_example":"It rains all the time here."}]
["tout à fait",{"thoughts":"\"Tout à fait\" is a common French expression used to express complete agreement or to confirm something similar to 'absolutely' or 'exactly'. It's often used in conversation to affirm and support another person's statement.","target_language_multi_word_term":"tout à fait","meaning":"'completely', 'absolutely', or 'exactly'.","additional_notes":"Used to express total agreement or confirmation. It can emphasize understanding or correctness of a statement.","target_language_example":"C'est tout à fait vrai.","native_language_example":"That's absolutely true."}]
["tout à l'heure",{"thoughts":"The French expression 'tout à l'heure' is often used to refer to a relative time shortly before or after the present moment. This phrase would be useful for learners to understand since it's quite common in casual conversation.","target_language_multi_word_term":"tout à l'heure","meaning":"soon, a while ago.","additional_notes":"It can mean 'a while ago' when referring to past events or 'soon' for future events, depending on the context of the conversation.","target_language_example":"Je l'ai vu tout à l'heure.","native_language_example":"I saw him a while ago."}]
["tout ça",{"thoughts":"The term 'tout ça' is an informal phrase used in everyday conversation. It refers to all that or all of that, often used to summarize something previously mentioned.","target_language_multi_word_term":"tout ça","meaning":"'all that'.","additional_notes":"'Tout ça' is often used informally to refer to previously discussed topics or situations. It's a way to gesture towards a collection of items or ideas without listing them all again.","target_language_example":"Il dit qu'il va déménager, quitter son job, tout ça.","native_language_example":"He says he's going to move, quit his job, all that."}]
["trop de",{"thoughts":"The phrase 'trop de' is often used in French to express an excess of something. It is frequently used in daily conversation to describe quantities that exceed what is considered normal or desirable. It is similar to the English construction 'too much of' or 'too many of', followed by a noun. This phrase can refer to countable or uncountable quantities.","target_language_multi_word_term":"trop de","meaning":"'too much of' or 'too many of'.","additional_notes":"It is used to indicate an excessive amount, applicable to both countable and uncountable nouns. Typically, it's followed directly by a noun to specify what is too much.","target_language_example":"Il y a trop de bruit ici.","native_language_example":"There is too much noise here."}]
["très bien",{"thoughts":"'Très bien' is a commonly used French phrase that means 'very well'. It's often used to express approval or satisfaction, and can also be used as a response when someone asks how you're doing.","target_language_multi_word_term":"très bien","meaning":"'very well'.","additional_notes":"Can be used to compliment someone's performance or in response to 'How are you?' to indicate you're doing well.","target_language_example":"- Comment ça va? - Très bien, merci !","native_language_example":"- How are you? - Very well, thank you!"}]
["tu l'as dit",{"thoughts":"\"Tu l'as dit\" is a casual French expression used to agree with someone emphatically, similar to how 'You said it!' is used in English to express strong agreement or acknowledgment.","target_language_multi_word_term":"tu l'as dit","meaning":"'You said it!'","additional_notes":"Used to express strong agreement with what someone else has said, often in an informal setting.","target_language_example":"Il fait vraiment chaud aujourd'hui. - Tu l'as dit!","native_language_example":"It's really hot today. - You said it!"}]
["tu parles",{"thoughts":"The phrase 'tu parles' literally translates to 'you speak' or 'you are speaking'. It is the second person singular form of the verb 'parler' in French. However, it can also be used idiomatically to express skepticism or disbelief, similar to saying 'yeah, right' or 'as if' sarcastically in English.","target_language_multi_word_term":"tu parles","meaning":"'you speak' or 'yeah, right!' sarcastically.","additional_notes":"Literally means 'you speak', but it can be used sarcastically to express doubt or disbelief, similar to saying 'yeah, right!' in English. Context will usually clarify the intended meaning.","target_language_example":"\"Tu as gagné à la loterie? Tu parles!\"","native_language_example":"\"You won the lottery? Yeah, right!\""}]
["tu sais",{"thoughts":"'Tu sais' is a simple phrase that often appears in informal spoken French. It's used to indicate knowledge, similar to 'you know' in English, often as a filler in conversation.","target_language_multi_word_term":"tu sais","meaning":"'you know'.","additional_notes":"Used as a conversational filler or to confirm that someone understands or is aware of something.","target_language_example":"C'est difficile, tu sais.","native_language_example":"It's difficult, you know."}]
["un autre",{"thoughts":"'Un autre' means 'another' or 'other' and is a frequently used expression in French to describe an additional item or person. It's relevant for simple conversations regarding preferences and choices.","target_language_multi_word_term":"un autre","meaning":"'another' or 'other'.","additional_notes":"Used to refer to an additional item, person, or alternative choice. Important for expressing preferences or making selections.","target_language_example":"Je voudrais un autre gâteau, s'il vous plaît.","native_language_example":"I would like another cake, please."}]
["un coup",{"thoughts":"'Un coup' is a versatile French expression that can mean a blow, a strike, or a sudden action. It is often used in idiomatic expressions or to indicate a specific action or event.","target_language_multi_word_term":"un coup","meaning":"'a blow', 'a strike', or 'a sudden action'.","additional_notes":"Commonly used in idiomatic expressions such as 'd'un coup' meaning 'all at once', or 'donner un coup de main' meaning 'to give a hand'.","target_language_example":"Il m'a donné un coup sur l'épaule.","native_language_example":"He gave me a hit on the shoulder."}]
["un jour",{"thoughts":"'Un jour' is an expression used in French to talk about some indefinite day in the future or to reminisce about some specific day in the past.","target_language_multi_word_term":"un jour","meaning":"'one day' or 'someday'.","additional_notes":"It can signify a vague future time or refer to a specific day in the past.","target_language_example":"Un jour, je visiterai Paris.","native_language_example":"One day, I will visit Paris."}]
["un peu",{"thoughts":"'Un peu' is a common and basic French expression which means 'a little' or 'a bit'. This phrase is often used to indicate a small quantity, degree, or extent, which is a useful concept for beginners to understand as they learn to describe things. It is used in various everyday contexts, such as ordering food, discussing feelings, or describing amounts.","target_language_multi_word_term":"un peu","meaning":"'a little' or 'a bit'.","additional_notes":"Typically used to describe a small amount or degree of something. Can refer to quantity, emotion, or frequency.","target_language_example":"Je parle un peu français.","native_language_example":"I speak a little French."}]
["un peu de",{"thoughts":"'Un peu de' is a French phrase used to express a small amount of something. It's commonly used when referring to quantities of uncountable nouns, similar to 'a bit of' or 'a little of' in English.","target_language_multi_word_term":"un peu de","meaning":"'a little bit of', 'a little', 'some'.","additional_notes":"Used to refer to a small quantity of a non-countable or abstract noun. Often followed by a noun to indicate the substance or matter being referred to.","target_language_example":"Je voudrais un peu de lait dans mon café.","native_language_example":"I would like a little bit of milk in my coffee."}]
["une fois",{"thoughts":"\"Une fois\" is a time expression in French, referring to frequency or a specific occasion. It is often used to indicate the event happens once.","target_language_multi_word_term":"une fois","meaning":"'once'.","additional_notes":"Used to indicate an event that occurs a single time.","target_language_example":"Je ne l'ai fait qu'une fois.","native_language_example":"I did it only once."}]
["va savoir",{"thoughts":"'Va savoir' is an informal expression in French that translates to 'who knows' in English. It's often used when something is uncertain or unknown.","target_language_multi_word_term":"va savoir","meaning":"'who knows'.","additional_notes":"Commonly used to express uncertainty or when something is a mystery.","target_language_example":"Il n'est pas là ? Va savoir où il est.","native_language_example":"He's not here? Who knows where he is."}]
["valoir mieux",{"thoughts":"The phrase 'valoir mieux' is commonly used in French to suggest an option or a course of action that is preferable. It is similar to saying 'it's better to' or 'it would be better to' in English. This phrase is useful for learners to express preferences or advice.","target_language_multi_word_term":"valoir mieux","meaning":"'to be better' or 'it would be better'.","additional_notes":"Used to suggest that a particular action or option is preferable over others. Often followed by an infinitive verb.","target_language_example":"Il vaut mieux partir tôt pour éviter le traffic.","native_language_example":"It's better to leave early to avoid traffic."}]
["vas-y",{"thoughts":"The phrase 'vas-y' is a casual imperative form in French, encouraging someone to take action or do something. It is often used to mean 'go ahead' or 'go for it,' but can also simply mean 'go there.'","target_language_multi_word_term":"vas-y","meaning":"'Go ahead' or 'go for it'.","additional_notes":"This phrase is informal and often used in spoken French. It literally translates to 'go there,' but it is commonly used to encourage someone to take action.","target_language_example":"Tu veux essayer ? Vas-y !","native_language_example":"Do you want to try? Go for it!"}]
["venir de",{"thoughts":"'Venir de' is a French phrase used to express something that has just happened, similar to the English expression 'to have just done something'. It's constructed by combining the present tense of the verb 'venir' with 'de' and an infinitive verb, commonly referred to as the 'recent past'. This is relevant to beginners as it is a simple way to talk about very recent past events.","target_language_multi_word_term":"venir de","meaning":"'to have just done something'.","additional_notes":"This expression is used to describe actions that have occurred very recently and is followed by an infinitive verb. It is a simple form to express the recent past.","target_language_example":"Je viens de manger.","native_language_example":"I have just eaten."}]
["vite fait",{"thoughts":"\"Vite fait\" is often used in French to describe something done quickly or in haste. It is an informal term that might come up in casual conversations, implying that the action was executed promptly, sometimes with the connotation of being done without thoroughness.","target_language_multi_word_term":"vite fait","meaning":"quickly done","additional_notes":"Often used in informal contexts to describe an action completed quickly and sometimes superficially.","target_language_example":"Il a fait ça vite fait avant de partir.","native_language_example":"He did that quickly before leaving."}]
["voir venir",{"thoughts":"'Voir venir' is an idiomatic expression in French that often means to wait and see how a situation unfolds before taking action. It can also imply being cautious and observant.","target_language_multi_word_term":"voir venir","meaning":"'wait and see'.","additional_notes":"Commonly used to express a sense of caution or pragmatism, when someone prefers to observe how things develop before making a decision or acting.","target_language_example":"Pour l'instant, nous allons voir venir avant de décider.","native_language_example":"For now, we'll wait and see before deciding."}]
["vouloir bien",{"thoughts":"'Vouloir bien' is a polite or willing way to say that you are happy or willing to do something. It carries a sense of accommodating someone's wishes.","target_language_multi_word_term":"vouloir bien","meaning":"'to be willing to', 'to be happy to'.","additional_notes":"Used to politely agree to do something or to express a willingness to comply. It can add a tone of graciousness or cooperation.","target_language_example":"Je veux bien t'aider avec ton projet.","native_language_example":"I am happy to help you with your project."}]
["vouloir dire",{"thoughts":"'Vouloir dire' is a phrase used in French to ask or provide explanations about what a word, phrase, or action means. It's similar to the English 'mean' in contexts like 'What do you mean?'. This is crucial for language learners to clarify meanings during conversations.","target_language_multi_word_term":"vouloir dire","meaning":"'to mean' or 'to signify'.","additional_notes":"Commonly used when asking for an explanation or interpretation of words, phrases, or actions. It helps clarify misunderstandings.","target_language_example":"Qu'est-ce que tu veux dire par là?","native_language_example":"What do you mean by that?"}]
["vous savez",{"thoughts":"'Vous savez' is a phrase that can either mean 'you know' when informing someone or checking if they are aware of something, or be used as a filler to hesitate as one considers how to continue a sentence.","target_language_multi_word_term":"vous savez","meaning":"'you know'.","additional_notes":"Used to indicate awareness or to clarify information, similar to a conversation filler in English when someone wants to make sure the other person understands or is aware of what is being talked about.","target_language_example":"Vous savez, je pense que c'est une bonne idée.","native_language_example":"You know, I think it's a good idea."}]
["vous-même",{"thoughts":"'Vous-même' is a reflexive pronoun used for emphasis meaning 'yourself' when addressing someone formally or speaking to more than one person. It's important for beginner learners to recognize the reflexive structure and its role in emphasizing the subject.","target_language_multi_word_term":"vous-même","meaning":"'yourself' (formal or plural).","additional_notes":"Used to emphasize the person being addressed, often in formal or polite contexts. It can be used to encourage someone to participate, or it can be used to emphasize that the person should take action on their own.","target_language_example":"Vous pouvez le faire vous-même.","native_language_example":"You can do it yourself."}]
["vous-mêmes",{"thoughts":"'Vous-mêmes' is the reflexive and emphatic form of 'vous,' used to emphasize the subject 'you' when addressing more than one person formally or respectfully.","target_language_multi_word_term":"vous-mêmes","meaning":"yourselves; yourselves specifically.","additional_notes":"Emphasizes the subject 'you' in a sentence, indicating that the people being addressed should consider or act for themselves, usually in a formal or plural context.","target_language_example":"Vous devez le faire vous-mêmes.","native_language_example":"You must do it yourselves."}]
["voyez-vous",{"thoughts":"'Voyez-vous' is a polite or formal way to ask 'do you see' in French. It's also used to ensure understanding or agreement in conversation.","target_language_multi_word_term":"voyez-vous","meaning":"'do you see?'","additional_notes":"Used to politely ensure that someone understands or agrees with what was said. Common in formal or respectful contexts.","target_language_example":"Voyez-vous ce que je veux dire ?","native_language_example":"Do you see what I mean?"}]
["voyons voir",{"thoughts":"'Voyons voir' is an informal expression often used to mean 'let's see' or 'let's have a look'. It indicates someone's intention to consider or check something. It can be used in various contexts, much like 'let's see' in English.","target_language_multi_word_term":"voyons voir","meaning":"'let's see'.","additional_notes":"This phrase is often used when someone is considering their options, thinking something over, or about to verify information. It's a casual and conversational expression.","target_language_example":"Voyons voir ce que nous avons ici.","native_language_example":"Let's see what we have here."}]
["vu que",{"thoughts":"'Vu que' is a conjunction used in French to introduce a causal clause, much like 'since' or 'given that' in English. It's useful for beginners to understand this conjunction for constructing reasons or explanations.","target_language_multi_word_term":"vu que","meaning":"'seeing that' or 'since'.","additional_notes":"Used to introduce a reason for something, similar to how 'since' or 'given that' is used in English. It often precedes an explanation or justification.","target_language_example":"Vu que tu es malade, tu devrais rester au lit.","native_language_example":"Since you're sick, you should stay in bed."}]
["y aller",{"thoughts":"'Y aller' is a common French phrase that literally translates to 'to go there.' It is often used in contexts referring to going to a place that has already been mentioned or is understood from context. This is helpful for beginners as it teaches how to refer back to a place without repeating the name.","target_language_multi_word_term":"y aller","meaning":"'to go there' or 'to go.'","additional_notes":"Used to refer to going to a place that has been previously mentioned or is understood from context. 'Y' replaces the name of the location.","target_language_example":"Je dois y aller maintenant.","native_language_example":"I have to go there now."}]
["y avoir",{"thoughts":"'Y avoir' is a phrase structure used in many impersonal French expressions and is often equivalent to 'there is/are' in English. It is essential in helping describe existence or presence, making it practical for beginners to distinguish simple sentences related to location or quantity.","target_language_multi_word_term":"y avoir","meaning":"'there is/are'.","additional_notes":"Often used in sentences to indicate the existence or presence of something in a specific location or context. The form changes with different tenses, such as 'il y a' in the present tense.","target_language_example":"Il y a un chat sous la table.","native_language_example":"There is a cat under the table."}]
["y compris",{"thoughts":"'Y compris' is a phrase used to include something within a group, similar to the English term 'including.' It is often used to clarify or specify elements in a list.","target_language_multi_word_term":"y compris","meaning":"'including'.","additional_notes":"Used to indicate inclusion of specific items within a broader category or list.","target_language_example":"Tous les étudiants, y compris les nouveaux inscrits, doivent assister à la réunion.","native_language_example":"All students, including new enrollees, must attend the meeting."}]
["à bientôt",{"thoughts":"'À bientôt' is a common French phrase used to say goodbye with the intention of meeting again soon. It's an informal way to express 'see you soon' and is used between friends, family, and acquaintances.","target_language_multi_word_term":"à bientôt","meaning":"'see you soon'.","additional_notes":"Used when parting ways with someone to indicate you will meet again in the near future. Common in casual conversations.","target_language_example":"Merci pour le café, à bientôt !","native_language_example":"Thanks for the coffee, see you soon!"}]
["à bord",{"thoughts":"'À bord' is a French term commonly used to talk about being on a specific form of transportation such as a plane or a ship.","target_language_multi_word_term":"à bord","meaning":"'on board'.","additional_notes":"Used to indicate that someone or something is on a ship, aircraft, train, or other vehicles.","target_language_example":"Les passagers sont à bord de l'avion.","native_language_example":"The passengers are on board the plane."}]
["à côté",{"thoughts":"'À côté' is a common French phrase that means 'next to' or 'beside'. It's a simple yet useful term for beginners who are learning how to describe the position of objects or places in French.","target_language_multi_word_term":"à côté","meaning":"'next to' or 'beside'.","additional_notes":"Used to describe the position of something or someone relative to another object or person. Often followed by 'de' when specifying what it is next to.","target_language_example":"La pharmacie est à côté de la boulangerie.","native_language_example":"The pharmacy is next to the bakery."}]
["à demain",{"thoughts":"The expression 'à demain' is a commonly used phrase in French for saying goodbye when you expect to see the person the next day. It's simple and familiar. Beginner learners should recognize this phrase as a basic part of everyday conversation.","target_language_multi_word_term":"à demain","meaning":"'see you tomorrow'.","additional_notes":"It's used when parting with someone with the expectation of meeting again the following day. Suitable for informal and casual contexts.","target_language_example":"Je dois y aller. À demain!","native_language_example":"I have to go. See you tomorrow!"}]
["à droite",{"thoughts":"'À droite' is a commonly used French phrase that indicates direction, specifically to the right. It is essential for navigating and giving directions, a basic but crucial skill for French learners.","target_language_multi_word_term":"à droite","meaning":"'to the right'.","additional_notes":"Used to indicate direction, useful in navigation and giving directions. Often used in contexts like driving, walking, or positioning.","target_language_example":"Tournez à droite au prochain feu.","native_language_example":"Turn right at the next light."}]
["à fond",{"thoughts":"The phrase 'à fond' is a useful term for beginners as it can describe actions done thoroughly or with full intensity.","target_language_multi_word_term":"à fond","meaning":"thoroughly, completely, intensely.","additional_notes":"Used to indicate that something is being done to the utmost extent, whether it be filling something completely or engaging in an activity with full effort.","target_language_example":"Il a étudié à fond pour l'examen.","native_language_example":"He studied thoroughly for the exam."}]
["à gauche",{"thoughts":"'À gauche' is a directional phrase used in French to indicate the position or direction to the left. It is likely relevant to a beginner learner for navigation or giving directions.","target_language_multi_word_term":"à gauche","meaning":"'to the left'.","additional_notes":"Used to indicate direction or position in terms of left.","target_language_example":"Tournez à gauche après le feu.","native_language_example":"Turn left after the light."}]
["à l'heure",{"thoughts":"The term 'à l'heure' is used in French to indicate timeliness or punctuality.","target_language_multi_word_term":"à l'heure","meaning":"'on time'.","additional_notes":"This phrase is used to confirm or describe someone's punctuality.","target_language_example":"Il est toujours à l'heure.","native_language_example":"He is always on time."}]
["à l'intérieur",{"thoughts":"'À l'intérieur' is a phrase indicating location within or inside something. It is useful for beginners to know how to describe where things are spatially.","target_language_multi_word_term":"à l'intérieur","meaning":"'inside' or 'within'.","additional_notes":"Used to describe something that is contained or enclosed within another object or space. Can be used both in a literal sense (inside a room) or figuratively (inside a situation).","target_language_example":"Il y a un chat à l'intérieur de la boîte.","native_language_example":"There is a cat inside the box."}]
["à la maison",{"thoughts":"The phrase 'à la maison' is common in French and is used to express that something is happening at home or that someone is at home. This phrase would be particularly useful for beginners as it relates to everyday conversations involving location and routine activities.","target_language_multi_word_term":"à la maison","meaning":"'at home'.","additional_notes":"This phrase is used to describe being at one's home or carrying out activities at home. It can refer to one's own home or someone else's, depending on context.","target_language_example":"Elle est à la maison ce soir.","native_language_example":"She is at home tonight."}]
["à moi",{"thoughts":"'À moi' is a French phrase typically used to express possession or belonging, similar to 'mine' or 'to me'. It is essential for beginners to understand how to indicate possession in French.","target_language_multi_word_term":"à moi","meaning":"'mine' or 'to me'.","additional_notes":"Often used to claim ownership or in expressions of personal association.","target_language_example":"Ce livre est à moi.","native_language_example":"This book is mine."}]
["à nouveau",{"thoughts":"The phrase 'à nouveau' is commonly used in French to indicate that something is being done again or anew, but it often carries the nuance of doing it in a new or different way compared to 'encore' which means 'again'. Understanding these nuances is useful for learners to differentiate between similar French expressions related to repetition.","target_language_multi_word_term":"à nouveau","meaning":"'again' or 'anew'.","additional_notes":"Generally used to express doing something again with the implication of trying it in a new way or after a change, as opposed to simply repeating exactly as before.","target_language_example":"Il a commencé son projet à nouveau.","native_language_example":"He started his project again."}]
["à part",{"thoughts":"The phrase 'à part' is widely used in French to express the idea of exclusion or separation, similar to the English 'apart from' or 'aside from'. This term can be useful for beginners to describe exceptions or things not included in a main category.","target_language_multi_word_term":"à part","meaning":"'apart from' or 'beside'.","additional_notes":"Used to exclude something from a general statement or to indicate a contrast or exception.","target_language_example":"À part le dessert, tout était délicieux.","native_language_example":"Apart from the dessert, everything was delicious."}]
["à plus",{"thoughts":"'À plus' is a casual French phrase often used to say goodbye informally, implying that you will see the person again at some point, similar to saying 'see you later' in English.","target_language_multi_word_term":"à plus","meaning":"'see you later'.","additional_notes":"This is an informal way to say goodbye and implies a future meeting, though it doesn't specify when. It's a short form of 'à plus tard'.","target_language_example":"D'accord, à plus !","native_language_example":"Alright, see you later!"}]
["à propos",{"thoughts":"The phrase 'à propos' is a versatile term in French that is useful in conversations to smoothly change subjects or to reference something related to the conversation topic. Beginners would benefit from understanding both its standalone use and its role as a prepositional phrase.","target_language_multi_word_term":"à propos","meaning":"'by the way' or 'about'.","additional_notes":"Often used to introduce a topic or to reference something related to the current context. Can stand alone or be followed by 'de' when specifying what something is about.","target_language_example":"À propos, as-tu entendu les nouvelles?","native_language_example":"By the way, did you hear the news?"}]
["à propos de",{"thoughts":"'À propos de' is a French prepositional phrase used when speaking about a specific subject or topic. It translates to 'about' or 'concerning' in English, and it introduces the subject matter of a discussion or text.","target_language_multi_word_term":"à propos de","meaning":"'about' or 'concerning'.","additional_notes":"Often used to introduce the subject of discussion or the topic one is inquiring about.","target_language_example":"Nous avons parlé à propos de son voyage.","native_language_example":"We talked about his trip."}]
["à toute",{"thoughts":"'À toute' is a casual French phrase commonly used to say goodbye with the implication of seeing the person soon, like 'see you later'.","target_language_multi_word_term":"à toute","meaning":"'see you later' or 'until then'.","additional_notes":"Informal way to say goodbye. Commonly used among friends or acquaintances when you are planning to see each other again soon.","target_language_example":"Je dois y aller, à toute !","native_language_example":"I have to go, see you later!"}]
["ça gaze",{"thoughts":"'Ça gaze' is an informal French expression equivalent to asking 'How's it going?' It is often used between friends or in casual situations and literally means 'Is it gassing?' referring to everything going smoothly.","target_language_multi_word_term":"ça gaze","meaning":"'How's it going?'","additional_notes":"Used in informal or colloquial contexts to inquire about someone's well-being or the general situation.","target_language_example":"Salut, ça gaze ?","native_language_example":"Hi, how's it going?"}]
["ça ira",{"thoughts":"'Ça ira' is a common French expression meaning that things will be okay or all right. It is often used for reassurance.","target_language_multi_word_term":"ça ira","meaning":"It will be okay.","additional_notes":"This phrase is used for reassuring someone that a situation will improve or be resolved positively.","target_language_example":"Ne t'inquiète pas, ça ira.","native_language_example":"Don't worry, it will be okay."}]
["ça marche",{"thoughts":"'Ça marche' is a common French idiomatic expression equivalent to 'It works' or 'That works' in English. It is often used informally to agree to something or confirm that something is functioning or acceptable. Beginners should be aware that it can be used in various contexts, much like 'It works' in English.","target_language_multi_word_term":"ça marche","meaning":"'it works' or 'that works'.","additional_notes":"Used informally to agree on something or indicate that something is functioning as expected.","target_language_example":"On se retrouve à 18 heures. - Oui, ça marche.","native_language_example":"We'll meet at 6 PM. - Yes, that works."}]
["ça roule",{"thoughts":"'Ça roule' is a casual, informal phrase in French often used to express that things are going well, or to confirm understanding or agreement, much like saying 'it's all good' or 'okay' in English.","target_language_multi_word_term":"ça roule","meaning":"'it's going well' or 'okay'.","additional_notes":"Common in informal contexts, often used among friends indicating everything is going smoothly or as planned.","target_language_example":"- On se retrouve à 8 heures? - Ça roule!","native_language_example":"- Shall we meet at 8 o'clock? - That's fine!"}]
["ça suffit",{"thoughts":"'Ça suffit' is a common French expression used to indicate that enough is enough, often employed to stop an action or behavior.","target_language_multi_word_term":"ça suffit","meaning":"'that's enough'.","additional_notes":"Used to express that something has reached its limit and no more is required or acceptable.","target_language_example":"Ça suffit, je ne veux plus en parler.","native_language_example":"That's enough, I don't want to talk about it anymore."}]
["ça va",{"thoughts":"The phrase 'ça va' is versatile in French, often used in greetings and casual conversations to convey feelings.","target_language_multi_word_term":"ça va","meaning":"'how are you?' or 'it's okay'.","additional_notes":"Used as both a question to inquire about someone's well-being and as a response to indicate one's own state.","target_language_example":"Salut! Ça va?","native_language_example":"Hi! How are you?"}]
["être humain",{"thoughts":"The term 'être humain' translates to 'human being' in English. It is a fundamental term often used in discussions about humanity, society, and personal identity.","target_language_multi_word_term":"être humain","meaning":"'human being'.","additional_notes":"Refers to any individual of the species Homo sapiens. Used in various contexts from biological, social, to philosophical discussions about human nature.","target_language_example":"Les droits de l'être humain sont universels.","native_language_example":"Human rights are universal."}]
["être le cas",{"thoughts":"'Être le cas' is a French phrase meaning 'to be the case'. It is used to confirm if something is true or applicable. It's important for learners to know how to confirm situations or facts.","target_language_multi_word_term":"être le cas","meaning":"'to be the case'.","additional_notes":"Often used to verify or confirm a situation, event, or fact that has been stated or assumed.","target_language_example":"Si c'est le cas, nous devrons agir rapidement.","native_language_example":"If that is the case, we will need to act quickly."}]
["être là",{"thoughts":"'Être là' translates directly to 'to be there' in English. It can indicate someone's physical presence at a location or more metaphorically their mental or emotional presence. It is a useful phrase for beginner learners because it's versatile and can be used in various contexts, such as confirming attendance or indicating support.","target_language_multi_word_term":"être là","meaning":"'to be there'.","additional_notes":"Can indicate physical presence at a location or metaphorically support/availability. Often used to ask or confirm if someone is present or will attend an event, or to express being available for someone.","target_language_example":"Je serai là à dix heures.","native_language_example":"I will be there at ten o'clock."}]
["être à",{"thoughts":"\"Être à\" followed by a stressed pronoun or a noun usually means \"to belong to\" someone. This construction gives a handy alternative to possessive adjectives. For beginners, this is the most common and useful sense.","target_language_multi_word_term":"être à","meaning":"to belong to","additional_notes":"Used with stressed pronouns (moi, toi, lui, elle, nous, vous, eux, elles) or a noun to show ownership: «Ce stylo est à Paul» = “This pen is Paul’s.”","target_language_example":"Ce livre est à moi.","native_language_example":"This book belongs to me."}]
