["é",{"thoughts":"English already contains many loan-words that use é (café, résumé, cliché). The vowel quality is close to the first part of the English diphthong “ay” in “say,” so the sound feels familiar; the main adjustment is to keep it pure and short, without adding a trailing glide.","pattern":"é","description":"é (called “e accent aigu”) is a pure, mid-to-high front vowel. To make it, open your mouth slightly, keep your tongue forward and raised (about half-way to where it would be for the English “ee” in “see”), and do NOT round your lips. Think of the first half of the English word “say,” but stop before your tongue moves or you add a little ‘y’ glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"café","native":"café","position":"End","cultural_context":"Common word for a coffee shop; appears on signs and menus"},{"target":"résumé","native":"résumé","position":"Multiple","cultural_context":"Job-application document; widely used in business contexts"},{"target":"Pokémon","native":"Pokémon","position":"Middle","cultural_context":"Global video-game & media franchise known to children and adults"}]}]
["è",{"thoughts":"English already has the /ɛ/ vowel (bet, set), so the raw sound is familiar. The new piece is noticing that the French accent grave (è) always signals that same open-e sound and should never turn into a diphthong like the English “eh-uh.” The main challenge is remembering to keep it short, pure, and to avoid hiding the accent when reading or spelling.","pattern":"è","description":"è is pronounced as a clear, open “eh” sound – the same vowel you hear in English “bet” or “red,” but held slightly steadier and without sliding toward another vowel. Open your jaw a bit, spread the lips slightly, tongue halfway between high and low, and keep the sound short and pure: /ɛ/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"crème brûlée","native":"crème brûlée","position":"Beginning","cultural_context":"Popular French dessert often seen on restaurant menus and cooking shows"},{"target":"chèvre","native":"chèvre","position":"Beginning","cultural_context":"Goat cheese commonly used in salads and sold in many supermarkets"},{"target":"première","native":"première","position":"Middle","cultural_context":"Film and theater term for a first showing; the word appears in English media coverage"}]}]
["ê",{"thoughts":"The circumflex ê represents a pure open-mid front vowel /ɛ/. English speakers already use a very similar \"eh\" sound in words like \"bet,\" so the quality is familiar, but they have to remember not to glide toward /eɪ/ as in “day” and to keep it a single, steady vowel.","pattern":"ê","description":"Pronounce ê with the tongue positioned low-mid and toward the front of the mouth, lips unrounded and relaxed—essentially the same mouth shape as the English vowel in “bet,” but hold it very steady (no ending glide) and slightly lengthen it. Think “eh” but a touch tenser and a bit longer.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"crêpe","native":"crêpe","position":"Middle","cultural_context":"Popular thin French pancake served in cafés and food trucks"},{"target":"tête-à-tête","native":"tête-à-tête","position":"Multiple","cultural_context":"Common expression in English for a private conversation; appears in literature and media"},{"target":"bête noire","native":"bête noire","position":"Middle","cultural_context":"Borrowed idiom meaning a pet peeve or sworn enemy, used in journalism and books"}]}]
["ë",{"thoughts":"ë is not a brand-new vowel quality for English speakers; it simply marks that this particular “e” must be pronounced as its own syllable, usually like the short open “eh” sound in English “bet.” The trick is remembering to split it off instead of sliding it into the previous vowel.","pattern":"ë","description":"In French, the two dots (called a tréma) tell you that this letter “e” is pronounced separately from the vowel right before it. Say a clear, short “eh” (like the English vowel in “bed”) and make it its own syllable: Noël = no-ELL, Citroën = see-tro-EN. There’s no nasalization or special lip rounding—just a clean, quick “eh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Noël","native":"Noël","position":"Middle","cultural_context":"Seen on holiday cards and as the English male name “Noel,” meaning Christmas"},{"target":"Citroën","native":"Citroën","position":"Middle","cultural_context":"Well-known French automobile brand; cars and ads keep the original spelling"},{"target":"Chloë","native":"Chloë","position":"End","cultural_context":"Popular given name of several celebrities, e.g., actress Chloë Grace Moretz"}]}]
["à",{"thoughts":"French “à” is simply the plain, open “ah” vowel—exactly the sound English speakers already make in words like “spa” or “father.” The accent mark (grave) only tells you to pronounce it clearly and distinguishes it from other French vowels/spellings, but it does not change the basic mouth position for an English speaker.","pattern":"à","description":"Pronounce it as a short, open “ah” sound, like the ‘a’ in English “father.” Drop your jaw, keep the tongue low and front-central, lips relaxed (not rounded). It is never pronounced like the English long ‘a’ in “late.” The accent mark does not lengthen the vowel; it simply signals that you should keep it open and distinct.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"à la carte","native":"à la carte","position":"Beginning","cultural_context":"Common restaurant term on English menus meaning you order items individually"},{"target":"voilà","native":"voilà","position":"End","cultural_context":"Frequently used in English conversation and cooking shows to mean “there it is/ta-da”"},{"target":"à propos","native":"à propos","position":"Beginning","cultural_context":"Borrowed into English in writing and speech to mean “regarding” or “by the way”"}]}]
["â",{"thoughts":"French â is simply a long, open \"ah\" sound. English already has almost the same vowel in words like “father,” so the sound itself is not new; learners mainly need to notice the spelling with a circumflex and avoid turning it into the flatter /æ/ of “cat.” Because the sound exists in English and is easy to form, the main challenge is spelling-recognition, not articulation.","pattern":"â","description":"Open your mouth as if you are starting to say the English word “father.” Keep the tongue low and slightly back, lips relaxed (not rounded). Sustain a clear, smooth “ah” without adding an /r/ or closing it toward /æ/. That is the French â.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"pâté","native":"pâté","position":"Middle","cultural_context":"Liver spread served as an hors d’oeuvre; appears on many English-language menus"},{"target":"papier-mâché","native":"papier mâché","position":"Middle","cultural_context":"Common craft material used in school art projects"},{"target":"bâton","native":"bâton","position":"Beginning","cultural_context":"Word \"baton\" in English for a conductor’s stick or relay race baton"}]}]
["î",{"thoughts":"French Î/î is not a separate vowel quality; it is the regular close-front vowel /i/ (like the English “ee” in “see”). The circumflex only shows historical spelling changes, so the sound is already familiar to most English speakers. The main tip is to keep it pure and short – do not add a glide such as the English “y” off-glide you sometimes hear in “see-y.”","pattern":"î","description":"Pronounce î exactly like the English vowel sound in “see” or “machine”: lips relaxed, tongue high and toward the front of the mouth, voiced and held steadily with no added ‘y’ glide at the end. Same sound as an ordinary French i, the accent does not change the pronunciation.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Île de France","native":"Île de France","position":"Beginning","cultural_context":"Region that includes Paris; you’ll see it on tourism materials and cheese labels"},{"target":"maître d'","native":"maître d'","position":"Middle","cultural_context":"English uses this French term for the headwaiter in a restaurant"},{"target":"Cîroc","native":"Cîroc","position":"Middle","cultural_context":"Popular vodka brand advertised in English-language media"}]}]
["ï",{"thoughts":"ï is not a special new vowel. It is the regular French “i” sound [i] (like the English “ee” in “see”), but the two dots (called a tréma) warn you that this vowel must be pronounced as a separate syllable instead of blending with the letter before it (e.g., a-ï = two syllables, not “ay”). English speakers have met it in spellings such as naïve, so the sound itself is easy; the trick is remembering to keep the vowels separate.","pattern":"ï","description":"Pronounce ï as a pure, front, long “ee” sound—like the “ee” in English “see.” The tréma shows that it starts its own syllable, so pronounce the letter just before it normally, then move immediately to a clear “ee” without sliding or merging the two vowels.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"naïve","native":"naïf/naïve (naïve)","position":"Middle","cultural_context":"Common English adjective meaning inexperienced; often still spelled with the dots in careful writing"},{"target":"Haïti","native":"Haïti","position":"Middle","cultural_context":"Name of the Caribbean country frequently mentioned in news and geography"},{"target":"aïoli","native":"aïoli","position":"Middle","cultural_context":"Garlic mayonnaise you see on restaurant menus and cooking shows"}]}]
["ô",{"thoughts":"French ô is basically the same back-rounded “oh” vowel English speakers already say, except it must stay a single, pure sound with no glide (no little /w/ at the end). Because the mouth posture and lip rounding are familiar, the only real challenge is remembering not to let it turn into the English diphthong.","pattern":"ô","description":"Make a closed, rounded “oh” sound. Keep your lips rounded as if to whistle, tongue raised toward the back of the mouth (mid-high position), and hold it steady—do NOT let it slide toward a ‘w’ or ‘oo.’ It should be short and pure: one single vowel, like the first part of English “go” but cut off before any glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Ô Canada","native":"Ô Canada","position":"Beginning","cultural_context":"Title and first words of the Canadian national anthem, often heard at sporting events"},{"target":"Côte d’Azur","native":"Côte d’Azur","position":"Middle","cultural_context":"Famous French Riviera holiday region referenced in travel shows and magazines"},{"target":"Côte d’Ivoire","native":"Côte d’Ivoire","position":"Middle","cultural_context":"West African country frequently mentioned in news and international sports"}]}]
["ù",{"thoughts":"In French, the written “ù” is extremely rare (basically only in the word “où”). It is NOT a special sound; the accent just distinguishes spelling/meaning in writing. Phonetically it is the same pure French [u] heard in “ou” (e.g., “vous”). English speakers know a similar ‘oo’ in “food,” but they tend to let it glide into a diphthong. The challenge is keeping it short, pure, and with tighter lip rounding.","pattern":"ù","description":"Pronounce it exactly like the French sound spelled “ou” – a single, pure, back, rounded vowel [u]. Think of saying the English “oo” in “food,” but do NOT let the sound slide toward a ‘w’; keep the tongue high in the back of the mouth and the lips tightly rounded the whole time. The grave accent only affects spelling, not pronunciation.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"où","native":"where","position":"Beginning","cultural_context":"Basic question word every French learner encounters (“Où est…?”) and common on travel signs"},{"target":"Où est Charlie ?","native":"Where’s Waldo?","position":"Beginning","cultural_context":"French title of the globally popular picture-book series “Where’s Waldo?”"},{"target":"Où est la gare ?","native":"Where is the train station?","position":"Beginning","cultural_context":"Classic tourist phrase found in nearly every French phrasebook and travel app"}]}]
["û",{"thoughts":"French “û” is not a unique sound; it marks the same vowel as plain “u” (/y/). This high, front, rounded vowel does not exist in English, so learners usually substitute /u/ or /oo/. Giving them well-known food words helps them notice it.","pattern":"û","description":"It is the same vowel as an unaccented French “u”: a high, front, rounded vowel written /y/. Start by saying English “ee” (as in “see”) to place your tongue high and forward, then—without moving your tongue—round your lips as if saying “oo”. Voice remains steady, no diphthong.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Classic dessert on many restaurant menus and cooking shows"},{"target":"bûche de Noël","native":"bûche de Noël","position":"Beginning","cultural_context":"Traditional French Yule-log cake that appears in holiday food articles and bakeries"},{"target":"flûte","native":"flûte","position":"Middle","cultural_context":"French word for a champagne flute; often seen on wine lists and culinary programs"}]}]
["ü",{"thoughts":"The French “ü” sound is the same vowel written as plain “u” or “û” in most French words: the high, front-rounded vowel /y/ (identical to German ü). English has no native equivalent, so learners must create a new mouth position. They may have heard it in foods (crème brûlée), fashion terms (tutu), or words like bureau, but they rarely pronounce it accurately.","pattern":"ü","description":"Start by saying the English long “ee” in “see” (tongue high and forward). While keeping your tongue in that position, round your lips as if you were going to say “oo” in “boot.” The result is a tight, whistling vowel that sits between English “ee” and “oo.” The tongue never pulls back—only the lips move.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bureau","native":"bureau","position":"Beginning","cultural_context":"Used in English for an office (e.g., Federal Bureau of Investigation) and as a type of desk"},{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Popular French dessert served in many restaurants"},{"target":"tutu","native":"tutu","position":"Multiple","cultural_context":"Common ballet term for a dancer’s skirt, often referenced in pop culture"}]}]
["ç",{"thoughts":"The French “ç” (c-cedilla) doesn’t introduce a new mouth movement for English speakers—it simply forces the letter C to be read like an “s.” So the sound itself is already in every English speaker’s inventory; the novelty is only visual and spelling-related.","pattern":"ç","description":"Pronounce it exactly like the English “s” in “sun.” The tongue is close to the top front teeth, a narrow channel of air passes, and the vocal cords do not vibrate (it is voiceless). French adds the cedilla to a C before the vowels a, o, or u to keep this soft /s/ quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"façade","native":"façade","position":"Middle","cultural_context":"Common architectural term and loanword in English for the front of a building"},{"target":"garçon","native":"garçon","position":"Middle","cultural_context":"Classic French word for “boy” or a waiter; heard in movies and restaurants"},{"target":"Curaçao","native":"Curaçao","position":"Middle","cultural_context":"Blue Curaçao liqueur used in cocktails and the Caribbean island of the same name"}]}]
["œ",{"thoughts":"English has no rounded front vowel, so learners usually replace œ with an un-rounded \"uh\" or with the ER sound in \"her.\" They also often write it as \"oe,\" so they may have seen the letters but never heard the real French sound.","pattern":"œ","description":"This is a mid-front, rounded vowel (IPA [œ]). Start with the English \"eh\" in \"bed,\" but push your tongue slightly further back and round your lips as if saying the English long “o.” Keep the mouth relatively relaxed and short; it should sound like a clipped, rounded version of “uh.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"œuf","native":"œuf (egg)","position":"Beginning","cultural_context":"Appears on brunch menus (e.g., \"œufs Benedict\"), even in English-speaking restaurants"},{"target":"cœur","native":"cœur (heart)","position":"Middle","cultural_context":"Seen in the U.S. place name \"Coeur d'Alene\" and in culinary term \"cœur de filet\""},{"target":"œuvre","native":"œuvre (work, as in art)","position":"Beginning","cultural_context":"Used in the English phrase \"chef-d'œuvre\" meaning masterpiece, common in art and literature discussions"}]}]
["ai",{"thoughts":"French “ai” usually sounds like the open “eh” in English “bet,” so the general mouth/tongue position is already familiar. It can also be a tenser “ay” [e] at the very end of a word, but without the English glide. English speakers have seen the spelling in foods and place-names, so the look of the pattern is familiar, yet producing the pure French vowel (without turning it into a diphthong) takes a little practice.","pattern":"ai","description":"Most of the time, the letters “ai” in French are pronounced as a single open front vowel [ɛ]—similar to the short “e” in English “bet,” but held a touch longer and without any following ‘y’ glide. Keep your tongue forward and low-mid, jaw slightly open, lips relaxed. When “ai” comes at the very end of a word or before a final, silent consonant (e.g., j’ai, parlerai), it tightens to a closed [e], like the “ay” in “say,” but again—no off-glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Common French pastry sold in coffee shops and grocery stores worldwide"},{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Sparkling wine used in celebrations; same word exists in English"},{"target":"Saint-Tropez","native":"Saint-Tropez","position":"Middle","cultural_context":"Famous French Riviera resort town mentioned in travel shows and pop culture"}]}]
["ei",{"thoughts":"“ei” in French is almost always pronounced as the open “eh” sound /ɛ/, identical to the vowel in English “bet.” Because English already has this vowel and there is no tricky French rounding or nasality here, the sound is straightforward for most learners. The main reminder is to keep it short and pure—don’t turn it into a glide like the English diphthong in “say.”","pattern":"ei","description":"Pronounce it as a short, open “eh” (IPA /ɛ/). Drop your jaw slightly, keep the tongue low-mid and forward, lips relaxed. Hold it briefly—one clean vowel, no off-glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Seine","native":"Seine","position":"Middle","cultural_context":"The famous river that flows through Paris, often mentioned in travel shows and literature"},{"target":"beignet","native":"beignet","position":"Middle","cultural_context":"French/New Orleans pastry frequently seen on food shows and café menus"},{"target":"Reims","native":"Reims","position":"Beginning","cultural_context":"Champagne-producing city; name appears on many champagne labels"}]}]
["oi",{"thoughts":"French “oi” is usually pronounced /wa/, a short, smooth “wah” sound English speakers already know from interjections like “wah!” or the first part of “water.” The letters never sound like the English diphthong in “boy,” which can mislead learners when they see familiar spellings such as Detroit.","pattern":"oi","description":"Start with rounded lips as if saying an English “w,” then immediately open into a short “ah” (as in “father”). The glide is quick and smooth: one continuous sound, not two separate syllables. Think of an emphatic English “wah!” but shorter and without adding an extra vowel at the end.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant","position":"Beginning","cultural_context":"Common pastry found in coffee shops and supermarkets"},{"target":"moi","native":"moi","position":"End","cultural_context":"Appears in the phrase “c’est moi,” often used in movies and TV to mean “it’s me”"},{"target":"foie gras","native":"foie gras","position":"Middle","cultural_context":"Well-known French delicacy frequently mentioned in food shows and menus"}]}]
["ou",{"thoughts":"French “ou” is essentially the single vowel /u/ (like the English sound in “food”), so the quality will feel familiar. The main trick is to keep it pure and short—English speakers often turn their ‘oo’ into a slight diphthong, sliding toward a ‘w’ or ‘uh’ at the end. French keeps the lips firmly rounded and the tongue high-back the whole time.","pattern":"ou","description":"Make a single, steady “oo” sound. Push the tongue high and to the back of the mouth while keeping the lips rounded (as if blowing through a straw). Do not let the vowel glide or change quality at the end.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"boulevard","native":"boulevard","position":"Beginning","cultural_context":"Common street name in English-speaking cities (e.g., Hollywood Boulevard) and in movies"},{"target":"mousse","native":"mousse","position":"Beginning","cultural_context":"Popular dessert (chocolate mousse) often seen on restaurant menus"},{"target":"rendezvous","native":"rendez-vous","position":"End","cultural_context":"Used in English for a meeting or date; appears in news, movies, and everyday speech"}]}]
["eu",{"thoughts":"French “eu” represents a rounded front vowel (/ø/ or /œ/) that does not exist in standard English. Learners often substitute it with English “uh” or “er,” but lip-rounding is the key difference.","pattern":"eu","description":"Start as if you were going to say English “eh” (as in “met”) but round your lips forward like you do for “oo” in “food,” keeping the tongue forward. The sound should be short and not diphthongize—one pure vowel, something between English “uh” and “oo” but with the tongue still in the mid-front position.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"euro","native":"euro","position":"Beginning","cultural_context":"European currency often mentioned in travel and financial news"},{"target":"bleu","native":"bleu","position":"End","cultural_context":"Seen in “bleu cheese” and steak cooked “bleu” (very rare)"},{"target":"fleur-de-lis","native":"fleur-de-lis","position":"Middle","cultural_context":"Historic French symbol used by the New Orleans Saints and in royal emblems"}]}]
["au",{"thoughts":"“au” is one of French’s simplest vowel teams.  For English speakers it usually sounds like the pure vowel in English “go,” but without the final w-like glide, so most listeners already have a near equivalent in their inventory.  The main challenge is remembering that it is always this sound in French spelling, never the OW sound of English “cow.”","pattern":"au","description":"Pronounce it as a single, rounded back vowel, similar to the first part of the English sound in “go.”  Lips are rounded; tongue is raised toward the back of the mouth.  Do NOT let the vowel slide into a diphthong (no final ‑w off-glide).  It’s the same sound you hear in French words like “eau” or “beau,” just written with a instead of e.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"au pair","native":"au pair","position":"Beginning","cultural_context":"Common term for a live-in childcare worker, used in English job ads and conversation"},{"target":"chauffeur","native":"chauffeur","position":"Middle","cultural_context":"Loanword meaning professional driver, seen in movies and luxury-car services"},{"target":"faux pas","native":"faux pas","position":"Middle","cultural_context":"Widely used English expression for a social blunder"}]}]
["eau",{"thoughts":"The spelling “eau” is very common in French and always sounds like a single, rounded long “oh” (similar to the English word “go,” but without the off-glide). English speakers have met it in loan-words like “bureau” and in wine names such as “Bordeaux,” so it shouldn’t feel entirely foreign.","pattern":"eau","description":"Pronounce it exactly like the English long “o” in “go,” but keep the lips slightly more rounded and don’t let the sound slide into a w sound at the end. It’s a pure, steady “oh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"bureau","native":"bureau","position":"End","cultural_context":"Common English word for a desk or a government office"},{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Famous French wine region and the wine itself—often seen on wine lists"},{"target":"Eau de toilette","native":"eau de toilette","position":"Beginning","cultural_context":"Widely used perfume/cologne term on product labels"}]}]
["ph",{"thoughts":"The French digraph “ph” is pronounced exactly like the normal English “f” sound, so native English speakers already have the sound in their inventory. The only new piece of information is that French spelling uses the letters p + h to represent it in some learned or Greek-origin words. Because the sound itself is identical to English “f,” there is very little articulation challenge—learners just need the spelling-to-sound reminder.","pattern":"ph","description":"In French, the letter pair “ph” is pronounced exactly like the English “f” sound, as in “fun” or “fat.” Place the upper teeth lightly on the lower lip and let air flow out unvoiced. Do NOT attempt to pronounce a separate “p” and “h”; treat the two letters as a single “f” sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"photo","native":"photo","position":"Beginning","cultural_context":"Same word in English—taking a picture"},{"target":"pharmacie","native":"pharmacie","position":"Beginning","cultural_context":"You’ll see this green-cross sign on drugstores all over France; cognate of English “pharmacy”"},{"target":"téléphone","native":"téléphone","position":"Middle","cultural_context":"Close cognate of English “telephone,” the everyday device"}]}]
["ch",{"thoughts":"French “ch” is usually pronounced like the English “sh” sound (/ʃ/). English speakers already know the sound itself, but they normally spell it “sh,” not “ch,” so they often say /tʃ/ (as in “church”) by mistake when reading French. The physical articulation is easy; the main hurdle is remembering the different spelling–sound match.","pattern":"ch","description":"In French, the letter pair “ch” is pronounced like the English “sh” in “ship.” Place the tongue close to the roof of the mouth just behind the teeth, let air pass through the narrow gap, and do not vibrate the vocal cords. It is a soft, hissing sound, not the harder /tʃ/ sound of English “ch.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"Beginning","cultural_context":"Sparkling wine widely associated with celebrations and New Year toasts"},{"target":"chef","native":"chef","position":"Beginning","cultural_context":"Common English word for the head cook in a kitchen or on cooking shows"},{"target":"cliché","native":"cliché","position":"Middle","cultural_context":"Everyday English term meaning an overused phrase or idea"}]}]
["gn",{"thoughts":"French “gn” is the single-sound /ɲ/, like Spanish ñ. English speakers have met it in borrowed words such as “champagne,” but it is not an English phoneme, so they recognise the spelling more than the sound. The main challenge is to keep the tongue forward on the hard palate and let the air flow through the nose without adding an extra y or n.","pattern":"gn","description":"Pronounce it as one smooth, nasal consonant similar to saying the English sounds “n” and “y” at exactly the same time. Place the middle/front of your tongue against the hard palate just behind your front teeth (as if starting the English “y” in “yes”) while letting air resonate through the nose (as in “n”). There is no vowel break between the consonant and the following vowel: /ɲa/ — not /n-ya/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"End","cultural_context":"Celebratory sparkling wine; common word on menus and in pop culture"},{"target":"cognac","native":"cognac","position":"Middle","cultural_context":"Famous French brandy; the name appears on liquor bottles and in cocktails"},{"target":"lasagna","native":"lasagna","position":"Middle","cultural_context":"Popular Italian pasta dish; frequently seen on restaurant menus and in recipes"}]}]
["qu",{"thoughts":"English speakers already make the /k/ sound, but when they see the letters “qu” they automatically want to add a /w/ glide (as in “queen”). In French that glide never happens—“qu” is simply a hard /k/. So the physical sound is easy, but the spelling-to-sound “re-wiring” takes a little getting used to.","pattern":"qu","description":"In French, the letter pair “qu” is pronounced exactly like the hard \"k\" sound in English (IPA /k/). The lips do NOT round and there is NO \"w\" glide afterward. Tongue is raised to the soft palate, then released for a crisp /k/, just as when you say English “sky” or “cat.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Popular French egg tart found on brunch menus in English-speaking countries"},{"target":"Jacques","native":"Jacques","position":"Middle","cultural_context":"Famous French name—think ocean explorer Jacques Cousteau"},{"target":"boutique","native":"boutique","position":"End","cultural_context":"Common English loanword for a small, stylish shop"}]}]
["ill",{"thoughts":"English speakers see the letters “ill” and expect the sound in “ill-ness,” but in many French words the cluster “ill/ille” is pronounced like a single y-sound (/j/) or an “ee + y” glide (/ij/). Well-known place and people names such as “Versailles,” “Marseille,” and “Camille” all use this French /j/ realization. The articulation itself is familiar (it is the same tongue position as the English y in “yes”), but the unexpected spelling makes it tricky.","pattern":"ill","description":"In French, when you see “ill” or “ille” after a vowel, pronounce it like the English y in “yes.” Your tongue is high and forward, lips relaxed; start as if you were saying a quick “ee,” then immediately release into the y glide. So “-aille” sounds roughly like “eye-y,” “-eille” like “ay-y,” etc. (If “ill” follows a consonant without a preceding vowel—mille, ville—it usually stays a clear /il/, but the famous words below use the y-sound.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Versailles","native":"Versailles","position":"Middle","cultural_context":"World-famous French royal palace often mentioned in history and tourism"},{"target":"Marseille","native":"Marseille","position":"End","cultural_context":"Major French port city; name heard in travel shows and European soccer"},{"target":"Camille","native":"Camille","position":"End","cultural_context":"Common French first name—seen in the artist Camille Pissarro and the Saint-Saëns opera ‘Camille’"}]}]
["ien",{"thoughts":"“ien” represents the glide /j/ (“y” sound) followed by the French nasal vowel /ɛ̃/. English has the /j/ glide (“y” in “yes”) but no true nasal vowels, so learners must keep the tongue in the front-high position for /j/, then open slightly toward “eh” while letting the sound resonate through the nose and cutting off the final n completely.","pattern":"ien","description":"Start with the English “y” in “yes,” then immediately open into an “eh” as in “bet,” but let the air also pass through the nose so the vowel is nasalised. Do NOT pronounce a final n sound; the n is only a nasal marker. One smooth syllable: /jɛ̃/.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bien","native":"bien","position":"End","cultural_context":"Common French word meaning “well/good” that shows up in phrases like “c’est bien” in movies and beginner French classes."},{"target":"chien","native":"chien","position":"End","cultural_context":"French word for “dog” often heard in expressions like “chien chaud” (hot-dog) or in pop-culture references to French pets."},{"target":"Ancien Régime","native":"Ancien Régime","position":"End","cultural_context":"Historical term used in English books and documentaries about pre-Revolutionary France."}]}]
["ion",{"thoughts":"French “ion” is almost always pronounced as one single sound cluster /jɔ̃/: a quick English-“y” glide followed immediately by the nasal vowel heard in French “bon.” English speakers meet the spelling constantly, but the French sound is very different from English “-shun/-ee-un,” so it needs explanation.","pattern":"ion","description":"Say a quick English “y” sound (tongue high and near the roof as if starting the word “yes”), then glide straight into the French nasal vowel /ɔ̃/. For the nasal vowel: open the mouth as for an “aw” sound, round the lips slightly, lower the back of the tongue, and let some air resonate through the nose—no “n” is actually spoken. The two parts blend together smoothly to make one syllable /jɔ̃/.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"champion","native":"champion (winner)","position":"End","cultural_context":"Same word seen in sports headlines like “world champion”"},{"target":"lion","native":"lion (the animal)","position":"End","cultural_context":"Well-known zoo animal and zodiac sign, spelled the same in English"},{"target":"million","native":"million (number)","position":"End","cultural_context":"Familiar big number used in finance, games, and phrases like “a million dollars”"}]}]
["an",{"thoughts":"French “an” represents the nasal vowel /ɑ̃/. English has no nasal vowels, but many learners have already seen it in loan-words like “croissant.” The challenge is not the spelling, but redirecting part of the airflow through the nose while keeping the mouth open for an “ah” sound.","pattern":"an","description":"Start as if you were going to say a long, open English “ah” (like the ‘a’ in “father”), but simultaneously let some of the air resonate through your nose. Keep the tongue low and toward the back, jaw relaxed, lips neutral or slightly rounded. Crucially, you do NOT close with an audible ‘n’—the sound stops while the soft palate is still lowered, letting it stay nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"croissant","native":"croissant","position":"End","cultural_context":"Common pastry found in many cafés and grocery stores"},{"target":"Mont Blanc","native":"Mont Blanc","position":"End","cultural_context":"Famous Alpine mountain and luxury pen brand"},{"target":"André","native":"André","position":"Beginning","cultural_context":"Recognized first name thanks to public figures like André the Giant"}]}]
["am",{"thoughts":"French “am” is really the same nasal vowel that shows up in “an” and “en.” English has no true nasal vowels, so learners have to remember to let air resonate in the nose while NOT finishing with an audible n- or m-sound.","pattern":"am","description":"When “am” is followed by a consonant (other than another m or n) or sits at the very end of a French word, the two letters fuse into a single nasal vowel /ɑ̃/. Start with the open ‘ah’ you hear in the English word “father,” but simultaneously let some air escape through your nose. Keep the mouth open; do not close the lips or add an audible m or n at the end. The result is a short, nasalized ‘ahn’ sound without the final n/m.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"Beginning","cultural_context":"Celebratory sparkling wine—same word used in English"},{"target":"Camembert","native":"Camembert","position":"Middle","cultural_context":"Famous French cheese often found on restaurant menus"},{"target":"Amsterdam","native":"Amsterdam","position":"Beginning","cultural_context":"Capital of the Netherlands; common travel and news reference"}]}]
["en",{"thoughts":"French “en” represents a nasal vowel (IPA /ɑ̃/). English has no nasal vowels, but many English speakers have heard it in borrowed words like “encore.” The closest English vowel is the “ah” in “father,” except you let some air escape through the nose and you do NOT finish with an “n” sound.","pattern":"en","description":"Open your mouth as if you are going to say the “ah” in “father,” but lower the soft-palate so air also flows through your nose. Keep the tongue low and toward the back. Hold that nasalized “ah” briefly—do NOT close off with an actual ‘n’. The sound is one single vowel, nasal and slightly longer than an English short vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"encore","native":"encore","position":"Beginning","cultural_context":"Shouted at concerts when the audience wants another song"},{"target":"entrée","native":"entrée","position":"Beginning","cultural_context":"Common restaurant menu term in the United States"},{"target":"en garde","native":"en garde","position":"Beginning","cultural_context":"Fencing command often heard in movies and sports coverage"}]}]
["em",{"thoughts":"French “em” followed by another consonant (em p, em b, em m, etc.) signals a nasal vowel. The written “m” is not pronounced as an /m/ consonant; instead, the preceding vowel is nasalised, roughly like the vowel in the English interjection “uh-huh” but farther forward in the mouth. English has no exact match, but speakers may have heard it in loan-words such as “ensemble.”","pattern":"em","description":"When “em” comes before another consonant in French, the letters together represent the single nasal vowel /ɑ̃/. Open your mouth as if saying the British English “ah,” then let part of the airflow escape through your nose; your tongue stays low and the lips are relaxed. Do NOT close the lips to make an /m/ sound—the nasal quality replaces it. If “em” is followed by a vowel, it is pronounced the regular, non-nasal /ɛm/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ensemble","native":"ensemble","position":"Middle","cultural_context":"Used in English for a group of musicians or a coordinated outfit"},{"target":"Empire","native":"Empire","position":"Beginning","cultural_context":"Familiar from historical terms (French Empire) and pop-culture like “Star Wars: The Empire Strikes Back”"},{"target":"Camembert","native":"camembert","position":"Middle","cultural_context":"Well-known French soft cheese sold internationally"}]}]
["in",{"thoughts":"French “in / ɛ̃ /” is a nasal vowel that has no exact twin in English. Learners usually try to pronounce an ordinary “eh” plus an audible n-sound, but the real trick is to let the vowel resonate through the nose and to mute the n completely.","pattern":"in","description":"Start with the English vowel in “bed,” but open your mouth slightly wider. While you hold that vowel, lower your soft-palate so air escapes through both mouth and nose. Keep your tongue relaxed and do NOT add an actual n sound—end the vowel cleanly while the airflow is still nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"vin","native":"vin","position":"End","cultural_context":"Seen on wine lists and phrases like “vin rouge / vin blanc.”"},{"target":"Michelin","native":"Michelin","position":"End","cultural_context":"Famous tire company and Michelin restaurant stars."},{"target":"Tintin","native":"Tintin","position":"Multiple","cultural_context":"Well-known Belgian comic-book hero (movies and graphic novels)."}]}]
["im",{"thoughts":"French “im” (before another consonant) is one of the four main spellings for the nasal vowel /ɛ̃/. English has nasalized vowels, but never treats them as separate vowel phonemes, so learners must remember not to pronounce a clear “m” sound.","pattern":"im","description":"When the letters “i” + “m” appear before another consonant (e.g., p, b, t) in French, the pair does NOT sound like the English syllable “im.” Instead, the vowel is pronounced as the nasal vowel /ɛ̃/: open your mouth as if to say the English short “e” in “bed,” round the lips only slightly, lower the jaw a bit more, and let air resonate through the nose while keeping the lips and tongue from fully closing to make an /m/. You should hear no distinct “m” consonant—just one nasal vowel that ends abruptly.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"impossible","native":"impossible","position":"Beginning","cultural_context":"Same spelling as the English word; title of the movie and TV series “Mission: Impossible.”"},{"target":"important","native":"important","position":"Beginning","cultural_context":"Same written word exists in English; common adjective in both languages."},{"target":"impressionism","native":"impressionnisme","position":"Beginning","cultural_context":"Art movement (Monet, Renoir) often mentioned in museums and art history."}]}]
["ain",{"thoughts":"French “ain” is pronounced as the nasal vowel /ɛ̃/. English has the oral vowel “eh” as in “men,” but it never nasal-izes it as a distinct phoneme, so the quality will feel half-familiar (the tongue position is known) yet the nasal airflow is new. Learners often try to append an audible ‘n’ sound—something they must avoid.","pattern":"ain","description":"Start with the English short “e” as in “men,” but open the mouth a bit wider and let part of the airflow escape through the nose while the back of the tongue stays low and the soft palate lowers. Your lips stay relaxed (not rounded). Crucially, you do NOT pronounce an audible ‘n’ at the end—nasalize the vowel instead. The sound is written many ways in French; the spelling “ain” is one of the most common.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pain au chocolat","native":"pain au chocolat","position":"End","cultural_context":"Famous French breakfast pastry you see in cafés and on baking-show menus"},{"target":"train","native":"train","position":"End","cultural_context":"Same written word in English; travelers in France spot it on station signs and tickets"},{"target":"Saint Laurent","native":"Saint Laurent","position":"Middle","cultural_context":"Luxury fashion house (Yves Saint Laurent) and perfume brand widely advertised"}]}]
["ein",{"thoughts":"“ein” is one of several spellings that give the French nasal vowel /ɛ̃/.  English has no true equivalent, so the main issue is teaching learners to drop the audible n-sound, lower the jaw a little, open the mouth as for “eh”, then let the air resonate in the nose.","pattern":"ein","description":"Pronounce it as a single nasal vowel: start with an open “eh” (like the e in “bet”), then let the sound resonate through your nose while keeping the back of the tongue low.  Your lips stay relaxed, the soft palate is lowered, and you do NOT release a final n-consonant—everything merges into one nasalized vowel /ɛ̃/.  Common spellings for this same sound include ein, in, ain, im, yn.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"plein air","native":"plein air","position":"Beginning","cultural_context":"Art term in English for outdoor painting – often heard in museums or art classes"},{"target":"vin","native":"vin","position":"End","cultural_context":"Seen on French wine lists (vin rouge, vin blanc) and in travel guides"},{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"Champagne-region city name you meet in travel shows and on wine labels"}]}]
["on",{"thoughts":"French “on” is the most common nasal vowel. English has nasal consonants (m, n, ng) but not true nasal vowels, so learners may try to add an n-sound after the vowel. Many have heard it in words like “bonjour” or “macaron,” even if they haven’t noticed the special quality.","pattern":"on","description":"Pronounce it like the English aw in “law,” but let the sound resonate through your nose and STOP before adding an n.  1) Drop your jaw slightly, lips rounded as for aw. 2) Lower the soft palate so air can escape through the nose at the same time as the mouth. 3) End the vowel cleanly; do not release a final n consonant.  The IPA symbol is [ɔ̃].","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"bonjour","native":"bonjour","position":"Beginning","cultural_context":"Common French greeting—many English speakers know it from travel, movies, or songs"},{"target":"macaron","native":"macaron","position":"End","cultural_context":"Trendy French almond-meringue cookie found in cafés and social media photos"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"End","cultural_context":"Famous luxury fashion brand whose name is frequently heard in pop culture and advertising"}]}]
["om",{"thoughts":"French “om” normally signals the nasal vowel /ɔ̃/ (similar to the vowel in British “law,” but produced while letting air resonate in the nose and with NO audible m-sound). English has nothing identical, but the feel is like starting to say “aw” and humming ‘m’ without closing the lips.\n\nGood hook words: “nom de plume,” luxury champagne “Dom Pérignon,” and the cheese “Comté.” All are fairly well-known in English-speaking culture and contain the nasal ‘om’.","pattern":"om","description":"Say an open \"aw\" (like in \"law\"), round the lips slightly, lower the jaw a bit, and let part of the air escape through the nose instead of finishing with an audible /m/. The result is one single nasal vowel /ɔ̃/, not “om.” No lip closure or consonant sound at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"nom de plume","native":"nom de plume","position":"End","cultural_context":"Common English phrase meaning a writer’s pen name"},{"target":"Dom Pérignon","native":"Dom Pérignon","position":"End","cultural_context":"Famous high-end Champagne brand often referenced in pop culture"},{"target":"Comté","native":"Comté","position":"Middle","cultural_context":"Well-known French cheese sold in many supermarkets and on restaurant menus"}]}]
["un",{"thoughts":"English has no true nasal vowels, so /œ̃/ written “un” is unfamiliar. Learners may have heard it in the word “un, deux, trois” or on perfume labels such as “eau de parfum,” but they rarely pronounce it. The main challenge is directing some of the vowel sound through the nose while keeping the lips rounded.","pattern":"un","description":"The letters “un” spell a single nasal vowel, written /œ̃/ in phonetics. Start as if you will say the English vowel in “burn” but round your lips slightly more. While doing this, let air resonate partly through your nose—your soft-palate is lowered, so you feel a gentle buzz in the nasal passages. Crucially, you do NOT pronounce a separate ‘n’ consonant at the end; the nasal quality replaces it.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"un","native":"un","position":"End","cultural_context":"Many English speakers know the basic French count “un, deux, trois” from school or pop culture"},{"target":"eau de parfum","native":"eau de parfum","position":"End","cultural_context":"Printed on perfume bottles and advertised in English-language media"},{"target":"lundi","native":"lundi","position":"End","cultural_context":"French day of the week often shown on bilingual calendars"}]}]
["um",{"thoughts":"“um” in French normally signals the nasal vowel /œ̃/ (the same sound spelled “un”).  The written “m” is not pronounced; instead the vowel itself becomes nasal.  English has no nasal vowels, so learners have to master a brand-new resonance and remember that the final /m/ is silent.","pattern":"um","description":"Pronounce a short, rounded \"uh\" (similar to the first part of English “uh-huh”) while letting air escape through the nose.  Keep the mouth mostly relaxed, lips lightly rounded, tongue mid-central.  Do NOT close the lips for an /m/ sound— the written “m” only marks that the vowel is nasal.  The result is a single nasal vowel /œ̃/, identical to the sound in French “un.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"parfum","native":"parfum","position":"End","cultural_context":"Seen on perfume bottles and in the phrase “eau de parfum”"},{"target":"humble","native":"humble","position":"Beginning","cultural_context":"Same spelling as English word “humble,” often quoted in historical or philosophical contexts"}]}]
["oin",{"thoughts":"French “oin” is a nasalized diphthong that starts with a quick English-like “w” glide and ends in the nasal vowel /ɛ̃/. Nothing identical exists in standard English, so learners must add nasal resonance while keeping the tongue forward, lips rounded, and the final “n” completely silent.","pattern":"oin","description":"Start with a short English “w” sound, then glide immediately into a vowel like the “e” in “bed,” but while lowering the soft palate so air also resonates through the nose. Do not pronounce the final written “n.” The whole thing should come out as one nasal syllable, roughly /wɛ̃/.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"loin","native":"loin","position":"End","cultural_context":"English cut of meat (sirloin, tenderloin) spelled the same"},{"target":"coin","native":"coin","position":"End","cultural_context":"Same spelling as the English word for money, seen on currency and in idioms like “coin toss”"},{"target":"point","native":"point","position":"Middle","cultural_context":"Common word in English (a point in a game, a point of view); identical spelling in French text such as ‘point d’interrogation’"}]}]
["euil",{"thoughts":"“euil” is one of the trickier French spellings for English speakers because it combines a rounded front vowel that English does not have with a quick ‘y’-glide. Even people who know a few French food or fashion terms often avoid saying this one out loud.","pattern":"euil","description":"Say a very short, rounded version of the English “uh” (keep your lips puckered as if beginning an “oo”) while your tongue is pushed slightly forward. Immediately glide into a quick English “y” sound (as in “yes”) without moving the lips out of that rounded position. It comes out like: rounded “uh” + “y” blended together: [œj] in IPA.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"mille-feuille","native":"mille-feuille","position":"End","cultural_context":"Classic layered French pastry you may see in bakeries or on cooking shows"},{"target":"fauteuil","native":"fauteuil","position":"End","cultural_context":"A French word for “armchair”; shows up in theater seating charts and interior-design articles"},{"target":"feuilleton","native":"feuilleton","position":"Middle","cultural_context":"Literary or TV term (a serialized story); occasionally mentioned in film and media discussions"}]}]
["œil",{"thoughts":"The spelling œil represents a glide from a rounded front vowel to a brief \"y\" sound, a sequence that does not exist in English, so learners usually mis-round the lips or add an extra syllable. Only a few French loan-phrases known in English contain it, the most common being “trompe l’œil.”","pattern":"œil","description":"Start with the lips rounded as if you were going to say the French \"eu\" ([ø] – similar to the British English vowel in “nurse” but with lip-rounding). From that rounded position, glide quickly toward the English \"y\" sound ([j] as in “yes”) while dropping the lip-rounding. Do NOT finish with a full \"ee\" vowel and do NOT pronounce the written “l.” The result is one smooth syllable, something like “uh-y” said in one breath.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"trompe-l’œil","native":"trompe-l’œil","position":"End","cultural_context":"Art term you see in museums and design magazines for illusionistic painting that ‘tricks the eye.’"},{"target":"clin d’œil","native":"clin d’œil","position":"End","cultural_context":"French phrase meaning “a wink,” used in fashion and pop-culture writing to sound stylish."},{"target":"œil-de-bœuf","native":"œil-de-bœuf","position":"Beginning","cultural_context":"Architectural term for a small round or oval window; appears in history or design shows and books."}]}]
["aux$",{"thoughts":"French words that end in “aux” (including “eaux”, “beaux”, etc.) all share the same spoken ending: a single, pure “oh” sound. English speakers already know this vowel, but they may be tempted to pronounce the written x (or turn the vowel into an English-style diphthong “oʊ”). The main challenge is remembering that the x is always silent and keeping the vowel short and flat.","pattern":"aux$","description":"When a French word ends in “aux”, say one smooth, rounded mid-to-high “oh” ([o])—similar to the English word “go”, but shorter and without the little glide at the end. Do NOT pronounce the final x (“ks”) or add a w sound; your lips stay rounded and steady for the entire vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gâteaux","native":"cakes (plural of gâteau)","position":"End","cultural_context":"Heard on cooking shows and menus—fancy French cakes"},{"target":"tableaux","native":"scenes/still pictures (plural of tableau)","position":"End","cultural_context":"Used in English theatre and art (“tableaux vivants”) and history textbooks"},{"target":"Beaux Arts","native":"Beaux Arts (architectural style)","position":"End","cultural_context":"Name of a well-known architectural style and art school, seen in museum descriptions"}]}]
["eaux$",{"thoughts":"“eaux” at the end of a word is always pronounced exactly like the single French vowel /o/. English already has a very similar pure vowel in words like “go” (if you stop the glide). English speakers regularly see this spelling in wine names and plural loan-words, so the sound itself is nothing new.","pattern":"eaux$","description":"Pronounce it as a single, pure “oh” sound: lips rounded, tongue mid-back, no closing glide toward a “w”. It’s the same vowel you start to say in English “go” before your tongue or lips move to finish the diphthong—just hold that pure vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"World-famous French wine region; name seen on wine bottles and restaurant menus"},{"target":"gâteaux","native":"gâteaux","position":"End","cultural_context":"Plural of “gâteau,” a fancy cake; appears on English dessert menus and cooking shows"},{"target":"plateaux","native":"plateaux","position":"End","cultural_context":"Plural of “plateau,” common term in geography and fitness discussions"}]}]
["ent$",{"thoughts":"Final “-ent” is one of the trickier French spellings for English speakers because it has TWO common behaviors: (1) it is totally silent in 3-rd-person-plural verb forms, and (2) everywhere else it is read as the nasal vowel /ɑ̃/ (roughly “ah” while letting air resonate in your nose). Speakers therefore have to remember when to say nothing and when to nasalize.","pattern":"ent$","description":"When the letters “ent” appear at the very end of a French word they are either:  • Silent – in verb endings like “ils parlent” or “elles mangent,” you do not pronounce any of the three letters.  • A nasal vowel – in most nouns, adjectives, and names (Laurent, Vincent, agent) the group is pronounced as one nasal sound /ɑ̃/. Make an open “ah” (as in ‘father’) while letting air escape through your nose and do NOT pronounce a final ‘t.’","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Saint Laurent","native":"Saint Laurent","position":"End","cultural_context":"Luxury fashion brand (Yves Saint Laurent) familiar from perfumes and high-end clothing"},{"target":"Vincent","native":"Vincent","position":"End","cultural_context":"First name of famous painter Vincent van Gogh; also common given name"},{"target":"agent","native":"agent","position":"End","cultural_context":"Same written word as English “agent,” often seen in phrases like “agent secret” in spy movies"}]}]
["e$",{"thoughts":"English already has the idea of a silent final “e,” so learners won’t find the concept foreign, but they may be tempted to give it an “ay” or “uh” sound. They must instead drop it completely. The main challenge is remembering that the French silent e does NOT lengthen the previous vowel the way it often does in English.","pattern":"e$","description":"When a plain, un-accented “e” comes at the very end of a French word, it is normally silent in everyday speech. You finish the word on the consonant that comes just before the “e,” releasing no extra vowel sound. In very slow, careful speech or singing you might hear a faint, relaxed schwa [ə], but most of the time the letter is simply not voiced. Never pronounce it like the English alphabet letter “ee” or “ay.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"baguette","native":"baguette","position":"End","cultural_context":"Iconic long French bread sold in bakeries and supermarkets worldwide"},{"target":"champagne","native":"champagne","position":"End","cultural_context":"Famous sparkling wine used for celebrations and often mentioned in English media"},{"target":"genre","native":"genre","position":"End","cultural_context":"Loan-word in English meaning a type or category, common in film and music discussions"}]}]
["s$",{"thoughts":"The pattern \"s$\" shows the very common French rule that an \"s\" written as the last letter of a word is normally silent. English speakers already know several French-origin words that keep the silent final “s,” but in everyday English they often pronounce that \"s,\" so they have to consciously drop it in French.","pattern":"s$","description":"When a French word ends with the single letter “s,” you normally do NOT pronounce any /s/ sound. The word finishes on the preceding vowel or consonant and your tongue stays relaxed; there is no hissing sound. (The “s” may re-appear in liaison before a following vowel, but when the word is spoken in isolation it is silent.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Paris","native":"Paris","position":"End","cultural_context":"Capital of France; common travel and pop-culture reference"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"End","cultural_context":"Global luxury fashion brand; name heard in music, movies, and shopping"},{"target":"hors d'oeuvres","native":"hors d'oeuvres","position":"End","cultural_context":"Catering and restaurant term for small appetizers, used in English menus"}]}]
["t$",{"thoughts":"Final –t in French is normally silent. English speakers already run into this in borrowed words like “ballet” or “merlot,” so they have some intuitive exposure. The main task is to remember NOT to release a /t/ sound at the end unless liaison or spelling rules say otherwise.","pattern":"t$","description":"When a word ends with the letter “t” in French, the –t is almost always silent. You finish the preceding vowel or nasal sound and simply stop; your tongue does NOT make the usual English /t/ contact with the roof of the mouth. Think of it as ending the word abruptly with no extra consonant burst.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"ballet","native":"ballet","position":"End","cultural_context":"Well-known form of dance and common English loanword"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Popular French pastry available in many cafés"},{"target":"merlot","native":"merlot","position":"End","cultural_context":"Familiar red wine varietal found on restaurant menus"}]}]
["^h",{"thoughts":"In French, an initial “h” is never pronounced like the English /h/.  English speakers already know several borrowed French words that start with “h” (hotel, hors d’oeuvre), but they usually keep the English /h/ when they say them.  The main challenge is remembering to drop the breath entirely.","pattern":"^h","description":"At the beginning of a French word, the letter “h” is silent.  Start the word as if the “h” were not there—no breathy /h/ sound at all.  Your lips, tongue and vocal cords immediately form the next letter.  (Advanced note: some words have “h muet,” which allows liaison, and some have “h aspiré,” which blocks liaison, but in both cases the “h” itself is silent.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hotel","position":"Beginning","cultural_context":"Same word as English “hotel”; travelers may see signs like “Hôtel de Ville.”"},{"target":"hors d’oeuvre","native":"hors d’oeuvre","position":"Beginning","cultural_context":"Common culinary term for appetizers on English menus."},{"target":"heure","native":"hour / time","position":"Beginning","cultural_context":"Basic word taught early in French courses, appears in phrases like “bonne heure” and “l’heure.”"}]}]
