["a",{"thoughts":"French “a” is essentially the same open-mouth vowel many English speakers already use in words like “spa” or “father.” It doesn’t shift toward an “uh” sound the way unstressed English vowels often do, so the main task is keeping it short, pure, and fully open.","pattern":"a","position":"Anywhere","description":"Open your mouth wide, tongue low and forward, lips relaxed (not rounded). Produce a short, steady ‘ah’ sound—like the ‘a’ in English “father,” but avoid letting it drift to “uh.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Paris","native":"Paris","position":"Beginning","cultural_context":"World-famous French capital that nearly every English speaker can name"},{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Popular buttery pastry sold in cafés and grocery stores"},{"target":"macaron","native":"macaron","position":"Multiple","cultural_context":"Trendy French almond cookie often featured on cooking shows and in bakeries"}]}]
["b",{"thoughts":"French “b” is essentially the same voiced bilabial stop English speakers already use, so it should feel very familiar. It is produced by bringing both lips together and releasing with vibration of the vocal cords. In French it can show up at the start, middle, or end of words and is almost always pronounced (unlike some other final consonants in French).","pattern":"b","position":"Anywhere","description":"Press both lips together, engage your vocal cords, then release a short burst of air – exactly the same as the English “b” in “boy.” Keep it crisp and short; don’t add an extra puff or vowel after it.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"Beginning","cultural_context":"The famous long French loaf sold in bakeries and supermarkets everywhere"},{"target":"brie","native":"brie","position":"Beginning","cultural_context":"Creamy French cheese commonly found on cheese boards"},{"target":"bonjour","native":"bonjour","position":"Beginning","cultural_context":"Standard French greeting often heard in movies and travel phrases"}]}]
["c",{"thoughts":"French “c” is not a new sound for English speakers— it’s the same hard K sound as in “cat” or the soft S sound as in “city.” What can trip learners up is WHEN it switches between the two: before a, o, u or a consonant it’s hard (k); before e, i, y it’s soft (s). The sound itself is easy, only the spelling rule needs practice.","pattern":"c","position":"Anywhere","description":"The letter “c” in French is pronounced two ways: (1) Hard /k/ – like the English K in “kite” – when it appears before a, o, u, or another consonant (croissant, classe). (2) Soft /s/ – like the English S in “see” – when it appears before e, i, or y (merci, français). The mouth position is exactly the same as in English for each case.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Beginning","cultural_context":"Well-known buttery pastry sold in cafés and bakeries worldwide"},{"target":"café","native":"café","position":"Beginning","cultural_context":"Common word for a coffee shop; appears on signs and menus everywhere"},{"target":"facade","native":"façade","position":"Middle","cultural_context":"Architectural term and common English loanword referring to the front of a building"}]}]
["d",{"thoughts":"French “d” is almost the same as the English “d,” so learners already have a mental model. The only new detail is keeping the tongue a bit farther forward and avoiding the little puff of air (aspiration) that often follows an English /d/. Because of this near-match, the sound is easy and already familiar.","pattern":"d","position":"Anywhere","description":"Voiced dental/alveolar stop. Touch the tip of your tongue to the back of your upper front teeth (slightly farther forward than in English), let the vocal cords vibrate, and release WITHOUT the small burst of air native English speakers usually add. Otherwise it sounds just like the English “d.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Dior","native":"Dior","position":"Beginning","cultural_context":"Famous French luxury fashion brand often mentioned in English-language media"},{"target":"Bordeaux","native":"Bordeaux","position":"Middle","cultural_context":"Well-known French wine region and type of wine seen on restaurant menus"},{"target":"déjà vu","native":"déjà vu","position":"Beginning","cultural_context":"Commonly used French loan phrase in English meaning the feeling of having already experienced something"}]}]
["e",{"thoughts":"Plain, un-accented “e” in French is tricky only because it can change value depending on its spot in the word, but the actual sounds (open e as in “bed,” or the neutral schwa) already exist in English, so the learner only needs to match situations, not invent a new mouth shape.","pattern":"e","position":"Anywhere","description":"When you see an un-accented “e” in French, it most often sounds like one of two English vowels:\n• open /ɛ/ – the short “e” in English “bed.” This happens in a closed syllable (ends with a consonant): merci /mɛʁ-si/, chef /ʃɛf/.\n• schwa /ə/ – the relaxed vowel in the second syllable of “sofa.” This appears in an unstressed syllable, especially before a consonant that is pronounced, or in the little word “le.”\nAt the very end of a word the plain “e” is usually silent (baguette → final ‑e not said). So you already know the mouth positions; the challenge is choosing which one the spelling wants.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"merci","native":"merci (thank you)","position":"Middle","cultural_context":"Common French way to say “thank you,” heard in travel shows, movies, and everyday speech"},{"target":"chef","native":"chef","position":"Middle","cultural_context":"Same word used in English for the head cook of a restaurant"},{"target":"Le Mans","native":"Le Mans","position":"End","cultural_context":"Famous 24-hour car race; the name is often mentioned in English sports and auto media"}]}]
["f",{"thoughts":"The French “f” is identical to the English “f” sound: a voiceless labiodental fricative made by placing the top teeth lightly on the bottom lip and letting air pass. Because English has the same sound and uses the same spelling, learners will already know it and find it easy.","pattern":"f","position":"Anywhere","description":"Press your upper front teeth gently against the inside edge of your lower lip, then push air out without using your vocal cords. It is the same sound as English “f” in words like “fun” or “coffee.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"France","native":"France","position":"Beginning","cultural_context":"Name of the country—common in news, travel, and history"},{"target":"café","native":"café","position":"Middle","cultural_context":"Widely used word for a coffee shop; appears on signs and menus"},{"target":"chef","native":"chef","position":"End","cultural_context":"Same word in English for a professional cook, popular in cooking shows"}]}]
["g",{"thoughts":"The French letter “g” is familiar in writing, but it has two distinct pronunciations (hard /g/ and soft /ʒ/). English has both sounds – hard “g” in “go,” soft “g” almost identical to the “s” in “measure” – so learners already know the mouth positions, but must notice the French spelling rules that trigger each sound.","pattern":"g","position":"Anywhere","description":"In French, the letter “g” is pronounced in two main ways:\n1) Hard g: a voiced stop /g/ (like English “go”). It occurs before a, o, u or a consonant (galerie, gondole, guitare), and in the digraph “gu” before e or i (guitare). Tongue touches the soft palate, vocal cords vibrate, then release.\n2) Soft g: a voiced ‘zh’ sound /ʒ/ (same as the “s” in English “measure”). It appears before e, i, y (général, girafe, gymnase). Air passes through a narrowed channel between tongue and hard palate while the vocal cords vibrate.\nThere is no puff of air (aspiration) after either sound in French, unlike some English hard g’s. Keep it short and smooth.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gourmet","native":"gourmet","position":"Beginning","cultural_context":"English also uses this French word to describe fine food"},{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Common term for the iconic French long bread"},{"target":"genre","native":"genre","position":"Beginning","cultural_context":"Used in English for categories of movies, music, etc., showing the soft g sound"}]}]
["h",{"thoughts":"English speakers expect the letter “h” to sound like the breathy consonant in “hat.” In French it is almost always SILENT. The real work is remembering not to pronounce it and knowing that some silent h’s block liaison while others don’t.","pattern":"h","position":"Anywhere","description":"In French, the letter “h” is not pronounced at all—no breathy sound. You simply begin the word on the following vowel or consonant. There are two kinds: “h muet” (truly mute, allows liaison and elision: l’homme) and “h aspiré” (still silent but blocks liaison: le héros). Either way, you never voice an English-style [h].","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hotel","position":"Beginning","cultural_context":"Seen on travel signs and in phrases like “hôtel de ville” when visiting France"},{"target":"Hermès","native":"Hermès (luxury brand)","position":"Beginning","cultural_context":"Famous French luxury house known for scarves and handbags"},{"target":"brioche","native":"brioche","position":"Middle","cultural_context":"Popular sweet bread sold in bakeries and used for French toast"}]}]
["i",{"thoughts":"The French vowel “i” is virtually the same basic mouth-shape English speakers use for the long “ee” in “see,” so it feels familiar. The only real trap is that English often lets the sound slide into a tiny ‘y’ glide (see → ‘see-y’), whereas French keeps it absolutely pure and steady. Because the tongue and lip position are already part of everyday English, learners mainly have to remember to keep it short and clean.","pattern":"i","position":"Anywhere","description":"A high, front, un-rounded vowel – basically the “ee” in English “see,” but kept pure with no off-glide. Smile slightly, raise the front of your tongue toward the hard palate, keep the back of the tongue low, and let the sound come straight out without sliding toward a ‘y.’","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"merci","native":"merci","position":"End","cultural_context":"Common French word for “thank you” that appears in movies, travel phrases, and souvenirs"},{"target":"bistro","native":"bistro","position":"Middle","cultural_context":"Widely used in English for a small, casual restaurant"},{"target":"Paris","native":"Paris","position":"End","cultural_context":"World-famous French capital city mentioned constantly in media and travel"}]}]
["j",{"thoughts":"French “j” is always the /ʒ/ sound, like the “s” in English “measure.” English speakers know the sound itself, but they don’t expect it to be spelled with a “j,” so the concept is familiar while the spelling-to-sound link is new.","pattern":"j","position":"Anywhere","description":"French “j” is voiced and pronounced with the tongue close to, but not touching, the roof of the mouth just behind the teeth ridge, letting the air pass through a narrow channel while the vocal cords vibrate. It is the same sound English makes in the middle of words like “viSIon,” “meaSure,” or “pleaSure,” only written with the letter “j” in French.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Jacques","native":"Jacques","position":"Beginning","cultural_context":"Famous French first name heard in references like explorer Jacques Cousteau"},{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Common French greeting often used in movies, travel phrases, or cafés"},{"target":"genre","native":"genre","position":"Beginning","cultural_context":"Loanword widely used in English to talk about categories of movies, books, or music"}]}]
["k",{"thoughts":"French /k/ is essentially the same voiceless hard “k” English speakers know (as in “cat”).  The only quirk is that French does not puff out as much air after releasing the consonant, so it feels slightly “softer.”  Otherwise the tongue and mouth position are identical, so learners rarely struggle with it.","pattern":"k","position":"Anywhere","description":"Make a hard \"k\" sound by pressing the back of your tongue against the soft palate (the back roof of the mouth) and releasing it cleanly.  Unlike in English, do not add a strong burst of air (aspiration).  The sound can be spelled c, qu, k or even ch in a few French words, but the mouth movement stays the same.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Beginning","cultural_context":"Common French pastry sold in coffee shops and grocery stores everywhere"},{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Savory French egg pie featured on many brunch menus in English-speaking countries"},{"target":"Québec","native":"Quebec","position":"Multiple","cultural_context":"Canadian province often mentioned in news and travel shows"}]}]
["l",{"thoughts":"English already has an /l/ sound, so learners just need to remember that French keeps the tongue toward the front (a “clear l”) even at the end of words. No new mouth movement is required, only consistency.","pattern":"l","position":"Anywhere","description":"In French, “l” is a clear, light L. Place the tip of your tongue against the ridge just behind your upper front teeth and let the sides of the tongue touch the upper side teeth a bit. Keep the back of the tongue relaxed (don’t pull it back the way some English speakers do in words like “ball”). The airflow passes gently around the sides of the tongue. The sound stays the same at the beginning, middle, or end of a word.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Louvre","native":"Louvre","position":"Beginning","cultural_context":"World-famous art museum in Paris that houses the Mona Lisa—often mentioned in travel shows and movies"},{"target":"ballet","native":"ballet","position":"Middle","cultural_context":"Common English loan-word for the classical dance form; French spelling and pronunciation are widely recognized"},{"target":"Chanel","native":"Chanel","position":"End","cultural_context":"Luxury fashion and perfume brand frequently referenced in pop culture and advertisements"}]}]
["m",{"thoughts":"French “m” is the exact same bilabial nasal English speakers already use in words like “man” or “home,” so there’s no new mouth movement or tongue placement to learn.","pattern":"m","position":"Anywhere","description":"Close both lips gently, let your vocal cords vibrate, and allow the sound to resonate through the nose. It’s the same voiced bilabial nasal you use in English words such as “mom” or “time.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"macaron","native":"macaron","position":"Beginning","cultural_context":"Trendy French almond dessert seen in bakeries and social media food posts"},{"target":"Camembert","native":"Camembert","position":"Middle","cultural_context":"Well-known soft cheese often featured on cheese boards and in grocery stores"},{"target":"comme ci, comme ça","native":"comme ci, comme ça","position":"Multiple","cultural_context":"Common French phrase meaning “so-so” that occasionally appears in English dialogue and pop culture"}]}]
["n",{"thoughts":"French “n” is the exact same alveolar nasal consonant English speakers already use in words like “no” or “ten.” There is no new mouth position or voicing rule to learn, so the only thing to remember is that the letter “n” can either be pronounced /n/ (as shown here) or it can simply mark a preceding nasal vowel (where the “n” itself is silent). In this card we focus on the cases where the consonant /n/ is actually pronounced.","pattern":"n","position":"Anywhere","description":"Voiced alveolar nasal. Place the tip of your tongue against the ridge just behind your upper front teeth (the same place you start for ‘t’ or ‘d’), let air pass out through your nose, and keep your vocal cords vibrating. It sounds exactly like the English “n” in “no.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Nicole","native":"Nicole","position":"Beginning","cultural_context":"Common first name—e.g., actress Nicole Kidman—so the spelling and sound are familiar"},{"target":"cinéma","native":"cinema / cinéma","position":"Middle","cultural_context":"Word seen on movie-theater signs and in phrases like “cinéma français”"},{"target":"cuisine","native":"cuisine","position":"End","cultural_context":"Used in English for “style of cooking,” as in “French cuisine”"}]}]
["o",{"thoughts":"English already has an \u001bo\u001c sound, so learners have a mental reference point, but they must remember that in French it stays pure and does not slide into a second sound.","pattern":"o","position":"Anywhere","description":"Make a pure, mid\u0013back, rounded vowel. Start with the mouth shape you use for the first half of the English word \u001cgo,\u001d but freeze there\u0014do NOT let the sound glide toward a \u001cw\u001d. Lips are rounded but not pushed far forward; tongue is mid\u0013high at the back of the mouth. Hold it steady, short, and clean.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"photo","native":"photo","position":"Multiple","cultural_context":"Same word in English for a picture\u0014easy to recognize"},{"target":"métro","native":"métro","position":"End","cultural_context":"Common term for subway systems, used in travel guides and movies"},{"target":"Monaco","native":"Monaco","position":"Multiple","cultural_context":"Famous micro\u0013state known for its casino and Formula 1 race"}]}]
["p",{"thoughts":"English speakers already use the same /p/ sound; in French it is produced without the strong burst of air (aspiration) often heard in English. Aside from keeping it softer and noting that it can be silent in a few words, there is nothing fundamentally new for the learner.","pattern":"p","position":"Anywhere","description":"French “p” is the same voiceless bilabial stop you use in English: bring both lips together, build up a little air, and release it. The main difference is that French speakers don’t add the noticeable puff of air (aspiration) you hear in English words like “pat.” Keep the release quick and soft.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Paris","native":"Paris","position":"Beginning","cultural_context":"World-famous French capital city; common in travel, movies, and fashion"},{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Sparkling wine served at celebrations; the word is used unchanged in English"},{"target":"crêpe","native":"crêpe","position":"End","cultural_context":"Thin French pancake that appears on brunch menus and in dessert names"}]}]
["q",{"thoughts":"French “q” is almost always seen in the digraph “qu.”  English speakers already know the hard /k/ sound, but they may instinctively add a /w/-glide (kw).  The main thing to remember is: in French it is just a plain /k/.","pattern":"q","position":"Anywhere","description":"In French, the letter “q” (usually written “qu”) is pronounced exactly like an unaspirated hard K sound /k/.  Touch the back of your tongue to the soft palate, release a small burst of air, and do NOT add the little /w/ glide you hear in English “quick.”  Think of the K in “ski.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Popular French savory pie often served at brunch in English-speaking countries"},{"target":"Québec","native":"Québec","position":"Beginning","cultural_context":"Well-known Canadian province you hear about in news and travel"},{"target":"Jacques","native":"Jacques","position":"Middle","cultural_context":"Common French first name (e.g., philosopher Jacques Derrida; phrase “Frère Jacques” in the children’s song)"}]}]
["r",{"thoughts":"The French “r” is the famous throaty sound most learners struggle with. It is produced far back in the mouth at the uvula, unlike the English tongue-tip R. English speakers have heard it in words like “croissant” and “Paris,” so they may recognize it, but actually making the sound is still challenging.","pattern":"r","position":"Anywhere","description":"Start with the back of your tongue raised so it almost touches the soft palate/uvula. Let air pass over that spot, creating a light friction or a short trill deep in the throat. Your lips stay relaxed; your tongue tip does NOT curl like in English. Think of a gentle gargling sound but softer and shorter.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Common buttery pastry sold in cafés and bakeries"},{"target":"Paris","native":"Paris","position":"Middle","cultural_context":"Capital of France; world-famous tourist destination"},{"target":"brie","native":"brie","position":"Beginning","cultural_context":"Popular soft cheese often found on cheese boards"}]}]
["s",{"thoughts":"The French “s” when it represents the unvoiced /s/ is essentially the same hiss-sound English speakers make in “see” or “snake.” English already has an identical place of articulation (front of the tongue lightly against the alveolar ridge, continuous airflow). Because of this one-to-one match, the sound itself is familiar and easy, though learners must remember French spelling rules (single “s” between vowels often turns into /z/, while “ss,” initial “s,” or “s” before a consonant stays /s/).","pattern":"s","position":"Anywhere","description":"Make a soft, voiceless hiss by placing the tip or blade of your tongue close to the ridge just behind your upper front teeth. Keep your vocal cords off (no buzzing) and let the air flow out continuously. It is exactly the same mouth position and airflow as the English “s” in “sun.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Iconic French buttery pastry found in coffee shops and freezer aisles everywhere"},{"target":"mousse","native":"mousse","position":"Middle","cultural_context":"Chocolate mousse or hair-styling mousse—both common in English"},{"target":"Merci","native":"merci","position":"Middle","cultural_context":"Basic French word for “thank you,” seen on candy brand “Merci” and tourist souvenirs"}]}]
["t",{"thoughts":"The French “t” is basically the same stop consonant English speakers already know, but placed slightly farther forward (tongue against the upper teeth) and produced without the big puff of air English uses at the start of stressed words. Because the core action—stopping and releasing airflow—is identical, the sound feels instantly recognizable; the only challenge is remembering to keep it soft and un-aspirated.","pattern":"t","position":"Anywhere","description":"Place the tip of your tongue right against the back of your upper front teeth (a bit farther forward than in English). Build a brief blockage of air, then release it quickly without adding a noticeable burst of breath. The vocal cords stay off (it’s a voiceless sound), and your lips stay relaxed.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"End","cultural_context":"The classic long French bread sold in bakeries and referenced in movies and recipes"},{"target":"croûton","native":"croûton","position":"Middle","cultural_context":"Crunchy bread cubes served on salads and soups, common on restaurant menus"},{"target":"Tour de France","native":"Tour de France","position":"Beginning","cultural_context":"World-famous cycling race frequently mentioned in sports news"}]}]
["u",{"thoughts":"French “u” is the single letter that represents the front-rounded vowel /y/, a sound most English speakers have never had to pronounce. They often replace it with English “oo” /u/ or “ee” /i/, so it needs clear explanation and high-profile examples.","pattern":"u","position":"Anywhere","description":"Shape your lips as if you are going to say the English “oo” in “food,” but at the same time keep your tongue in the high, forward position used for the English “ee” in “see.” You should feel your lips rounded and your tongue pushed toward the front of the mouth. Air flows straight out without touching the teeth.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"bureau","native":"bureau","position":"Beginning","cultural_context":"English uses this French word for an office or a type of desk"},{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Well-known French dessert on many restaurant menus"},{"target":"déjà vu","native":"déjà vu","position":"End","cultural_context":"Common expression in English for the feeling you’ve experienced something before"}]}]
["v",{"thoughts":"French “v” is virtually identical to the English “v” sound, so English speakers already know how to make it. Biggest tip is to keep it voiced and avoid turning it into a “w.”","pattern":"v","position":"Anywhere","description":"The French “v” is a voiced labiodental fricative—exactly the same sound as the English “v” in “van.” Lightly place your bottom lip against your upper front teeth, let air pass out while your vocal cords buzz. Do NOT round your lips the way you do for an English “w.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Versailles","native":"Versailles","position":"Beginning","cultural_context":"Famous royal palace outside Paris, often mentioned in world-history classes and tourism"},{"target":"Louvre","native":"Louvre","position":"Middle","cultural_context":"World-renowned art museum in Paris that houses the Mona Lisa"},{"target":"vin","native":"vin","position":"Beginning","cultural_context":"French word for wine; shows up on wine lists and phrases like “vin rouge”"}]}]
["w",{"thoughts":"The letter “w” is rare in native French words and shows up almost exclusively in loan-words. French speakers treat it in two different ways: either like the English /w/ glide (as in “week-end”) or like a /v/ sound (as in “wagon”). Because English already has both sounds, the main challenge for learners is simply remembering which pronunciation a given French word uses.","pattern":"w","position":"Anywhere","description":"In French, the letter “w” is pronounced in one of two ways depending on the word’s origin:\n1. English origin → say it just like the English /w/ in “water,” lips rounded and quickly moving toward the following vowel.\n2. Germanic or older borrowings → pronounce it like a French /v/: teeth touch the bottom lip, voice on, no rounding.\nThere is no rule that always works, so learners must memorize word by word.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"wifi","native":"wifi","position":"Beginning","cultural_context":"Everyone sees this term on smartphones and laptops; borrowed directly from English tech vocabulary."},{"target":"week-end","native":"week-end","position":"Beginning","cultural_context":"Same spelling as English “weekend”; common in French to talk about Saturday-Sunday break."},{"target":"wagon","native":"wagon","position":"Beginning","cultural_context":"Looks like English “wagon”; heard in travel contexts (train car) or in phrases like “wagon restaurant.”"}]}]
["x",{"thoughts":"French “x” looks familiar to English speakers, but it doesn’t always sound the way it does in English.  The letter can be heard as /ks/ (like English), /gz/ (voiced), /s/ or /z/ between vowels, and it is sometimes silent at the end of a word (especially after a nasal vowel).  The mouth positions are exactly the same as the English /k/+/s/ or /g/+/z/ combinations, so the articulation itself is easy – the challenge is knowing which value to choose in a new word.","pattern":"x","position":"Anywhere","description":"Most of the time French “x” is pronounced /ks/ (the same sound you hear in English “fox”).  Before some vowels it becomes voiced /gz/ (similar to “eggs-zact” for the English speaker).  When it falls between two vowels it may soften to /z/ or /s/, and at the very end of many words it is silent (e.g. prix = /pri/).  So:  /ks/ (taxi), /gz/ (exact), /s/ or /z/ (oxygène, examen), or silent at word-end after a vowel or nasal sound (deux, prix).  Context, not spelling changes, tells you which one you will hear.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"International word for a cab; English speakers see it on city streets everywhere"},{"target":"Grand Prix","native":"Grand Prix","position":"End","cultural_context":"Name of famous automobile races and figure-skating finals; often said in English sports coverage"},{"target":"exact","native":"exact","position":"Middle","cultural_context":"Same spelling and meaning as the English word “exact,” commonly seen in bilingual texts or product descriptions"}]}]
["y",{"thoughts":"In French, the letter “y” almost always represents the glide /j/ – the same consonant sound an English speaker says at the start of “yes.” Because the sound itself exists in English, learners usually recognize and reproduce it without much effort. The main thing to remember is that French keeps the glide crisp and short; it never turns into a full vowel like the English long “ee.”","pattern":"y","position":"Anywhere","description":"/j/ – a quick, light glide made by raising the middle-front of the tongue toward the hard palate, identical to the English “y” in “yes.” It can occur at the start of a syllable (yoga), between consonant and vowel (Lyon), or twice in one word (yo-yo). Do NOT stretch it into an “ee” vowel; keep it a brief consonant.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"yoga","native":"yoga","position":"Beginning","cultural_context":"Common exercise/relaxation practice; same word in English"},{"target":"Lyon","native":"Lyon","position":"Middle","cultural_context":"Major French city often mentioned in travel and food shows"},{"target":"yo-yo","native":"yo-yo","position":"Multiple","cultural_context":"Classic toy name identical in English"}]}]
["z",{"thoughts":"French “z” is the same voiced hissing sound English speakers already know from words like “zoo.” It can appear at the start, in the middle, or (less often audibly) at the end of a word. Because the sound is already present in English, there is little new mouth movement to learn; learners mostly just need to remember that, unlike in some English words, a final written “z” in French is often silent.","pattern":"z","position":"Anywhere","description":"A voiced hissing consonant made by letting air pass continuously between the tip of the tongue and the upper teeth while the vocal cords vibrate – the exact same sound as the English “z” in “zoo.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"zéro","native":"zéro","position":"Beginning","cultural_context":"You may have heard French people count \"zéro, un, deux…\" in beginner courses or sports scores."},{"target":"Zidane","native":"Zidane","position":"Beginning","cultural_context":"Surname of Zinedine Zidane, the famous French soccer star and World-Cup-winning coach."},{"target":"Toulouse","native":"Toulouse","position":"Middle","cultural_context":"Well-known French city (home of Airbus) that appears in travel shows and airline routes."}]}]
["à",{"thoughts":"English already has the open \"ah\" vowel (as in “spa”). The grave accent here doesn’t change the basic mouth shape, it just shows stress or distinguishes words in French spelling. So the sound itself is familiar and easy; what’s new is noticing the accent mark.","pattern":"à","position":"Anywhere","description":"Pronounced like a short, open \"ah\"—the vowel you make for the English word \"spa\" or the first syllable of \"father.\" Keep the mouth relaxed and open; tongue is low and centered-to-front. The grave accent does not lengthen or nasalise the vowel—just makes sure you don’t glide toward an \"ay\" sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"à la carte","native":"à la carte","position":"Beginning","cultural_context":"Common menu phrase meaning you order items individually at restaurants"},{"target":"à la mode","native":"à la mode","position":"Beginning","cultural_context":"Dessert term in English for pie served with ice-cream"},{"target":"voilà","native":"voilà","position":"End","cultural_context":"Widely used interjection in English conversations to say “there it is!”"}]}]
["â",{"thoughts":"French â is basically an “ah” sound that English speakers already meet in words like “father.” The accent mainly tells the reader not to nasal-ize the vowel and sometimes signals where an old consonant used to be. Because the quality is so close to the English “ah,” recognition is easy, but learners must remember not to shorten it or slip into the flatter “a” of “cat.”","pattern":"â","position":"Anywhere","description":"Pronounce â as a long, open \"ah\"—the same mouth shape you use for the vowel in English “father” or “spa.” Keep the tongue low and toward the back of the mouth, lips relaxed and unrounded. Hold it very slightly longer than a plain French a, and do NOT nasalize it.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pâté","native":"pâté","position":"Middle","cultural_context":"Well-known meat spread seen in supermarkets and on appetizer menus"},{"target":"château","native":"château","position":"Middle","cultural_context":"Used in English for French castles and on many wine labels (e.g., Château Margaux)"},{"target":"Bâton Rouge","native":"Bâton Rouge","position":"Middle","cultural_context":"Capital city of Louisiana; its French name appears in U.S. news and travel guides"}]}]
["ä",{"thoughts":"The French letter “ä” is extremely rare and only turns up in a few proper names or foreign loan-words kept in their original spelling. Phonetically it is not a new sound for English speakers; it is simply the open “ah” sound of father, but the diaeresis (two dots) tells you to pronounce this “a” separately instead of blending it with the letter before it. So the main teaching point is rhythm and syllable separation, not mouth shape.","pattern":"ä","position":"Anywhere","description":"Pronounce it like the plain French “a” – an open, back-of-the-mouth “ah” (similar to the vowel in the English word “father”). The two dots (called “tréma” in French) are just a signal that this vowel must be articulated in its own syllable rather than sliding into the preceding vowel. Your tongue is low and relaxed; lips are neutral to slightly open.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Häagen-Dazs","native":"Häagen-Dazs","position":"Middle","cultural_context":"Well-known premium ice-cream brand sold in supermarkets and advertised in English-speaking countries"},{"target":"doppelgänger","native":"doppelgänger","position":"Middle","cultural_context":"Popular loan-word used in films, books and casual conversation to mean a look-alike"}]}]
["ç",{"thoughts":"For English speakers the cedilla is just a visual cue; the actual sound is the regular /s/. They have already said words like “façade,” so sound recognition is high and articulation is easy.","pattern":"ç","position":"Anywhere","description":"The letter “ç” (c-cedilla) is pronounced exactly like the English “s” in “see.” French uses the cedilla to force a soft /s/ sound before the vowels a, o, or u, where a plain “c” would normally be /k/. Simply place the tip of your tongue close to your upper teeth and let air pass—just say an English “s.” Do NOT add any “sh” or “k” quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"façade","native":"façade","position":"Middle","cultural_context":"Architectural term commonly used in English for the front of a building"},{"target":"garçon","native":"garçon","position":"Middle","cultural_context":"Heard in films or restaurants to refer to a (male) waiter"},{"target":"Curaçao","native":"Curaçao","position":"Middle","cultural_context":"Blue Curaçao liqueur is a popular cocktail ingredient"}]}]
["é",{"thoughts":"English speakers already meet “é” in common loan-words such as café or résumé, so the basic idea of the accent feels familiar. The actual French vowel is a pure, single sound /e/, like the first part of the English diphthong in “day” but without the finishing glide toward a ‘y’ sound.","pattern":"é","position":"Anywhere","description":"é is a clear, pure vowel pronounced /e/: tongue is pushed slightly forward and raised (mid-high front), lips relaxed and unrounded. Think of the very first part of the English vowel in “day,” but stop before your tongue glides or your jaw moves—keep it short and steady.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"café","native":"café","position":"End","cultural_context":"Seen on coffee shop signs and menus everywhere"},{"target":"fiancé","native":"fiancé","position":"End","cultural_context":"Common English term for someone engaged to be married"},{"target":"cliché","native":"cliché","position":"End","cultural_context":"Used in English to describe an overused idea or expression"}]}]
["è",{"thoughts":"English already has a very similar vowel in “bet,” so recognizing the quality is easy. The only tricky part is remembering to keep it pure and not turn it into a diphthong or schwa.","pattern":"è","position":"Anywhere","description":"This letter is pronounced as the open-mid front unrounded vowel [ɛ] – basically the short “e” sound in English “bet.” Keep the tongue low-mid and forward, lips relaxed, and make it one clean, steady vowel (don’t let it slide toward a y-sound or schwa).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"crème","native":"crème","position":"Middle","cultural_context":"Seen in dessert names like “crème brûlée” and expressions such as “crème de la crème.”"},{"target":"très","native":"très","position":"Middle","cultural_context":"Appears in the fashion phrase “très chic,” often used in English to mean “very stylish.”"},{"target":"Frère Jacques","native":"Frère Jacques","position":"Middle","cultural_context":"Title of the well-known French nursery rhyme sung by English-speaking children."}]}]
["ê",{"thoughts":"ê is basically the same vowel sound English speakers already make in the word “bet,” just spelled with a circumflex that does not change the modern French pronunciation. The accent mostly signals spelling history and helps show when a following consonant is silent.","pattern":"ê","position":"Anywhere","description":"Pronounce it like the short “e” in the English word “bet.” Open your jaw slightly, keep the tongue forward-mid in your mouth, lips relaxed, and make a quick, clear “eh” sound: /ɛ/. The accent mark (ˆ) does not add a glide or extra length—just aim for a clean, open “eh.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"crêpe","native":"crêpe","position":"Middle","cultural_context":"Thin French pancake now common on brunch menus and at food stands"},{"target":"tête-à-tête","native":"tête-à-tête","position":"Multiple","cultural_context":"Borrowed phrase for a private conversation, used in English writing and speech"},{"target":"bête noire","native":"bête noire","position":"Middle","cultural_context":"Idiomatic expression meaning a pet peeve or dreaded thing, appears in newspapers and books"}]}]
["ë",{"thoughts":"ë is rare in French; it simply forces the reader to pronounce this particular “e” as its own syllable instead of letting it disappear or combine with a preceding vowel. English speakers have run into it in Christmas carols (Noël) or with the car maker Citroën, so the sign may look familiar even if they have never thought about what it does.","pattern":"ë","position":"Anywhere","description":"Treat it like a clear, separate “eh” sound (similar to the short e in English “bet”). The dots tell you that this e must be pronounced and starts a new syllable: No-ël, Ci-tro-ën. Keep it short and relaxed, not the long English ‘ay’.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Noël","native":"Noël (Christmas)","position":"Middle","cultural_context":"The word appears in the old English carol “The First Noël,” sung every holiday season."},{"target":"Citroën","native":"Citroën","position":"Middle","cultural_context":"French automobile brand whose logo you see on European streets and in car-enthusiast media."},{"target":"Zoë","native":"Zoë","position":"End","cultural_context":"Common given name in English-speaking countries (e.g., actress Zoë Kravitz)."}]}]
["î",{"thoughts":"Î (i-with-circumflex) is pronounced exactly like the regular French i /i/—a pure, tense “ee” sound. The accent mostly serves spelling/history functions, so the sound itself will feel very familiar to English speakers who already say “ee” in words like “see.”","pattern":"î","position":"Anywhere","description":"Say a short, pure “ee” as in English “machine,” but keep it very crisp: mouth slightly smiling, tongue high and forward, lips unrounded. The circumflex does NOT change the sound; it simply marks spelling history or distinguishes words.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Île-de-France","native":"Île-de-France","position":"Beginning","cultural_context":"Region around Paris that’s often referenced in travel shows, guidebooks, and news"},{"target":"gîte","native":"gîte","position":"Middle","cultural_context":"Common term on travel sites for a French vacation rental cottage"},{"target":"Nîmes","native":"Nîmes","position":"Middle","cultural_context":"French city famous for Roman ruins and for giving us the word “denim” (‘serge de Nîmes’)"}]}]
["ï",{"thoughts":"ï is not a new sound; it just marks that the normal French i (like the English “ee” in see) must be pronounced as its own syllable instead of merging with the surrounding vowels. English already has the sound, and learners have probably seen the diaeresis in words like naïve and Haïti, so recognition is reasonably good.","pattern":"ï","position":"Anywhere","description":"It is the regular French i sound – a pure, close, unrounded \"ee\" (like the vowel in English “machine”). The two dots simply warn you to pronounce this i as a separate syllable, not blended into the preceding vowel. Keep your lips spread, tongue high and forward, and make a short, steady \"ee\" sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"naïve","native":"naïve","position":"Middle","cultural_context":"Common English word meaning inexperienced or innocent; sometimes written with the two dots in formal text"},{"target":"Haïti","native":"Haïti","position":"Middle","cultural_context":"Caribbean country often mentioned in news and geography classes"},{"target":"aïoli","native":"aïoli","position":"Middle","cultural_context":"Garlic mayonnaise frequently listed on restaurant menus, cooking shows, and recipe sites"}]}]
["ô",{"thoughts":"English already has an “oh” sound, so the quality is familiar, but French keeps the lips rounded and the vowel pure (no glide toward a “w” or “oo”). The accent mark just signals that pure, closed quality and sometimes a lost historical consonant. Most learners have seen it in words like “hôtel.” Pronunciation is usually not hard once they remember to keep it short and steady.","pattern":"ô","position":"Anywhere","description":"French ô is a closed, pure “oh” sound (IPA /o/). Shape your lips into a small round opening as if saying the English word “go,” but hold the vowel steady without sliding toward a “w” or “oo.” Keep it short and tense—one single sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hotel","position":"Beginning","cultural_context":"Same word you book when you travel; often shown with the accent on French signs and websites"},{"target":"Côte d’Azur","native":"French Riviera","position":"Middle","cultural_context":"Famous Mediterranean vacation coastline mentioned in travel shows and movies"},{"target":"rôle","native":"role","position":"Middle","cultural_context":"Word “role” used in English theatre or gaming; French originals still show the accent in credits or scripts"}]}]
["ö",{"thoughts":"French “ö” is not a special new vowel like the German ö. It is simply a normal French “o” sound, but the two dots (¨) tell you to pronounce it in its own syllable, separate from the vowel right before or after it (e.g., No–ël, Ci–tro–ën). So the challenge is noticing the dieresis and keeping the syllables separate, not learning a brand-new mouth position.","pattern":"ö","position":"Anywhere","description":"Pronounce exactly the regular French closed “o” (similar to the first part of English “go,” but without the final glide). The dieresis (¨) only signals that this “o” begins a new syllable instead of combining with the surrounding vowels. Say a clean, pure “oh” sound, then move on to the next syllable.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Noël","native":"Christmas","position":"Middle","cultural_context":"French word for Christmas; seen on holiday cards, songs like “The First Noël”"},{"target":"Citroën","native":"Citroën","position":"Middle","cultural_context":"Well-known French car brand; logo often seen in movies, Formula 1, and European streets"},{"target":"coöperation (older spelling)","native":"cooperation","position":"Middle","cultural_context":"You may have seen this diaeresis in older English texts; shows the two “o” vowels are separate"}]}]
["ù",{"thoughts":"There is only one very common French word that actually uses the grave-accented “ù”: ‘où’ (“where”). The letter is pronounced exactly like the standard French “u” sound [y]—a front, rounded vowel that does not exist in English. Even though the spelling is rare, learners still need to master the sound because it shows up all the time in regular “u” words too (tu, jus, lune, etc.). English speakers usually find the lip-rounding + front-tongue position tricky.","pattern":"ù","position":"Anywhere","description":"Make the front of your tongue touch the position for the English “ee” in “see,” but at the same time round your lips tightly as though you were about to say “oo” in “food.” Keep the tongue forward and do NOT pull it back. The result is a high, front, rounded vowel written in phonetics as [y]. It is exactly the same sound as the plain French letter “u.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"où","native":"where","position":"End","cultural_context":"Common French question word; you meet it in phrases like “Où est…?” when traveling or in beginner textbooks"},{"target":"Où est Charlie ?","native":"Where’s Waldo?","position":"Beginning","cultural_context":"French title of the famous children’s picture-book series, known worldwide"},{"target":"Où est la bibliothèque ?","native":"Where is the library?","position":"Beginning","cultural_context":"Humorous stock sentence English speakers often quote when joking about their first French lesson"}]}]
["û",{"thoughts":"English has no exact equivalent of the French front-rounded vowel /y/ written û (and also plain u). Learners usually try to say “oo” or “ee”, but they need both tongue position of “ee” and lip rounding of “oo” at the same time.","pattern":"û","position":"Anywhere","description":"Same sound as an unaccented French “u”: a high front, tightly rounded vowel /y/. To make it, start to say the English “ee” in “see” (tongue high and forward), but at the same time round your lips as if you were going to say “oo” in “food”. Keep the tongue forward; do NOT pull it back like in English “oo.” The circumflex does not change the modern pronunciation, but it marks historical spelling and helps distinguish words in writing.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Famous French caramel-topped custard dessert found on many restaurant menus"},{"target":"flûte","native":"flûte","position":"Middle","cultural_context":"Classical music term—the French word that gave English “flute,” often seen in scores or descriptions of instruments"},{"target":"croûton","native":"croûton","position":"Middle","cultural_context":"Toasted bread cubes added to salads and soups; packaging sometimes keeps the French spelling"}]}]
["ü",{"thoughts":"In French spelling, a tréma over u (ü) is rare. It simply tells you to pronounce the normal French vowel /y/ instead of letting the u stay silent after g or another vowel. English has no /y/, but many learners have seen the same symbol in German words like “über,” so the look of it may feel familiar even if the mouth-movement is not.","pattern":"ü","position":"Anywhere","description":"Make your mouth as if you were going to say “oo” in “food,” but at the same time push your tongue forward toward the position for the “ee” in “see.” Keep the lips rounded the whole time. The result is a tight, front-rounded vowel written as ü (or plain u) in French and as ü in German. It is the same sound you already need for the regular French letter “u.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Über","native":"über","position":"Beginning","cultural_context":"The original German word behind the ride-sharing company name “Uber” and the English prefix meaning “super.”"},{"target":"Müsli","native":"muesli","position":"Middle","cultural_context":"Well-known Swiss/German breakfast cereal sold internationally."},{"target":"Brüno","native":"Brüno","position":"Middle","cultural_context":"Title of the 2009 comedy film starring Sacha Baron Cohen, advertised with the umlaut in English-language media."}]}]
["ÿ",{"thoughts":"The letter ÿ is extremely rare in modern French; it is basically the normal French “y” sound, but the two dots (tréma) tell the reader to pronounce it as its own syllable instead of blending with the vowel before it. Because the character almost never appears in everyday vocabulary, English speakers are unlikely to have run across it, yet the sound itself (the “ee” /i/ vowel or the glide /j/ as in y-es) is very easy for them to make.","pattern":"ÿ","position":"Anywhere","description":"Pronounce ÿ exactly like a normal French y: either the vowel sound /i/ (similar to the English long “ee”) or, when it comes right after another vowel, as a quick y-glide /j/ starting its own syllable. The two dots only mean “pronounce this y separately,” not “change the sound.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Easy","example_words":[{"target":"Aÿ","native":"Aÿ (Champagne village)","position":"End","cultural_context":"Appears on many Champagne labels (e.g., Bollinger, Ayala), so wine drinkers or anyone who’s seen a Champagne bottle may have noticed it"},{"target":"L’Haÿ-les-Roses","native":"L’Haÿ-les-Roses","position":"Middle","cultural_context":"Paris suburb whose name shows up on Paris Metro maps and in travel guides"},{"target":"Croÿ","native":"Croÿ","position":"End","cultural_context":"Historic noble family name encountered in European history books, art museums, and some castle names"}]}]
["œ",{"thoughts":"English has no native rounded-front vowels, so this sound is unfamiliar, but learners may have seen it in food terms like “bœuf” or “hors d’œuvre.” The big challenge is keeping the tongue in the “eh” position while rounding the lips.","pattern":"œ","position":"Anywhere","description":"Pronounce it like the German ö or the French eu in “peur.” Start saying the English vowel in “bet,” but at the same time ROUND your lips as if you were going to say “oo.” The tongue stays forward and low-mid, the lips stay rounded and slightly protruded. The result is a short, clipped, rounded “eh” sound: [œ].","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bœuf (as in “Bœuf Bourguignon”)","native":"bœuf","position":"Beginning","cultural_context":"Classic French beef stew popularized by Julia Child; the word often appears on English-language menus"},{"target":"hors d’œuvres","native":"hors d’œuvres","position":"Middle","cultural_context":"Common catering term in English for small appetizer bites"},{"target":"œuvre (as in “chef-d’œuvre”)","native":"œuvre","position":"Beginning","cultural_context":"The phrase “chef-d’œuvre” meaning “masterpiece” is used in art and literature discussions"}]}]
["ai",{"thoughts":"Biggest hurdle for English speakers is spelling: they see “ai” and want to say the English diphthong /eɪ/ (as in “rain”). In French, however, it is usually a single, open-mid vowel /ɛ/—the “eh” of “bet.” The sound itself exists in English, so the mouth position is familiar; only the spelling-to-sound link is new.","pattern":"ai","position":"Anywhere","description":"French “ai” is normally pronounced as a single, quick “eh” sound, like the vowel in English “bet.” Open your mouth slightly, tongue forward and relaxed, no glide at the end. (In a few word-final verb forms it can be a closed “ay” /e/, but the most common value you’ll meet is the open “eh” /ɛ/.)","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"laissez-faire","native":"laissez-faire","position":"Middle","cultural_context":"Common economic and political phrase used in English media"},{"target":"café au lait","native":"café au lait","position":"End","cultural_context":"Coffee-with-milk drink name you see on café menus"},{"target":"Renaissance","native":"Renaissance","position":"Middle","cultural_context":"Name of a major historical period studied in school"}]}]
["ei",{"thoughts":"French “ei” is almost always the single open-e vowel /ɛ/, the same sound English speakers use in “bed”.  The sound can show up anywhere in a French word.  Because the vowel itself is familiar, the only real challenge is remembering not to glide into an “ay” diphthong the way many English speakers do.","pattern":"ei","position":"Anywhere","description":"Say the short, open “eh” vowel you hear in English “bet/bed”, but hold it steady—do NOT let it slide toward a y-glide.  Lips are unrounded, jaw slightly open, tongue forward and low-mid in the mouth.  It is a single pure vowel, not two sounds.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Seine","native":"Seine","position":"Middle","cultural_context":"Famous river that runs through Paris—often mentioned in travel shows and news"},{"target":"beignet","native":"beignet","position":"Middle","cultural_context":"Popular New Orleans French-style pastry sold in cafés like Café du Monde"},{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"Champagne-region city known for sparkling wine and World War II history"}]}]
["oi",{"thoughts":"French “oi” is usually pronounced /wa/. English speakers have met it in words like “croissant” or “soirée,” so the sound is not totally new, but spelling-to-sound mapping is different from English. They must remember it is not /oi/ as in “oil,” but /wa/. Lip rounding then opening is a small new motor pattern, but not very hard.","pattern":"oi","position":"Anywhere","description":"Say a quick English “w” sound while rounding your lips, then immediately open into a short, bright “ah” (as in British “father”). The result is one smooth syllable /wa/. Do NOT pronounce it like the English diphthong in “boy” or “oil.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant (buttery pastry)","position":"Middle","cultural_context":"Common breakfast pastry found in cafés and grocery stores"},{"target":"moi","native":"me","position":"End","cultural_context":"Often heard in phrases like “moi aussi” in movies or “moi?” for comedic emphasis"},{"target":"soirée","native":"evening party","position":"Middle","cultural_context":"Borrowed into English to mean a fancy evening gathering"}]}]
["oy",{"thoughts":"English speakers already make the /wɑ/ sound (“wa” in “wander”), but they never spell it “oy,” so the spelling-to-sound link is unfamiliar, even though the physical pronunciation is easy.","pattern":"oy","position":"Anywhere","description":"In French, the letters “oy” blend into one quick syllable that sounds like English “wa” in “water.” Start with a short English w-glide, then immediately open into the broad “ah” vowel as in “father”: /wa/. It is one continuous sound, not two separate vowels like the English “boy.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"voyage","native":"voyage","position":"Middle","cultural_context":"Heard in the farewell phrase “Bon voyage!” used in English to wish someone a good trip"},{"target":"Royale","native":"royale","position":"Beginning","cultural_context":"Seen in pop culture titles such as the movie “Casino Royale” and video-game term “Battle Royale”"},{"target":"Joyeux (as in “Joyeux Noël”)","native":"joyeux","position":"Beginning","cultural_context":"Common holiday greeting “Joyeux Noël” often appears on Christmas cards and decorations"}]}]
["ui",{"thoughts":"English speakers already know the “w-ee” glide in words like “week,” so the French spelling “ui” will sound somewhat familiar, but the lips must stay tightly rounded for the brief glide /ɥi/. It can show up anywhere in a word.","pattern":"ui","position":"Anywhere","description":"Glide quickly from a very rounded \"oo\" mouth position to the \"ee\" tongue position without breaking it into two syllables. Think of saying English “we,” but start with tighter, puckered lips. The result is one smooth sound, written /ɥi/ in phonetics.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"cuisine","native":"cuisine","position":"Beginning","cultural_context":"Common loanword meaning style of cooking, as in “French cuisine”"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"Middle","cultural_context":"Global luxury fashion brand; the name Louis is also well-known"},{"target":"suite","native":"suite","position":"Beginning","cultural_context":"Borrowed term for a set of rooms in a hotel or a set of software programs, e.g., “office suite”"}]}]
["ou",{"thoughts":"“ou” is almost the same sound English speakers already know from “food” or “blue,” so recognition is high and production is usually straightforward.","pattern":"ou","position":"Anywhere","description":"Pronounced like the long “oo” in English words such as “food” or “zoo.” Keep your lips rounded, tongue pulled back, and hold the vowel a bit shorter and tenser than in relaxed English speech.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"bouquet","native":"bouquet","position":"Middle","cultural_context":"Used in English to mean a bunch of flowers"},{"target":"mousse","native":"mousse","position":"Middle","cultural_context":"Common dessert (chocolate mousse) and hair-styling product"},{"target":"souvenir","native":"souvenir","position":"Middle","cultural_context":"Widely used English loanword for a travel keepsake"}]}]
["eu",{"thoughts":"French “eu” is a rounded front-mid vowel that doesn’t exist in General American or Received Pronunciation English, so learners usually substitute an English “uh” or “er” sound. Giving them very familiar loan-words like “euro,” “bleu (cheese),” and the car brand “Peugeot” lets them hear the target vowel in words they already know.","pattern":"eu","position":"Anywhere","description":"Round your lips as if you were going to say the English “oo” in “food,” but instead pronounce the English “uh” in “fun.” Keep the tongue forward (close to where it would be for the English “ay” in “say,” but lower) while maintaining lip-rounding. The result is a smooth, single vowel—never a diphthong. It is similar to the vowel in some British pronunciations of “sir,” but with clearly rounded lips.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"euro","native":"euro (European currency)","position":"Beginning","cultural_context":"News, travel, and finance stories frequently mention the euro"},{"target":"bleu (from “bleu cheese”)","native":"bleu → “blue”","position":"End","cultural_context":"Common menu item and supermarket product: “bleu cheese” dressing or crumbles"},{"target":"Peugeot","native":"Peugeot (French car brand)","position":"Middle","cultural_context":"Widely advertised international automobile manufacturer"}]}]
["au",{"thoughts":"English speakers already meet the French spelling “au” in loan-words like “faux pas” and car-maker “Renault.” It is always pronounced as one pure, rounded vowel /o/, very close to the long “o” in English “go,” but held a touch shorter and without the slight glide some Americans add.","pattern":"au","position":"Anywhere","description":"Pronounce it as a single, rounded \"oh\" sound, similar to the English long O in “go.” Keep the lips rounded, tongue mid-high and back. Avoid adding an extra glide (no “ow” diphthong).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"chauffeur","native":"driver","position":"Beginning","cultural_context":"Common loan-word in English for a hired driver"},{"target":"faux pas","native":"faux pas","position":"Beginning","cultural_context":"Well-known phrase for a social blunder"},{"target":"Renault","native":"Renault","position":"Middle","cultural_context":"French car brand often seen in news, racing, and on roads"}]}]
["eau",{"thoughts":"“eau” is one of the first French spellings English speakers notice because it shows up in several loan-words they already use (beau, bureau, plateau, château). Phonetically it is simply the long “o” sound, so the only new thing to remember is that French keeps it as a pure vowel without the slight English glide toward a “w.”","pattern":"eau","position":"Anywhere","description":"Pronounce it like the long “o” in English “go,” but keep it pure and steady: lips rounded, tongue in the middle-back of the mouth, no off-glide toward a “w.” IPA /o/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"beau","native":"beau","position":"End","cultural_context":"Used in English for a boyfriend or dashing man; also a common given name (e.g., actor Beau Bridges)."},{"target":"bureau","native":"bureau","position":"End","cultural_context":"Everyday English word for a desk/dresser and in names like the Federal Bureau of Investigation."},{"target":"plateau","native":"plateau","position":"End","cultural_context":"Geography term taught in school for a flat-topped highland; also used figuratively (e.g., weight-loss plateau)."}]}]
["oeu",{"thoughts":"“oeu / œu” spells the rounded front vowel you hear in French words like “bœuf” or “cœur.”  English has no native sound like it, so learners usually replace it with the English “uh” or “er.”  Still, they have run into the spelling in food terms (hors d’oeuvre, bœuf bourguignon) or place names (Coeur d’Alene).  The sound can occur anywhere in a French word.","pattern":"oeu","position":"Anywhere","description":"Shape your lips as if you are going to say the English “oo” in “boo,” but instead of letting the tongue stay back, move it forward as if you were saying the English vowel in “bed.”  Keep the lips rounded the whole time.  The result is a rounded version of the English “eh” sound, written phonetically as /ø/ (when the syllable is open) or the slightly more relaxed /œ/ (when it is closed by a pronounced consonant).  English has no exact match, but it is similar to the German “ö.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"hors d'oeuvre","native":"hors d'oeuvre (appetizer)","position":"Middle","cultural_context":"Common menu term for small starters at receptions and restaurants"},{"target":"oeuvre","native":"œuvre (“body of work”)","position":"Beginning","cultural_context":"Used in English arts writing: e.g., “the artist’s entire oeuvre.”"},{"target":"Coeur d'Alene","native":"Coeur (“heart”) in the place name Coeur d’Alene","position":"Beginning","cultural_context":"City and lake in Idaho often mentioned in U.S. travel or geography contexts"}]}]
["oe",{"thoughts":"The French “oe” (often written as the single-letter ligature “œ”) represents a rounded front vowel /œ/ or its close variant /ø/. English has no native sound that is exactly the same, so learners need a short, relaxed “e” as in “bet” while rounding the lips as for “o.” It shows up anywhere in French words and turns up in a few loan-words that English speakers already know (oeuvre, hors d’oeuvre, Coeur d’Alene). Exposure is occasional, so familiarity is moderate and pronunciation effort is medium.","pattern":"oe","position":"Anywhere","description":"Make the short “e” sound from English “bet,” but at the same time round your lips as if you were going to say “o.” Keep the tongue forward, not pulled back. It is one single vowel, shorter than the English “er” in “her,” with no ‘r’ coloring.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"oeuvre","native":"work, artistic output","position":"Beginning","cultural_context":"Used in English when talking about an artist’s entire body of work, e.g., “the director’s oeuvre.”"},{"target":"hors d'oeuvre","native":"appetizer / hors d'oeuvre","position":"Middle","cultural_context":"Common term on English menus for small starters served at parties or receptions."},{"target":"Coeur d'Alene","native":"Coeur d'Alene (place name)","position":"Middle","cultural_context":"U.S. city and lake in Idaho often mentioned in travel, skiing, and outdoor-sports contexts."}]}]
["an",{"thoughts":"English lacks true nasal vowels, but many English speakers have heard the French /ɑ̃/ in words like “croissant.” The sound can occur anywhere in a French word and is always nasal, never followed by a pronounced consonant “n.”","pattern":"an","position":"Anywhere","description":"This French “an” is a nasal vowel, written ‘an’, ‘am’, ‘en’, or ‘em’ before certain consonants. To make it, start with the open back vowel of English “father,” then let some air flow out through your nose while keeping the back of your tongue low and not touching the roof of your mouth. The final ‘n’ or ‘m’ is NOT pronounced; its only job is to signal that the vowel is nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"André","native":"André","position":"Beginning","cultural_context":"Common French first name; known from André the Giant, the famous wrestler and actor"},{"target":"Mont Blanc","native":"Mont Blanc","position":"Middle","cultural_context":"Name of the tallest mountain in Western Europe and a luxury pen brand"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Popular flaky pastry sold in many cafés and bakeries"}]}]
["am",{"thoughts":"French “am” (before another consonant or at the end of a word) represents the nasal vowel /ɑ̃/. English has no true nasal vowels, but speakers do make vowels nasal before m/n/ng, so the idea is somewhat familiar. Picking well-known international words lets the learner hear the sound in vocabulary they already recognize.","pattern":"am","position":"Anywhere","description":"Pronounce a broad open “ah” (like the a in “father”), but let the air also escape through your nose at the same time and do NOT close your lips to finish an m sound. Your mouth stays open, tongue low, and the resonance shifts into the nose, producing one single nasal vowel /ɑ̃/. No audible m follows.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Amsterdam","native":"Amsterdam","position":"Beginning","cultural_context":"Major European city; capital of the Netherlands, often mentioned in travel and news"},{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Famous sparkling wine used in celebrations; same word in English"},{"target":"Vietnam","native":"Vietnam","position":"End","cultural_context":"Country frequently referenced in history and current events"}]}]
["en",{"thoughts":"“en” is the most common French spelling of the nasal vowel /ɑ̃/. English has no true nasal vowels, so learners often try to pronounce an audible n-sound at the end or use an American “awn.” They may have heard it in loan-words like “entrepreneur” but seldom realise the special mouth–nose airflow involved.","pattern":"en","position":"Anywhere","description":"Open your mouth as if saying a short, relaxed “ah,” but let the sound resonate partly in your nose. Keep your tongue low and toward the back; your soft palate lowers so air escapes through both mouth and nose. Crucially, you do NOT finish with a separate n-consonant—the nasal quality replaces it. It ends up sounding a bit like a very quick, soft “ahn,” but without closing your lips or tongue at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"entrepreneur","native":"entrepreneur","position":"Beginning","cultural_context":"Common business term for a start-up founder, widely used in English"},{"target":"rendezvous","native":"rendezvous","position":"Middle","cultural_context":"Borrowed word meaning a meeting; appears in movies, news, and everyday speech"},{"target":"encore","native":"encore","position":"Beginning","cultural_context":"Word audiences shout at concerts to request another performance"}]}]
["em",{"thoughts":"“em” usually signals the French nasal vowel /ɑ̃/ when it appears before another consonant (m, b, p, etc.). English has no equivalent dedicated nasal vowel, so learners must remember NOT to finish the sound with an audible m-consonant. The letters may also behave normally (pronounced /ɛm/) when followed by a vowel, but the nasal reading is the one that trips learners up.","pattern":"em","position":"Anywhere","description":"When the letters “em” come directly before another consonant in French, they fuse into a single nasal vowel. Start with an open \"ah\" sound (as in British “bath”) while lowering the soft-palate so air also flows through your nose. Do NOT close your lips to make an /m/—the lips only begin to move toward an /m/ shape, but the sound stops before they touch.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"embargo","native":"embargo","position":"Beginning","cultural_context":"Same word in English meaning a trade ban; news reports often mention an “embargo” on a country."},{"target":"ensemble","native":"ensemble","position":"Middle","cultural_context":"Used in English for a coordinated outfit or a musical group (“string ensemble”)."},{"target":"temps","native":"temps","position":"Middle","cultural_context":"Appears in ballet terms (e.g., “temps levé”) and in the famous novel title “À la recherche du temps perdu.”"}]}]
["on",{"thoughts":"French “on” is a nasal vowel (IPA [ɔ̃/õ]) that English speakers have heard in words like “bon appétit.” They don’t have this exact standalone vowel in English, but they do nasal-color vowels before n/m (as in “song”) so the sensation isn’t totally alien.","pattern":"on","position":"Anywhere","description":"Start as if you were saying a rounded “aw” like the vowel in British “law” or the first part of “song,” but let some of the air escape through your nose while keeping your tongue and lips in place. Crucially, you do NOT finish with an n sound—the n is only there to show the nasalization. Lips stay rounded, mouth a bit open, soft palate lowers so air resonates in both mouth and nose, producing one single nasal vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bon appétit","native":"bon appétit","position":"End","cultural_context":"Common phrase said before eating, used in English cooking shows and restaurants"},{"target":"Montréal","native":"Montreal","position":"Beginning","cultural_context":"Large Canadian city frequently mentioned in travel, sports, and news"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"End","cultural_context":"Famous French luxury fashion brand visible in ads and pop culture"}]}]
["om",{"thoughts":"French “om” almost always represents the nasal vowel /ɔ̃/. English has the vowel part (like the “o” in “long”), but it does not normally nasalise vowels, so learners must remember to let air escape through the nose while keeping the lips rounded and not to pronounce a full m-sound afterwards. The spelling shows up in several loan-words English speakers already recognize (champagne, trombone, Dom Pérignon). Because the base vowel is familiar but the nasal resonance is new, the sound feels half-known, half-foreign.","pattern":"om","position":"Anywhere","description":"Pronounce it as a single nasal vowel: start with the ‘aw’ sound in English “long” or “dawn,” keep your lips slightly rounded, lower the back of the tongue, and simultaneously let air resonate through the nose. Do NOT finish with a separate m consonant—your lips should not fully close at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Famous sparkling wine served at celebrations"},{"target":"trombone","native":"trombone","position":"Middle","cultural_context":"Common brass instrument name is identical in English"},{"target":"Dom Pérignon","native":"Dom Pérignon","position":"Beginning","cultural_context":"Luxury champagne brand frequently mentioned in pop culture"}]}]
["un",{"thoughts":"English has no true nasal vowels, so the French “un” (/œ̃/) is unfamiliar. Learners must close the mouth cavity for an “uh/er”-like sound while letting air escape through the nose, without adding an extra n sound. It can occur at the start, middle, or end of words.","pattern":"un","position":"Anywhere","description":"Pronounce the vowel of a very short English “uh” or the start of “er,” but lower your soft palate so some air goes out through the nose. Keep the lips slightly rounded like the French \"eu\" in “deux,” and do NOT finish with an audible n. The result is one single nasal vowel: /œ̃/.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"un","native":"one","position":"Beginning","cultural_context":"Basic French number often seen on bilingual packaging or language-learning apps"},{"target":"parfum","native":"perfume","position":"Middle","cultural_context":"Appears on nearly every French perfume bottle or cosmetics label: “eau de parfum”"},{"target":"jungle","native":"jungle","position":"Middle","cultural_context":"English speakers know the word from nature or Tarzan movies; in French it’s spelled the same but the “un” is nasal"}]}]
["um",{"thoughts":"French “um” is visually familiar to English speakers, but the pronunciation changes depending on the word family.  Learners already know loan-words like “forum” or “maximum,” where the m is pronounced.  The tricky part is everyday French words such as “parfum,” where the m disappears and the vowel becomes the nasal sound /œ̃/ (similar to the vowel in “un”).  So the spelling looks easy, but the sound can be completely different from the English hesitation word “uhm.”","pattern":"um","position":"Anywhere","description":"There are two common pronunciations for the spelling “um.” 1) In most Latin-origin learned words (forum, maximum, album) you say an open mid back rounded vowel /ɔ/ (close to the o in “law”), then close your lips to release an audible m: /ɔm/. 2) In a handful of everyday words ending in –um after p, b, f, or h (parfum, humble, rhum), the m is silent and the vowel becomes the nasal /œ̃/ (the same sound you hear in “un”).  For the nasal version, round your lips slightly, lower the jaw a little, keep the tongue in mid-central position, and let air resonate through the nose—no final m sound is released.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"parfum","native":"parfum","position":"End","cultural_context":"Seen on perfume bottles and in duty-free shops; English word “perfume” comes from it"},{"target":"maximum","native":"maximum","position":"End","cultural_context":"Same spelling in English for the mathematical or everyday term “maximum”"},{"target":"forum","native":"forum","position":"End","cultural_context":"Common English loan-word for an online discussion board or public meeting"}]}]
["in",{"thoughts":"French “in” represents the nasal vowel /ɛ̃/. English has no true nasal vowels, so learners must consciously block airflow through the mouth slightly and let some air resonate in the nose while saying a mid-front vowel. The sound can occur anywhere in a word.","pattern":"in","position":"Anywhere","description":"Start with the English short “e” in “pen,” open your mouth a bit wider, lower the soft palate so air also flows through your nose, and don’t add an “n” at the end – the nasal resonance replaces it. Your tongue stays mid-front and relaxed.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"vin","native":"vin (wine)","position":"End","cultural_context":"Even non-French speakers know “vin rouge/vin blanc” from restaurant menus and wine labels"},{"target":"Tintin","native":"Tintin","position":"Multiple","cultural_context":"Famous Franco-Belgian comic-book hero whose adventures are sold and filmed worldwide"},{"target":"Michelin","native":"Michelin","position":"End","cultural_context":"Well-known tire company and publisher of the prestigious Michelin restaurant stars"}]}]
["im",{"thoughts":"English speakers see the letters “im” in many words they already know (important, impossible), but in French it represents a single nasal vowel [ɛ̃] when the m is NOT followed by another vowel. The ‘m’ is not pronounced as a consonant; instead the preceding vowel becomes nasal. That idea (air flows through mouth + nose at the same time) is new for many learners, but the overall mouth shape is close to the short e in “bet,” just slightly higher and with added nasal resonance.","pattern":"im","position":"Anywhere","description":"When “im” is followed by another consonant (important, impossible, impasse, etc.) it is pronounced as one nasal vowel, roughly [ɛ̃]. To make it: open the mouth slightly, keep the tongue forward-mid (between English “eh” and “ih”), and let some air vibrate through the nose while you voice the vowel. Do NOT close the lips for an /m/ sound; the m is only a spelling signal for nasalization. If another vowel follows (imagine, immobilier), the i and m are pronounced separately and the vowel is no longer nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"impossible","native":"impossible","position":"Beginning","cultural_context":"Same word exists in English; movie title “Mission: Impossible” makes it very familiar"},{"target":"important","native":"important","position":"Beginning","cultural_context":"Closely resembles the English word “important,” frequently seen in bilingual signs and labels"},{"target":"impasse","native":"impasse","position":"Beginning","cultural_context":"Borrowed into English to mean a dead-end or stalemate, used in news and politics"}]}]
["yn",{"thoughts":"‘yn’ is one of the spellings French uses for the nasal vowel /ɛ̃/ – the same sound you see in very common groups like “in”, “ain”, or “ein.” The big hurdle is that nothing in everyday English is quite the same: you have to pronounce a short “eh”-like vowel while letting air escape through the nose and completely dropping the final n-sound. Because the letters y and n are familiar, learners often want to say /ajn/ or /ɪn/. Recognising that the n is silent and that the vowel is nasal is the key.","pattern":"yn","position":"Anywhere","description":"Pronounce it as the French nasal vowel /ɛ̃/. Start with a sound similar to the English “eh” in “set,” then raise the back of your tongue slightly and let the air resonate partly through your nose. Do NOT pronounce an audible n; the n only serves to nasalise the vowel. The lips stay relaxed and there is no glide like the English “y.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"syndrome","native":"syndrome","position":"Middle","cultural_context":"The medical term “syndrome” is identical in English and often heard in health news"},{"target":"sphinx","native":"sphinx","position":"Middle","cultural_context":"The mythical creature ‘sphinx’ appears in history books and pop culture"},{"target":"lynx","native":"lynx","position":"Middle","cultural_context":"Name of the wild cat species, used in nature documentaries and even tech brand names"}]}]
["ym",{"thoughts":"French “ym” is just a spelling cue: it tells you to nasal-ize the vowel /ɛ̃/. English speakers hear a similar nasal coloring before n/m in words like “pen,” so the sensation is not brand-new, but they must remember NOT to pronounce a separate y or m.","pattern":"ym","position":"Anywhere","description":"When French shows the letters “ym” followed by another consonant (or at the end of certain prefixes), pronounce a single nasal vowel /ɛ̃/ – no y-glide, no m sound. Start with the vowel in English “set” (/ɛ/), then let air also pass through your nose, keeping lips relaxed. End the sound without closing your lips; the written “m” is silent and only signals nasalization.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"sympa","native":"sympa","position":"Middle","cultural_context":"Common casual French word for “nice”; shows up in travel blogs and subtitles."},{"target":"symbole","native":"symbole","position":"Middle","cultural_context":"Looks like the English word “symbol”; often used in news or art discussions."},{"target":"Olympique (as in “Olympique de Marseille”)","native":"Olympique","position":"Middle","cultural_context":"Name of well-known French soccer clubs; seen in sports headlines."}]}]
["ain",{"thoughts":"‘ain’ represents the nasal vowel /ɛ̃/. English has no nasal vowels, but learners have probably heard this sound in food names like “pain au chocolat” or brands like “Saint Laurent.” The sound can appear anywhere in a French word, so note position “Anywhere.” Biggest challenge: letting air resonate in the nose while keeping the mouth half-open as for short English “eh.”","pattern":"ain","position":"Anywhere","description":"Pronounce the open “eh” vowel (like the e in “get”) while letting air escape through your nose at the same time. The soft n is not fully spoken—the tongue stays low and does NOT touch the roof of the mouth. The result is a nasal ‘eh’ sound: /ɛ̃/. Do not add an extra ‘n’ at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pain (as in pain au chocolat)","native":"pain","position":"End","cultural_context":"Name of the bread/pastry you see in cafés and bakeries—“pain au chocolat.”"},{"target":"Saint Laurent","native":"Saint Laurent","position":"Middle","cultural_context":"Luxury fashion brand (Yves Saint Laurent) known worldwide."},{"target":"bain-marie","native":"bain-marie","position":"Beginning","cultural_context":"Common cooking term for a hot-water bath used on TV cooking shows and recipes."}]}]
["aim",{"thoughts":"English speakers have seen the letters “aim” in French love phrases like “je t’aime” or in the names Aimée/Aimé, but they rarely know the nasal-vowel rule. The sound can be either the nasal vowel /ɛ̃/ (when the group ends the syllable) or the oral /ɛm/ (when another vowel follows). The nasal version has no perfect English equivalent, so it requires some practice, but it is not as hard as the French ‘u’ or ‘r’.","pattern":"aim","position":"Anywhere","description":"In French, the letter group “aim” normally represents the nasal vowel /ɛ̃/—similar to the English “eh” in “men,” but pronounced while letting air resonate through the nose. Your tongue is low-mid and the soft palate is lowered so some air escapes nasally; the final “m” is not fully pronounced. Example: faim [fɛ̃]. If “aim” is immediately followed by another vowel (as in aime, aimer, Aimée), the vowel is no longer nasal: it is the ordinary open ‘eh’ sound /ɛm/, like the start of the English word “embassy,” followed by a light ‘m’.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Je t'aime","native":"Je t'aime","position":"End","cultural_context":"Famous French phrase meaning “I love you,” heard in songs, films, and greeting cards"},{"target":"Aimée","native":"Aimée","position":"Beginning","cultural_context":"French female given name; English speakers know the spelling Aimee (e.g., singer Aimee Mann)"},{"target":"faim","native":"faim (hunger)","position":"End","cultural_context":"Appears in cooking shows and phrase \"j’ai faim\" (“I’m hungry”) that often surfaces in beginner French lessons"}]}]
["ein",{"thoughts":"“ein” represents the nasal vowel /ɛ̃/.  English has no true nasal vowels, so learners must consciously lower the soft palate to let air escape through both mouth and nose while saying an open “eh” sound.","pattern":"ein","position":"Anywhere","description":"Start with the English short “eh” as in “bet,” then, without closing your mouth, let some of the air resonate through your nose (soft-palate lowered).  Do NOT add an ‘n’ sound at the end; the ‘n’ is silent—its only job is to make the vowel nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Seine","native":"Seine","position":"Middle","cultural_context":"Famous river that flows through Paris—seen in travel shows, books, and movies"},{"target":"plein","native":"plein","position":"End","cultural_context":"Heard in the art phrase “en plein air,” meaning painting outdoors"},{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"Champagne-producing city mentioned in travel guides and WWII history"}]}]
["eim",{"thoughts":"The letter group “eim” is quite rare in French; when it does occur it almost always represents the nasal vowel /ɛ̃/. English speakers seldom meet the spelling, but many have seen the city name “Reims” on Champagne bottles or in World-War II history. The main challenge is realising that the final “m” is not a consonant—its only job is to signal nasalisation of the preceding vowel.","pattern":"eim","position":"Anywhere","description":"Pronounce it as the French nasal vowel /ɛ̃/: start with the short “e” sound in English “bed,” then lower the jaw a little more, relax the tongue, and let part of the air escape through the nose. Do NOT pronounce an audible “m.” The sound finishes while the lips and tongue stay relatively still and the airflow is partly nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Reims","native":"Reims","position":"End","cultural_context":"Large Champagne-region city; name appears on many Champagne labels and in WWII history books"},{"target":"Marlenheim","native":"Marlenheim","position":"End","cultural_context":"Alsace wine-town name sometimes seen on French wine bottles and travel guides"},{"target":"Bischheim","native":"Bischheim","position":"End","cultural_context":"Another Alsatian place name that shows up in French rail timetables and on regional products"}]}]
["oin",{"thoughts":"“oin” is the French glide-plus-nasal vowel [wɛ̃]. English has the glide W and it has nasal vowels before m/n (e.g. “wen”), but it never nasalises a vowel without closing it with a consonant. So English speakers know the written chunk, yet the French sound is new because the vowel is nasal and there is no final N pronounced.","pattern":"oin","position":"Anywhere","description":"Start with a quick English “w” sound, then slide immediately into the open \"eh\" sound of “bet,” but instead of finishing with an N, drop your soft palate so the vowel resonates through the nose. The tongue stays low-mid and the lips stay rounded throughout. Think “w + eh” said while humming through the nose, with no actual N pronounced at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"coin","native":"corner","position":"End","cultural_context":"Spelled just like the English word for money, so the word catches the eye of English speakers in travel phrases like “au coin de la rue”"},{"target":"loin","native":"far","position":"End","cultural_context":"Same spelling as the cut of meat “pork loin,” making it instantly familiar in print"},{"target":"Poincaré","native":"Poincaré","position":"Middle","cultural_context":"Surname of the well-known mathematician linked to the Poincaré conjecture; often mentioned in science documentaries and articles"}]}]
["ien",{"thoughts":"“ien” combines a quick English-style “y” glide with a nasalized vowel. English has the “y” but not nasal vowels, so learners must master letting air resonate in the nose while keeping the tongue forward. They may have heard it in brands like Evian or phrases like “rien ne va plus,” but they probably have not consciously noticed the exact sound.","pattern":"ien","position":"Anywhere","description":"Start with the English “y” sound as in “yes.” Immediately slide into a short “eh” vowel (like the e in “get”) while lowering the soft palate so air also flows through the nose. Hold this nasalized vowel briefly, and do NOT pronounce an audible n at the end. The whole cluster is one syllable, transcribed /jɛ̃/.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Evian","native":"Evian","position":"End","cultural_context":"Popular French bottled-water brand sold worldwide"},{"target":"bien","native":"bien","position":"End","cultural_context":"Common word meaning “well/okay” in phrases like “très bien” heard in movies or language classes"},{"target":"rien","native":"rien","position":"End","cultural_context":"Phrase “rien ne va plus” announced at roulette tables in casinos or depicted in films"}]}]
["ion",{"thoughts":"English speakers have seen “ion” in place-names like Dijon or Lyon, but the French sound /jɔ̃/ (a y-glide plus a nasal “aw”) is not present in English. The concept of nasal vowels and dropping the final n makes it tricky.","pattern":"ion","position":"Anywhere","description":"In French, the letter group “ion” is usually pronounced as one nasal syllable: start with a short English “y” sound, immediately glide into an “aw” as in “law,” but let the sound resonate through your nose and do NOT pronounce an n at the end. The result is roughly “yohng” without the hard g, written in IPA as /jɔ̃/. (If a clear vowel follows, it may split into two syllables /i.ɔ̃/.)","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Dijon","native":"Dijon","position":"End","cultural_context":"Famous French city that lends its name to the well-known Dijon mustard"},{"target":"Lyon","native":"Lyon","position":"End","cultural_context":"Large French city often mentioned in travel shows and airline routes"},{"target":"champion","native":"champion","position":"End","cultural_context":"Same word in English meaning a winner; seen in sports headlines"}]}]
["eill",{"thoughts":"The French letter group “eill/eille” is pronounced /ɛj/ – a quick “eh” followed immediately by a light English “y” glide, almost like saying the English word segment “ey-” in “hey-ya,” but much shorter and smoother. English has no exact spelling match, yet the sound itself (eh + y) exists, so learners usually recognise it once explained.","pattern":"eill","position":"Anywhere","description":"Start with the open “eh” as in English “bet,” then immediately glide into a short, soft “y” as in “yes” without inserting a separate vowel. Do not pronounce any hard L sound—the double L is completely silent and only signals the “y” glide. The flow is one continuous syllable: “ehy.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Marseille","native":"Marseille","position":"End","cultural_context":"Major French port city often mentioned in travel shows, sports (Olympique de Marseille soccer club), and history classes"},{"target":"reveille","native":"réveil / réveille","position":"End","cultural_context":"U.S. military bugle call (“wake-up” signal) commonly referenced in films and TV"}]}]
["eil",{"thoughts":"English already has the diphthong /ej/ in words like “day,” so the basic vowel-plus-glide is familiar; learners mainly need to remember that French keeps it shorter and tenser and never turns it into a long “ee.”","pattern":"eil","position":"Anywhere","description":"Pronounce a quick “eh” sound (like the vowel in English “bet,” but a bit tenser) and immediately glide into a short \"y\" sound (/j/), finishing almost as if you were starting to say “yes.”  Put the two parts together smoothly without adding an extra syllable: /ɛj/.  It’s very close to the English vowel in “day,” just shorter and without the w-like off-glide some English accents add.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"soleil","native":"soleil","position":"End","cultural_context":"You’ve heard it in the global entertainment company name “Cirque du Soleil.”"},{"target":"Marseille","native":"Marseille","position":"Middle","cultural_context":"Famous French port city referenced in travel shows, soccer broadcasts, and tourism ads."},{"target":"Versailles","native":"Versailles","position":"Middle","cultural_context":"Historic Palace of Versailles, a major tourist attraction and topic in history classes."}]}]
["ill",{"thoughts":"English speakers see “ill” in words like “fille, famille, bouillon.” Most of the time, after a vowel, the group is not an L-sound at all but a quick glide /j/ (like the Y in “yes”) that comes right after an “ee” vowel. After a consonant, however, the L can be pronounced (as in “ville”). Because English has the /j/ glide, the sound is not alien, but the spelling-to-sound mismatch is tricky.","pattern":"ill","position":"Anywhere","description":"When “ill” follows a vowel in French (a, e, o, u, i, ou, etc.), it usually makes one smooth sound: first the French “ee” vowel, then the Y-glide /j/. Imagine saying “ee” and sliding straight into the beginning of the English word “yes.” Lips stay slightly spread; the tongue starts high and front, then moves quickly toward the hard palate for the glide. Do NOT pronounce an English L. (After a consonant, like in “ville,” you *do* pronounce the L.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Versailles","native":"Versailles","position":"End","cultural_context":"The famous French palace and the Treaty of Versailles often mentioned in history classes"},{"target":"bouillon","native":"bouillon","position":"Middle","cultural_context":"Broth cubes or stock used in cooking; the word appears on soup packages"},{"target":"Camille","native":"Camille","position":"End","cultural_context":"Common French first name—seen with composer Camille Saint-Saëns or actress Camille"}]}]
["eille",{"thoughts":"“eille” is pronounced /ɛj/: an “eh” (like in “bet”) that immediately glides into a brief English-style “y” sound. English has a similar glide in words like “hey,” so learners have a reference even though the French vowel starts slightly more open.","pattern":"eille","position":"Anywhere","description":"Start with the vowel in English “bet” (keep it a bit tenser), then slide straight into a quick \"y\" sound without adding an extra syllable. The tongue moves forward and up for the glide, and the lips stay relaxed. There is no audible \"l\" or final \"e.\" IPA: /ɛj/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Marseille","native":"Marseille","position":"End","cultural_context":"Well-known French port city; heard in travel shows, soccer (Olympique de Marseille), and the phrase “Savon de Marseille.”"},{"target":"bouteille","native":"bouteille","position":"End","cultural_context":"Appears on French wine labels and restaurant menus to mean “bottle.”"},{"target":"abeille","native":"abeille","position":"End","cultural_context":"French for “bee”; seen in eco-labels and the luxury skincare line “Abeille Royale.”"}]}]
["aille",{"thoughts":"“aille” is a very common French letter-group.  It normally sounds like an English “eye” quickly gliding into a brief “y” as in “yes” (IPA /a͡j/).  The basic vowel quality (the “eye” part) is very familiar to English speakers, but the added short glide and the fact that the French /a/ is a bit more open can trip them up.  They have probably heard the sound in place-names such as “Versailles” or in the mustard brand “Maille”, yet they may not consciously link the spelling ‑aille to the sound.","pattern":"aille","position":"Anywhere","description":"Start with a wide open “ah” (like the a in “father”), then slide immediately into a quick “ee” glide, finishing in one smooth motion—something like saying “eye-y” as one syllable but without an extra beat at the end.  The tongue moves forward during the glide, and the lips stay relaxed.  In IPA it is /aj/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Versailles","native":"Versailles","position":"Middle","cultural_context":"World-famous French palace and city often mentioned in history classes and travel shows"},{"target":"Maille","native":"Maille","position":"End","cultural_context":"Well-known Dijon mustard brand found in many English-speaking supermarkets"},{"target":"Braille","native":"Braille","position":"End","cultural_context":"Writing system for the blind, named after the French inventor Louis Braille"}]}]
["ouille",{"thoughts":"English speakers have probably seen the sequence “ouille” in a few well-known food words and a Pixar movie title, but they rarely say it correctly. It sounds like a quick \"wee\" preceded by a very light \"y\" glide after the \"oo\". The tongue stays high and forward, then the lips spread slightly at the end. Because the spelling looks long and exotic, learners tend to over-pronounce the letters or insert an extra syllable.","pattern":"ouille","position":"Anywhere","description":"Say “oo” as in “food,” immediately glide into a short “y” sound, and finish with a clipped \"ee\" — all in one syllable: “oo-yee” → [wi]. Think of it as the French one-syllable version of English “we,” but start with slightly rounder lips for the initial “oo.” Do NOT pronounce an audible L or double syllable.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"ratatouille","native":"ratatouille","position":"End","cultural_context":"Title of the Pixar movie about a cooking rat and name of the Provençal vegetable dish"},{"target":"andouille","native":"andouille","position":"End","cultural_context":"Smoked Cajun sausage commonly mentioned in American Southern cuisine"},{"target":"grenouille","native":"grenouille","position":"End","cultural_context":"French word for frog, seen on menus (frog legs) and in phrases like “la grenouille” in cookbooks"}]}]
["ueil",{"thoughts":"The spelling “ueil” is rare and usually shows up only in specifically French words or place-names.  It represents the glide [œj] or [ɥɛj] – a rounded front vowel that immediately slides into a brief “y/ee” sound.  Because English lacks the rounded “eu/œ” vowel and the rapid glide, most learners have never met this combo before and have trouble reproducing it.","pattern":"ueil","position":"Anywhere","description":"Start by shaping your lips as if you were going to say the French “eu/œ” (rounded lips, tongue forward and slightly lowered – it should sound a bit like the “u” in English “fur” but with lips rounded).  Without breaking, let the sound quickly glide into a short English “y” or “ee” before you move on to the next consonant.  Think “EUH” + fast “y” = roughly “weh-y,” but with that distinct French rounded quality at the start.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"accueil","native":"welcome, home page","position":"End","cultural_context":"Appears on every French website or shop sign as the button for “Home/Welcome,” so tourists and internet users often bump into it."},{"target":"fauteuil","native":"armchair","position":"End","cultural_context":"Used by furniture stores (IKEA, Restoration Hardware) to describe a classic French-style armchair; shows up in catalogs and design magazines."},{"target":"Neuilly-sur-Seine","native":"(proper name)","position":"Middle","cultural_context":"Affluent Paris suburb often mentioned in international news, travel guides, and in stories about former French president Nicolas Sarkozy (who was its mayor)."}]}]
["ch",{"thoughts":"English already uses many French loan-words containing “ch,” and in both languages it is pronounced like the “sh” in “shoe.” Because the sound exists in English and appears in familiar vocabulary, learners usually recognize and reproduce it without difficulty.","pattern":"ch","position":"Anywhere","description":"In modern French, the letter pair “ch” almost always represents the single sound /ʃ/—the same “sh” sound you hear at the start of English words like “shoe” or “shower.” Place the tip of your tongue close to (but not touching) the roof of your mouth just behind your teeth and let air pass through, creating a soft hissing “sh” noise. Do NOT voice the sound and do NOT release a hard ‘k’ or ‘t’ before it.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"champagne","native":"champagne","position":"Beginning","cultural_context":"Sparkling wine universally associated with celebrations and toasts"},{"target":"chef","native":"chef","position":"Beginning","cultural_context":"Same word in English for the head cook or kitchen leader"},{"target":"cliché","native":"cliché","position":"Middle","cultural_context":"Common English term for an overused phrase or idea"}]}]
["gn",{"thoughts":"French “gn” is the same sound as Spanish “ñ” (/ɲ/). English doesn’t have this single consonant, but speakers do meet the sound in words like “canyon” (the “ny” part). They have also run into it through French borrowings such as “champagne.” So the sound is not totally alien, yet it isn’t native to English either.","pattern":"gn","position":"Anywhere","description":"Pronounce “gn” by touching the middle/front of your tongue to the hard palate (just behind the upper teeth) while letting air flow through your nose – it’s one smooth nasal consonant, not a separate “g” + “n.” Think of saying the “ny” in English “canyon,” but make it one blended consonant that starts and finishes in that position.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Sparkling wine often served at celebrations"},{"target":"cognac","native":"cognac","position":"Middle","cultural_context":"Famous French brandy found on bar menus"},{"target":"filet mignon","native":"filet mignon","position":"Middle","cultural_context":"Popular steak cut listed in many restaurants"}]}]
["qu",{"thoughts":"For English speakers, French “qu” is straightforward: it is simply the hard K sound, with no accompanying W glide or separate U vowel. They already know this K sound from many English words, so the only challenge is remembering that the letter U is silent.","pattern":"qu","position":"Anywhere","description":"In French, the letter pair “qu” is pronounced exactly like the English hard K sound /k/. The written “u” is silent; its only job is to keep the following vowel hard (e.g., preventing a soft /s/-like sound that “c” or “g” might have). So whenever you see “qu” in French, just say a clean, single K sound and move on to the next vowel or consonant—never add a W glide as in the English word “quick.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Popular French savory tart often found in cafés and brunch menus"},{"target":"boutique","native":"boutique","position":"Middle","cultural_context":"Common English loan-word for a small, fashionable shop"},{"target":"Jacques","native":"Jacques","position":"Middle","cultural_context":"Familiar French male name thanks to historical figures like explorer Jacques Cousteau"}]}]
["gu",{"thoughts":"In French, the digraph “gu” is simply a spelling trick: it tells the reader to pronounce a hard /g/ (as in “go”) before the otherwise “soft-g” vowels e, i, or y. The letter u itself is silent. Because the resulting sound is identical to the hard g that English speakers already know, the only new idea is that the written u is not voiced. So comprehension, not articulation, is the main hurdle.","pattern":"gu","position":"Anywhere","description":"Pronounce it exactly like the hard g in English “get.” The written u is silent; its only job is to keep the g hard before e, i, or y (e.g., guerre, guitare). When gu comes before a, o, or u (e.g., baguette, guacamole) it is still the same hard /g/ sound, and the u remains silent.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"guacamole","native":"guacamole","position":"Beginning","cultural_context":"Mexican avocado dip; popular appetizer in the U.S. and worldwide"},{"target":"Guadeloupe","native":"Guadeloupe","position":"Beginning","cultural_context":"Caribbean island that is an overseas region of France; appears in travel shows and weather reports"},{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Iconic long French loaf of bread sold in many supermarkets and sandwich shops"}]}]
["gue",{"thoughts":"“gue” simply forces a hard /g/ sound before the letter e (or before silent e at the end of a word). English already uses the same trick in words like “vague” or “catalogue,” so most learners have heard it, though they may not have consciously noticed the mute u.","pattern":"gue","position":"Anywhere","description":"When you see g u e in French, pronounce it as a single hard g sound (like the g in “go”). The u itself is silent; it is only there to keep the g hard before the letter e. The following e may be silent (as in “fatigue”) or belong to the next syllable (as in “baguette”), but in every case the cluster g-u-e is realized simply as /g/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette (long French bread)","position":"Middle","cultural_context":"Common type of French bread you can buy in many grocery stores or see on restaurant menus"},{"target":"fatigue","native":"fatigue (tiredness)","position":"End","cultural_context":"Medical and everyday English use the same word to mean extreme tiredness"},{"target":"Prague","native":"Prague (capital city)","position":"End","cultural_context":"Well-known European travel destination often mentioned in news and travel shows"}]}]
["gui",{"thoughts":"French “gui” is simply a hard g plus the pure French “ee” vowel. The written u is silent; it only signals that the g stays hard before the front vowel i. English speakers already know the hard g + ee sequence in words like “geese,” so the sound itself is familiar, but they must remember not to pronounce the u and to keep the French vowel short and pure (no glide toward y). It can appear anywhere in a French word.","pattern":"gui","position":"Anywhere","description":"Pronounce it as a hard, voiced g (like in “go”) immediately followed by the pure French “ee” sound /i/. The letter u is NOT pronounced – it merely tells you to keep the g hard. Think “g-ee” with no extra y-glide and no w-sound from the u.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guide","native":"guide","position":"Beginning","cultural_context":"Same word exists in English (“tour guide”); French spelling and meaning are identical."},{"target":"guitare","native":"guitare","position":"Beginning","cultural_context":"Looks like the English word “guitar,” a globally known instrument."},{"target":"guillotine","native":"guillotine","position":"Beginning","cultural_context":"Historical execution device often mentioned in movies, books, and history classes about the French Revolution."}]}]
["guy",{"thoughts":"In French, the letter string “guy” does not sound like the English word “guy.” The letter u is silent; it only tells you to keep a hard /g/ before the front vowel sound written y. The result is simply /gi/ – a hard g followed by the long “ee” vowel. English speakers already know both sounds, but the spelling is misleading, so recognition is the main hurdle, not the mouth movement.","pattern":"guy","position":"Anywhere","description":"Pronounce it just like the first part of the English word “geese” (/gi/). Start with a hard g (as in “get”), then go straight into the long “ee” vowel. The written u is not voiced at all; it only keeps the g hard before the y.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guy","native":"Guy","position":"Beginning","cultural_context":"Very common French male first name (e.g., author Guy de Maupassant)"},{"target":"Guyane","native":"Guyane","position":"Beginning","cultural_context":"French Guiana—South-American territory often mentioned for its ESA spaceport"},{"target":"Guylian","native":"Guylian","position":"Beginning","cultural_context":"Belgian chocolate brand sold in many supermarkets worldwide"}]}]
["ph",{"thoughts":"English already uses the digraph “ph” for the /f/ sound in words like “phone” and “photo,” so learners should instantly recognize both the spelling and the sound. The only potential surprise is that French never pronounces it as a /p/ + /h/ burst; it’s always a single /f/.","pattern":"ph","position":"Anywhere","description":"In French, the letter pair “ph” is always pronounced exactly like the English “f” sound: upper teeth touch the lower lip and air is pushed out without voicing. It is never aspirated or split into two sounds.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"photo","native":"photo / picture","position":"Beginning","cultural_context":"Same everyday word in English—people say “photo” for a picture."},{"target":"téléphone","native":"telephone / phone","position":"Middle","cultural_context":"Nearly identical to the English word “telephone,” a common device."},{"target":"pharmacie","native":"pharmacy / drugstore","position":"Beginning","cultural_context":"Closely matches the English word “pharmacy,” a place to buy medicine."}]}]
["th",{"thoughts":"English learners usually expect the digraph “th” to sound like the English θ / ð.  In French it never does— it is always just the plain unaspirated “t”.  Once you know that, it’s straightforward.","pattern":"th","position":"Anywhere","description":"In French, the letters “t h” are pronounced exactly like a single, quick, unaspirated “t” (the same sound in French words like “tout” or the English word “stone”).  Your tongue touches the ridge just behind your upper front teeth; air is briefly stopped and then released.  Do NOT stick your tongue between your teeth as you do for English “th,” and do not add a puff of air.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Thomas","native":"Thomas","position":"Beginning","cultural_context":"Common first name; English speakers know people named Thomas"},{"target":"théâtre","native":"théâtre","position":"Beginning","cultural_context":"Looks like the English word “theatre,” often seen on signs and in culture"},{"target":"mathématiques","native":"mathématiques","position":"Middle","cultural_context":"French equivalent of “mathematics”; English speakers recognize the root “math”"}]}]
["sc",{"thoughts":"English speakers have already met “sc” in loan-words like “science” and “escargot.” In French it’s not a new sound, just a spelling rule: before a, o, u, or a consonant it keeps the hard /k/ so you hear /sk/ (like “skip”), but before e, i, y it softens so you only hear /s/ (like “see”). No new mouth movement is required—just remember the two possible pronunciations.","pattern":"sc","position":"Anywhere","description":"In French the letter pair “sc” signals one of two familiar pronunciations:\n• /sk/ – exactly the same as the English “sk” in “ski,” used when the next letter is a, o, u, or another consonant (e.g., es-CAR-go).\n• /s/ – a simple /s/ sound when the next letter is e, i, or y; the “c” is silent (e.g., SCI-ence).\nSo think of “sc” as either “sk” or “s” depending on the vowel that follows.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"science","native":"science","position":"Beginning","cultural_context":"Same word in English for the academic subject—often heard in school"},{"target":"escargot","native":"escargot","position":"Middle","cultural_context":"Classic French dish of cooked snails on many restaurant menus"},{"target":"discothèque","native":"discothèque","position":"Middle","cultural_context":"Fancy French-sounding term for a nightclub, used in English media and pop culture"}]}]
["ce",{"thoughts":"For an English speaker, the letter pair “ce” in French almost always signals the soft-C sound /s/.  English already does the same thing in words like “cent” or “ice,” so the sound is familiar.  The only new point is that the written “e” is often silent (just there to soften the c) unless it carries an accent or falls in the middle of a word where it may be pronounced as the weak French “uh” (schwa).","pattern":"ce","position":"Anywhere","description":"In French, the spelling “ce” is pronounced with a soft, hissy S sound, like the “s” in English “see.”  The tongue is close to the roof of the mouth just behind the teeth, air flows out smoothly, and the vocal cords do NOT vibrate.  The written e usually does not add a vowel sound at the end of a word (it is silent) but can be a very light, quick “uh” (schwa) inside a word.  It is NEVER the hard /k/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"France","native":"France","position":"End","cultural_context":"Name of the country next to England; heard in news, travel, and history"},{"target":"Nice","native":"Nice","position":"End","cultural_context":"Popular French Riviera city; many tourists know it"},{"target":"Céline (as in Céline Dion)","native":"Céline","position":"Beginning","cultural_context":"World-famous Canadian singer; also a luxury fashion brand"}]}]
["ci",{"thoughts":"French “ci” is simply an /s/ plus the pure vowel /i/. English already has this exact combination in words like “see,” so recognition is high. Biggest coaching point: keep the vowel flat and short—avoid the English-style diphthong that ends with a faint “y” glide.","pattern":"ci","position":"Anywhere","description":"Pronounce it like English “see”: start with a clear, voiceless S sound, then move straight into a pure, front-high “ee” vowel /i/. Do not let the vowel slide into a diphthong (no extra ‘y’ off-glide).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Citroën","native":"Citroën","position":"Beginning","cultural_context":"Well-known French car maker; name appears in auto news and Formula-1 sponsorships"},{"target":"Cirque du Soleil","native":"Cirque du Soleil","position":"Beginning","cultural_context":"Globally famous circus and theater company; posters and shows advertised in many English-speaking cities"},{"target":"merci","native":"merci","position":"End","cultural_context":"Basic French word for “thank you” that English speakers often use when traveling or in pop culture"}]}]
["cy",{"thoughts":"For English speakers, the French letter pair “cy” is straightforward: the c turns into a soft s-sound because it sits in front of y, and the y itself is just the long “ee” vowel. The only trap is that English often pronounces cy as /saɪ/ (as in “cycle”), so learners must remember to say /si/ instead.","pattern":"cy","position":"Anywhere","description":"In French, the two letters “c” + “y” are pronounced /si/ – an s-sound (“s” in “sun”) immediately followed by the long “ee” vowel (as in English “see”), with no glide or diphthong. Say it as one quick, clean syllable: “see.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"cyber","native":"cyber","position":"Beginning","cultural_context":"International tech prefix (cyber-security, cyber-space) widely used in English"},{"target":"cycle","native":"cycle","position":"Beginning","cultural_context":"Same spelling in English for bicycle-related words and life cycles"},{"target":"bicyclette","native":"bicyclette","position":"Middle","cultural_context":"Looks like “bicycle,” so English speakers easily guess the meaning"}]}]
["ge",{"thoughts":"French “ge” is the soft g sound /ʒ/, same as the J in “Jacques” and like the “s” in English “measure.” English already has the sound, but the spelling-to-sound link is new.","pattern":"ge","position":"Anywhere","description":"When the letter g is followed by e in French, it is pronounced as the soft, voiced “zh” sound /ʒ/—similar to the middle consonant in English “meaSure” or the end of “mirage.” Your tongue is slightly raised toward the roof of the mouth, vocal cords vibrate, and air is released smoothly without a burst.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"général","native":"général","position":"Beginning","cultural_context":"Familiar from French military titles and historical references (e.g., Général de Gaulle)"},{"target":"garage","native":"garage","position":"End","cultural_context":"Same word in English for a place you park or repair a car"},{"target":"camouflage","native":"camouflage","position":"End","cultural_context":"Common English loan-word for military or fashion patterns that help things blend in"}]}]
["gi",{"thoughts":"In French, the letters “g + i” almost always trigger the soft ‘g’ /ʒ/ (the “zh” sound in English “measure”) followed directly by the French long “ee” /i/. Put together, “gi” sounds like “zhee.” English speakers already know both pieces but rarely hear them glued together, so it feels familiar yet slightly unusual.","pattern":"gi","position":"Anywhere","description":"Pronounce a soft “zh” (like the middle of “mea​sure”) immediately followed by a pure, tense “ee” sound. Say it as one smooth syllable: /ʒi/ → “zhee.” Lips are relaxed, tongue touches nothing for the /ʒ/, then moves forward and high for the /i/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Gillette","native":"Gillette","position":"Beginning","cultural_context":"Global razor brand heavily advertised in English-speaking countries"},{"target":"gilet","native":"gilet","position":"Beginning","cultural_context":"Seen in news about French “gilets jaunes” protests and in fashion as sleeveless vest"},{"target":"bougie","native":"bougie","position":"Middle","cultural_context":"Slang in English for ‘pretentiously fancy,’ borrowed from the French word for candle"}]}]
["gy",{"thoughts":"In French, the letters “g y” almost always signal the soft, voiced “zh” consonant (/ʒ/) followed immediately by the long “ee” vowel (/i/). English contains the /ʒ/ sound (pleasure, vision) but rarely at the start of a word, so learners may recognize the sound yet still feel unsure when they see the spelling “gy.” The main trap is to avoid the hard /g/ of English “gym.”","pattern":"gy","position":"Anywhere","description":"Pronounce “gy” as one quick unit: begin with the voiced “zh” sound from English “meaSURe,” then glide straight into a tight, smiling “ee.” Think “zh-ee.” Keep the tongue mid-way up, vocal cords vibrating, lips relaxed, then spread slightly for the “ee.” Do NOT use the hard “g” of English “go” or “gym.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gym","native":"gym (exercise/gymnastics)","position":"Beginning","cultural_context":"Exact same word in English for a place to work out"},{"target":"gyroscope","native":"gyroscope","position":"Beginning","cultural_context":"Science/tech term you hear about in smartphones, drones, and toys"},{"target":"gynécologue","native":"gynecologist","position":"Beginning","cultural_context":"Medical specialist; resembles the English word “gynecologist,” so the meaning is recognizable"}]}]
["ti+V",{"thoughts":"English speakers already know many French-origin words that contain the spelling “ti” followed by another vowel (a, o, e, etc.). In French this group is not pronounced “tee-” but collapses into one sound /sj/ – similar to saying “see” quickly while starting a “y” glide, like “sy”. The sound is familiar in the abstract (English has /s/ + /j/ in “museum”), but learners don’t expect to get it from the letters “ti”, so they must consciously relearn the spelling-sound link.","pattern":"ti+V","position":"Anywhere","description":"When the letters “ti” are immediately followed by another vowel in French (nation, patient, question, etc.), the cluster is usually pronounced /sj/: a quick “s” sound immediately followed by a brief “y” glide, almost like saying “sy”. The tongue starts in the same place as an English “s” (behind the upper teeth), then the middle of the tongue rises toward the hard palate for the “y” glide while you move on to the next vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"nation","native":"nation","position":"End","cultural_context":"Same spelling in English; heard in news and politics"},{"target":"question","native":"question","position":"End","cultural_context":"Identical English word; common in everyday speech"},{"target":"ambition","native":"ambition","position":"End","cultural_context":"Borrowed into English; used to talk about personal goals"}]}]
["tion",{"thoughts":"English speakers already know the written ending “-tion,” but in French it sounds completely different: /sjɔ̃/, not the English /ʃən/. The tricky parts are: (1) the written “t” turns into an “s” sound, (2) a quick “y” glide follows, and (3) it finishes with the nasal vowel /ɔ̃/ (no audible n). Because of the unfamiliar nasal vowel, this pattern is usually hard to imitate even though the spelling looks familiar.","pattern":"tion","position":"Anywhere","description":"Say a sharp English “s,” immediately slide into a quick “y” (as in “yes”), then finish with the French nasal “o” sound /ɔ̃/ (imagine saying “aw” while letting air resonate in your nose and cutting off the final n). All together: /sjɔ̃/. The tongue never fully pronounces a t, and you do NOT release an n at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"nation","native":"nation","position":"End","cultural_context":"Spelled exactly like the English word “nation,” often heard in news or history contexts."},{"target":"station","native":"station","position":"End","cultural_context":"Same spelling as English “station,” common for train or metro stops when traveling in France."},{"target":"action","native":"action","position":"End","cultural_context":"Looks like the English word used in movies (“Action!”) and in business (“take action”)."}]}]
["sion",{"thoughts":"English already has the word-ending spelling “-sion,” so learners recognise the letters, but the French audio is different: the final vowel is the nasal /ɔ̃/ and the written s often sounds like /z/. They only need to master the y-glide plus the nasal vowel.","pattern":"sion","position":"Anywhere","description":"In French, the letter group “sion” is normally pronounced /sjɔ̃/ or /zjɔ̃/. 1) Start with a quick /s/ or /z/ sound. 2) Immediately let the tongue glide into a short /j/ (the “y” of English ‘yes’). 3) Finish with the nasal vowel /ɔ̃/: round your lips as for British ‘aw’, let air resonate in the nose, and do NOT release a final n sound. Put it together and you get something close to “syoh˜” or “zyoh˜,” ending through the nose rather than with a pronounced ‘n’.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"télévision","native":"télévision","position":"End","cultural_context":"Same word as English “television,” familiar household item and medium"},{"target":"mission","native":"mission","position":"End","cultural_context":"Used unchanged in English for tasks or space trips (e.g., “NASA mission”)"}]}]
["xion",{"thoughts":"“xion” is almost always found at the END of French words (annexion, connexion, crucifixion). It is read /ksjɔ̃/: 1) a sharp “k-s” cluster, 2) the French “y” glide /j/, 3) the nasal vowel /ɔ̃/ (sounds like the end of English “song” without the final g). English speakers already know the spelling from words such as “complexion” or “crucifixion”, but the French nasal ending and the extra /s/ before the glide make it sound noticeably different, so some adjustment is needed.","pattern":"xion","position":"Anywhere","description":"Pronounce “xion” as /ksjɔ̃/. Start with a quick “k-s” (as if you were beginning the word “kick” and immediately adding an un-voiced “s”), then glide into a short “y” sound, and finish with the French nasal vowel /ɔ̃/ — like the vowel in “awn” while keeping the back of the tongue up and letting air escape through the nose, with no final n pronounced.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"connexion","native":"connection","position":"End","cultural_context":"Seen on French Wi-Fi login pages and signs; almost identical to English “connection” so travellers spot it quickly"},{"target":"crucifixion","native":"crucifixion","position":"End","cultural_context":"Familiar from Biblical references and art history; spelled the same in English"},{"target":"annexion","native":"annexation","position":"End","cultural_context":"Used in news reports about territory being annexed; looks like the English word “annexation”"}]}]
["ps",{"thoughts":"English speakers already meet the letters “ps” in words like “psychology” or “pseudonym”, but in English the initial P is silent. In French you normally pronounce both consonants at the start or in the middle, while the pair is often silent at the end of a word. So learners must remember to add the P sound when it opens a French word, and sometimes drop the whole group when it closes a word.","pattern":"ps","position":"Anywhere","description":"When you see “ps” in French, think of it as two separate consonants in quick succession. Close the lips for a light P, then let the air escape immediately into an S hiss: [p] + [s] = [ps]. There is no vowel between them. At the very end of a word, however, the letters are usually silent (corps → [kɔʁ], temps → [tɑ̃]). So: beginning/middle = pronounced [ps]; end = usually silent.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psychologie","native":"psychology","position":"Beginning","cultural_context":"Looks almost identical to the English word “psychology,” a common school subject"},{"target":"pseudonyme","native":"pseudonym","position":"Beginning","cultural_context":"Same meaning as the English word “pseudonym,” used for writers’ pen names"},{"target":"corps","native":"body","position":"End","cultural_context":"Familiar from English phrases like “Marine Corps”; in French it means “body,” and the final “ps” is silent"}]}]
["h",{"thoughts":"English speakers already know several words that start with a silent “h” (hour, honor), so the idea of not pronouncing the consonant is not totally foreign. What is new is that in French the initial “h” is ALWAYS silent and sometimes blocks liaison even though you still do not pronounce it. Remembering to keep the vowel sound right at the front of the word and to avoid the English puff of air can feel odd at first.","pattern":"h","position":"Beginning","description":"In French, the letter “h” at the beginning of a word is NEVER pronounced as an audible /h/ sound.  Your mouth starts directly on the following vowel, with no puff of air.  There are two kinds—“h muet” and “h aspiré.”  Both are silent, but an “h aspiré” prevents liaison or apostrophe (e.g., “le héros,” not “l’héros”).  From a pure pronunciation point of view, treat the “h” as if it weren’t there.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hôtel","position":"Beginning","cultural_context":"Common travel-related word you see on signs and booking websites"},{"target":"hors d’oeuvre","native":"hors d’oeuvre","position":"Beginning","cultural_context":"Appetizer term frequently printed on English menus and cookbooks"},{"target":"haute couture","native":"haute couture","position":"Beginning","cultural_context":"Fashion phrase used in English media to describe high-end designers"}]}]
["ps",{"thoughts":"English speakers are used to seeing the letters “ps” at the start of words of Greek origin (psychology, psychiatry) but in English the initial “p” is silent. In French, however, both consonants are pronounced, so learners must add a brief /p/ before the /s/.","pattern":"ps","position":"Beginning","description":"Close your lips to make a very quick un-aspirated /p/ release and, almost immediately, let the air continue through a narrow gap between the tongue and the alveolar ridge for /s/. There is no vowel between the two sounds: they blend into one crisp “ps” at the very start of the word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psychologie","native":"psychologie","position":"Beginning","cultural_context":"Looks almost identical to the English word “psychology,” a subject many people study in school"},{"target":"pseudo","native":"pseudo","position":"Beginning","cultural_context":"Used in English as a prefix meaning “fake,” as in “pseudoscience”"},{"target":"psoriasis","native":"psoriasis","position":"Beginning","cultural_context":"Medical term often heard in pharmaceutical commercials and health articles"}]}]
["ent",{"thoughts":"The spelling “ent” at the very end of a French word normally represents the nasal vowel /ɑ̃/, roughly an “ah” sound produced while letting air resonate through the nose.  English has no exact nasal vowel, so learners must both shape the vowel and let it go through the nose.  The only time final “ent” is NOT pronounced is on third-person plural verbs, where it is completely silent.","pattern":"ent","position":"End","description":"Open your mouth as if saying English “ah” in “father,” but lower the soft palate so some air escapes through the nose; do NOT release a final consonant.  The result is a short, nasalized /ɑ̃/ sound.  (In verb endings like “ils parlent,” the letters –ent are silent.)","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"comment","native":"comment","position":"End","cultural_context":"Seen in the beginner greeting “Comment ça va?” meaning “How are you?”"},{"target":"moment","native":"moment","position":"End","cultural_context":"Same spelling as the English word “moment,” used in phrases like “Un moment.”"},{"target":"Vincent","native":"Vincent","position":"End","cultural_context":"Well-known first name—painter Vincent van Gogh, actor Vincent Cassel."}]}]
["e",{"thoughts":"English speakers already deal with a silent final “e,” but in French it behaves differently: it’s either completely dropped or reduced to a very quick neutral vowel /ə/. The trick is to avoid giving it the English long-“ee” or “ay” value.","pattern":"e","position":"End","description":"When a plain, unaccented “e” sits at the very end of a French word, it is normally silent. Simply stop on the preceding consonant. In careful or poetic speech it can surface as a very short, relaxed “uh” (the neutral vowel you hear in the second syllable of English “sofa”), but never as “ee” or “ay.” Your lips and tongue stay relaxed; just release the consonant and you’re done.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"omelette","native":"omelette","position":"End","cultural_context":"Popular breakfast dish found on diner menus everywhere"},{"target":"baguette","native":"baguette","position":"End","cultural_context":"Iconic French bread sold in supermarkets and sandwich shops"},{"target":"champagne","native":"champagne","position":"End","cultural_context":"Famous sparkling wine used for celebrations"}]}]
["er",{"thoughts":"Final -er in French is almost always the infinitive ending of the largest verb group.  English speakers often see it in phrases (je t’aime, bon appétit, savoir-faire) or in brand/ proper names like Parler.  The tricky part is remembering that the written r is silent and the vowel is a pure, closed “ay” sound, not the diphthong /eɪ/ and certainly not followed by an English r.","pattern":"er","position":"End","description":"When -er comes at the very end of a French word it is pronounced as one clean, closed “ay” sound (IPA /e/).  Your tongue is mid-high and toward the front (like the vowel in English “say”) but you must stop there—do NOT let it glide into a y/ee off-glide and do NOT pronounce an r afterwards.  The written r is silent unless there is a liaison with the next word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Parler","native":"to speak","position":"End","cultural_context":"Name of a social-media platform frequently mentioned in U.S. news; spelled the same as the French verb"},{"target":"manger","native":"to eat","position":"End","cultural_context":"Seen on French menus or cooking shows; appears in phrases like “Bon appétit, mangez !”"},{"target":"aimer","native":"to love/like","position":"End","cultural_context":"Recognized from the famous phrase “Je t’aime” heard in films, songs, and pop culture"}]}]
["ez",{"thoughts":"“ez” is always at the very end of a French word and is pronounced exactly the same as the single letter “é”: a clean, closed e sound, similar to the vowel in English “say” but shorter and without a final y-glide. The written z is completely silent. English speakers have the vowel already, so the only new idea is remembering not to pronounce the z.","pattern":"ez","position":"End","description":"Say a short, pure \"ay\" sound (IPA /e/). Keep your tongue forward and your lips only slightly spread, and do NOT pronounce any final z sound. Think of ending English “say” halfway through, before the tongue glides up.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"chez","native":"chez","position":"End","cultural_context":"Seen in restaurant names like “Chez Panisse” or phrases such as “chez moi” (at my place)."},{"target":"allez","native":"allez","position":"End","cultural_context":"Heard in sports chants like “Allez les Bleus!” during French soccer or cycling events."},{"target":"parlez","native":"parlez","position":"End","cultural_context":"Part of the well-known tourist phrase “Parlez-vous français?”"}]}]
["es",{"thoughts":"Final –es in French is usually pronounced /e/ (like the “ay” in English “day,” but shorter and without the y-glide) while the written s itself is silent unless liaison occurs. English speakers have seen it in names such as “Les Misérables,” yet they often keep the English z-sound or pronounce the s. Mouth in mid-close, lips slightly spread, quick clean vowel, then stop—no consonant sound.","pattern":"es","position":"End","description":"When –es comes at the very end of a standalone French word of one syllable (les, des, mes etc.), say a single, pure “ay” sound /e/. Do NOT voice the written s; it is silent unless the next word begins with a vowel, in which case it links as /z/. Compared with English “day,” make it shorter and crisper and avoid the final y-glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Les Misérables","native":"Les Misérables","position":"End","cultural_context":"Blockbuster musical and film based on Victor Hugo’s novel"},{"target":"Des Moines","native":"Des Moines","position":"End","cultural_context":"U.S. city (Iowa’s capital) often mentioned during presidential primaries"},{"target":"Les Paul","native":"Les Paul","position":"End","cultural_context":"Classic electric-guitar model and the name of its famous inventor"}]}]
["x",{"thoughts":"Final “x” in French is almost always silent, so the main hurdle for English speakers is resisting the urge to pronounce an /ks/ or /z/. They may have encountered this in imported words like “faux” or names like “Grand Prix,” but might not consciously realize the x is mute.","pattern":"x","position":"End","description":"When an “x” appears at the very end of a standalone French word, it is normally NOT pronounced at all; you simply finish on the preceding vowel or consonant sound. For example, “prix” sounds like “pree,” and “faux” sounds like “foh.” (A few rare exceptions—mostly numbers like six/dix—use an /s/ or change in liaison, but the general rule is silent.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"prix","native":"prix","position":"End","cultural_context":"Known from Formula 1 races called the Grand Prix"},{"target":"faux","native":"faux","position":"End","cultural_context":"Used in English fashion and décor to mean “fake,” as in faux fur"},{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Famous French wine region and wine label frequently seen in restaurants and stores"}]}]
["s",{"thoughts":"English speakers tend to assume any written “s” is pronounced /s/. In French, a final “s” is usually silent, which can surprise learners. They must learn to ignore the written letter and end the word on the preceding vowel or consonant sound.","pattern":"s","position":"End","description":"When an “s” is the last letter in a French word, it is normally NOT pronounced. Simply stop the word before the “s,” letting the previous vowel or consonant be the last audible sound. (The written “s” usually marks plurals or certain grammar endings, but it stays silent in speech unless a liaison is required.)","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Paris","native":"Paris","position":"End","cultural_context":"World-famous capital city, often mentioned in travel, movies, and fashion"},{"target":"croissants","native":"croissants","position":"End","cultural_context":"Well-known buttery breakfast pastry sold in many cafés and bakeries"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"End","cultural_context":"Luxury fashion brand frequently referenced in pop culture and advertising"}]}]
["t",{"thoughts":"Final ‑t in French is normally silent. English already has several loan-words that keep this French spelling, so learners have seen the pattern, but they still tend to pronounce the final /t/. Main task is to remember to drop the consonant completely unless there is a liaison.","pattern":"t","position":"End","description":"When a single letter “t” appears at the very end of a standalone French word, you simply do NOT pronounce it. Your tongue stays relaxed—there is no brief closure or release like the English /t/. The word ends on the vowel or nasal sound that comes just before the written “t.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ballet","native":"ballet","position":"End","cultural_context":"Famous dance style; same spelling used in English"},{"target":"début","native":"début","position":"End","cultural_context":"English also uses “debut” to mean a first appearance"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Popular buttery pastry sold in cafés and bakeries"}]}]
["d",{"thoughts":"English speakers already know the letter D, but they are used to pronouncing it at the end of words. In French, a written final “d” is usually silent, so the challenge is remembering *not* to voice it.","pattern":"d","position":"End","description":"When the letter “d” is the very last letter in a French word, it is normally silent: you simply stop the sound on the preceding vowel or nasal vowel and do not add a voiced-d release. (Example: “grand” is pronounced roughly like “grahn,” without a final /d/.) In a few short compass-point words such as “sud” or in liaison before a following vowel, the /d/ can be heard, but as a rule of thumb, assume silence.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"grand","native":"grand","position":"End","cultural_context":"Recognized in the motorsport term “Grand Prix” and in wine ratings like “grand cru”"},{"target":"blond","native":"blond","position":"End","cultural_context":"Borrowed into English to describe hair colour and pale beers; spelling stays French"},{"target":"fond","native":"fond","position":"End","cultural_context":"Culinary word you hear on cooking shows for the browned bits that become a sauce base"}]}]
["p",{"thoughts":"English speakers already know the sound /p/, but here the key point is that a written final “p” in French is normally NOT pronounced at all. Remembering to keep it completely silent—no puff of air—is the challenge.","pattern":"p","position":"End","description":"When the letter “p” appears at the very end of a French word, you do not pronounce it. Your lips may close briefly as they move to the next word, but you release no burst of air and produce no audible consonant. In careful speech you often end the word on the preceding vowel or nasal sound and simply stop.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"coup","native":"coup","position":"End","cultural_context":"Heard in the news phrase “coup d’état,” meaning a government takeover"},{"target":"trop","native":"trop","position":"End","cultural_context":"Common adverb meaning “too/too much,” often seen in phrases like “trop cool” on social media"},{"target":"champ","native":"champ","position":"End","cultural_context":"Appears in the well-known sparkling wine name “Champagne” and in English slang “champ” (short for champion)"}]}]
["g",{"thoughts":"English speakers already know the voiced “hard g” /g/ as in “go.” In French, when a single g is written at the very end of a word (not “ng”), it is almost always the same sound: a voiced velar stop. It is released a bit more softly than some English speakers do, but otherwise identical. Because the sound already exists in English, recognition and production are straightforward.","pattern":"g","position":"End","description":"A voiced velar stop, made by touching the back of the tongue to the soft palate and releasing it while the vocal cords vibrate – exactly like the hard g in English “tag.” In French, you do not add a following schwa; end the word crisply on the consonant.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tag","native":"tag","position":"End","cultural_context":"Used in French for graffiti or social-media hashtag; same spelling as English \"tag\""},{"target":"blog","native":"blog","position":"End","cultural_context":"The loan-word for an online journal; identical to English \"blog\""},{"target":"zigzag","native":"zigzag","position":"End","cultural_context":"Describes a back-and-forth line; same word in English"}]}]
["ps",{"thoughts":"Final –ps is usually silent in modern French: neither the P nor the S is released, so the word ends on the preceding vowel (often a nasal vowel). English speakers may want to pronounce /ps/ like in “lapse,” but they must resist that impulse.","pattern":"ps","position":"End","description":"When a French word ends in the letters “ps,” you normally do NOT pronounce either consonant. Simply finish on the previous vowel sound (which may be nasal, as in temps /tɑ̃/). Your lips stay relaxed; no closing for a /p/ and no hissing /s/. Think of it as the letters just being written, not spoken.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"corps","native":"corps","position":"End","cultural_context":"Known from “Marine Corps,” “Peace Corps,” and similar names in English"},{"target":"temps","native":"temps","position":"End","cultural_context":"Heard in music, ballet, and phrases like “à temps” that appear in English discussions of rhythm and timing"},{"target":"laps","native":"laps","position":"End","cultural_context":"Seen in the fixed expression “laps de temps,” occasionally quoted in English legal or academic writing; related to the English word “lapse.”"}]}]
["c",{"thoughts":"Final “c” in French is almost always the same hard /k/ sound English speakers make at the ends of words like “back.” It’s therefore very familiar and rarely causes trouble.","pattern":"c","position":"End","description":"Make the unvoiced hard “k” sound: raise the back of the tongue to the soft palate to block the air, then release it quickly. In French the release is softer than in English—little to no burst of air (aspiration)—but otherwise it feels like saying the last sound in English “lock.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"chic","native":"chic","position":"End","cultural_context":"The English language uses this French word to mean stylish or fashionable."},{"target":"Bic","native":"Bic","position":"End","cultural_context":"Worldwide pen and lighter brand seen in offices and stores."},{"target":"Cognac","native":"cognac","position":"End","cultural_context":"Famous French brandy often mentioned in cocktails and luxury drinks."}]}]
["eaux",{"thoughts":"“eaux” is simply the plural form of “eau.”  The written chunk looks exotic, but it is pronounced exactly the same as the single-letter English interjection “oh.”  The tricky part is remembering that the final “x” is always silent.","pattern":"eaux","position":"End","description":"Pronounce it as a single, pure “oh” sound, like the English word “go” without the final –guh.  Your lips round a bit and stay steady; nothing else is voiced.  The written “x” never makes a sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Famous French wine region; also a common wine and color name in English"},{"target":"gâteaux","native":"gâteaux","position":"End","cultural_context":"Seen on dessert menus and baking shows as the plural of “gâteau” (fancy cakes)"},{"target":"plateaux","native":"plateaux","position":"End","cultural_context":"Plural of “plateau,” a geography term taught in school"}]}]
["aux",{"thoughts":"The French ending “aux” is silent except for a single, pure /o/ vowel. Many English speakers have met it in words like “faux fur.” Because the spelling looks very different from the sound, the main hurdle is remembering that the final x is never pronounced.","pattern":"aux","position":"End","description":"When “aux” appears at the end of a French word, the three letters together are pronounced as one long closed “oh” sound, like the vowel in English “go,” but shorter and without the off-glide you might make in English. The final x is completely silent.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"faux","native":"faux","position":"End","cultural_context":"Common in English fashion and design to mean fake, e.g., “faux fur”"},{"target":"portmanteaux","native":"portmanteaux","position":"End","cultural_context":"Plural of “portmanteau”; appears in linguistics and word-play discussions"},{"target":"tableaux","native":"tableaux","position":"End","cultural_context":"Plural of “tableau”; used in art and theater descriptions"}]}]
