["a",{"thoughts":"French “a” is one of the simplest vowels for English speakers because it is very similar to the /a/ they already know in words like “spa.” The main warning is to keep it short and pure—never let it glide toward a second vowel the way many Americans say the first part of “cat.”","pattern":"a","position":"Anywhere","description":"A short, pure open vowel. Drop your jaw, keep the tongue low and toward the front, and let the sound out quickly—much like the “a” in British-style “bath” or the first half of “father,” but without any following glide (“uh” or “y”).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"Beginning","cultural_context":"Famous long French bread sold worldwide"},{"target":"café","native":"café","position":"Middle","cultural_context":"Common word for a coffee shop, used in English too"},{"target":"macaron","native":"macaron","position":"Multiple","cultural_context":"Trendy French almond‐meringue cookie seen in bakeries and on social media"}]}]
["b",{"thoughts":"French “b” is almost always the same voiced bilabial stop English speakers already use in words like “bat.” The only quirks: in clusters such as “bs/pt” it may de-voice and sound closer to a soft “p” (obstacle → [ɔp.stakl]), and in a handful of old spellings it can be silent (plomb). These exceptions are rare, so learners mainly pronounce it exactly as the English /b/.","pattern":"b","position":"Anywhere","description":"Pronounce it by bringing both lips together and voicing, just like the English “b” in “boy.” Keep it short and crisp—French doesn’t add a puff of air (no noticeable ‘h’ burst) the way some English accents do.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"bonjour","native":"bonjour","position":"Beginning","cultural_context":"Classic French greeting often heard in movies and travel shows"},{"target":"Brie","native":"Brie","position":"Beginning","cultural_context":"Well-known French cheese sold in supermarkets"},{"target":"obstacle","native":"obstacle","position":"Middle","cultural_context":"Same word in English meaning a hindrance; shows the devoiced /p/ sound in French"},{"target":"club","native":"club","position":"End","cultural_context":"Same word in English—social group or venue, also in “club sandwich”"}]}]
["c",{"thoughts":"French “c” is either a hard [k] or a soft [s]. Both sounds already exist in English, so the only real challenge is remembering when French switches between them.","pattern":"c","position":"Anywhere","description":"Hard [k] before a, o, u, or another consonant (like the k in “cat”). Soft [s] before e, i, y or when written with a cedilla (ç), just like the s-sound in “city.” No puff of air is added, and the tongue stays a bit farther forward than a hard English k.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"café","native":"café","position":"Beginning","cultural_context":"Common word for a coffee or coffee shop"},{"target":"croissant","native":"croissant","position":"Beginning","cultural_context":"Popular buttery breakfast pastry"},{"target":"merci","native":"merci","position":"Middle","cultural_context":"Most‐taught French word for “thank you”"}]}]
["d",{"thoughts":"English already has the /d/ sound, so learners just need to be aware that French places the tongue a bit farther forward (against the upper teeth) and never adds the little puff of air (aspiration) some English speakers give after an initial D.","pattern":"d","position":"Anywhere","description":"French “d” is a single, voiced stop like English d in “dog,” but the tongue touches the back of the upper front teeth (slightly more forward than in English) and there is no noticeable burst of air. Hold the vocal-cord voicing firmly and release cleanly.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"déjà vu","native":"déjà vu","position":"Beginning","cultural_context":"Common expression for the feeling of having already experienced something"},{"target":"Bordeaux","native":"Bordeaux","position":"Middle","cultural_context":"Famous French wine region and the wine itself"},{"target":"Le Monde","native":"Le Monde","position":"End","cultural_context":"Well-known French newspaper often cited in international media"}]}]
["e",{"thoughts":"The plain, un-accented French letter “e” is one of the easiest French vowels for English speakers because both of its common values (/ə/ and /ɛ/) already exist in English. The only trap is not turning the closed version into an English diphthong.","pattern":"e","position":"Anywhere","description":"Plain “e” has two main values. 1) Schwa /ə/: a quick, weak “uh” like the a in “sofa” – usually in short little words or the last syllable (le, de). 2) Open /ɛ/: like the e in “bet,” but hold it steady without sliding toward “y” – happens in stressed or closed syllables (merci, belle). It is never the long English “ee” or the diphthong “ay.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Le Mans","native":"Le Mans","position":"End","cultural_context":"24-hour French car race that appears in movies and sports news"},{"target":"merci","native":"merci","position":"Middle","cultural_context":"Common French word for “thanks” often used in English conversation"},{"target":"belle","native":"belle","position":"Multiple","cultural_context":"Name of the heroine in Disney’s “Beauty and the Beast”; also means “beautiful”"}]}]
["f",{"thoughts":"French “f” is identical to the English unvoiced “f” in “fun.” No new mouth position is needed, so learners mainly just have to remember that, unlike in some English words (e.g., “half”), the French final –f is almost always pronounced. Very occasionally, in formal liaison, a final ‑f can soften to a /v/ sound (neuf heures → /nœ‿v‿œʁ/), but in ordinary isolated words it stays /f/.","pattern":"f","position":"Anywhere","description":"Same sound as English “f” in “fun.” Lower lip touches upper teeth; let air hiss out without using the vocal cords.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"film","native":"film","position":"Beginning","cultural_context":"Same word in English for a movie"},{"target":"café","native":"café","position":"Middle","cultural_context":"Common word for a coffee shop; appears on menus everywhere"},{"target":"chef","native":"chef","position":"End","cultural_context":"Same word in English for a professional cook"}]}]
["g",{"thoughts":"English already has both a hard /g/ as in “go” and a soft /ʒ/ sound as in “mirage,” so French uses won’t feel completely alien; the main job is learning when each one appears.","pattern":"g","position":"Anywhere","description":"In French, “g” has two main values:\n• Hard g /g/ – like English “go.” It appears before a, o, u or another consonant (gâteau, golf, grenouille’s 2nd g ‘‐gl‐’).\n• Soft g /ʒ/ – like the s in English “vision.” It shows up before e, i, y or at the word-end “-ge” (genre, neige).  \nA silent u often follows g (as “gu”) to keep the hard sound before e/i/y (guitare, guerre).  When you see “gn” the sound changes to the “ny” of “canyon,” but that is its own pattern.  Most English speakers already use both /g/ and /ʒ/; just memorize the French spelling rules.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gourmet","native":"gourmet","position":"Beginning","cultural_context":"Common English loanword for fine-food lover"},{"target":"garage","native":"garage","position":"Multiple","cultural_context":"Everyday English word; French original shows both a hard g (first) and soft g (second)"},{"target":"genre","native":"genre","position":"Beginning","cultural_context":"Widely used in English for categories of art or media"}]}]
["h",{"thoughts":"English speakers expect to breathe out /h/, but in French the letter is always silent; the only challenge is remembering when liaison/elision are allowed (h muet) or blocked (h aspiré).","pattern":"h","position":"Anywhere","description":"In French the written “h” is NEVER voiced like the English /h/.  There are two kinds:\n• h muet (\"mute h\") – completely silent and behaves as if the word started with a vowel: l’hôtel, j’habite.\n• h aspiré (\"aspirated h\") – still silent, but it blocks liaison and elision: le héros (not l’héros), les héros (the final ‑s is not linked).\nSo: don’t pronounce the sound; just remember whether to link the preceding word.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hôtel","position":"Beginning","cultural_context":"Familiar loan-word meaning a place to stay when traveling"},{"target":"héros","native":"héros","position":"Beginning","cultural_context":"Looks like and means “hero,” seen in comic-book titles and subtitles"},{"target":"Hermès","native":"Hermès","position":"Beginning","cultural_context":"Luxury fashion brand name often mentioned in celebrity and style news"}]}]
["i",{"thoughts":"French “i” is simply the pure high front vowel [i]. English speakers know a close version in the word “machine,” but English often turns it into a slight diphthong (“ee-uh”). The main thing is to keep it short and steady, without gliding.","pattern":"i","position":"Anywhere","description":"Like the “ee” in English “machine,” but shorter and without any trailing “y” sound. Lips stay spread, tongue high and forward; hold the single, pure vowel and stop—no glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"internet","native":"internet","position":"Beginning","cultural_context":"Same word as English – the global computer network"},{"target":"pizza","native":"pizza","position":"Middle","cultural_context":"Internationally famous Italian food, common in English"},{"target":"ski","native":"ski","position":"End","cultural_context":"Winter sport term identical in English"}]}]
["j",{"thoughts":"French “j” is always the single sound /ʒ/ (like the s in “meaSure”). English speakers know the sound, but they usually see it spelled “s”, “si”, or “g” (vision, genre). Seeing the letter j produce /ʒ/ instead of /dʒ/ (“jam”) is the main surprise.","pattern":"j","position":"Anywhere","description":"Pronounce it as a soft, buzzing shhh: start to say English “zh” (the middle of “meaSure”, “viSion”) with your vocal cords vibrating, tongue just behind the upper teeth-ridge, lips relaxed (not rounded like English “sh”). Never add a d-sound in front of it.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Jacques","native":"Jacques","position":"Beginning","cultural_context":"Famous French male name—think of philosopher Jacques Derrida or actor Jacques Cousteau"},{"target":"Jean","native":"Jean","position":"Beginning","cultural_context":"Common French first name; also looks like the English word “jeans”"},{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Widely known French greeting meaning “hello”"},{"target":"Beaujolais","native":"Beaujolais","position":"Middle","cultural_context":"Popular French wine region and the young red wine released each November"}]}]
["k",{"thoughts":"French /k/ is essentially the same consonant English speakers already use, so it should feel familiar. The only real novelty is that French pronounces it without the little burst of air (aspiration) that often follows an English ‘k’. Because the letter k is uncommon in native French words but common in modern borrowings, learners will meet it mostly in international or English-derived vocabulary.","pattern":"k","position":"Anywhere","description":"Same hard “k” sound as in English “skill,” but produced with almost no puff of air. Back of the tongue touches the soft palate; let the sound release cleanly without aspiration.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"kilo","native":"kilo","position":"Beginning","cultural_context":"Abbreviation for kilogram, used worldwide when talking about weight"},{"target":"parking","native":"parking","position":"Middle","cultural_context":"Loan-word meaning a parking lot; looks and sounds just like English"},{"target":"snack","native":"snack","position":"End","cultural_context":"Same word in English for a light bite or small meal"}]}]
["l",{"thoughts":"French “l” is basically the same light /l/ English speakers use at the start of a word like “leaf.” The only hiccup is that French never has the velarized “dark-l” many English speakers make at the ends of syllables (as in “ball”), so learners just need to keep it light everywhere.","pattern":"l","position":"Anywhere","description":"A clear, light “l” made by touching the tongue tip to the alveolar ridge (just behind the upper teeth) and letting air flow along the sides. It sounds like the first l in English “light,” even at the ends of words. Avoid the thicker ‘dark l’ you may use in English words like “ball.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Louvre","native":"Louvre","position":"Beginning","cultural_context":"World-famous Paris museum that houses the Mona Lisa"},{"target":"omelette","native":"omelette","position":"Middle","cultural_context":"Classic French egg dish commonly served for breakfast"},{"target":"Chanel","native":"Chanel","position":"End","cultural_context":"Iconic French fashion and perfume brand"}]}]
["m",{"thoughts":"English already has the /m/ sound; French uses the same lip-closed nasal consonant with no extra puff of air. The only caution is to keep the lips lightly closed and immediately move to the next vowel—don’t add a lingering humming or an extra vowel as some English speakers do at word-ends.","pattern":"m","position":"Anywhere","description":"Exactly the same as English “m” in “map.” Close the lips, let the sound resonate through the nose, then release straight into the next vowel or consonant. No aspiration or added vowel needed.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"merci","native":"merci","position":"Beginning","cultural_context":"Famous French word for “thank you,” used in movies and travel phrases"},{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Celebration sparkling wine; same word seen on bottles everywhere"},{"target":"film","native":"film","position":"End","cultural_context":"Same spelling as the English word for a movie, used on French posters and schedules"}]}]
["n",{"thoughts":"English speakers already know the basic /n/ sound. The only surprise is that a final “n” (or an “n” before certain consonants) often isn’t pronounced in French; instead it nasalises the preceding vowel. That spelling-to-sound rule, not the consonant itself, is where confusion can arise.","pattern":"n","position":"Anywhere","description":"The French letter “n” is usually the same alveolar nasal you say in English \"no\" or \"ten.\" Tongue touches the ridge just behind the upper teeth and air passes through the nose. However, when a single “n” follows a vowel and is not immediately followed by another vowel or another ‘n’, it normally disappears and simply makes the vowel nasal (e.g. bon ➜ /bɔ̃/). Double “nn” or an “n” between vowels is pronounced like regular /n/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"non","native":"non","position":"Multiple","cultural_context":"Means “no”; common word even non-French speakers recognise"},{"target":"bon","native":"bon","position":"End","cultural_context":"Heard in the expression “bon appétit” before meals"},{"target":"Nice","native":"Nice","position":"Beginning","cultural_context":"Famous French Riviera city; name appears in travel and news"}]}]
["o",{"thoughts":"The single letter “o” in French covers two main vowel qualities: a closed, pure /o/ and a slightly more open /ɔ/.  Both are rounded back vowels that exist in English, but English speakers usually add a little glide (“ow” sound) after /o/.  So the biggest challenge is keeping the French vowel short and steady, without letting it diphthong-ize.  Because the mouth shape and tongue position are familiar, most learners can pick it up quickly once they remember to drop the glide.","pattern":"o","position":"Anywhere","description":"French “o” is pronounced either as a closed, rounded back vowel /o/ (similar to the first part of English “go” but with NO trailing ‘w’) or as a more open /ɔ/ (like many Americans’ vowel in “thought”).  Hold the lips rounded, keep the sound short and pure—no glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"photo","native":"photo","position":"Multiple","cultural_context":"Same word in English for a picture; common tech term"},{"target":"chocolat","native":"chocolat","position":"Multiple","cultural_context":"French word for chocolate, seen on menus and candy wrappers"},{"target":"docteur","native":"docteur","position":"Middle","cultural_context":"Looks like and means “doctor,” used in titles of French versions of films/books"}]}]
["p",{"thoughts":"French P is almost identical to English P; only difference is that it’s usually produced with little to no puff of air (unaspirated). Final written P can be silent, so learners should notice spelling-to-sound quirks.","pattern":"p","position":"Anywhere","description":"Same voiceless ‘p’ as in English (put, spin) but without the strong burst of air you hear in English when P starts a stressed syllable. Keep the lips together, release quickly and lightly. At the end of some words the written “p” is silent (e.g. coup), unless a linking consonant-sound (liaison) brings it back before a vowel in the next word.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Paris","native":"Paris","position":"Beginning","cultural_context":"Famous capital city everyone hears about in travel and movies"},{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Celebratory sparkling wine, the word is common in English"},{"target":"coup d’état","native":"coup d’état","position":"End","cultural_context":"News term for an overthrow of government; final P is silent"},{"target":"crêpe","native":"crêpe","position":"Middle","cultural_context":"Thin French pancake popular at cafés and food stalls"}]}]
["q",{"thoughts":"French q is almost always written as qu and is simply the hard /k/ sound. The main trap for English speakers is to avoid adding the little “w” glide they say in English words like “quick.” Just make a clean, single k-sound.","pattern":"q","position":"Anywhere","description":"Pronounce it exactly like the English hard “k.” Most of the time it appears as qu before any vowel (quand, qui, boutique, etc.). Unlike English, there is NO /kw/ glide—just /k/. When q ends a word (coq, cinq) it is still the /k/ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Popular savory tart often on café menus in English-speaking countries"},{"target":"croquet","native":"croquet","position":"Middle","cultural_context":"Lawn game name borrowed straight from French"},{"target":"boutique","native":"boutique","position":"End","cultural_context":"Common word for a small, stylish shop"}]}]
["r",{"thoughts":"French “r” is the famous guttural sound made in the back of the throat rather than with the tip of the tongue like the English R. It is produced by slightly constricting the throat so the airflow causes a light friction at the uvula. Because it does not exist in mainstream English accents, learners often substitute an English R or an H-like sound.","pattern":"r","position":"Anywhere","description":"A voiced uvular fricative or approximant made in the very back of the mouth (near the uvula). Think of a soft gargling sound or the light throat clearing in the English interjection “ugh,” but voiced and smoother. Lips stay relaxed; tongue tip stays down while the back of the tongue rises toward the uvula.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"restaurant","native":"restaurant","position":"Multiple","cultural_context":"Same word in English—place where you eat"},{"target":"Paris","native":"Paris","position":"Middle","cultural_context":"Capital city of France, major tourist destination"},{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Well-known flaky French pastry available in cafés"},{"target":"bonjour","native":"bonjour","position":"End","cultural_context":"Common French greeting meaning “hello,” heard in movies and travel shows"}]}]
["s",{"thoughts":"French “s” looks familiar but behaves in three different ways English speakers must notice: it can sound like the clear hiss /s/, the voiced /z/, or be silent. The sounds themselves are easy; remembering when each happens takes a bit of attention.","pattern":"s","position":"Anywhere","description":"1) /s/ – crisp hiss, like English “snake.” Written as “s” at the start of a word, after a consonant, or doubled as “ss.”\n2) /z/ – voiced, like the “z” in English “zip.” Happens when a single “s” sits between two vowels.\n3) Silent – final “s” in many words (especially plural articles or proper names) disappears; the word just ends in the preceding vowel or consonant.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Famous buttery French pastry sold worldwide"},{"target":"rosé","native":"rosé","position":"Middle","cultural_context":"Popular pink wine name used in English menus"},{"target":"Paris","native":"Paris","position":"End","cultural_context":"Capital of France; common travel and pop-culture reference"}]}]
["t",{"thoughts":"French “t” is mostly the same voiceless stop English speakers know, but it is made with the tongue touching the upper teeth (dental) instead of the ridge behind them (alveolar).  English speakers rarely notice the difference, so production is easy.  The real challenge is knowing when the written “t” disappears (usually at the end of a word) or when it merges into the /sj/ sound in “-tion.”","pattern":"t","position":"Anywhere","description":"Normally a crisp, un-aspirated /t/ made with the tongue against the upper teeth.  Final “-t” is usually silent unless followed by a liaison (petit ami).  In the spelling “-tion,” the “t” is not pronounced separately; the whole ending sounds like “see-on” (/sjɔ̃/).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tour","native":"tour","position":"Beginning","cultural_context":"Common word on Paris tourist signs—means a tower or a trip"},{"target":"restaurant","native":"restaurant","position":"Multiple","cultural_context":"Same word in English—place you eat; first “t” is heard, last one is silent"},{"target":"ballet","native":"ballet","position":"End","cultural_context":"Famous dance form; final “t” is silent"},{"target":"nation","native":"nation","position":"Middle","cultural_context":"Same spelling in English; “-tion” pronounced /sjɔ̃/ in French"}]}]
["u",{"thoughts":"French “u” is the single-letter spelling for the vowel /y/ – a front, rounded sound that does not exist in standard English. Learners must master lip rounding while keeping the tongue forward as for the English “ee.”","pattern":"u","position":"Anywhere","description":"Pronounce it like the English long “ee” (as in “see”) BUT with your lips rounded as for the English “oo.” Tongue stays high and forward, lips stay rounded the whole time. Do not let it glide to a second vowel.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"déjà vu","native":"already seen / déjà vu","position":"End","cultural_context":"Common English expression for the eerie feeling of repetition"},{"target":"rendez-vous","native":"appointment / rendez-vous","position":"End","cultural_context":"Heard in movies and TV for a meeting or date"},{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Popular French dessert on many restaurant menus"}]}]
["v",{"thoughts":"French “v” is basically the same voiced labiodental fricative English speakers already say in words like “very.” Most learners will recognise and produce it automatically.","pattern":"v","position":"Anywhere","description":"A voiced labio-dental fricative: lightly place your upper front teeth on the bottom lip and let the voice vibrate. It sounds just like the English “v” in “van.” Unlike in some English accents, it always stays voiced, even at the end of a word.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"voilà","native":"voilà","position":"Beginning","cultural_context":"Common French interjection used in English to mean “there you go”"},{"target":"Louvre","native":"Louvre","position":"Middle","cultural_context":"World-famous Paris art museum visited by tourists"},{"target":"au revoir","native":"au revoir","position":"Middle","cultural_context":"Familiar French goodbye phrase heard in movies and language classes"}]}]
["w",{"thoughts":"French “w” only shows up in loan-words, so English speakers have seen the letter before but may be surprised that it flips between an English-style /w/ glide and a /v/ sound. The main challenge is remembering that many everyday French words with “w” (wagon, Warwick, watt, etc.) use the /v/ value, while others (week-end, wifi, kiwi) keep the English-like /w/. Context or memorisation is the only reliable guide.","pattern":"w","position":"Anywhere","description":"In French loan-words the letter “w” is pronounced in two main ways:\n• /w/ – same glide as English “w” in “we.” Mouth rounds quickly as you move from the lips-rounded /u/ position to the following vowel.\n• /v/ – voiced “v” sound as in English “vet.” Upper teeth touch lower lip and vibrate.\nThere is no rule to predict which you’ll meet; you simply learn word by word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"week-end","native":"week-end (short vacation)","position":"Beginning","cultural_context":"Same spelling and meaning as English “weekend,” common in travel ads"},{"target":"wagon","native":"wagon (railroad car/truck)","position":"Beginning","cultural_context":"Looks like English “wagon;” often seen on French train signage"},{"target":"wifi","native":"wifi","position":"Beginning","cultural_context":"Universal tech term for wireless internet access"}]}]
["x",{"thoughts":"The letter “x” is visually the same as in English, so learners already recognize it, but its French pronunciations vary: /ks/, /gz/, /s/, or silent, which can surprise them.","pattern":"x","position":"Anywhere","description":"In French, “x” is usually pronounced like the /ks/ in English “rocks.” At the start of many words it softens to /gz/ (similar to the middle of English “eggs-act”). At the end of some numbers it is /s/ (like English “hiss”), while in many other final positions it is completely silent. The mouth positions are familiar; the challenge is remembering when each value applies.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"taxi","native":"taxi","position":"Middle","cultural_context":"Same word as English “taxi” for a cab"},{"target":"exact","native":"exact","position":"Beginning","cultural_context":"Spelled the same as English “exact,” meaning precise"},{"target":"six","native":"six","position":"End","cultural_context":"French for the number 6—taught early in French classes"},{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Well-known French wine region and city"}]}]
["y",{"thoughts":"French “y” is rarely the English consonant “y” sound; most of the time it is simply the vowel /i/ (like the “ee” in “see”).  English speakers don’t expect the letter y to sound like a plain vowel in the middle of a word, so that can surprise them.  When it comes right before another vowel (ya-, yo-, yu-, etc.) it keeps its familiar consonant glide /j/—much like English “yes, yoga.”  Technically easy to articulate, but spotting when it’s a vowel vs. a glide takes some attention.","pattern":"y","position":"Anywhere","description":"In French the letter “y” is pronounced either:\n• as the pure vowel /i/ (same mouth position as English “ee” in “see”): lycée /li-se/.\n• as the consonant glide /j/ (English “y” in “yes”) when it immediately precedes another vowel: yaourt /ja-urt/.\nIt never forms the diphthongs heard in English words like “my” or “boy.” Keep the vowel short and tense; don’t add an extra glide unless another vowel follows.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Yves","native":"Yves","position":"Beginning","cultural_context":"Famous in fashion label \"Yves Saint Laurent\""},{"target":"Lyon","native":"Lyon","position":"Middle","cultural_context":"Major French city often mentioned in travel shows"},{"target":"mayonnaise","native":"mayonnaise","position":"Middle","cultural_context":"Common condiment name on food labels"}]}]
["z",{"thoughts":"French “z” rarely surprises English speakers: it is almost always the same voiced /z/ as in English “zoo.”  The only twist is that a final –z is usually silent unless there’s liaison with the next word.","pattern":"z","position":"Anywhere","description":"Pronounce it like the English z in “zoo”: vocal-cord vibration, tongue tip on or just behind upper teeth, quick release of air.  Beware of final –z: it is normally silent (chez ≈ “shay”), but it reappears as /z/ when the next word begins with a vowel (chez‿elle, /ʃe.zɛl/).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"zéro","native":"zero","position":"Beginning","cultural_context":"French number you may hear when people count: zéro, un, deux…"},{"target":"bizarre","native":"bizarre / strange","position":"Middle","cultural_context":"Same word in English meaning odd or strange"},{"target":"chez","native":"at the house/place of","position":"End","cultural_context":"Common in restaurant names like “Chez Marie”; the –z is silent"}]}]
["à",{"thoughts":"In French, the letter a with a grave accent (à) is not a new sound—it's pronounced exactly like the plain French “a.” The accent only marks spelling or grammatical differences, so the learner just has to produce a short, open “ah” (like the a in “father”). Because the sound exists in English, recognition and production are generally easy; the only real task is remembering the accent in writing.","pattern":"à","position":"Anywhere","description":"Pronounce it as a short, open “ah,” similar to the vowel in the English word “father” or the first syllable of “spa.” There is no extra length or diphthong—keep it pure and relaxed, mouth open, tongue low.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"à la carte","native":"à la carte","position":"Beginning","cultural_context":"Restaurant menu term meaning you order items individually"},{"target":"voilà","native":"voilà","position":"End","cultural_context":"Exclamation meaning “there it is” that English speakers use for emphasis"},{"target":"déjà vu","native":"déjà vu","position":"Middle","cultural_context":"Common phrase for the feeling of having seen something before"}]}]
["â",{"thoughts":"English speakers see â on menus and in place-names, but they rarely know its exact sound. It is basically the long, open back “ah” (French /ɑ/), similar to the vowel in British ‘spa’. In most modern French it is merging with the regular a (/a/), so aiming for a clear, round ‘ah’ is acceptable.","pattern":"â","position":"Anywhere","description":"Pronounce â as a long, open “ah” produced low in the mouth with the tongue pulled slightly back—think the vowel in British English “spa” or the first ‘a’ in American “father,” but keep the lips relaxed and unrounded. It is a touch longer and darker than the normal French a. Before n or m it nasalises: ân /ɑ̃/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bâton Rouge","native":"Bâton Rouge","position":"Beginning","cultural_context":"U.S. capital city of Louisiana, heard in news and sports"},{"target":"pâté","native":"pâté","position":"Beginning","cultural_context":"French meat spread listed on many charcuterie menus"},{"target":"château","native":"château","position":"Middle","cultural_context":"Word for a castle or wine estate, common on wine labels"},{"target":"pâtes","native":"pâtes","position":"Beginning","cultural_context":"French word for pasta; appears on bilingual restaurant menus"}]}]
["ä",{"thoughts":"The letter a with a diaeresis is almost never used in everyday French words, but when it shows up (usually in borrowed proper names) it simply tells the reader to pronounce a as its own syllable /a/. This is the same open a sound English speakers say in “spa” or “father,” so the sound itself is easy; the only novelty is the two little dots.","pattern":"ä","position":"Anywhere","description":"ä is pronounced exactly like a plain French a – an open, back-of-the-mouth /a/ similar to the a in English “spa.” The two dots (tréma) just warn you not to merge it with the preceding letter; it stays a separate, fully voiced a.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Häagen-Dazs","native":"Häagen-Dazs","position":"Beginning","cultural_context":"Premium ice-cream brand sold worldwide"},{"target":"doppelgänger","native":"doppelgänger","position":"Middle","cultural_context":"Borrowed German word meaning look-alike, often used in movies and TV"}]}]
["é",{"thoughts":"English already has a very close sound (the first part of the vowel in “say”), so the main task is noticing that French keeps the vowel pure and short, without sliding toward a “y” sound. Spelling-wise, the acute accent simply marks this closed /e/ sound and signals that the letter is not silent.","pattern":"é","position":"Anywhere","description":"é is pronounced as a pure, closed \"ay\" sound (/e/): like the vowel in English “say,” but shorter and without the glide that often follows in English. Keep your tongue toward the front, lips relaxed, and cut the sound off cleanly—do not let it turn into two vowels.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"éclair","native":"éclair","position":"Beginning","cultural_context":"Famous cream-filled pastry seen in bakeries"},{"target":"café","native":"café","position":"End","cultural_context":"Coffee shop; the word is common in English menus"},{"target":"cliché","native":"cliché","position":"End","cultural_context":"Same word in English, meaning an overused expression"},{"target":"résumé","native":"résumé","position":"Multiple","cultural_context":"Document listing work experience, used in job applications"}]}]
["è",{"thoughts":"English already has the vowel /ɛ/ as in “bet,” so the quality of the French vowel written “è” is familiar; what’s new is simply noticing the grave accent. Most learners only need to remember that “è” is always the open “eh” sound, never the long “ay” of é.","pattern":"è","position":"Anywhere","description":"Pronounce it like the short “e” in English “bet,” but hold it just a touch longer and keep the tongue forward and relaxed. It is always this open “eh” sound—never the “ay” of French é.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Ève","native":"Ève","position":"Beginning","cultural_context":"Biblical name Eve—French spelling starts with “È.”"},{"target":"très chic","native":"très chic","position":"Middle","cultural_context":"Fashion phrase meaning “very stylish” that shows up in magazines and ads"},{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Popular French dessert found on many restaurant menus"},{"target":"pièce de résistance","native":"pièce de résistance","position":"Middle","cultural_context":"Well-known expression for the highlight of a meal or event"}]}]
["ê",{"thoughts":"French “ê” is almost the same vowel an English speaker says in “bet,” so they have heard it before.  The main challenge is keeping it pure and not gliding toward a diphthong (avoid turning it into “bay-uht”).  Because it is a familiar mouth position the sound is not hard, but the written accent is new.","pattern":"ê","position":"Anywhere","description":"Pronounce it like the short “eh” in English “bet,” but a bit tenser and without any trailing “y” or “uh” glide.  Mouth opens mid-wide, tongue is forward and mid-high.  Hold it briefly and cleanly.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"crêpe","native":"crêpe","position":"Middle","cultural_context":"Thin French pancake you can order at cafés"},{"target":"fête","native":"fête","position":"Middle","cultural_context":"Loan-word meaning a party or celebration"},{"target":"tête-à-tête","native":"tête-à-tête","position":"Multiple","cultural_context":"Common phrase for a private conversation"},{"target":"bête noire","native":"bête noire","position":"Middle","cultural_context":"English expression for something especially detested"}]}]
["ë",{"thoughts":"ë is not a new vowel sound for English speakers – it simply forces the letter “e” to be pronounced as its own syllable instead of blending with the vowel before it. The trick is remembering to break the word into two syllables when you see the dots.","pattern":"ë","position":"Anywhere","description":"ë shows a diaeresis (two dots).  It tells you to pronounce the letter “e” separately: usually like the short e in English “bet” [ɛ] or occasionally the closed e of English “ay” without the glide [e].  The key is to make a clear extra syllable right after the preceding vowel (No-ël = no-EL).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Noël","native":"Noël","position":"Middle","cultural_context":"Classic Christmas word found in English carol titles like “The First Noel”"},{"target":"Citroën","native":"Citroën","position":"Middle","cultural_context":"Famous French car brand seen on roads and in movies"},{"target":"Israël","native":"Israël","position":"Middle","cultural_context":"Spelling of the country name in French news headlines"},{"target":"canoë","native":"canoë","position":"End","cultural_context":"Same object as English “canoe,” often seen in vacation brochures"}]}]
["î",{"thoughts":"French î is not its own sound; it simply marks the regular French /i/ vowel, identical to plain i. English speakers already know the basic “ee”-like quality, so the main hurdle is remembering that the circumflex does NOT change the pronunciation.","pattern":"î","position":"Anywhere","description":"Pronounce î exactly like the French letter i: a short, pure “ee” sound, similar to the vowel in English “machine,” but keep your lips spread and don’t make it diphthong into “iy.” The accent mostly signals historical spelling and does not affect the sound today.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"maître d'","native":"maître d'","position":"Middle","cultural_context":"Common restaurant term for the head waiter"},{"target":"Île-de-France","native":"Île-de-France","position":"Beginning","cultural_context":"Name of the Paris region often seen in travel guides"}]}]
["ï",{"thoughts":"ï is simply the regular French “i” sound, but the two dots (tréma) warn you not to blend it with the vowel before it. English speakers already know the word “naïve,” so the concept is familiar, but they may forget to keep the vowels in separate syllables.","pattern":"ï","position":"Anywhere","description":"Pronounce it like the French “i” (/i/ – similar to the “ee” in English “see”), but be sure it forms its own syllable, separate from the vowel that comes right before it. Say the two vowels one after the other (e.g., na-EEV, a-EE-oh-lee). Keep your tongue high and forward and don’t turn it into the English diphthong “eye.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"naïve","native":"naïve","position":"Middle","cultural_context":"Common English word meaning inexperienced"},{"target":"Haïti","native":"Haïti","position":"Middle","cultural_context":"Caribbean country often mentioned in the news"},{"target":"aïoli","native":"aïoli","position":"Beginning","cultural_context":"Garlic mayonnaise frequently listed on restaurant menus"}]}]
["ô",{"thoughts":"The letter ô signals a single, pure “closed-o” /o/ vowel, slightly longer and tighter than the first part of English “go,” but without the final glide /ʊ/.  English speakers already know a similar mouth shape from saying the first half of “oh,” so the main challenge is keeping it short and steady—no sliding to a “w” sound.","pattern":"ô","position":"Anywhere","description":"A rounded mid-back vowel /o/.  Start with the jaw slightly open, lips rounded as if beginning to say English “oh,” but freeze there—do not let the tongue or lips move or add a trailing “w.”  Think of the pure Spanish or Italian “o.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hotel","position":"Middle","cultural_context":"Same word as English “hotel,” often seen on French signs"},{"target":"Côte d’Azur","native":"Côte d’Azur","position":"Middle","cultural_context":"Well-known name for the French Riviera in travel media"},{"target":"rôle","native":"role","position":"Middle","cultural_context":"French spelling of the word behind English “role,” encountered in theatre or academic texts"}]}]
["ö",{"thoughts":"French uses the letter “ö” only in a handful of mostly-foreign proper names. It simply marks that the “o” must be pronounced on its own, not blended with the preceding consonant or vowel. For an English speaker it will usually sound like a normal French closed “o” (somewhere between English “go” and “paw”), but you must keep it short and pure, with no glide toward a ‘w’ sound.","pattern":"ö","position":"Anywhere","description":"Pronounce it like the regular French closed “o” (rounded lips, tongue mid-back). The trema (two dots) just tells you not to merge this “o” with the letter before it. Think of saying the “o” in British English “law” but shorter and with tighter, more rounded lips.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Möbius","native":"Möbius","position":"Beginning","cultural_context":"Mathematician famous for the Möbius strip, often mentioned in science shows"},{"target":"Göteborg","native":"Göteborg","position":"Beginning","cultural_context":"Large Swedish city sometimes discussed in travel programs"},{"target":"Schröder","native":"Schröder","position":"Middle","cultural_context":"Gerhard Schröder, former German chancellor, appears in news and history discussions"}]}]
["ù",{"thoughts":"French “ù” is extremely rare (modern French uses it mainly in the small word “où”). The accent does not change the sound of the vowel; it simply distinguishes spelling. Phonetically, it is the same tight, rounded front vowel [y] spelled “u/û,” a sound English lacks.","pattern":"ù","position":"Anywhere","description":"Pronounced like the regular French “u” [y]—lips rounded as for “oo” in “food” while the tongue stays forward as for “ee” in “see.” English has no exact equivalent, so practice sliding from “ee” to “oo” while keeping the tongue forward.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"où","native":"où (where)","position":"End","cultural_context":"Famous in the phrase “Où est la bibliothèque?” taught in beginner French classes"}]}]
["û",{"thoughts":"The French “û” is almost always the same vowel as plain “u”: the tight, front-rounded vowel /y/ (similar to German “ü”). English has no equivalent, so learners tend to replace it with “oo” /u/ or “ee” /i/. The jaw stays nearly closed like for “ee”, but the lips are rounded as for “oo”. Because the sound doesn’t exist in English, it feels alien and is easy to confuse with the French “ou” /u/. The circumflex itself never changes the sound, it just marks old spelling or distinguishes homographs.","pattern":"û","position":"Anywhere","description":"Pronounce it as the French /y/: keep the tongue high and forward (as if saying the vowel in “heed”) while rounding the lips (as if starting “who”). Do NOT glide or open the mouth. Length is short and steady.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"crème brûlée","native":"crème brûlée – classic caramel-topped custard dessert","position":"Middle","cultural_context":"Popular dessert on restaurant menus and cooking shows"},{"target":"flûte","native":"flûte – the musical instrument (French spelling)","position":"Middle","cultural_context":"Seen in orchestral scores and sometimes on wine or champagne glass names (‘flûte glass’)"}]}]
["ü",{"thoughts":"French very rarely writes a tréma on the letter u, but when it does the purpose is to force you to pronounce that u as the front-rounded vowel /y/ instead of letting it disappear into the preceding g or q. English has no true /y/ sound, so learners usually substitute something between the English “ee” of “see” and the “oo” of “too.” They must keep the tongue forward (like for “ee”) while rounding the lips (like for “oo”). Because the spelling is so uncommon, most English speakers have seen this letter only in a handful of proper names or in the reformed spellings of words such as “aigüe.”","pattern":"ü","position":"Anywhere","description":"ü = the French front-rounded high vowel /y/. Say English “ee” but round your lips as though saying “oo,” keeping the tongue high and forward. Do not add a glide or turn it into “you.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"aigüe","native":"aigüe (acute, feminine form of aigu)","position":"Middle","cultural_context":"Shows up in medical or news phrases like “crise aigüe” (acute crisis)"},{"target":"Saül","native":"Saül","position":"Middle","cultural_context":"French spelling of the Biblical name Saul—recognizable from the Bible"},{"target":"ambigüe","native":"ambigüe (ambiguous, feminine form of ambigu)","position":"Middle","cultural_context":"Related to the English word “ambiguous,” so its meaning is easy to guess"}]}]
["ÿ",{"thoughts":"Very rare letter; English speakers almost never meet it except on some French place-names (e.g. Aÿ in Champagne). Sound is not exotic – it is the same as an ordinary French “y / i/” or the glide /j/. The trema just signals it must be pronounced as a separate sound from the preceding vowel, so the practical challenge is recognising the letter, not making a new sound.","pattern":"ÿ","position":"Anywhere","description":"Pronounced the same as a regular French “y”.\n• When it acts as a vowel it is the high-front /i/ sound, close to the English “ee” in “see” but shorter and tenser.\n• When it starts a glide it sounds like the English “y” in “yes”.\nThe two dots (tréma) simply warn you not to merge it with the vowel before it.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"Aÿ","native":"Aÿ","position":"End","cultural_context":"Name of a Champagne-producing town seen on some wine labels"},{"target":"L’Haÿ-les-Roses","native":"L’Haÿ-les-Roses","position":"Middle","cultural_context":"Suburb of Paris; appears on metro maps and road signs"}]}]
["ç",{"thoughts":"‘Ç’ (the letter c with a cedilla) simply tells you to pronounce the letter like a soft English “s,” even when it stands in front of the vowels a, o, or u, where a plain French ‘c’ would normally sound like a hard “k.” Because English already has the /s/ sound, the only real novelty for learners is noticing and interpreting the little hook under the letter.","pattern":"ç","position":"Anywhere","description":"Pronounce it exactly like the unvoiced English “s” in “see.” The cedilla just overrides the usual French rule that c+a/o/u = /k/. Keep the tongue close to the front teeth and let air hiss out smoothly—no vocal-cord vibration, no “z” sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Ça va ?","native":"Ça va ?","position":"Beginning","cultural_context":"Famous French greeting meaning “How’s it going?”—often heard in basic phrase books and films"},{"target":"façade","native":"façade","position":"Middle","cultural_context":"Architectural term also used in English for a building’s front or a figurative ‘front’"},{"target":"garçon","native":"garçon","position":"Middle","cultural_context":"French for ‘boy’ or a stereotypical call for a waiter—shows up in movies and cafés"},{"target":"Curaçao","native":"Curaçao","position":"Middle","cultural_context":"Bright-blue liqueur and Caribbean island mentioned in cocktail recipes"}]}]
["œ",{"thoughts":"The ligature œ represents the rounded front vowel /œ/, a sound English doesn’t really use. Learners will likely have seen it in food & art phrases (hors d’œuvres, chef-d’œuvre) but rarely know how to say it. The mouth is shaped as for the English “uh” in “cup” while the lips are rounded as if to whistle. Because the sound and symbol are both unfamiliar, it poses a fair challenge.","pattern":"œ","position":"Anywhere","description":"Usually pronounced like a short, rounded version of the English “uh” in “cup” but with the lips puckered (IPA /œ/). Think of starting to say the vowel in “bird” (British) or “fur,” then round your lips. In a few scholarly/Latin words it can sound more like /e/, but the /œ/ value is by far the most common.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"œuvre","native":"work, artistic output","position":"Beginning","cultural_context":"Heard in phrases like “chef-d’œuvre” or “the author’s œuvre” in art reviews"},{"target":"hors d’œuvres","native":"hors d’œuvres","position":"Middle","cultural_context":"Common menu term for appetizers at parties and receptions"},{"target":"bœuf bourguignon","native":"beef bourguignon","position":"Middle","cultural_context":"Classic French beef stew made famous by cookbooks and food shows"}]}]
["æ",{"thoughts":"French only uses the letter-ligature “æ” in a handful of Latin loanwords. Modern speakers normally just pronounce it the same as a single “é” /e/ or sometimes a short open /ɛ/ depending on the spelling tradition, so it is not really a new sound for English speakers—just a spelling quirk they might see in set phrases.","pattern":"æ","position":"Anywhere","description":"Pronounce it like a clear, pure “ay” sound, close to the French é in “café.” Do NOT try to use the English short “a” (as in “cat”). Simply say /e/ or slightly more open /ɛ/ and you will be understood.","familiarity":"ProbablyDoesNotKnow","difficulty":"Easy","example_words":[{"target":"curriculum vitæ","native":"curriculum vitæ","position":"End","cultural_context":"Latin phrase often seen at the top of a résumé"},{"target":"et cætera","native":"et cætera","position":"Middle","cultural_context":"Latin for “and so forth,” frequently abbreviated etc."}]}]
["h",{"thoughts":"French words that begin with the letter “h” NEVER pronounce an audible /h/ like English does.  There are two varieties: h-muet (completely silent and allows the preceding word to link or contract, e.g. l’hôtel) and h-aspiré (still silent, but it blocks liaison/elision, e.g. le hamburger).  The challenge is not making a sound where English normally would, and remembering when you may or may not link.","pattern":"h","position":"Beginning","description":"At the start of a French word the written “h” is always silent.  For h-muet you treat the word as if it began with a vowel (linking and contractions happen).  For h-aspiré you keep a tiny break before the word—no linking or contraction—yet you still do NOT pronounce an English-style /h/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hôtel","position":"Beginning","cultural_context":"Looks like the English word “hotel,” widely seen on travel signs"},{"target":"héros","native":"héros","position":"Beginning","cultural_context":"Same root as English “hero,” appears in comics and movies titles"},{"target":"hamburger","native":"hamburger","position":"Beginning","cultural_context":"Exact same spelling as the fast-food staple"},{"target":"hashtag","native":"hashtag","position":"Beginning","cultural_context":"Social-media term used in both languages"}]}]
["h",{"thoughts":"English speakers expect to breathe out /h/, but in French the letter is always silent; the only challenge is remembering when liaison/elision are allowed (h muet) or blocked (h aspiré).","pattern":"h","position":"Anywhere","description":"In French the written “h” is NEVER voiced like the English /h/.  There are two kinds:\n• h muet (\"mute h\") – completely silent and behaves as if the word started with a vowel: l’hôtel, j’habite.\n• h aspiré (\"aspirated h\") – still silent, but it blocks liaison and elision: le héros (not l’héros), les héros (the final ‑s is not linked).\nSo: don’t pronounce the sound; just remember whether to link the preceding word.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hôtel","position":"Beginning","cultural_context":"Familiar loan-word meaning a place to stay when traveling"},{"target":"héros","native":"héros","position":"Beginning","cultural_context":"Looks like and means “hero,” seen in comic-book titles and subtitles"},{"target":"Hermès","native":"Hermès","position":"Beginning","cultural_context":"Luxury fashion brand name often mentioned in celebrity and style news"}]}]
["ch",{"thoughts":"French “ch” almost always sounds like English “sh,” so it feels familiar. A smaller set of scholarly or Greek-based words use a hard “k” sound, which can surprise learners. Remember: unlike English, French never says “ch” as the English “ch” in “church” unless the word is an obvious English import (rare).","pattern":"ch","position":"Anywhere","description":"1) Most of the time “ch” = /ʃ/, the soft “sh” sound in English “shoe.” Push the tongue slightly forward and let the air flow over the middle of the tongue without voicing. 2) In a handful of learned or Greek-origin words, “ch” = /k/, the hard “k” in English “scare.” There is no puff of aspiration as in English—keep it short and crisp.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"chef","native":"chef","position":"Beginning","cultural_context":"Same word in English—professional head cook"},{"target":"champagne","native":"champagne","position":"Beginning","cultural_context":"Famous sparkling wine for celebrations"},{"target":"cliché","native":"cliché","position":"Middle","cultural_context":"Same word in English—overused idea or phrase"},{"target":"chorale","native":"chorale","position":"Beginning","cultural_context":"Choir/chorus term seen in music titles"}]}]
["gn",{"thoughts":"French “gn” is usually one single consonant sound /ɲ/, like the “ny” in the English word “canyon.”  Most English speakers have heard it in loan-words such as “champagne” or “cognac.”  A smaller set of scholarly or Latin-looking words (e.g., “diagnostic,” “stagnation”) keep the two letters separate, pronounced /g/ + /n/.  So learners must decide case-by-case: common everyday French words squeeze the letters into one nasal “ny,” while more bookish or international words say the two letters distinctly.","pattern":"gn","position":"Anywhere","description":"Main value: one fused sound /ɲ/—tongue against the hard palate, air resonating through the nose, similar to the Spanish “ñ” or the “ny” in “canyon.”  Do NOT add a hard g.  Keep lips relaxed and let the sound come through the nose while the middle of the tongue touches the roof.  Rarer value: in certain Greek/Latin-derived or learned words, pronounce a normal hard “g” followed by an “n” (/gn/).  Dictionaries mark these cases.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"End","cultural_context":"Celebratory sparkling wine—same word in English"},{"target":"cognac","native":"cognac","position":"Middle","cultural_context":"Well-known French brandy"},{"target":"diagnostic","native":"diagnostic","position":"Middle","cultural_context":"Looks like the English word “diagnostic”; here the g and n are pronounced separately"}]}]
["ph",{"thoughts":"In French, the digraph “ph” is almost always pronounced exactly like the English “f.” English already uses “ph” for /f/ in words such as “phone” or “photo,” so most learners already associate the spelling with that sound. The only adjustment is to avoid the stronger English-style puff of air; French /f/ is a bit lighter and unaspirated, but this difference is usually negligible for communication.","pattern":"ph","position":"Anywhere","description":"Pronounce it as a plain, voiceless ‘f’ sound—bottom lip lightly touches the upper teeth, let air flow out softly. It never sounds like an English ‘p’ or ‘ph’ as in “uphill.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"photo","native":"photo","position":"Beginning","cultural_context":"Same word in English for a picture"},{"target":"téléphone","native":"téléphone","position":"Middle","cultural_context":"Word for telephone; nearly identical to English"},{"target":"philosophie","native":"philosophie","position":"Beginning","cultural_context":"French for philosophy, well-known academic subject"}]}]
["qu",{"thoughts":"English speakers already know the spelling “qu,” but in French it is almost always a plain hard K sound, never the usual English KW.  A few learned/Latin words keep the KW cluster.","pattern":"qu","position":"Anywhere","description":"Most of the time French “qu” is pronounced exactly like an English hard K, with NO w-sound: king → quiche.  Your lips stay open; don’t round them as for ‘w.’  Rare scientific/Latin loans (aquarium, quota, quadriceps) keep the original /kw/ cluster.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Common savory pie found in cafés and recipes"},{"target":"boutique","native":"boutique","position":"End","cultural_context":"Loan-word for a small fashionable shop"},{"target":"aquarium","native":"aquarium","position":"Middle","cultural_context":"Place to see fish; same word in English, shows the rare KW pronunciation"},{"target":"unique","native":"unique","position":"Middle","cultural_context":"Same adjective in English, illustrates the silent-u hard K sound"}]}]
["th",{"thoughts":"French “th” is very straightforward for English speakers: it is never the English “th” sound. It is simply a plain /t/ with the tongue on the alveolar ridge, and the “h” is silent. Once learners know this rule, they can apply it anywhere the spelling appears.","pattern":"th","position":"Anywhere","description":"In French, the letters “th” are always pronounced like a single clear T sound, exactly like the T in English “top.” The H is never aspirated and never gives the English “th” sounds /θ/ or /ð/. Just say a normal French/English T and ignore the H.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"thé","native":"thé","position":"Beginning","cultural_context":"French word for tea, often seen on café menus"},{"target":"Thomas","native":"Thomas","position":"Beginning","cultural_context":"Common first name, identical spelling to English ‘Thomas’"},{"target":"cathédrale","native":"cathédrale","position":"Middle","cultural_context":"Looks like English ‘cathedral’; used when talking about famous churches"},{"target":"Athènes","native":"Athènes","position":"Middle","cultural_context":"French name for Athens, the capital of Greece"}]}]
["rh",{"thoughts":"The letter pair “rh” doesn’t create a new sound in French; it simply signals the normal French uvular “r.” English speakers therefore face the same challenge they have with any French “r”: producing a voiced, throaty friction at the back of the mouth instead of the English tongue-tip or retroflex R.","pattern":"rh","position":"Anywhere","description":"Pronounce it exactly like the standard French R: a voiced, slightly raspy sound made in the throat (near the uvula), a bit like you’re softly gargling or clearing your throat. The written H is silent and changes nothing about the sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Rhinocéros","native":"rhinocéros","position":"Beginning","cultural_context":"Looks almost the same as the English word “rhinoceros,” the large horned animal"},{"target":"Rhône","native":"Rhône","position":"Beginning","cultural_context":"Famous French river and wine region you see on wine labels and travel shows"},{"target":"arthrite","native":"arthrite","position":"Middle","cultural_context":"Means “arthritis,” a medical term English speakers recognize"}]}]
["sh",{"thoughts":"“sh” is not native to traditional French spelling; it only appears in recent English loan-words. When it does show up, it keeps the exact same sound English speakers already know (/ʃ/, as in “shoe”). So the issue is spotting it, not pronouncing it.","pattern":"sh","position":"Anywhere","description":"Pronounced /ʃ/, the same hushing “sh” sound in English words like “ship.” Let the air flow over the middle of the tongue, lips slightly rounded, vocal cords off. Because it is identical to the English sound, nothing special is required beyond remembering that French almost never uses the digraph except in borrowed words.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"shampooing","native":"shampoo","position":"Beginning","cultural_context":"Seen on French shampoo bottles; looks like the English word \"shampoo\" with -ing ending"},{"target":"short","native":"shorts (athletic shorts)","position":"Beginning","cultural_context":"Used in French sportswear contexts; same meaning as English \"shorts\""},{"target":"flash","native":"flash","position":"End","cultural_context":"Tech term (camera flash, flash news) carried straight over from English"}]}]
["ss",{"thoughts":"English already has the double-s spelling and the exact same unvoiced /s/ sound, so learners just need to remember that in French the double s guarantees the crisp “s” (never the /z/ that a single s can have between vowels). Easiest of French consonant patterns.","pattern":"ss","position":"Anywhere","description":"“ss” in French is always the clear, hissy /s/ sound, like the first sound in English “sun.”  It is never pronounced /z/.  Keep the tongue near the upper teeth ridge, let air pass without using your vocal cords.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Popular buttery breakfast pastry sold worldwide"},{"target":"mousse","native":"mousse","position":"Middle","cultural_context":"Common dessert (chocolate mousse) and a hair-styling product name"},{"target":"passé","native":"passé","position":"Middle","cultural_context":"Used in English to mean out of fashion"},{"target":"assassin","native":"assassin","position":"Multiple","cultural_context":"Same word in English for a hired killer"}]}]
["ll",{"thoughts":"French “ll” is easy to pronounce once you know which of its two values to choose: (1) a plain English-style L, or (2) the Y-sound /j/ as in “yes.” The spelling doesn’t change, so the learner has to learn the common environments that trigger the glide.","pattern":"ll","position":"Anywhere","description":"Most of the time “ll” is just a single, clear L, identical to the English L in “lip.” BUT when it follows the letter i (and often forms “ille/aille/eille/ouille/etc.”) it turns into the glide /j/, the same sound as English “y” in “yes.” So “ballet” = ba-LÉ, but “fille” = FEE-y(uh). Remember: see an i + ll + silent e, think “y.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ballet","native":"ballet","position":"Middle","cultural_context":"Classical dance form; same word in English"},{"target":"Marseille","native":"Marseille","position":"Middle","cultural_context":"Well-known French port city, famous soccer team"},{"target":"Camille","native":"Camille","position":"End","cultural_context":"Common French first name; composer Saint-Saëns and characters in literature"},{"target":"grille","native":"grille","position":"End","cultural_context":"Word used in English for a metal gate or restaurant name (‘the Grille’)"}]}]
["ill",{"thoughts":"French “ill” is tricky because it has two main realizations: either a simple clear L sound or a Y-like glide (often written /j/).  English speakers see “ill” and expect the sound in “bill”, so either French value feels unusual; still, many famous French names/words use it, so learners have probably heard it before.","pattern":"ill","position":"Anywhere","description":"Two common pronunciations: (1) After another vowel, “ill” is usually a single clear L, like the L in English “leaf”—e.g. ville [vil]. (2) After most consonants or at the start of a syllable, it becomes a glide, close to the English Y in “yes,” sometimes preceded by a short EE: billet [bi-yeh], Versailles [ver-sigh].  Aim to keep the tongue forward and the lips relaxed; do not pronounce the English short “i” as in “bill.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Versailles","native":"Versailles","position":"End","cultural_context":"Famous French palace/treaty—history class & tourism"},{"target":"Marseille","native":"Marseille","position":"End","cultural_context":"Major French port city often mentioned in sports and travel"},{"target":"guillotine","native":"guillotine","position":"Middle","cultural_context":"Execution device from the French Revolution—common historical reference"},{"target":"ville","native":"ville (\"city\")","position":"End","cultural_context":"Seen as a suffix in U.S. place names like \"Nashville\" and means \"city\" in French"}]}]
["ille",{"thoughts":"English speakers have run into “ille” in names like “Bastille” or “Camille”, but may not realise that sometimes it sounds like the English “ee-y” glide (/ij/) and other times it’s a plain clear L (/il/). The spelling does not reliably tell you which, so a bit of memorisation is needed.","pattern":"ille","position":"Anywhere","description":"In most French words, “-ille” after a consonant is pronounced like a quick 'ee' followed by a light English 'y' sound — almost like saying “ee-y” together (/ij/: Bastille = ba-STEE-y).  In a smaller group of very common words (ville, mille, tranquille) the double-l is pronounced as a normal clear L (/il/: ville = ‘veel’).  There’s no hard rule; you simply learn which words keep the L sound.  Keep your tongue close to the hard palate for the /ij/ glide, and resist adding an English ‘L’ unless the word is one of the exceptions.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bastille","native":"Bastille","position":"End","cultural_context":"Famous Paris prison; ‘Bastille Day’ is often mentioned in history and news"},{"target":"Camille","native":"Camille","position":"End","cultural_context":"Well-known French given name used internationally"},{"target":"ville","native":"ville","position":"End","cultural_context":"Seen in city names like Louisville or Nashville; means “city” in French"},{"target":"mille-feuille","native":"mille-feuille","position":"Beginning","cultural_context":"Layered pastry frequently shown on cooking shows and bakery menus"}]}]
["sc",{"thoughts":"French “sc” has no new mouth position for English speakers, but the spelling-to-sound rule changes depending on the following letter: before e, i, or y it is just /s/ (the k disappears); before a, o, u, or a consonant it keeps the /sk/ cluster. English already has both sounds, so the only challenge is remembering when the k is silent.","pattern":"sc","position":"Anywhere","description":"Two possible pronunciations:\n• /s/ – when “sc” comes before e, i, or y (think of the S in “see”).\n• /sk/ – in all other cases (like the SK in “ski”).\nTip: look at the next letter; if it’s a ‘soft’ vowel (e, i, y) drop the K sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"science","native":"science","position":"Beginning","cultural_context":"Same spelling in English; school subject everyone knows"},{"target":"fascination","native":"fascination","position":"Middle","cultural_context":"Common English word meaning strong interest"},{"target":"sculpture","native":"sculpture","position":"Beginning","cultural_context":"Art term used exactly the same in English"},{"target":"scooter","native":"scooter","position":"Beginning","cultural_context":"Word for a small motorbike or kids’ push vehicle, identical in English"}]}]
["sch",{"thoughts":"For an English speaker, “sch” in French is straightforward: it is always the single “sh” sound /ʃ/. The only possible trap is thinking of the English word “school” (/sk/), but French never keeps that hard /sk/ after s-c-h. If you can say the first sound in “shoe,” you already have it.","pattern":"sch","position":"Anywhere","description":"Always pronounced like the English “sh” in “shoe.” Lips come slightly forward, tongue is high and near the roof of the mouth, with no vibration of the vocal cords.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"schéma","native":"schéma","position":"Beginning","cultural_context":"Same idea as English “schema,” a diagram or outline"},{"target":"schizophrénie","native":"schizophrénie","position":"Beginning","cultural_context":"Close to English “schizophrenia,” a well-known mental health term"},{"target":"Schengen","native":"Schengen","position":"Beginning","cultural_context":"EU “Schengen Area” mentioned often in news about European travel"}]}]
["tch",{"thoughts":"In French spelling, the sequence “tch” is only used to force the hard English-style “ch” (/tʃ/) sound that French normally writes just “ch” for loanwords. English speakers already make /tʃ/ in words like “church,” so the sound itself is familiar and easy; the only trick is remembering that French usually pronounces plain “ch” as /ʃ/ (“sh”), so you need the extra t to keep the familiar ‘ch’ sound.","pattern":"tch","position":"Anywhere","description":"Pronounce it exactly like the English “ch” in “church” – start with a quick ‘t’ and slide straight into a ‘sh’ to make one crisp affricate /tʃ/. Lips are lightly rounded, tongue tip touches the ridge behind the top teeth for the brief ‘t’ release, then immediately pulls back for the ‘sh’ hiss.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"ketchup","native":"ketchup","position":"Middle","cultural_context":"Popular condiment for fries and burgers"},{"target":"Tchaïkovski","native":"Tchaïkovski","position":"Beginning","cultural_context":"Famous Russian composer; name seen in concert programs"},{"target":"tchao","native":"tchao","position":"Beginning","cultural_context":"Casual “bye” borrowed from Italian “ciao,” appears in movies and pop culture"},{"target":"Tchernobyl","native":"Tchernobyl","position":"Beginning","cultural_context":"Site of the well-known 1986 nuclear accident, often mentioned in documentaries"}]}]
["ps",{"thoughts":"English speakers already know the letter pair “ps” because it turns up in medical or academic terms like “psychology” and in English we normally keep the /s/ but drop the /p/. In French, what happens varies by location: at the very start of a word you actually do pronounce both sounds one right after the other /ps/; at the end of a word the whole cluster usually disappears. Those two situations cover almost everything a beginner will run into.","pattern":"ps","position":"Anywhere","description":"At the start of a French word, pronounce a quick /p/ immediately followed by /s/, like saying the consonants in “cups” without the vowel. Keep it light and un-aspirated—no puff of air after the /p/. At the end of a word the letters p s are normally silent, so the word ends with the previous vowel or consonant (corps → /kɔʁ/). In the middle, if the “ps” belongs to a Greek-origin prefix (psy-, pseudo-) you say /ps/; otherwise the whole cluster is often silent in everyday words.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psychologie","native":"psychologie","position":"Beginning","cultural_context":"Looks almost identical to the English word “psychology”"},{"target":"pseudonyme","native":"pseudonyme","position":"Beginning","cultural_context":"French version of the English word “pseudonym”"},{"target":"corps","native":"corps","position":"End","cultural_context":"Seen in phrases like “Marine Corps”; final ps is silent in both languages"}]}]
["pt",{"thoughts":"English already uses the “pt” cluster (opt, concept), so the sound itself is familiar. The only surprises in French are (1) at the very beginning of a word the p disappears and you just say /t/, and (2) in a few short words like “sept” the p is also silent at the end. Otherwise you pronounce a quick, un-aspirated /p/ immediately followed by /t/.","pattern":"pt","position":"Anywhere","description":"Inside a word or before a vowel you normally pronounce both letters one after the other, like the end of English “opt”, but with a lighter, non-aspirated /p/. At the very start of a word—and in a handful of short words such as “sept”—the p is silent, so you only pronounce /t/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ptérodactyle","native":"ptérodactyle","position":"Beginning","cultural_context":"The dinosaur name most people know from museums and movies; starts with silent p"},{"target":"adoption","native":"adoption","position":"Middle","cultural_context":"Legal process of becoming a child’s parent; same word exists in English"},{"target":"concept","native":"concept","position":"End","cultural_context":"Common word meaning an idea; spelled the same in English"},{"target":"sept","native":"sept","position":"End","cultural_context":"Means the number seven; basic French counting word often seen in beginners’ lessons"}]}]
["gue",{"thoughts":"“gue” is not a new sound for English speakers – it simply indicates the hard /g/ (as in “go”).  In French the extra letter “u” is normally silent; its only job is to keep the G hard in front of the letter E (otherwise G would soften to /ʒ/).  At the end of a word “-gue” is pronounced just /g/, and if the e carries an accent (gué, guérir) you still hear the hard /g/ followed by the normal French é sound.  The physical articulation is exactly the English hard G, but with almost no puff of air.","pattern":"gue","position":"Anywhere","description":"Pronounce a regular hard G /g/ (like the G in “go”).  The letter “u” is silent; the following “e” is either silent (at word-end) or pronounced like a normal French é/è if it has an accent.  The key is to avoid adding an English-style burst of air after the /g/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Famous long, crusty French bread sold worldwide"},{"target":"fatigue","native":"fatigue","position":"End","cultural_context":"Same word in English meaning extreme tiredness"},{"target":"catalogue","native":"catalogue","position":"End","cultural_context":"Common English word for a product list, often spelled this way"},{"target":"guerre","native":"guerre","position":"Beginning","cultural_context":"Seen in French titles like “La Guerre des étoiles” (Star Wars); means “war”"}]}]
["gui",{"thoughts":"English speakers already know the hard “g” sound and the long “ee”, but the spelling GUI looks like the English word “guy”. In French you never say “guy”; you say either /gi/ (most cases) or the slightly trickier /gɥi/ glide when another vowel comes right before. The job of the written u is mainly to keep g hard before i; sometimes it forms a quick w-like glide.","pattern":"gui","position":"Anywhere","description":"Usually pronounced /gi/: a hard g (as in “gift”) followed by the French i = “ee”. The written u is silent but keeps the g hard. After another vowel (e.g., aiguille) the u can be heard as a short, rounded glide /ɥ/, a quick “w” before the ee, /gɥi/. Think “gee” or very short “gwee,” never “guy.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guide","native":"guide (a guide, handbook, or tour guide)","position":"Beginning","cultural_context":"Same spelling exists in English; tourist \"guidebook\" etc."},{"target":"guitare","native":"guitar","position":"Beginning","cultural_context":"The musical instrument—word differs only by final e."},{"target":"guillotine","native":"guillotine","position":"Beginning","cultural_context":"Execution device from the French Revolution, term used in English history classes."},{"target":"Aiguille du Midi","native":"Aiguille du Midi","position":"Middle","cultural_context":"Well-known mountain peak and cable car viewpoint in the French Alps visited by tourists."}]}]
["ge",{"thoughts":"“ge” almost always triggers the French soft-g sound /ʒ/ (like the s in “meaSure”). The written e itself is usually silent unless it carries an accent or is followed by another pronounced vowel. English already borrows many French words with this sound, so the ear is familiar, but speakers sometimes slip into a hard g /g/ or an English j /dʒ/.","pattern":"ge","position":"Anywhere","description":"Pronounce g + e as the soft ‘zh’ sound /ʒ/, the same noise in English “vision.” Do NOT add a d-sound in front (no /dʒ/). Keep the tongue high and slightly back, lips relaxed; vocal cords vibrate. The following e is normally silent, so you end right on /ʒ/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"genre","native":"genre","position":"Beginning","cultural_context":"English uses this French word for a category of art, film, music"},{"target":"lingerie","native":"lingerie","position":"Middle","cultural_context":"Term for women’s intimate apparel; common in stores/ads"},{"target":"beige","native":"beige","position":"End","cultural_context":"Everyday English color name"},{"target":"collage","native":"collage","position":"End","cultural_context":"Art technique taught in school and crafts"}]}]
["gi",{"thoughts":"The letter pair “gi” normally triggers French’s soft-g sound /ʒ/ followed by the vowel /i/. English has the same /ʒ/ in ‘meaSUre’ or ‘viSIon’, but never at the beginning of a native word, so learners may default to /dʒ/ (“j”) instead. They must remember to keep it a buzzy, tongue-forward “zh” plus a pure ‘ee’. A few recent loans (e.g. gin) keep an English-style /dʒi/, but /ʒi/ is the default.","pattern":"gi","position":"Anywhere","description":"Usually pronounced /ʒi/ – think “zh + ee”. Start with the sound in English “measure” then glide straight into a clear “ee”. Do NOT add a hard ‘g’ or English “j” unless the word is a modern English loan.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gilet","native":"gilet","position":"Beginning","cultural_context":"“Yellow-vest” protests put this word for a sleeveless vest in the news"},{"target":"girafe","native":"girafe","position":"Beginning","cultural_context":"Nearly the same spelling as the English animal “giraffe”"},{"target":"bougie","native":"bougie","position":"Middle","cultural_context":"French for “candle”; echoed in English slang “bougie” meaning upscale"},{"target":"gigabyte","native":"gigabyte","position":"Beginning","cultural_context":"Tech term for digital storage; same meaning in English"}]}]
["ga",{"thoughts":"“ga” in French is simply a hard /g/ followed by the open-back vowel /a/. English speakers already know both sounds, but should keep the French “a” pure and short (no diphthong such as the first part of “guy”).","pattern":"ga","position":"Anywhere","description":"Pronounce a hard \"g\" (as in English \"go\") immediately followed by a short, pure \"ah\" sound. It is identical to the first syllable of the French-borrowed English word “garage,” just keep the “a” flat, not the wider/tenser \"æ\" heard in some English accents.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"garage","native":"garage","position":"Beginning","cultural_context":"Same word in English meaning a place where you park or repair cars"},{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Iconic long French bread sold in bakeries and supermarkets"},{"target":"gâteau","native":"cake","position":"Beginning","cultural_context":"French word for cake; appears on dessert menus and cooking shows"},{"target":"yoga","native":"yoga","position":"End","cultural_context":"Popular exercise and meditation practice; word identical in English"}]}]
["go",{"thoughts":"“g o” is very straightforward for English speakers: the g is always the hard g as in “go,” and the vowel is some kind of pure rounded o. The only subtlety is that French has two flavors of o: a close /o/ in an open syllable and a more open /ɔ/ before a pronounced consonant. English speakers already know both sounds, but they tend to glide them; in French the vowel must stay pure, with no ending w-sound.","pattern":"go","position":"Anywhere","description":"Always the hard g ([g]) plus a pure rounded o. In an open syllable it’s the close /o/ (similar to the first half of English “go” but without the off-glide); in a closed syllable it’s the more open /ɔ/ (like the vowel in British “thought”). Keep your lips rounded the whole time and don’t let the vowel slide.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"golf","native":"golf","position":"Beginning","cultural_context":"Same word for the sport in English and French"},{"target":"logo","native":"logo","position":"End","cultural_context":"English uses the word “logo” for a brand symbol"},{"target":"escargot","native":"escargot","position":"Middle","cultural_context":"Classic French snail dish often mentioned in restaurants and food shows"}]}]
["gu",{"thoughts":"English speakers see “gu” in words like “guitar” or “Gucci,” so the hard-g idea is not new, but they rarely realise that in French the written u can be either silent (just forcing a hard g) or pronounced as a front-rounded glide /ɥ/ or /w/. The silent version is easy; the glided one feels odd because English lacks the front-rounded /ɥ/ sound, so learners tend to drop it or replace it with a plain w.","pattern":"gu","position":"Anywhere","description":"1) Before the vowels e, i, y the u is silent and the group simply sounds like a hard g, as in English “get.”\n2) Before a, o, u (or when final) the u is usually heard as a quick rounded glide /ɥ/ (a tighter, more fronted version of English w) or /w/, so you get something like “gw/gy.” Do NOT separate the sounds like “goo-a”; keep them in one syllable.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guadeloupe","native":"Guadeloupe","position":"Beginning","cultural_context":"French Caribbean island often mentioned in travel shows and weather reports"},{"target":"guillotine","native":"guillotine","position":"Beginning","cultural_context":"Execution device from the French Revolution, a word that appears in history books and movies"},{"target":"accent aigu","native":"accent aigu","position":"End","cultural_context":"The name of the acute accent mark (´) that every French textbook teaches"}]}]
["ai",{"thoughts":"French “ai” has two common vowel values. Inside a word it is usually the open “eh” /ɛ/—think of the vowel in English “bet,” but held a touch longer. At the very end of a word (or before a silent final consonant such as –t) it tightens to a closed “ay” /e/, similar to the vowel in English “say” but without sliding-off; keep your tongue steady and don’t add a y-glide.","pattern":"ai","position":"Anywhere","description":"Most often /ɛ/ (open “eh”) inside a word; becomes /e/ (closed, pure “ay”) at the end. Unlike English, it is never a diphthong—mouth stays still.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fait accompli","native":"fait accompli","position":"Middle","cultural_context":"Common idiom in English meaning a finished deed"},{"target":"Beaujolais","native":"Beaujolais","position":"End","cultural_context":"Well-known French wine seen on menus and in stores"},{"target":"prairie","native":"prairie","position":"Middle","cultural_context":"Everyday English word for a grassland, originally French"}]}]
["ais",{"thoughts":"“ais” almost always sounds like an open “eh” (/ɛ/) – similar to the vowel in English “bet,” but a bit longer and without the glide English speakers sometimes add.  When it comes at the end of a word the final “s” is silent.  Inside a word, if the “s” belongs to the next syllable you’ll hear it, giving /ɛs/ or /ɛz/ (as in “Blaise”).  English speakers know the basic /ɛ/ vowel, but keeping it pure (no closing “y” sound) and remembering when the “s” is silent are the main hurdles.","pattern":"ais","position":"Anywhere","description":"Usually pronounced /ɛ/ – like the “e” in “bet” but held a touch longer.  At word-ends the “s” is silent (Calais, Beaujolais).  In the middle, if the “s” is pronounced it becomes /ɛs/ or /ɛz/ (Blaise).  Never pronounced like English long “ay” unless you’re hearing an anglicised tourist version.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Calais","native":"Calais","position":"End","cultural_context":"French port city you hear about with the Channel Tunnel"},{"target":"Beaujolais","native":"Beaujolais","position":"End","cultural_context":"Well-known French wine region and the yearly “Beaujolais Nouveau” release"},{"target":"Blaise","native":"Blaise","position":"Middle","cultural_context":"First name of famous mathematician Blaise Pascal; used as a given name in English too"}]}]
["ait",{"thoughts":"English speakers have heard the sequence “ait” in loan-phrases like “café au lait” or “fait accompli,” so the spelling looks familiar, but its French sound is not obvious because the final “t” is silent and the vowel is a single “eh” sound, not an English diphthong. It’s basically the open ‘e’ of “bet,” held a touch longer, with no trace of an ending consonant unless there’s liaison.","pattern":"ait","position":"Anywhere","description":"Usually pronounced as a single open e sound /ɛ/ (like the “e” in English “bet,” a bit longer). The final “t” is silent unless the next word starts with a vowel and liaison is required, in which case a /t/ may be heard. Do NOT glide into an English “ay” diphthong; keep it a pure vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fait accompli","native":"fait accompli","position":"End","cultural_context":"Common English phrase for an accomplished fact"},{"target":"café au lait","native":"café au lait","position":"End","cultural_context":"Well-known coffee drink, literally “coffee with milk”"}]}]
["ai",{"thoughts":"Final –ai is usually one of two pure French vowels: a closed /e/ (like the first part of “say” without the y-glide) or an open /ɛ/ (like “e” in “bet”).  English speakers know both vowels, but must remember French keeps them pure—no diphthong.","pattern":"ai","position":"End","description":"At the end of a word, ai can be pronounced in two ways:\n• closed /e/ – similar to the vowel in English “say,” but keep it short and do NOT let it slide into a y-sound.\n• open /ɛ/ – like the “e” in “bet,” but a bit tenser.\nWhich one you hear depends on the word: many short function words (j’ai, mais) use /e/, while most nouns like mai use /ɛ/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"j’ai","native":"I have","position":"End","cultural_context":"Common beginner phrase “j’ai faim / I’m hungry” in any French course"},{"target":"mai","native":"May (the month)","position":"End","cultural_context":"Month name you see on French calendars or travel posters"}]}]
["ais",{"thoughts":"“ais” at the end of a word is almost always pronounced like the open “eh” sound /ɛ/ (as in English “bet”), while the written “s” is silent. The spelling never signals a long “ai” diphthong like in English “aisle,” so learners just need to ignore the final “s” and say a short, pure vowel.","pattern":"ais","position":"End","description":"Say a short open “eh” (like the vowel in English “bet”), then stop—do NOT pronounce the written “s.” Lips are relaxed, jaw slightly open. It is never the English long ‘ay’ or ‘ice’ sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Français","native":"Français","position":"End","cultural_context":"Language label you see on websites and product packaging meaning “French.”"},{"target":"Anglais","native":"Anglais","position":"End","cultural_context":"Means “English”; appears on bilingual menus and language settings."},{"target":"Beaujolais","native":"Beaujolais","position":"End","cultural_context":"Well-known French red wine often mentioned in food & drink contexts."}]}]
["ait",{"thoughts":"English speakers already know the written chunk “ait” from loan-phrases like “café au lait” and “fait accompli,” but they usually pronounce the final “t.” In French, the letters “ait” at the end of a word sound like a short open “eh” (/ɛ/) and the written “t” stays silent unless the next word begins with a vowel.","pattern":"ait","position":"End","description":"At the end of a French word, “ait” is pronounced like the short \"eh\" in English “bet,” but a bit more open. The final written “t” is normally silent, so you just end on that pure vowel: /ɛ/. Avoid adding an English trailing /t/ or turning the vowel into a diphthong like “ay.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fait accompli","native":"fait accompli","position":"End","cultural_context":"Common English legal/political phrase meaning an accomplished fact"},{"target":"café au lait","native":"café au lait","position":"End","cultural_context":"Well-known coffee drink served with milk"},{"target":"trait","native":"trait","position":"End","cultural_context":"Exactly the same spelling as English “trait,” but in French the final “t” is silent"}]}]
["aie",{"thoughts":"Very few French loan-words that English speakers run into actually contain the exact spelling “aie”, so the cluster will feel unfamiliar in writing even though the sound itself (/ɛ/) is not hard. The trickiest point is remembering that, unless the ï has a diaeresis (aïe), you do NOT glide to an “eye” diphthong – you just say one open “eh”. The pattern can pop up at the beginning, middle or end of a French word (j’aie, aieul, craie).","pattern":"aie","position":"Anywhere","description":"Most of the time “aie” is pronounced as a single short open “eh” /ɛ/, similar to the “e” in English “bet”, because the final “e” is silent and the “ai” gives /ɛ/. If the i carries a diaeresis (aïe), the vowels are read separately /a.i/ and it sounds like the English word “eye” stretched over two syllables.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"aïe","native":"ouch!","position":"Beginning","cultural_context":"Seen in subtitles or comics when someone yells in pain"},{"target":"baie","native":"bay / berry","position":"End","cultural_context":"Shows up in Quebec place-names such as “Baie-Saint-Paul” that tourists may notice"}]}]
["aie",{"thoughts":"“aie” at the end of a French word is almost always pronounced as a single open-mid “eh” sound /ɛ/. English has the same vowel in “bet”, so the sound itself is easy; what can trip learners up is expecting a diphthong like the English word “eye”. Just keep it short and relaxed — no glide.","pattern":"aie","position":"End","description":"Pronounce it like the vowel in English “bet”, but keep it pure and short — don’t slide toward “y” or “ee”.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"aïe","native":"ouch!","position":"End","cultural_context":"Comic-book or subtitle exclamation for pain — seen in Asterix, Tintin, etc."},{"target":"haie","native":"hedge","position":"End","cultural_context":"Word shows up on French TV graphics for ‘100 m haies’ (hurdles) during the Olympics"},{"target":"j’essaie","native":"I try","position":"End","cultural_context":"Very common phrase you’ll notice in French song lyrics and subtitles"}]}]
["au",{"thoughts":"French “au” is almost always a single, pure round vowel, not a diphthong like English “ow/au.”  English speakers already see it in several loan-words, but may lengthen it or glide it.  They need to keep it short and keep the lips rounded.","pattern":"au","position":"Anywhere","description":"Usually pronounced like the pure French close-mid rounded vowel /o/ – similar to the first half of English “oh” but shorter and with steadier lip rounding.  In a few common words before l or r it can be the slightly more open /ɔ/ (like the vowel in British “thought”).  Do not let it glide into a ‘w’ sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"restaurant","native":"restaurant","position":"Middle","cultural_context":"Common English word for an eating establishment borrowed from French"},{"target":"chauffeur","native":"chauffeur","position":"Middle","cultural_context":"Loan-word meaning a professional driver"},{"target":"Paul","native":"Paul","position":"Middle","cultural_context":"Very common male first name; French pronunciation shows the open variant /ɔ/"},{"target":"au revoir","native":"au revoir","position":"Beginning","cultural_context":"Famous French farewell phrase often heard in movies and classes"}]}]
["aux",{"thoughts":"English speakers have met “aux” in words like Bordeaux or in the plural article “aux”, but they rarely realise the final ‑x is silent. The main job, therefore, is to remember that most of the time “aux” is just one long French “oh” sound /o/, with the x only surfacing as /z/ during liaison or as /ks/ inside words such as “auxiliaire”.","pattern":"aux","position":"Anywhere","description":"Most of the time “aux” is pronounced exactly like a long English “oh” /o/, the x being silent (ex: Bordeaux, gâteaux). If the next word begins with a vowel, the normally silent x links in as /z/ (aux États-Unis → /o ze.ta‿zy.ni/). Inside a longer word where x sits between vowels, it sounds like /ks/ (auxiliaire → /ok.si.ljɛʁ/). Think “oh”, and only add /ks/ or /z/ when letters follow.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Well-known French wine and city"},{"target":"gâteaux","native":"gâteaux","position":"End","cultural_context":"Plural of “gâteau”; fancy cakes often mentioned in cooking shows"},{"target":"Auxerre","native":"Auxerre","position":"Beginning","cultural_context":"French town; name appears in travel and football (soccer) contexts"},{"target":"auxiliaire","native":"auxiliaire","position":"Middle","cultural_context":"Looks like English “auxiliary”; seen in grammar guides and technical writing"}]}]
["eau",{"thoughts":"“eau” is one of the first French vowel spellings English speakers bump into (beau, bureau, plateau). The sound itself is essentially the pure French /o/; the only trap is to avoid the English-style diphthong /oʊ/. Because the letters show up in many loan-words, the look and the sound are already fairly familiar.","pattern":"eau","position":"Anywhere","description":"Usually pronounced as a single, steady \"oh\" sound /o/ – similar to the vowel in English “go,” but without letting it glide toward a /ʊ/ at the end. Keep the lips rounded and hold the vowel steady. (In a few rare grammatical endings it can sound closer to /ø/, but not in the common words English speakers meet.)","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"beau","native":"beau","position":"End","cultural_context":"Borrowed into English for “boyfriend” or “admirer” (e.g., “my beau”)."},{"target":"bureau","native":"bureau","position":"End","cultural_context":"English word for a desk or an agency (e.g., “FBI is a bureau”)."},{"target":"plateau","native":"plateau","position":"End","cultural_context":"Geography term for a flat-topped highland; used in science and dieting (“weight-loss plateau”)."},{"target":"Eau de Cologne","native":"Eau de Cologne","position":"Beginning","cultural_context":"Classic fragrance name seen on perfume bottles and in ads."}]}]
["eaux",{"thoughts":"‘eaux’ is almost always a spelling of the single French vowel /o/.  English speakers already know the basic “oh” sound, but the silent x and extra letters can be confusing.","pattern":"eaux","position":"Anywhere","description":"Pronounce it like a pure, rounded “oh” (IPA /o/), similar to the vowel in English “go” but shorter and without the final glide toward a ‘w’.  The final x is always silent; the whole group ‘eaux’ = one vowel sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Well-known French wine region and the wine itself"},{"target":"châteaux","native":"châteaux","position":"End","cultural_context":"Plural of château; English speakers meet it in travel and history texts"},{"target":"plateaux","native":"plateaux","position":"End","cultural_context":"Plural of plateau; appears in geography and science writing"},{"target":"gâteaux","native":"gâteaux","position":"End","cultural_context":"French word for cakes; seen on dessert menus"}]}]
["ei",{"thoughts":"“ei” is not one of the trickier French spellings for an English speaker.  Most of the time it is the open-mid front vowel /ɛ/ (like the “e” in English “bet”).  In the sequence “eil/elle/eille” it glides to /ɛj/ (roughly “eh-y”).  Both sounds exist in English, so the only real task is remembering to keep the French vowel short and pure.","pattern":"ei","position":"Anywhere","description":"Usually pronounced /ɛ/ – the pure “eh” of English “bet.”  Before an “l” it becomes /ɛj/, a quick “eh-y” glide similar to the end of English “hey” but shorter.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"beige","native":"beige","position":"Middle","cultural_context":"A light tan colour; same word used in English"},{"target":"Seine","native":"Seine","position":"Middle","cultural_context":"The famous river running through Paris"},{"target":"seize","native":"seize","position":"Middle","cultural_context":"Means “sixteen” in French; appears in basic counting lists"},{"target":"soleil","native":"soleil","position":"End","cultural_context":"Known from the entertainment company “Cirque du Soleil,” literally “sun”"}]}]
["eu",{"thoughts":"French “eu” has no exact English twin; learners must master lip rounding while keeping the tongue relatively forward. Two main qualities: closed /ø/ (as in “bleu”) and open /œ/ (as in “neuf”). English speakers may have heard it in words like “euro” but still struggle to reproduce it.","pattern":"eu","position":"Anywhere","description":"Round your lips as though saying English “oo,” but keep your tongue in the position for the vowel in “bed.” Sustain the sound—don’t glide. In stressed syllables or before a silent final consonant it is usually the more closed /ø/ (tighter lips); before pronounced consonants it tends to be the more open /œ/ (slightly laxer).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"euro","native":"euro","position":"Beginning","cultural_context":"European currency you hear in news and travel"},{"target":"bureau","native":"bureau","position":"Middle","cultural_context":"Loan-word for an office or a type of desk"},{"target":"chauffeur","native":"chauffeur","position":"End","cultural_context":"Word for a hired driver, common in English"}]}]
["eux",{"thoughts":"“eux” spells the single vowel sound /ø/ or /œ/ (here it is the stressed /ø/ because it is followed by normally-silent x). English has no rounded front vowels, so nothing matches it directly; it is a bit like the vowel in “sir” or “bird,” but with the lips rounded as though you were going to whistle. The final x is silent unless liaison happens. The spelling can turn up at the beginning, middle, or end of words, but is most common at the end.","pattern":"eux","position":"Anywhere","description":"Pronounce it as one smooth, pure vowel, halfway between the “ay” of “say” and the “uh” of “sun,” but keep the lips rounded. Hold it briefly; do not add a glide or an English “w.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"deux","native":"deux","position":"End","cultural_context":"French number 2—shows up in cafés, film titles like “Deux Jours” etc."},{"target":"jeux","native":"jeux","position":"End","cultural_context":"Seen in phrases like “Jeux Olympiques” (Olympic Games) in sports coverage"},{"target":"adieux","native":"adieux","position":"End","cultural_context":"Plural of “adieu”; used in English expressions such as “fond adieux”"}]}]
["oe",{"thoughts":"English speakers have seen the letters \"oe/œ\" in words like \"œuvre\" or \"boeuf\", but the actual French vowel it represents (/ø/ or /œ/) does not exist in English. It is a rounded version of the \"uh\" sound in “cup,” so it tends to be perceived as hard to place. Occasionally, the same spelling in learned/Greek words is read simply /e/, but that is far rarer in everyday vocabulary.","pattern":"oe","position":"Anywhere","description":"Most of the time, “oe” written as the ligature œ (often typed just “oe”) is pronounced like French “eu”: a mid-front, rounded vowel /ø/ or the slightly more open /œ/. Think of saying the English \"uh\" in “cup” while rounding the lips as if starting to whistle. Much less commonly, in a handful of scholarly words from Greek, “oe” is pronounced /e/ (like é).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"œuf","native":"œuf","position":"Beginning","cultural_context":"Means “egg”; shows up on breakfast menus"},{"target":"bœuf","native":"bœuf","position":"Middle","cultural_context":"Known from the classic dish “boeuf bourguignon”"},{"target":"cœur","native":"cœur","position":"Middle","cultural_context":"Appears in love-song phrases like “mon cœur” (“my heart”)"},{"target":"œuvre","native":"œuvre","position":"Beginning","cultural_context":"Loanword in English (an artist’s entire work); found in “chef-d’œuvre” or “hors d’œuvre”"}]}]
["œu",{"thoughts":"English has no front-rounded vowels, so the “œu” spelling feels exotic even though English speakers run into it in food and art terms. The sound can be either the close-mid /ø/ (as in “peu”) or the more open /œ/ (as in “cœur”), but to an English ear they both resemble the vowel in “bird” said while rounding the lips.","pattern":"œu","position":"Anywhere","description":"Pronounce it with the tongue forward (like for the vowel in English “bed”) but with the lips rounded.  • In an open syllable or before a silent consonant it’s tighter /ø/ (similar to German “ö” in “schön”).  • Before a pronounced consonant it relaxes to /œ/ (similar to German “ö” in “Götter”).  English has no exact match, so think of saying “uh” while shaping the lips for an “oo”.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"œuvre","native":"work / oeuvre","position":"Beginning","cultural_context":"Used in English when talking about an artist’s entire body of work"},{"target":"hors d’oeuvre","native":"hors d’oeuvre","position":"Middle","cultural_context":"French word for appetizers that appears on English menus"},{"target":"bœuf bourguignon","native":"beef bourguignon","position":"Beginning","cultural_context":"Classic French beef stew made popular by cookbooks and cooking shows"}]}]
["oi",{"thoughts":"English speakers meet the French “oi” all the time in words like “croissant” and the interjection “voilà”. The sound is basically /wa/ – a quick English “w” followed by a short, open ‘ah’. The lips start rounded (as if to say “oo”) then immediately open to an “ah”. No real diphthong like the English \"boy\"; it is shorter and flatter.","pattern":"oi","position":"Anywhere","description":"Pronounced roughly like the start of English “wah!”. Think of saying “w” plus the vowel in “father”: /wa/. Keep it short and do not glide into a long ‘y’ sound as in English “boy.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Popular flaky breakfast pastry sold in cafés and bakeries"},{"target":"voilà","native":"voilà","position":"Middle","cultural_context":"Common exclamation meaning “there it is,” often used in English speech"},{"target":"moi","native":"me","position":"End","cultural_context":"Simple word for “me,” heard in phrases like “Moi aussi” in movies"},{"target":"boîte","native":"box","position":"Middle","cultural_context":"Used in phrases like “boîte de nuit” (nightclub) that appear in travel guides"}]}]
["ou",{"thoughts":"English speakers already know the “oo” sound, so the French spelling “ou” feels familiar. The only twist is that French keeps it a pure single vowel /u/, never the diphthong /uw/ many Americans add. When another vowel follows, “ou” may glide into /w/ (e.g., Louis /lwi/), but the mouth still starts in the same rounded position.","pattern":"ou","position":"Anywhere","description":"Most of the time “ou” is the single, tense, rounded vowel /u/, very close to the “oo” in English “food,” but held a bit shorter and without sliding. Before another vowel it often becomes the consonant-like glide /w/, as in “Louis.” Round your lips firmly and keep the tongue high and back; don’t let it drift or add a y-like off-glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"souvenir","native":"souvenir","position":"Beginning","cultural_context":"Same word in English for a travel keepsake"},{"target":"mousse","native":"mousse","position":"Beginning","cultural_context":"Chocolate mousse dessert or hair-styling foam"},{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Common French greeting used worldwide"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"Beginning","cultural_context":"Global luxury fashion brand"}]}]
["ui",{"thoughts":"“ui” in French almost always represents the glide-plus-vowel sequence /ɥi/.  English has nothing exactly like the front-rounded glide /ɥ/, so learners tend to replace it with /wi/ (“wee”).  The real sound is made by rounding the lips as if saying French “u” (/y/ – like a tight English \"oo\") while the tongue moves quickly toward a high front \"ee\" position.  So it’s a very fast \"ü-ee\" merged into one syllable.","pattern":"ui","position":"Anywhere","description":"Pronounce it as one quick syllable /ɥi/: start with tightly rounded lips (as for a French \"u\"), then glide immediately into an \"ee\" sound while keeping the lips rounded.  It will resemble English “wee” but with more lip rounding and a narrower mouth.  Don’t split it into two syllables and don’t let the lips un-round too early.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"cuisine","native":"cuisine","position":"Beginning","cultural_context":"Seen on menus; refers to a style of cooking"},{"target":"fruit","native":"fruit","position":"Middle","cultural_context":"Same spelling as the English word \"fruit\""},{"target":"circuit","native":"circuit","position":"Middle","cultural_context":"Used in English for an electrical path or a racing track"}]}]
["ue",{"thoughts":"“ue” in French is not one fixed sound—it changes depending on the letters around it.  English speakers run into it in loan-words like “rue,” “duel,” “vogue,” “unique.”  Sometimes the pair sounds like the French front-rounded vowel /y/ (a bit like saying “ee” while rounding the lips), sometimes it creates the glide /ɥ/ before another vowel, and in the common clusters “gue/que” the “u” is totally silent; the whole group just gives a hard g or k.  Because at least one of these options (the silent U) matches an English pattern, exposure is moderate, but producing the /y/ or /ɥ/ can still trip learners up.","pattern":"ue","position":"Anywhere","description":"1) After most consonants at the end of a word, “ue” is usually just the vowel /y/—round your lips as for “oo” but keep the tongue high and forward like “ee” (e.g., rue /ʁy/).  2) Between consonants before another vowel, “u” becomes the glide /ɥ/ and “e” is the following vowel (duel /dɥɛl/).  3) In the letter groups “gue” and “que,” the “u” is silent; the group simply gives a hard g (/ɡ/) or k (/k/) sound (vogue /voɡ/, unique /ynik/).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"rue","native":"rue (street)","position":"End","cultural_context":"Commonly seen on French street signs in movies or while traveling"},{"target":"duel","native":"duel","position":"Middle","cultural_context":"Same word in English for a formal fight"},{"target":"vogue","native":"vogue","position":"End","cultural_context":"Famous fashion magazine and English word for trend"},{"target":"unique","native":"unique","position":"End","cultural_context":"Same spelling and meaning in English—one of a kind"}]}]
["ie",{"thoughts":"French “ie” usually reads as a single vowel /i/ when it ends a word (Marie → /ma.ʁi/), but inside a word it becomes a glide + vowel, roughly /jɛ/ or /je/ (pied → /pje/, sieste → /sjɛst/). English speakers already know the pure /i/ sound (“see”). The tricky bit is adding a quick y-glide before the open ‘eh’ sound without inserting an extra syllable.","pattern":"ie","position":"Anywhere","description":"1) Word-final: pronounced like the long “ee” in English “see.” 2) Before another vowel or before a silent consonant at the end of a syllable: pronounce a quick y-sound (“y”) followed by an open ‘eh’ (/ɛ/) → approximates “yeh.” Keep it to one syllable: “pied” ≈ “pyeh,” not “pee-eh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Marie","native":"Marie","position":"End","cultural_context":"Common French given name, often seen in pop culture and history"},{"target":"pied-à-terre","native":"pied-à-terre","position":"Middle","cultural_context":"Loan phrase for a small city apartment, used in real-estate talk"},{"target":"Pied Piper","native":"pied","position":"Beginning","cultural_context":"Fairy-tale character name, the word “pied” in the title shows the French spelling"}]}]
["ier",{"thoughts":"English speakers have seen “ier” in words like “premier” or “croupier,” so the letter group itself is familiar, but the French sound is a single syllable /je/ (roughly “y”+“ay”) rather than the two-syllable “ee-er” many English speakers guess. The glide comes from the y-like consonant /j/ immediately into the closed e /e/. No r-sound is voiced at the end unless another consonant follows. Keeping it one quick syllable and not inserting an extra schwa is the main challenge.","pattern":"ier","position":"Anywhere","description":"Usually one syllable pronounced /je/: start with the English “y” in “yes,” then slide straight into the vowel of “day,” but shorten it. Do NOT add an English ‘r’ or extra schwa (“ee-er”). In the rare case it’s followed by a pronounced consonant (e.g., “pierre”), the final consonant is sounded separately.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"premier","native":"premier","position":"End","cultural_context":"Title for a prime minister; seen in news ('the Canadian premier')"},{"target":"croupier","native":"croupier","position":"End","cultural_context":"Casino card dealer term used in movies and games"},{"target":"sommelier","native":"sommelier","position":"End","cultural_context":"Wine expert in restaurants; food & dining shows often mention it"}]}]
["ier",{"thoughts":"-ier at the end of French words is almost always pronounced /je/. The written “r” is silent and the vowel is not a diphthong like English “ear.” English speakers see this spelling in loan-words but often pronounce the written r or turn the vowel into “ee-er.”","pattern":"ier","position":"End","description":"Final “-ier” sounds like a quick \"y\" plus the short \"eh\" in “get” (IPA /je/). Think “y-eh” said as one syllable. Keep the tongue high for the y-glide, then relax slightly for the open e; do NOT pronounce an r at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"sommelier","native":"sommelier","position":"End","cultural_context":"Wine expert term seen on restaurant menus"},{"target":"cavalier","native":"cavalier","position":"End","cultural_context":"Same word in English for a carefree attitude or a historical horseman"},{"target":"glacier","native":"glacier","position":"End","cultural_context":"Same spelling in English for a large river of ice"}]}]
["iers",{"thoughts":"“-iers” is the regular masculine plural ending for many adjectives and nouns (singular ‑ier). It is always in final position and pronounced just like the singular ‑ier: the vowel /je/ (close to English “yay” without the y-glide) with no audible r or s. English speakers may recognise the spelling from borrowed words like “cavaliers” or “grenadiers,” but the French sound is tighter and shorter than the English diphthong in “YAY.” Biggest trap: do NOT pronounce an English-style ‘ee-erz.’","pattern":"iers","position":"End","description":"Sounds like a single syllable /je/ – imagine saying a very short English “yay” but stop before the second half of the diphthong. Tongue high and forward; lips spread. The written r and s are silent unless there’s a liaison word after it.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"premiers","native":"first (masc. pl.)","position":"End","cultural_context":"You hear about provincial or state leaders called “premiers” in news reports"},{"target":"Cavaliers","native":"horsemen / Cavaliers","position":"End","cultural_context":"Name of the Cleveland NBA team, comes from French word for mounted soldiers"},{"target":"grenadiers","native":"grenadiers (soldiers using grenades)","position":"End","cultural_context":"Old military term; song \"The British Grenadiers\" often referenced"}]}]
["ien",{"thoughts":"English lacks nasal vowels, so learners must master both a glide (y-sound) and French nasal /ɛ̃/. They may also run into the non-nasal version when an extra ‘n/e’ follows. Real-life names and phrases they’ve probably seen give decent exposure.","pattern":"ien","position":"Anywhere","description":"Most often pronounced /jɛ̃/: start with an English “y” (as in “yes”), then glide into the French nasal vowel /ɛ̃/ (think of the “eh” in “bed” while letting air pass through the nose and NOT articulating an audible n).  If another written n or a vowel follows (e.g., “ienne”), the nasal quality disappears: you say /jɛn/ with a real n sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bien","native":"bien","position":"End","cultural_context":"Phrase “très bien” (“very good”) is common in beginner French lessons and pop culture"},{"target":"chien","native":"chien","position":"End","cultural_context":"Sometimes seen in jokes or on signage meaning “dog”—e.g., “chien méchant”"},{"target":"Adrien","native":"Adrien","position":"End","cultural_context":"Given name familiar from actor Adrien Brody"},{"target":"Vivienne","native":"Vivienne","position":"Middle","cultural_context":"British fashion designer Vivienne Westwood; showcases the non-nasal /jɛn/ variant"}]}]
["ien",{"thoughts":"‘ien’ at the end of French words is usually the single nasal vowel /jɛ̃/: starts with a brief English-like “y” glide then goes into a nasalized version of “eh” (like in “bet”) while letting air resonate through the nose. English has no exact match, so speakers often drop either the nasal quality or the glide.","pattern":"ien","position":"End","description":"Say a quick English “y” plus a short “eh,” but let the sound vibrate in your nose and keep the tongue fairly forward; do NOT finish with an N consonant – the N is only shown in the spelling.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bien","native":"bien","position":"End","cultural_context":"Heard in phrases like “bien sûr” (sure) or “muy bien” in Spanish-influenced contexts"},{"target":"chien","native":"chien","position":"End","cultural_context":"French word for “dog,” pops up in travel guides and jokes about French pets"},{"target":"ancien","native":"ancien","position":"End","cultural_context":"In the historical term “Ancien Régime,” discussed in history classes"}]}]
["iens",{"thoughts":"“iens” at the end of a French word sounds like /jɛ̃/: start with the English \"y\" glide of “yes” (/j/), then go into a nasal \"eh\" sound while letting air resonate in the nose; the final “s” is silent. English has no nasal vowels, so learners tend to drop the nasal quality or insert an extra consonant (e.g., “yen”).","pattern":"iens","position":"End","description":"Pronounce it roughly like the English word “yen,” but make the vowel nasal: begin with a quick “y” sound, then say an open “eh” while vibrating in the nose, and do NOT pronounce the final “s.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Canadiens","native":"canadiens","position":"End","cultural_context":"Montreal Canadiens NHL team name (French for Canadians)"},{"target":"Parisiens","native":"parisiens","position":"End","cultural_context":"Means Parisians; appears in travel articles and signage about Paris"},{"target":"Martiens","native":"martiens","position":"End","cultural_context":"French for Martians; shows up in sci-fi references"}]}]
["an",{"thoughts":"“an” in French is almost never the two sounds /æ/ + /n/ that English speakers expect. Instead, the two letters fuse into one nasal vowel /ɑ̃/: start with an open \"ah\" (as in British “posh”), keep the tongue low and back, then let air leak out through the nose while lightly cutting off the /n/. Don’t actually voice an /n/ at the end.","pattern":"an","position":"Anywhere","description":"French “an” is pronounced as the single nasal vowel /ɑ̃/. It’s like saying “ah” while humming through your nose and not touching the tongue to the roof of the mouth. The lips stay relaxed and the sound is shorter than an English vowel + n combination.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Chanel","native":"Chanel","position":"Middle","cultural_context":"Famous French luxury fashion brand"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Common flaky breakfast pastry"},{"target":"Mont Blanc","native":"Mont Blanc","position":"Middle","cultural_context":"Well-known Alpine mountain and premium pen brand"}]}]
["am",{"thoughts":"English speakers already see “am” in French loan-words like “champagne,” but they may not realise it can be nasal (/ɑ̃/) or an ordinary a-plus-m (/am/). The nasal version is new to them; the oral version feels natural.","pattern":"am","position":"Anywhere","description":"1) Most of the time, when “am” is followed by another consonant or ends the word, the vowel becomes the nasal sound /ɑ̃/: lower your jaw as for the ‘a’ in “father,” let the sound resonate in your nose, and do NOT close the lips for an ‘m.’ 2) When “am” is followed by a vowel (amour) or doubled (amm), the nasal effect disappears—you simply say an open ‘a’ plus an audible ‘m,’ much like English “am.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Sparkling wine used for celebrations"},{"target":"camping","native":"camping","position":"Beginning","cultural_context":"Same word in English for staying in tents"},{"target":"amour","native":"amour","position":"Beginning","cultural_context":"Seen in phrases like “mon amour” in movies and songs"},{"target":"Madame","native":"Madame","position":"End","cultural_context":"Polite French title for a woman, often encountered in travel or literature"}]}]
["en",{"thoughts":"English speakers see “en” in loan-words like “encore” or “ennui”, so they’ve met the spelling, but the French sound is a nasal vowel that doesn’t really exist in English. You let the air flow out through both mouth and nose while your tongue and jaw form something between the English “ah” in ‘father’ and “aw” in ‘law’. It never finishes with an audible N unless another vowel follows.","pattern":"en","position":"Anywhere","description":"Most of the time “en” is the nasal vowel /ɑ̃/: open your mouth as for the ‘ah’ in “father,” round very slightly like the start of “on,” and let some air escape through your nose—no separate N sound. If another vowel follows (e.g. “en a-”, “en o-”) or if the spelling ends in –enne/–enner, it is pronounced /ɛn/ (like the “en” in English “tenant”).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"encore","native":"encore","position":"Beginning","cultural_context":"Used in English at concerts to ask for one more song"},{"target":"ennui","native":"ennui","position":"Beginning","cultural_context":"Borrowed English word meaning boredom"},{"target":"Renaissance","native":"Renaissance","position":"Middle","cultural_context":"Historical period and art style everyone studies at school"}]}]
["em",{"thoughts":"“em” is deceptive for English speakers: most of the time it marks a nasal vowel /ɑ̃/, but when doubled (emm) or followed by another vowel the sound is not nasal and the m is pronounced. Choosing examples the learner already sees in English—empire, femme fatale, crème brûlée—shows the two main outcomes.","pattern":"em","position":"Anywhere","description":"In French, “em” has two main values:\n1) Nasal /ɑ̃/ – If “em” comes before another consonant (except m or n), the e is pronounced as the nasal vowel /ɑ̃/ (similar to saying “ah” while letting air out of your nose) and the m itself is silent.\n2) Regular /ɛm/ or /am/ – If “em” is followed by another m or by a vowel/ending, there is NO nasalization; you just pronounce the e as open “eh” (/ɛ/) or “ah” (/a/) and keep the /m/ consonant, e.g. “femme” /fam/ or “crème” /kʁɛm/.\nTip: For the nasal version, lower your soft palate (like when humming) and avoid closing your lips for an /m/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"empire","native":"empire","position":"Beginning","cultural_context":"Same word in English—large kingdom or business power"},{"target":"femme fatale","native":"femme fatale","position":"Middle","cultural_context":"Common phrase in movies and novels for a seductive, dangerous woman"},{"target":"crème brûlée","native":"crème brûlée","position":"End","cultural_context":"Well-known French custard dessert on many restaurant menus"}]}]
["in",{"thoughts":"“in” is usually a nasal vowel [ɛ̃] (similar to saying “eh” while air also comes out through your nose).  When a vowel or another “n” follows, it is NOT nasal and just sounds like an English “ee” + “n.”","pattern":"in","position":"Anywhere","description":"Most of the time “in” is one single nasal vowel: start with the English “eh” in “bet,” open the mouth a bit wider, drop the jaw slightly, and let the sound resonate through the nose while the tongue stays low and front.  Do not finish with an audible ‘n.’  If another vowel follows (Pinot, inouï), pronounce an ordinary “ee” sound followed by an ‘n.’","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"vin","native":"vin","position":"End","cultural_context":"Means wine; heard in phrases like “vin rouge” (red wine)"},{"target":"Tintin","native":"Tintin","position":"Multiple","cultural_context":"Well-known comic-book hero; movies and books use the original French name"},{"target":"Pinot","native":"Pinot","position":"Middle","cultural_context":"Grape/wine type familiar from labels like “Pinot Noir,” showing the non-nasal use before a vowel"}]}]
["im",{"thoughts":"English speakers already know the letters i and m, but in French “im” sometimes signals the nasal vowel [ɛ̃] (similar to the French “in”). That nasal quality does not exist in English, so learners must remember to drop the final m sound and let the vowel resonate through the nose. When “im” is followed by a vowel (or written “imm-”), it is just the regular oral combination [im], like the English word “team” without the ending t.","pattern":"im","position":"Anywhere","description":"Two possibilities: \n1) Before another consonant (except another m) or word-final, “im” spells the nasal vowel [ɛ̃] — roughly like saying the English vowel in “bed” while letting air pass through the nose and with no audible m.\n2) Before a vowel or when doubled (imm), it is pronounced normally as [im] — the high front vowel of “machine” plus an audible m.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"impossible","native":"impossible","position":"Beginning","cultural_context":"Same word as English “impossible”"},{"target":"important","native":"important","position":"Beginning","cultural_context":"Same word as English “important”"},{"target":"image","native":"image","position":"Beginning","cultural_context":"Looks like English “image,” common tech term"},{"target":"simple","native":"simple","position":"Middle","cultural_context":"Spelled like English “simple,” meaning easy"}]}]
["ain",{"thoughts":"“ain” is a very common French letter-group.  Most of the time it is pronounced as the nasal vowel /ɛ̃/ (roughly like the English word “eh” said while letting air leak out of your nose and without finishing the ‘n’).  Whenever a vowel follows the n, however, the sound loses its nasal quality and is pronounced /ɛn/, close to the English word “hen” without the initial h.","pattern":"ain","position":"Anywhere","description":"Usually pronounced the French nasal vowel /ɛ̃/: start with the English “eh” (as in “bet”) but lower the jaw slightly and let the sound resonate through your nose—do NOT finish with an n sound.  If a vowel comes right after the n (as in “capitaine”), the nasalisation disappears and you say /ɛn/, similar to the English “en” in “end.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pain au chocolat","native":"pain au chocolat","position":"End","cultural_context":"Famous French pastry often seen in cafés and cooking shows"},{"target":"Saint Laurent","native":"Saint Laurent","position":"Middle","cultural_context":"Luxury fashion brand (YSL) and common French place name starting with “Saint”"},{"target":"capitaine (as in “Capitaine Nemo”)","native":"capitaine","position":"Middle","cultural_context":"Title of the well-known character Captain Nemo from Jules Verne’s novels"}]}]
["aim",{"thoughts":"“aim” is tricky because English has no single spelling that flips between a nasal vowel and a plain vowel-plus-m like French does. Learners need to know the two contexts: nasal before a consonant or word-final, and oral + m before a vowel.","pattern":"aim","position":"Anywhere","description":"1) When “aim” is followed by a consonant or sits at the end of the word, the letters fuse into the nasal vowel [ɛ̃] – a sound a bit like the “eh” in “men” while letting air escape through the nose and *not* pronouncing an /m/.\n2) When “aim” is followed by another vowel (e.g., aimer), the vowel is the clear French “é” /e/ (close to the first half of English “day”) and the /m/ is pronounced normally.\nThink “eh̃” vs. “ay-m.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Aimée","native":"Aimée","position":"Beginning","cultural_context":"Given name you see in English-speaking movies and books"},{"target":"faim","native":"faim","position":"End","cultural_context":"Phrasebook staple: “J’ai faim” (“I’m hungry”) in beginner French courses"},{"target":"Aimé Leon Dore","native":"Aimé Leon Dore","position":"Beginning","cultural_context":"Popular New-York based fashion brand frequently mentioned in style blogs"}]}]
["ein",{"thoughts":"“ein” is one of several letter-groups (in, ain, ein, yn, etc.) that write the French nasal vowel /ɛ̃/.  English has no identical vowel, but learners have heard it in common words like “vin” or “pain au chocolat”.  It is made by starting with an “eh” sound while letting air also flow through the nose, then cutting the vowel short without releasing an ‘n’.  Because the sound is nasal, the tongue never fully touches the roof as it would for an English n.","pattern":"ein","position":"Anywhere","description":"Pronounce /ɛ̃/: begin with the open “eh” of “bet,” lower the jaw slightly, lower the soft palate so air escapes through the nose, and stop the sound before adding any audible ‘n’.  Do NOT pronounce a final ‘n’.  Think of the vowel in the French word “vin,” but a little more open.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"plein (as in “en plein air”)","native":"plein","position":"End","cultural_context":"Art term in English meaning painting outdoors; seen in museums and art books"},{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"Champagne-producing French city often mentioned on wine labels"},{"target":"feint","native":"feint","position":"Middle","cultural_context":"English boxing/fencing word borrowed from French; spelling unchanged"}]}]
["eim",{"thoughts":"“eim” is an uncommon but useful spelling of the French nasal vowel /ɛ̃/ (same sound as “ein” or “ain”). English speakers may have seen it in the city name Reims, printed on Champagne bottles. The sound itself is not hard to place in the mouth (it starts like the English “eh” in “bet”) but adding nasal resonance while stopping the lips from closing on an ‘m’ is new for many learners.","pattern":"eim","position":"Anywhere","description":"Pronounced as the single nasal vowel /ɛ̃/: start with an open “eh” (like the e in “bed”), then let some air escape through the nose while keeping the mouth shape. Do NOT pronounce a separate ‘m’. Similar to saying English “ehn” without touching the tongue to the roof of the mouth at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"Famous French city listed on Champagne labels and WWI history"}]}]
["on",{"thoughts":"“on” nearly always marks the nasal vowel /ɔ̃/. English speakers have heard it in phrases like “bon appétit,” but English has no true nasal vowels, so the tongue/jaw position is easy but the nasal airflow is new.","pattern":"on","position":"Anywhere","description":"Pronounce it as the French nasal vowel /ɔ̃/: start as if saying the English \"aw\" in \"law,\" then let the sound resonate through your nose while keeping lips slightly rounded; the final “n” is not pronounced. If another vowel follows (e.g., liaison) it may sound like regular “on” (/ɔn/), but the common case is the nasal vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Famous French greeting meaning “hello”"},{"target":"bon appétit","native":"bon appétit","position":"End","cultural_context":"Common phrase said before eating"},{"target":"Montréal","native":"Montréal","position":"Beginning","cultural_context":"Major Canadian city known for festivals and hockey"},{"target":"Louis Vuitton","native":"Louis Vuitton","position":"End","cultural_context":"Luxury fashion brand seen in stores and advertisements"}]}]
["om",{"thoughts":"“om” is one of French’s nasal-vowel spellings. Most of the time it gives the nasal /ɔ̃/ (roughly the vowel in English “song” said without the final ng), but if another m follows (-omme) or if a vowel follows (-oma-, ‑omi-, etc.) the vowel stays oral and you pronounce an ordinary open “aw/oh” sound plus m (/ɔm/). English has no exact nasal vowel, so learners must avoid letting any audible n or m escape the nose.","pattern":"om","position":"Anywhere","description":"Usually pronounced as the nasal vowel /ɔ̃/: open “aw” + nasal airflow, no actual m sound. If another m follows (comme) or the next letter is a vowel (domino), pronounce a normal open “aw/oh” plus an audible m (/ɔm/).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"nom","native":"name","position":"End","cultural_context":"Known from the phrase “nom de plume” meaning pen name"},{"target":"ombré","native":"shaded/ombré","position":"Beginning","cultural_context":"Fashion & hair-coloring style called “ombré”"},{"target":"domino","native":"domino","position":"Middle","cultural_context":"Same word in English for the game piece"}]}]
["un",{"thoughts":"English has no exact match for the French nasal vowel spelled “un,” so learners must create a brand-new mouth posture. Some may have heard it when people count “un, deux, trois.”","pattern":"un","position":"Anywhere","description":"In most French words the letters “un” fuse into a single nasal vowel /œ̃/: start with the English “uh” in “sun,” round your lips slightly, then let sound resonate in your nose while the tongue stays mid-high and central. You do NOT finish with an audible N. If another vowel follows (e.g., “une”) or if the N is doubled (“unn”), the N is pronounced and the vowel is no longer nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"un","native":"one","position":"Beginning","cultural_context":"People often learn “un, deux, trois” as the French numbers"},{"target":"lundi","native":"Monday","position":"Beginning","cultural_context":"Common weekday name in beginner French lessons and calendars"},{"target":"Crunch","native":"Crunch (Nestlé chocolate bar)","position":"Middle","cultural_context":"International candy bar sold in many English-speaking countries; French ads pronounce the nasal “un”"}]}]
["um",{"thoughts":"French “um” is tricky because sometimes it represents a nasal vowel (like the sound in “un”) and the final m disappears, while in many Latin-looking words (forum, album) the m is fully pronounced and the vowel is not nasal. English has no nasal vowels, so the first variant feels new; the second variant sounds pretty close to the way an English speaker already says “forum.”","pattern":"um","position":"Anywhere","description":"Two main pronunciations:\n1) Nasal /œ̃/ – lips relaxed, tongue forward, let air escape through nose, no audible “m.” Closest English approximation is saying “uh” while humming through the nose. Seen in native French words like “parfum,” “humble.”\n2) Non-nasal vowel + clear /m/ – much like English “um.” Common in international/Latin words (forum, album, maximum).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"parfum","native":"parfum","position":"End","cultural_context":"Word on perfume bottles and in fragrance ads"},{"target":"humble","native":"humble","position":"Beginning","cultural_context":"Same spelling as English adjective; used in phrases like “être humble”"},{"target":"forum","native":"forum","position":"End","cultural_context":"Exact same word in English for an online discussion board or public meeting"}]}]
["yn",{"thoughts":"English speakers meet “yn” mostly in Greek-origin words like “synagogue” or “syndrome.” When the n is followed by another consonant or is word-final, the pair spells the nasal vowel /ɛ̃/, the same sound as French “in.” When the n is followed by a vowel, there is NO nasalization: you just say an English-style “ee” /i/ followed by an n. The nasal version is unfamiliar because English has no nasal vowels.","pattern":"yn","position":"Anywhere","description":"Two cases:\n1. y + n + consonant or word-end → nasal vowel /ɛ̃/ (like saying “eh” while letting air escape through the nose; think of the vowel in French “vin”). The n itself is silent.\n2. y + n + vowel → /i/ + /n/ (just pronounce “een”).\nTip: For /ɛ̃/, lower your soft palate and try to hum through your nose while saying a short “eh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"syndrome","native":"syndrome","position":"Beginning","cultural_context":"Medical term heard in news or TV shows"},{"target":"lynx","native":"lynx","position":"Middle","cultural_context":"Wild cat species; also a hockey team name"},{"target":"synagogue","native":"synagogue","position":"Beginning","cultural_context":"Place of Jewish worship, common English word"}]}]
["ym",{"thoughts":"French “ym” is really the same spelling trick as “im” or “in”: most of the time it signals the nasal vowel /ɛ̃/ (like the “an” in the English word “bank”, but starting with a short e), and the written m is silent. However, when the m is at the very end of the word (or followed by another vowel), the m is actually pronounced, giving a normal “eem” sound /im/.","pattern":"ym","position":"Anywhere","description":"1) Before another consonant: nasal vowel /ɛ̃/ – mouth partly open as for short English “eh”, but let the air resonate in your nose; lips don’t close because the written m is silent. 2) At the end of a word or before a vowel: the y stays /i/ and the m is pronounced /m/, so you get /im/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"sympa","native":"sympa","position":"Beginning","cultural_context":"Casual French word meaning “nice/cool”, often heard in beginners’ courses or movies"},{"target":"Olympique","native":"Olympique","position":"Middle","cultural_context":"Name of famous French soccer teams like “Olympique de Marseille”"},{"target":"gym","native":"gym","position":"End","cultural_context":"Same word as English “gym”, used in French for physical education class"}]}]
["oin",{"thoughts":"French “oin” is a nasal diphthong that English speakers don’t really have. They usually replace it with “wahn” or “woyn,” but the real sound is a quick “w” + nasalised “eh” with no final N pronounced.","pattern":"oin","position":"Anywhere","description":"Pronounced [wɛ̃] – start with an English “w” glide, then move into a short “eh” (as in “set”) while letting the air resonate through the nose. Don’t finish with an N sound; the N is only there to signal nasalisation.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Antoine","native":"Antoine","position":"Middle","cultural_context":"Well-known French given name (e.g., author Antoine de Saint-Exupéry)‏"},{"target":"Des Moines","native":"Des Moines","position":"End","cultural_context":"Capital city of Iowa; name seen in U.S. news and geography"},{"target":"poinsettia","native":"poinsettia","position":"Beginning","cultural_context":"Common Christmas plant sold in stores during the holidays"}]}]
["oin",{"thoughts":"“oin” is one of French’s nasal spellings.  English speakers already know the written string (coin, loin) but have almost never produced the French nasalized version, so they may read it the English way until it’s pointed out.","pattern":"oin","position":"End","description":"Pronounced /wɛ̃/: start with a quick English “w,” slide into the vowel of “men,” then let the sound resonate in the nose instead of finishing with an audible N.  The tongue never fully touches the roof the way it would for an English n.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"coin","native":"corner","position":"End","cultural_context":"Spelled just like the English word for money—easy to remember"},{"target":"loin","native":"far","position":"End","cultural_context":"Looks like the English meat cut \"loin\"; shows up in the travel phrase \"loin de…\" (far from…)"},{"target":"moins","native":"less","position":"End","cultural_context":"Common in the math phrase \"plus ou moins\" ('plus or minus') heard in class or movies"}]}]
["ent",{"thoughts":"Final –e–n–t at the end of French words can be puzzling because it is either completely silent (common on verb forms) or sounds like the nasal vowel “an/ah” with no final t. English has no silent ending that changes from word to word, and it has no true nasal vowels, so learners must both remember when nothing is pronounced and master the nasal version.","pattern":"ent","position":"End","description":"At the very end of a word, “ent” is usually: 1) totally silent in most 3rd-person-plural verb forms (ils parlent → /paʁl/). 2) pronounced as the nasal vowel /ɑ̃/ (roughly “ah” while letting air leak through the nose, no final ‘t’) in many nouns/adjectives (comment → /kɔ.mɑ̃/). The letter ‘t’ is only heard when a liaison forces it before a following vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"comment","native":"how","position":"End","cultural_context":"Phrase “comment ça va?” is taught in first French lessons and appears in pop culture"},{"target":"client","native":"client","position":"End","cultural_context":"Same word exists in English; French keeps the nasal ending sound"},{"target":"président","native":"president","position":"End","cultural_context":"Familiar political title, often seen written in French news headings"},{"target":"parlent","native":"(they) speak","position":"End","cultural_context":"Appears in the textbook sentence “Ils parlent français,” common in beginner courses"}]}]
["e",{"thoughts":"Final plain “e” is almost never voiced in modern French.  English speakers must remember that it is usually totally silent, or at most a fleeting, very soft schwa ([ə]) that disappears in normal speech.  Because English almost always pronounces a written vowel, learners tend to add an audible “uh” at the end; the trick is to cut it off or reduce it to nothing.","pattern":"e","position":"End","description":"At the very end of a French word, a single, un-accented “e” is normally silent.  If it surfaces at all, it’s a very quick, muffled schwa, like the last sound in the American English word “comma,” but even shorter.  Never pronounce it like the clear English “ee” or “eh.”  Most of the time you simply stop after the preceding consonant.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"baguette","native":"baguette","position":"End","cultural_context":"Classic French bread sold worldwide"},{"target":"omelette","native":"omelette","position":"End","cultural_context":"Familiar egg dish on many menus"},{"target":"Louvre","native":"Louvre","position":"End","cultural_context":"Famous Paris art museum visited by tourists"}]}]
["es",{"thoughts":"Final ‑S in French is normally silent, so the key question is whether the preceding E is pronounced. In tiny function words like “les / des / mes” it is pronounced /e/ (close to the English long A in “day,” but held pure—no off-glide). In most other words the whole “es” is silent, it just marks a plural; you hear only the consonant right before it (baguette → baguettes /baˈgɛt/). English speakers already know the long A sound and are used to silent final letters, but they must remember not to turn /e/ into a diphthong and not to add a voiced S.","pattern":"es","position":"End","description":"At the end of a word, “es” behaves in two main ways:\n1. In short function words (les, des, mes, ces, ses, tes) it is pronounced /e/ – like the vowel in English “day” but without the y-glide.\n2. In most other words it is completely silent; it simply shows the plural, so you only pronounce the consonant that comes right before it (baguette → baguettes /ba-GET/).\nThe final S itself is always silent.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"les","native":"les","position":"End","cultural_context":"Seen in the title “Les Misérables”; plural article meaning “the”"},{"target":"Des Moines","native":"Des Moines","position":"Beginning","cultural_context":"U.S. state capital whose first word is the French plural “des”"},{"target":"baguettes","native":"baguettes","position":"End","cultural_context":"Plural of the well-known French bread “baguette”"},{"target":"petites","native":"petites","position":"End","cultural_context":"Label on clothing racks for small sizes (‘petites’ section)"}]}]
["s",{"thoughts":"English speakers know the /s/ sound very well. The only challenge is realizing that a written final “s” in French is usually silent, but can sometimes be pronounced /s/ (and turns into /z/ in a liaison). The mouth position is exactly the same as the English unvoiced “s” in “see.” The difficulty is therefore remembering when to say it, not how to say it.","pattern":"s","position":"End","description":"When an “s” is written at the very end of a French word it is MOST OFTEN silent (Paris ➜ ‘pa-REE’). A few short everyday words keep the clear /s/ sound (bus ➜ ‘büss’). If the next word begins with a vowel, the normally silent “s” can link to it and be voiced /z/ (les‿amis ➜ ‘lay-zah-MEE’), but on its own it is silent. So the sound itself is the same soft, hissing /s/ English uses; the trick is knowing whether to pronounce it at all.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Paris","native":"Paris","position":"End","cultural_context":"Famous capital city of France"},{"target":"bus","native":"bus","position":"End","cultural_context":"Same word in English for city transport vehicle"},{"target":"plus","native":"plus","position":"End","cultural_context":"Seen in phrases like “plus ça change” or brand names like “Disney Plus”"}]}]
["x",{"thoughts":"English speakers expect final “x” to sound like /ks/ (as in “box”). In French, that never happens: most of the time the final x is completely silent, and in a handful of short number-words (six, dix) it is pronounced like a soft /s/. During liaison before a following vowel, the sound can become /z/, but that is an advanced point.","pattern":"x","position":"End","description":"At the very end of a French word, the letter “x” is usually silent (Bordeaux ➜ “bor-DOH”). In a few short words—mainly numbers such as six, dix—it is pronounced like the English /s/ (“seece”). If the next word begins with a vowel and a liaison is required, that /s/ may blend into a /z/ sound, but when the word stands alone you will only hear silence or /s/, never the English /ks/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Famous French wine and city; wine lists often use this name"},{"target":"faux","native":"faux","position":"End","cultural_context":"Common English fashion term meaning ‘fake’, e.g., ‘faux fur’"},{"target":"six","native":"six","position":"End","cultural_context":"The number 6; looks the same in English but is pronounced differently in French"}]}]
["t",{"thoughts":"English speakers know the /t/ sound well, but French spelling rules often make the final written “t” silent, which can confuse them. The main hurdle is remembering when to drop the sound and when to keep it (usually pronounced in a consonant cluster like –st or in many imported/technical terms, but silent after a lone vowel).","pattern":"t","position":"End","description":"When the letter “t” is the very last letter of a French word, it is usually NOT pronounced (ballet → “bal-lay”). However, if that “t” is part of a consonant cluster such as –st or appears in many newer technical/foreign words, it is pronounced as a clear, unaspirated /t/—lighter than the puffier English final /t/. Think of placing the tongue on the ridge behind your teeth and releasing without a burst of air.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ballet","native":"ballet","position":"End","cultural_context":"Classical dance term used in English"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Popular flaky French pastry"},{"target":"internet","native":"internet","position":"End","cultural_context":"Global computer network, same word in English"}]}]
["d",{"thoughts":"English speakers know the printed letter “d,” but French treats a final d very differently: it’s usually silent, sometimes turns into a /t/ with liaison, and only occasionally keeps the voiced /d/. Learners must remember “don’t say the d” unless a special case applies.","pattern":"d","position":"End","description":"At the end of a French word, the letter d is almost always silent: the word ends abruptly with the preceding vowel or consonant (grahn, not grand). If the next word begins with a vowel and liaison is required, the silent d re-surfaces but as an unvoiced /t/ (grand hôtel ➜ grahn-to-tel). A handful of short words and proper names keep the voiced /d/ you know from English (sud, David). Think of letting the tongue touch just once and cutting the sound off quickly; do NOT add a following vowel like “duh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"grand","native":"grand","position":"End","cultural_context":"Familiar from the term “Grand Prix” for Formula One races"},{"target":"Grand Hôtel","native":"Grand Hôtel","position":"End","cultural_context":"Common hotel name; referenced in films like “The Grand Budapest Hotel” (liaison makes the d sound like /t/) "},{"target":"David","native":"David","position":"End","cultural_context":"Well-known biblical first name that keeps the final /d/ in French"}]}]
["p",{"thoughts":"English speakers know the /p/ sound, but in French a final written “p” is often completely silent. When it is pronounced, the sound itself is the same unaspirated /p/ that occurs after an “s” in English words like “spin” (little to no puff of air). The main challenge is deciding when to pronounce it at all.","pattern":"p","position":"End","description":"At the end of a word, written “p” is USUALLY silent in French (e.g. coup ➜ /ku/). When it is pronounced (mostly in recent English loan-words like stop, pop, etc.) it is a short, crisp, barely-aspirated /p/, produced with less burst of air than English “p” at the start of a word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"coup","native":"coup","position":"End","cultural_context":"Heard in the English phrase “coup d’état” meaning a sudden overthrow"},{"target":"stop","native":"stop","position":"End","cultural_context":"Same word on French road signs; borrowed directly from English"}]}]
["g",{"thoughts":"English speakers know the hard /g/ sound, but they don’t expect the letter to become silent. In French, a final “g” is usually not pronounced; it just affects the preceding vowel (often making it nasal). A few modern or borrowed words keep the audible hard /g/. The main challenge is remembering to drop the sound in most cases.","pattern":"g","position":"End","description":"At the very end of a French word, “g” is usually silent. The vowel right before it is pronounced normally or nasalized (e.g., on → ɔ̃). In a handful of short, often borrowed words (zigzag, drag, etc.) the final “g” is pronounced like the hard “g” in English “go.” There is no soft /ʒ/ option at word-end in modern standard French.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"long","native":"long","position":"End","cultural_context":"Looks exactly like the English word “long,” meaning the same thing"},{"target":"ping-pong","native":"ping-pong","position":"Multiple","cultural_context":"The table-tennis game name is the same in English"},{"target":"zigzag","native":"zigzag","position":"Multiple","cultural_context":"Same spelling in English; refers to a back-and-forth line"}]}]
["z",{"thoughts":"Final ‑z in French is sometimes pronounced like English “z” but is often completely silent, which can surprise learners.","pattern":"z","position":"End","description":"At the end of a French word, the letter z can do two things:\n1. Most commonly it is silent – the word ends on the preceding vowel (e.g., chez is just /ʃe/).\n2. In certain short or borrowed words it is pronounced /z/, the same buzzy sound as the English z in “zoo” (e.g., gaz /ɡaz/).\nThere is no spelling clue that tells you which will happen, so you memorize word by word.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"chez","native":"chez","position":"End","cultural_context":"Seen in restaurant names like “Chez Pierre,” meaning “at the home of”"},{"target":"gaz","native":"gaz","position":"End","cultural_context":"Looks like English “gas”; found on French gas-station signs"},{"target":"nez","native":"nez","position":"End","cultural_context":"Used in perfume ads: “le nez” (the nose, scent expert)"}]}]
["ps",{"thoughts":"English already has the cluster “ps-” in Greek-based words (psychology, psoriasis), but we silence the p.  French usually pronounces both consonants, so learners must remember to let a little /p/ puff out before the /s/.  A handful of old biblical words (psaume, psautier) drop the p, so both possibilities exist.","pattern":"ps","position":"Beginning","description":"At the very start of most modern French words, pronounce a quick /p/ immediately followed by /s/ – almost like saying the end of “hoops” without the vowel.  Keep it light and don’t add a vowel between the two consonants.  In a few older religious terms the p is silent and you just say /s/ (like English “psychology”).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psycho","native":"psycho (slang for psychologist/crazy person)","position":"Beginning","cultural_context":"Same pop-culture word as in English, e.g., Hitchcock’s movie"},{"target":"pseudonyme","native":"pseudonym","position":"Beginning","cultural_context":"Looks like English “pseudonym,” a pen name for writers"},{"target":"psoriasis","native":"psoriasis","position":"Beginning","cultural_context":"Well-known skin condition mentioned in medical ads"},{"target":"psaume","native":"psalm","position":"Beginning","cultural_context":"Biblical word; shows the rare silent-p pronunciation"}]}]
["pt",{"thoughts":"Initial “pt” exists in only a handful of learned or scientific English words and the English habit is to drop the p (pterodactyl → “ter-”). French, however, pronounces BOTH consonants: a quick /p/ immediately followed by /t/, no vowel in between. This back-to-back stop cluster is physically unfamiliar to most English speakers and can feel awkward.","pattern":"pt","position":"Beginning","description":"Release a short, soft /p/ and slide straight into a crisp /t/ without inserting a vowel (almost like starting to say “pat” but cutting the vowel). Keep lips closed for the /p/, open just enough for the burst, then let the tongue tip touch the ridge for the /t/ right away.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"ptérodactyle","native":"pterodactyl","position":"Beginning","cultural_context":"Well-known flying dinosaur seen in movies and museums"},{"target":"Ptolémée","native":"Ptolemy","position":"Beginning","cultural_context":"Famous ancient Greek astronomer mentioned in history and astronomy books"},{"target":"ptéranodon","native":"pteranodon","position":"Beginning","cultural_context":"Another prehistoric flying reptile popular in dinosaur media"}]}]
["gn",{"thoughts":"French ‘gn’ at the very start of a word always represents the single palatal-nasal sound /ɲ/ (same consonant you hear in Spanish “ñ”), which English doesn’t use at word-initial position. English speakers do meet /nj/ in the middle of words like “onion,” so the tongue movement is familiar, but starting a word with it feels unusual.","pattern":"gn","position":"Beginning","description":"Pronounce it as one smooth sound that blends an ‘n’ with a quick ‘y’: place the front of your tongue against the ridge just behind your upper teeth (like for an English ‘n’) while at the same time raising the middle of the tongue toward the hard palate, letting air pass through the nose. Think of the ‘ny’ in “canyon,” but put it right at the start of the word, with no separate ‘g’ sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gnocchi","native":"gnocchi","position":"Beginning","cultural_context":"Popular Italian potato pasta listed on many restaurant menus"},{"target":"gnome","native":"gnome","position":"Beginning","cultural_context":"Garden statue or fantasy creature common in English"}]}]
