["a",{"thoughts":"Plain letter “a” in French is almost always the same open vowel, so English speakers just have to remember to keep it short and pure. The sound occurs anywhere in a word and is found in many loan-words they already know.","pattern":"a","position":"Anywhere","description":"A short, open “ah” sound, similar to the first vowel in English “father,” but kept shorter and without the glide some Americans add. Mouth opens wide, tongue low and front-central.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Classic French bread sold worldwide"},{"target":"macaron","native":"macaron","position":"Multiple","cultural_context":"Trendy colorful French cookie often seen in cafés"},{"target":"Paris","native":"Paris","position":"Middle","cultural_context":"Capital city everyone hears about in travel and movies"},{"target":"champagne","native":"champagne","position":"Multiple","cultural_context":"Famous sparkling wine used for celebrations"}]}]
["b",{"thoughts":"French “b” is basically the same voiced bilabial stop as English “b” (as in “bat”). The only twist is that a final -b can be silent in a handful of old-fashioned words such as “plomb.” Otherwise you just release your lips and let the vocal cords vibrate, exactly like English.","pattern":"b","position":"Anywhere","description":"Usually pronounced just like the English “b” in “boy.” Lips come together, vocal cords vibrate, then the lips release. A final written -b is sometimes silent in a few set words (e.g., plomb /plɔ̃/), but this is rare.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"Beginning","cultural_context":"The iconic long French loaf of bread"},{"target":"cabernet","native":"cabernet","position":"Middle","cultural_context":"Cabernet Sauvignon wine grape—name seen on wine labels"},{"target":"club","native":"club","position":"End","cultural_context":"Same word in English for a sports or night club; used in French too"},{"target":"sans plomb","native":"sans plomb","position":"End","cultural_context":"Phrase on French gas pumps meaning “unleaded”; travelers often see it"}]}]
["c",{"thoughts":"French “c” is not a new sound for English speakers—it is either the hard “k” or the soft “s” they already know. The only thing to learn is the spelling rule that triggers each value.","pattern":"c","position":"Anywhere","description":"The letter c in French has two main pronunciations: (1) a hard k sound, like English “kite,” when it appears before a, o, u, or another consonant; (2) a soft s sound, like English “snake,” when it appears before e, i, or y. Unlike English, French never uses c for the “ch” sound by itself (that requires ch or ç).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Beginning","cultural_context":"Famous buttery French pastry sold in many cafés"},{"target":"macaron","native":"macaron","position":"Middle","cultural_context":"Colorful French almond cookie found in bakeries"},{"target":"France","native":"France","position":"End","cultural_context":"Name of the country itself"},{"target":"cinéma","native":"cinéma","position":"Beginning","cultural_context":"Same word as English “cinema,” meaning movies"}]}]
["d",{"thoughts":"The French letter “d” is almost the same stop consonant English speakers already use, but it’s made with the tongue a little farther forward (against the upper teeth) and without the tiny puff of air English often adds. Final “d” is normally silent unless there’s liaison. Overall, very familiar and easy for English speakers.","pattern":"d","position":"Anywhere","description":"Dental, unaspirated /d/. Tip of the tongue touches the upper teeth (not the ridge), then releases without a burst of air. At the end of a word it is usually silent, unless followed by a vowel in liaison (e.g., “grand hôtel”).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"déjà vu","native":"déjà vu","position":"Beginning","cultural_context":"Common expression in English for the feeling of ‘already seen’"},{"target":"Bordeaux","native":"Bordeaux","position":"Middle","cultural_context":"Well-known French wine region and its wines"},{"target":"grand prix","native":"grand prix","position":"End","cultural_context":"Term for major motor-racing events, widely used in English"}]}]
["e",{"thoughts":"French “e” covers three main sounds: closed [e] (similar to the vowel in English “day” but shorter, no glide), open [ɛ] (like the vowel in “bet”), and the neutral schwa [ə] (a very quick, relaxed “uh” that can disappear). English already has comparable vowels, but knowing which one to use—and when the schwa drops—takes practice.","pattern":"e","position":"Anywhere","description":"Depending on spelling and stress, plain “e” in French can be:\n• Closed [e] – short, tense “ay” as in English “day” (but don’t add a final y-glide). Often written é, or in final ‑er endings.\n• Open [ɛ] – like the “e” in “bet.” Common before double consonants or in words like “merci.”\n• Schwa [ə] – a quick, relaxed “uh,” often in small words like “le” or the second syllable of “parle.” In casual speech it may disappear entirely.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"café","native":"café","position":"End","cultural_context":"Common word for a coffee or coffee shop; appears on menus"},{"target":"merci","native":"merci","position":"Beginning","cultural_context":"Basic French word for “thank you,” used by many English speakers when traveling"},{"target":"le","native":"le","position":"End","cultural_context":"Definite article in French; seen in phrases like “le weekend”"}]}]
["f",{"thoughts":"The French letter “f” is pronounced exactly like the English “f.” English speakers already meet it in everyday loan-words such as “café” and “chef,” so there is no new mouth position to learn. The only quick reminder: in French, the letter is almost always pronounced, even at the end of a word (unlike many other French consonants).","pattern":"f","position":"Anywhere","description":"Same sound as the English “f” in “fun”: voiceless, made by letting air pass between the upper teeth and lower lip. Keep the airflow steady; do not add vocal-cord vibration.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"fromage","native":"cheese","position":"Beginning","cultural_context":"Classic French food word, often seen on menus and in “fromage plate.”"},{"target":"café","native":"coffee / coffee shop","position":"Middle","cultural_context":"Common international term for a coffee shop; appears on storefronts everywhere."},{"target":"chef","native":"chef","position":"End","cultural_context":"Same word in English—head cook in a kitchen."}]}]
["g",{"thoughts":"French “g” has two pronunciations an English speaker must notice: the hard [g] (as in English “go”) and the soft [ʒ] (as in the s-sound of “measure”). The letter’s sound is fixed by the vowel that follows, so learners need to watch the spelling, not guess from English.","pattern":"g","position":"Anywhere","description":"• Hard g: Before a, o, u, or a consonant, it is the same hard ‘g’ you hear at the start of English “go.”\n• Soft g: Before e, i, or y, it becomes the French /ʒ/, like the ‘s’ in English “measure.”\n• The combo “gu-e/i” (baguette, guitare) keeps the hard [g]; the u is silent.\nTip: For the soft /ʒ/, keep the tongue high and slightly forward; don’t let the tip touch the teeth, and make a buzzing airflow, not a stop.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gourmet","native":"gourmet","position":"Beginning","cultural_context":"Fancy food term widely used in English"},{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Classic French bread, common in cafés and cooking shows"},{"target":"genre","native":"genre","position":"Beginning","cultural_context":"Borrowed into English to talk about movie or book categories"}]}]
["h",{"thoughts":"French “h” is almost always silent, so the main issue for English speakers is remembering NOT to breathe out a /h/ sound. That is fairly easy to do, because English already has a few silent-h words (hour, honor). The only extra wrinkle is the linguistic distinction between “h muet” (allows liaison) and “h aspiré” (blocks liaison), but that does not change how you actually pronounce it—both are silent—so it is more a listening/grammar point than a pronunciation one.","pattern":"h","position":"Anywhere","description":"In French, the letter “h” is never pronounced as an audible /h/ like in English “hat.” You simply start the next vowel or consonant without any burst of air. The mouth stays relaxed; no voiceless puff is made. Remember: silent, with or without liaison depending on the word, but always silent for pronunciation.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hôtel","native":"hotel","position":"Beginning","cultural_context":"International word—accommodation; you see it on French building signs"},{"target":"hors d’œuvre","native":"appetizer","position":"Beginning","cultural_context":"Common culinary term used in English menus"},{"target":"haute couture","native":"high fashion","position":"Beginning","cultural_context":"Famous phrase in fashion and style magazines"},{"target":"Tahiti","native":"Tahiti","position":"Middle","cultural_context":"Well-known island in French Polynesia, popular travel destination"}]}]
["i",{"thoughts":"French “i” is almost always the pure vowel [i]—the tight, forward “ee” sound in English “see,” but shorter and without the English-style diphthong glide. When it comes right before another vowel (as in “fiancé”), it usually turns into a quick consonant-like glide [j] (similar to the English ‘y’ in “yes”). Because English already has an “ee” sound and a ‘y’ glide, this letter poses little novelty for most learners.","pattern":"i","position":"Anywhere","description":"Say a short, crisp “ee,” keeping the tongue high and forward, lips spread (no rounding). Avoid letting it slide into two sounds (no “ee-uh”). Before another vowel it becomes a fast ‘y’ sound, as in “fiancé” [fya-].","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Paris","native":"Paris","position":"End","cultural_context":"Capital city of France—famous tourist destination"},{"target":"quiche","native":"quiche","position":"Middle","cultural_context":"Savory egg pie found in cafés and cookbooks"},{"target":"Mardi Gras","native":"Mardi Gras","position":"End","cultural_context":"Well-known carnival festival, especially in New Orleans"},{"target":"fiancé","native":"fiancé","position":"Middle","cultural_context":"Loan-word in English meaning an engaged man"}]}]
["j",{"thoughts":"French “j” is almost always pronounced /ʒ/, the same sound English speakers hear in the middle of “viSION” or “garaGE”.  English has the sound but never spells it with the letter “j”, so learners must break the link between English “j” (/dʒ/) and French “j” (/ʒ/).  The sound carries the voice; don’t add a stop or “d” in front of it.","pattern":"j","position":"Anywhere","description":"Pronounce French “j” as the soft, voiced “zh” sound (/ʒ/), like the middle of English “viSION”.  Lips relaxed, vocal cords vibrating, air flows smoothly—no tongue tip tap as in English “j” (/dʒ/).  It stays the same before any vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Jean","native":"Jean","position":"Beginning","cultural_context":"Common French first name; seen in movies (e.g., Jean-Luc Picard) and fashion names"},{"target":"Jacques","native":"Jacques","position":"Beginning","cultural_context":"Famous from Jacques Cousteau, the ocean explorer"},{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Standard French greeting meaning “hello”, taught in basic phrases"},{"target":"déjà vu","native":"déjà vu","position":"Middle","cultural_context":"Borrowed phrase in English describing the feeling of having already experienced something"}]}]
["k",{"thoughts":"/k/ in French is basically the same unvoiced hard “k” English speakers know, but it’s produced with almost no burst of air (little or no aspiration). Because the mouth movement and tongue placement match English, the sound is very familiar.","pattern":"k","position":"Anywhere","description":"A hard, voiceless “k” sound made at the back of the mouth, like the first sound in English “cat,” but with less puff of air. Keep the back of the tongue against the soft palate, release cleanly, and avoid aspirating strongly.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"kilo","native":"kilo","position":"Beginning","cultural_context":"Short for kilogram; metric weight unit seen on packaging"},{"target":"kayak","native":"kayak","position":"Multiple","cultural_context":"Same word for the small boat used in sports and leisure"},{"target":"parking","native":"parking","position":"Middle","cultural_context":"Borrowed English word used for parking lots in French cities"}]}]
["l",{"thoughts":"French uses only a “clear L” (tongue tip on the ridge just behind the upper teeth, air flows along the sides). English speakers already know this sound at the start of words (\"light\"), but English often makes a dark, velarized L at the ends of syllables (\"feel\"). In French you must keep it light/clear everywhere, including word-finally.","pattern":"l","position":"Anywhere","description":"Always a clear, light L. Touch the tip of your tongue to the alveolar ridge and let the sides of the tongue lower slightly; do NOT pull the back of the tongue up the way many English speakers do in words like “ball.” The sound stays the same at the beginning, middle, or end of French words.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Louvre","native":"Louvre","position":"Beginning","cultural_context":"World-famous Paris art museum"},{"target":"ballet","native":"ballet","position":"Middle","cultural_context":"Loanword for the classical dance form"},{"target":"Chanel","native":"Chanel","position":"End","cultural_context":"Iconic French fashion and perfume brand"}]}]
["m",{"thoughts":"English speakers already use the voiced bilabial nasal [m] every day, so this sound itself is nothing new. The only mild trap in French spelling is that an \"m\" after a vowel can sometimes be silent and simply mark a nasal vowel (e.g., in \"faim\"), but as a consonant it is produced exactly like English \"m.\"","pattern":"m","position":"Anywhere","description":"Pronounced like the English \"m\" in “mother”: close your lips, let the sound resonate through your nose, and keep the vocal cords vibrating. Same mouth position, same voicing. Just remember that when \"m\" follows a vowel and isn’t followed by another vowel, it often makes the vowel nasal and may not be pronounced as a separate consonant.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"merci","native":"thank you","position":"Beginning","cultural_context":"Common French word for “thank you” heard in travel and pop culture"},{"target":"fromage","native":"cheese","position":"Middle","cultural_context":"Famous French food; “quiche au fromage,” “fromage” boards, etc."},{"target":"camembert","native":"Camembert cheese","position":"Multiple","cultural_context":"Well-known soft French cheese sold internationally"},{"target":"film","native":"movie/film","position":"End","cultural_context":"Same word as English for a movie; appears on French cinema posters"}]}]
["n",{"thoughts":"English speakers already know the basic [n] sound; the only new idea is that in French a final or before-consonant “n” usually isn’t pronounced at all – it just nasalises the vowel before it.","pattern":"n","position":"Anywhere","description":"1) As a regular n-sound [n] when it starts a word, sits between two vowels, or is doubled (nn). Your tongue touches the ridge just behind your upper teeth – exactly like the English n in “no”. 2) Silent but nasalises the vowel before it when it comes before another consonant or ends the word: the air comes out of your nose but you do NOT add a separate n-sound. Think of saying the vowel while humming through your nose, then stopping – e.g. “bon” ends on a nasalised “aw̃” rather than “bawn”.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"non","native":"non","position":"Multiple","cultural_context":"Means “no”; often heard in films or basic travel phrases"},{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Famous French greeting – “hello”/“good day”"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Popular flaky breakfast pastry sold worldwide"}]}]
["o",{"thoughts":"English speakers already know the written letter “o,” and the French sound is in the same general mouth-area. The main surprise is that French has two versions: a ‘closed’ pure /o/ (lips rounded, tongue high-mid, no English-style diphthong) and a more ‘open’ /ɔ/ (jaw a bit lower, like the vowel in some accents’ “thought”). No glide is added, and length is shorter than English long O. Learners must resist turning it into the “oh-oo” diphthong.","pattern":"o","position":"Anywhere","description":"French “o” is either:  • closed /o/ – like the first part of English “go” but without the trailing glide; lips rounded, tongue mid-high.  • open /ɔ/ – similar to British English “off/aw,” mouth slightly more open.  Which one you hear depends on spelling patterns and surrounding letters, but both stay pure and short.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"orange","native":"orange","position":"Beginning","cultural_context":"The fruit; same word exists in English"},{"target":"photo","native":"photo","position":"Multiple","cultural_context":"Common loan-word meaning picture"},{"target":"Monaco","native":"Monaco","position":"End","cultural_context":"Famous micro-state on the French Riviera, home of the Grand Prix"}]}]
["p",{"thoughts":"The French letter “p” is the same voiceless bilabial plosive English speakers already know, but in French it is released with little or no puff of air (no strong aspiration). Because the basic mouth position is identical to English, most learners have no trouble—only the reduced burst of air may feel slightly softer than in words like English “peach.”","pattern":"p","position":"Anywhere","description":"Like the English “p” in “spin” rather than the strongly-aspirated “p” in “pin.” Lips come together, build a small pressure, then release cleanly with almost no extra breath.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Paris","native":"Paris","position":"Beginning","cultural_context":"Famous capital city of France"},{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Iconic sparkling wine used for celebrations"},{"target":"crêpe","native":"crêpe","position":"End","cultural_context":"Well-known thin French pancake served sweet or savory"}]}]
["q",{"thoughts":"French “q” is almost always written as the digraph “qu”.  It simply represents the hard K sound /k/, never the English /kw/.  The only trick is to remember that the following “u” is purely spelling—your lips do not round for a W.","pattern":"q","position":"Anywhere","description":"Pronounce “qu” exactly like the K in English “skip”.  Do NOT add a W-glide as in English “queen”.  The written “u” is silent unless it carries its own written accent (rare).  Word-final “que” is also /k/.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Popular French egg-and-cream tart served worldwide"},{"target":"Jacques","native":"Jacques","position":"Middle","cultural_context":"Famous French given name—as in author Jacques Cousteau"},{"target":"boutique","native":"boutique","position":"End","cultural_context":"Loan word in English for a small fashionable shop"},{"target":"Québec","native":"Québec","position":"Beginning","cultural_context":"Canadian province and its capital city, often mentioned in travel and news"}]}]
["r",{"thoughts":"French “r” is written with the same letter English speakers know, so it looks familiar. The sound itself, however, is produced far back in the throat (a voiced uvular fricative), something English never uses. Learners must keep the tip of the tongue down and let the back of the tongue lightly rub against the uvula while voicing—almost like a gentle gargle. Because it is so different from the English alveolar ‘r’, it usually takes sustained practice to master.","pattern":"r","position":"Anywhere","description":"The French “r” is a throaty, voiced uvular fricative /ʁ/. Instead of curling the tongue like in English, keep the tip low, raise the back of the tongue toward the uvula, and let air pass with slight vibration. Think of a soft, voiced version of the throaty sound you make when clearing your throat.","familiarity":"LikelyAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Renault","native":"Renault","position":"Beginning","cultural_context":"Well-known French car brand sold worldwide"},{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Famous buttery pastry found in cafés and bakeries"},{"target":"crème brûlée","native":"crème brûlée","position":"Multiple","cultural_context":"Classic French dessert featured on many restaurant menus"},{"target":"bonjour","native":"bonjour","position":"End","cultural_context":"Common French greeting that many English speakers recognize"}]}]
["s",{"thoughts":"French “s” is rarely a new mouth-shape for English speakers – it is either the familiar unvoiced /s/, its equally familiar voiced cousin /z/, or completely silent at the end of certain words. The challenge is rule-based spelling, not articulation.","pattern":"s","position":"Anywhere","description":"In French a single “s” between vowels becomes the voiced /z/ (like the z in “lazy”). A single “s” at the start of a word, before a consonant, or followed by a consonant stays the unvoiced /s/ (like the s in “sun”). A double “ss” is always the sharp /s/. A final written “s” is often silent unless liaison makes it link to a following vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Popular buttery pastry sold in cafés everywhere"},{"target":"résumé","native":"résumé","position":"Middle","cultural_context":"French loan-word for a CV; used in job applications"},{"target":"Paris","native":"Paris","position":"End","cultural_context":"Capital city frequently mentioned in travel and culture"}]}]
["t",{"thoughts":"English speakers already know the basic /t/ sound, but in French they must remember the lack of aspiration, that many final t’s are silent, and that “ti” before a vowel often sounds like /s/ or /sj/.","pattern":"t","position":"Anywhere","description":"Usually the same crisp /t/ as in English but with almost no puff of air (unaspirated). At the end of words it is often silent unless followed by a mute-e (e.g., tar-te). In “ti + vowel” the t typically softens to an /s/-like sound: na-sion. Learn to release it quickly and close to the teeth.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"tarte","native":"tarte","position":"Multiple","cultural_context":"Well-known French pastry word seen on dessert menus"},{"target":"croissant","native":"croissant","position":"End","cultural_context":"Iconic French breakfast roll sold worldwide; final t is silent"},{"target":"nation","native":"nation","position":"Middle","cultural_context":"Spelled the same as English “nation”; in French the “ti” sounds like /s/"}]}]
["u",{"thoughts":"French “u” is almost always the single vowel /y/ – a sound English doesn’t have. Speakers must round their lips as for “oo” in “food” while keeping the tongue high and forward as for “ee” in “see.” Because English lacks this exact vowel, learners often substitute /u/ or /ɪ/. The letter can appear anywhere in a word and keeps the same quality, even with a circumflex (û). It is NOT the same as the digraph “ou.”","pattern":"u","position":"Anywhere","description":"Pronounce it as a tight-lipped, fronted “oo.” Say English “ee,” freeze the tongue, then round the lips. It is a single, pure vowel, always short and tense.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"menu","native":"menu","position":"End","cultural_context":"Same word on English restaurant menus"},{"target":"brut","native":"brut (dry)","position":"Middle","cultural_context":"Wine & champagne label indicating dryness"},{"target":"bureau","native":"desk / office","position":"Middle","cultural_context":"Loanword seen in names like “Federal Bureau of Investigation”"},{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Well-known French dessert offered in many restaurants"}]}]
["v",{"thoughts":"French v is essentially the same voiced “v” sound English speakers already use (as in “van”). Little to explain beyond reminding learners to keep the lower lip lightly against the upper teeth and make the sound voiced; do not touch the tongue to the teeth like the English “th.”","pattern":"v","position":"Anywhere","description":"Voiced labiodental fricative, just like the English v in “violin.” Press lower lip gently against upper front teeth and make it voiced; no extra puff of air.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Versailles","native":"Versailles","position":"Beginning","cultural_context":"Famous palace and tourist site just outside Paris"},{"target":"Louvre","native":"Louvre","position":"Middle","cultural_context":"World-renowned Paris art museum"},{"target":"déjà vu","native":"déjà vu","position":"Beginning","cultural_context":"Common expression in English for the feeling of having already experienced something"}]}]
["w",{"thoughts":"Letter “w” is uncommon in native French words; it appears mostly in borrowings.  Native speakers treat it in two ways: either like the English /w/ sound, or—especially in older or very Gallicised words—like a /v/.  English learners therefore mainly have to remember which value each borrowed word has.","pattern":"w","position":"Anywhere","description":"Two possible pronunciations: (1) /w/ – just like the English “w” in “we.”  This is heard in recent loan-words and tech terms (web, week-end, kiwi).  Keep the lips rounded and glide quickly into the following vowel.  (2) /v/ – a voiced “v” as in English “van.”  This older, Gallicised value occurs in words such as “wagon” or “watt.”  There’s no reliable spelling rule; you memorise word by word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"week-end","native":"week-end","position":"Beginning","cultural_context":"Common Franglais word for the weekend, seen in ads and French lessons"},{"target":"wagon","native":"wagon","position":"Beginning","cultural_context":"Looks like the English word “wagon”; used for train carriages in French"},{"target":"kiwi","native":"kiwi","position":"Middle","cultural_context":"Same tropical fruit and bird name used worldwide, including in French"}]}]
["x",{"thoughts":"The letter “x” in French is unpredictable: it can be silent, /s/, /ks/, or /gz/ depending on position and word origin. Learners need to memorize common patterns and examples.","pattern":"x","position":"Anywhere","description":"1) Most often between vowels or before a consonant it sounds like English “ks” (as in “books”).\n2) At the very start of a word it is usually /gz/ (a quick “gz” like “eggs” without the first e).\n3) At the end of many common number-words it becomes /s/ (dix, six). \n4) In several small function words it is completely silent but still affects the preceding vowel (deux, faux, yeux).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"deux","native":"two","position":"End","cultural_context":"Basic French number often seen in phrases like “pas de deux” in ballet"},{"target":"dix","native":"ten","position":"End","cultural_context":"Heard in French countdowns or film title “Dix pour cent” (Call My Agent!)"},{"target":"luxe","native":"luxury","position":"Middle","cultural_context":"Used in English marketing (“deluxe,” “luxe hotel”) so the root word is recognizable"},{"target":"Xavier","native":"Xavier","position":"Beginning","cultural_context":"Common first name (e.g., Professor X—Charles Xavier—from X-Men)"}]}]
["y",{"thoughts":"French “y” is almost always read as the pure vowel /i/ (like the “ee” in English “see”), not the English diphthong /aɪ/.  After another vowel it simply begins a second syllable and may be heard as a quick glide /j/ (ma-yo-).  The sound itself is easy; the only trap for English speakers is resisting the urge to say /aɪ/.","pattern":"y","position":"Anywhere","description":"Pronounce the letter “y” as a clean, short “ee” sound /i/.  When it comes right after another vowel you will glide from the first vowel into this /i/ (written “ay”, “oy”, etc.), but do NOT turn it into the English “y” in “my.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"yoga","native":"yoga","position":"Beginning","cultural_context":"The same word used worldwide for the Indian exercise practice"},{"target":"style","native":"style","position":"Middle","cultural_context":"Borrowed fashion word you see in English magazines"},{"target":"mayonnaise","native":"mayonnaise","position":"Middle","cultural_context":"Common sandwich condiment"},{"target":"pyjama","native":"pajamas","position":"Beginning","cultural_context":"French spelling of the familiar sleepwear word"}]}]
["z",{"thoughts":"French “z” is very straightforward for English speakers: the sound is the same voiced hissing found in English “zoo.” The only surprise is that a final written “z” is normally silent—unless liaison wakes it up before a following vowel, when it links just like the English phrase “rose is.”","pattern":"z","position":"Anywhere","description":"Usually the same /z/ you hear in English “zoo.” Keep the tongue close to your upper teeth and let your vocal cords buzz. When the letter is the last letter of a word, it is almost always silent in careful speech, though it re-appears as a linking /z/ when the next word begins with a vowel (liaison).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"zéro","native":"zéro","position":"Beginning","cultural_context":"The number zero; looks and sounds like the English word"},{"target":"magazine","native":"magazine","position":"Middle","cultural_context":"Same spelling as the English word for a periodical"},{"target":"chez","native":"chez","position":"End","cultural_context":"Common in restaurant names (e.g., “Chez Pierre”) meaning “at the house of”"}]}]
["à",{"thoughts":"French “à” is simply the open ‘ah’ sound English speakers already make in words like “spa.” The accent mainly serves spelling/meaning purposes, not a special pronunciation, so the sound itself feels very familiar.","pattern":"à","position":"Anywhere","description":"Pronounce it as a short, open “ah” (IPA /a/), similar to the first half of British English “father,” but shorter and without an /r/. The grave accent does not change the vowel quality; it only marks things like the preposition ‘à’ or distinguishes words in writing.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"à la carte","native":"à la carte","position":"Beginning","cultural_context":"Restaurant menu term meaning each item is priced separately"},{"target":"à la mode","native":"à la mode","position":"Beginning","cultural_context":"Dessert served with ice cream; common phrase in U.S. menus"},{"target":"déjà vu","native":"déjà vu","position":"Middle","cultural_context":"Famous expression for the feeling of having seen something before"},{"target":"voilà","native":"voilà","position":"End","cultural_context":"Interjection meaning “there it is”; often used in English conversation"}]}]
["â",{"thoughts":"English speakers already know the base vowel sound /a/ (as in British “spa”), and that is essentially what â represents. The main novelty is the little ‘roof’ accent (circonflexe), which does NOT change the sound much in modern French—just makes it a slightly longer, tenser version of plain a. So the challenge is minimal: keep the mouth open, tongue low and front-central, don’t turn it into the English diphthong of “cat.”","pattern":"â","position":"Anywhere","description":"â is pronounced like a pure, open “ah” (IPA [a]) similar to the vowel in British English “spa” or the first part of American “father,” but a touch longer/tenser. Do NOT glide toward an ‘ee’ or ‘uh.’","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"pâté","native":"pâté","position":"Middle","cultural_context":"French meat spread; word appears on deli menus"},{"target":"château","native":"château","position":"Middle","cultural_context":"Used in English for French castles and on wine labels"},{"target":"Mâcon","native":"Mâcon","position":"Beginning","cultural_context":"Burgundy wine region often seen on bottle labels"}]}]
["ä",{"thoughts":"The trema on a (ä) is vanishingly rare in French; when it turns up it is almost always in brand names or other proper nouns borrowed from German or Scandinavian languages.  In standard French spelling the trema simply signals that the vowel is pronounced on its own, so for ä you still say the normal open French a (/a/, like the a in English “father”).  Because most encounters with ä happen in foreign names, many French speakers themselves approximate the German-style sound /ɛ/ (like the e in English “bet”).  Either way, an English speaker already knows both of those mouth positions, so the sound itself is not hard—recognising that it is even used in French is the surprising part.","pattern":"ä","position":"Anywhere","description":"In French the letter ä means the vowel a is pronounced separately from any vowel just before it.  The safest French realisation is the regular open a (/a/, as in “father”).  When the word is a borrowed German name, French often leans toward the German pronunciation /ɛ/ (as in English “bet”).  Either way, keep the tongue low and relaxed; do NOT glide into a w or y sound afterward.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Kärcher","native":"Kärcher","position":"Middle","cultural_context":"International brand of pressure-washing machines; logo seen on cleaning equipment"},{"target":"Häagen-Dazs","native":"Häagen-Dazs","position":"Middle","cultural_context":"Well-known premium ice-cream brand found in supermarkets"}]}]
["é",{"thoughts":"French “é” is one of the first accented letters English speakers run into in café, résumé, cliché, etc. The sound is a clean, pure “ay” ([e]) without the off-glide you often hear at the end of the English word “day.” Shorten it slightly and keep lips un-rounded.","pattern":"é","position":"Anywhere","description":"Sounds like the vowel in English “day,” but crisper and shorter, with no y-glide at the end. Tongue is mid-high and forward; think of freezing the first half of the English “ay.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"éclair","native":"éclair","position":"Beginning","cultural_context":"Popular chocolate-topped cream-filled pastry found in bakeries"},{"target":"café","native":"café","position":"End","cultural_context":"Common word for coffee shop; appears on menus everywhere"},{"target":"résumé","native":"résumé","position":"Multiple","cultural_context":"Job application document, spelled this way in English too"},{"target":"cliché","native":"cliché","position":"End","cultural_context":"Same word in English for an overused expression"}]}]
["è",{"thoughts":"The letter “è” is just the open-mid front vowel /ɛ/ – basically the same vowel English speakers use in “bet.”  The accent grave mainly tells you two things: use the pure short ‘eh’ sound (never the long ‘ay’ /e/) and keep the syllable open, no trailing glide.  So for an English speaker the sound itself is familiar; the challenge is only remembering to keep it short and pure every time they see the grave accent.","pattern":"è","position":"Anywhere","description":"Say a quick, relaxed “eh” like the e in English “bet” or “get,” but slightly more rounded lips and with no ending y-glide.  Keep it short and steady: one clear vowel, no diphthong.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Popular French dessert found on many restaurant menus"},{"target":"Frère","native":"Frère","position":"Beginning","cultural_context":"First word of the well-known children’s song “Frère Jacques”"},{"target":"très","native":"très","position":"Middle","cultural_context":"Often heard in phrases like “très chic” in fashion/entertainment media"}]}]
["ê",{"thoughts":"English speakers already have the /ɛ/ vowel (as in “bet”), so the French ê sound usually feels familiar. The main issue is remembering that it is a pure vowel (no trailing ‘y-glide’ like English “day”) and that the circumflex does not change the quality compared with è; it just marks spelling history. Because it shows up anywhere in a word, learners mainly need to watch the written accent and keep the vowel short and open.","pattern":"ê","position":"Anywhere","description":"Pronounce ê as the open \"eh\" sound /ɛ/, like the vowel in English “bet,” but keep it pure and a bit shorter. Do NOT let it slide toward “ay.” Lips stay relaxed, tongue mid-low at the front.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"crêpe","native":"crêpe","position":"Middle","cultural_context":"Thin French pancake commonly sold as street food and on café menus"},{"target":"tête-à-tête","native":"tête-à-tête","position":"Multiple","cultural_context":"Loan phrase in English for a private conversation"},{"target":"forêt","native":"forêt","position":"End","cultural_context":"Means “forest”; appears in dessert names like Black Forest cake (Forêt Noire)"}]}]
["ë",{"thoughts":"ë is rare but shows up in a handful of well-known French words and brand names. The dieresis simply tells you to pronounce the letter e on its own instead of blending it with the vowel before it. English speakers already have the basic /ɛ/ sound (“eh” as in ‘bet’), so the main challenge is remembering to break the syllable.","pattern":"ë","position":"Anywhere","description":"ë is pronounced like a clear, short “eh” sound (IPA [ɛ] – similar to the e in English “bet”). The two dots mean you must start a new syllable: the e is not silent and does not combine with the preceding vowel. Say the preceding vowel, make a tiny break, then say “eh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Noël","native":"Christmas","position":"Middle","cultural_context":"Famous French word for Christmas, seen in carols like “Noël, Noël!”"},{"target":"Citroën","native":"Citroën","position":"Middle","cultural_context":"Well-known French car brand"},{"target":"Chloë","native":"Chloë (female name)","position":"End","cultural_context":"Common first name and French fashion house “Chloé”"}]}]
["î",{"thoughts":"The circumflex over i does not change the vowel quality in modern standard French; it is still the close front vowel /i/—the same sound as the English “ee” in “see.” So learners only have to remember that the little hat is mainly a spelling/history marker, not a cue for a new sound.","pattern":"î","position":"Anywhere","description":"Pronounce î exactly like the English long “ee” sound in “see” or “machine.” Keep the tongue high and forward, lips spread. Don’t try to lengthen or diphthong-ize it as some English dialects do; aim for a pure steady vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Île-de-France","native":"Île-de-France (Paris region)","position":"Beginning","cultural_context":"Seen on maps, tourism ads, or train tickets when visiting Paris"},{"target":"maître d’","native":"maître d’ (head waiter)","position":"Middle","cultural_context":"Common restaurant term borrowed into English"}]}]
["ï",{"thoughts":"English speakers already know the plain French \"i\" sound (like the long “ee” in English \"see\"). The trema (¨) on ï does NOT change that quality; it only tells you to pronounce the ï as its own syllable instead of merging it with the vowel before it. So the sound is familiar; the only new info is the syllable break.","pattern":"ï","position":"Anywhere","description":"ï is the regular French /i/ sound (close to English “ee”), but the two dots signal that it starts a new syllable instead of forming a diphthong with the previous vowel. Think “na-EEV” for « naïve » or “ha-EE-tee” for « Haïti ». Keep the vowels separate and short; don’t blend them.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"naïve","native":"naïve","position":"Middle","cultural_context":"Common English loanword meaning innocent or inexperienced"},{"target":"Haïti","native":"Haïti","position":"Middle","cultural_context":"Country name you hear in news and geography"},{"target":"aïoli","native":"aïoli","position":"Middle","cultural_context":"Garlic mayonnaise often listed on restaurant menus"}]}]
["ô",{"thoughts":"French “ô” is simply the closed, pure /o/ vowel. English speakers often turn an “o” into a diphthong like the start of “oh-w,” so they must remember to keep it short and steady.","pattern":"ô","position":"Anywhere","description":"Pronounce it as a single, rounded \"oh\" sound, similar to the first part of English “oh” but without sliding toward a “w.” Lips are rounded; tongue is mid-high toward the back. It is the same quality you hear in the British pronunciation of “law” but a bit higher and tenser.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hôtel","position":"Middle","cultural_context":"Looks like the English word “hotel,” common travel term"},{"target":"Côte d’Azur","native":"Côte d’Azur","position":"Middle","cultural_context":"Famous French Riviera vacation spot that appears in travel shows and brochures"},{"target":"rôle","native":"rôle","position":"Middle","cultural_context":"French word for an acting “role”; appears in film or theatre contexts"}]}]
["ö",{"thoughts":"The letter ö is extremely rare in modern French; when it does appear, the two dots (tréma) simply tell you to pronounce this particular “o” as a separate syllable, not to blend it with the following vowel. In other words, just say a normal French closed /o/ (similar to the “o” in English “go,” but without the glide) and then move on to the next vowel.","pattern":"ö","position":"Anywhere","description":"Say a pure French “o” (lips rounded, no glide) and then immediately pronounce the next vowel as its own syllable. Do NOT use the German ‘ö’ sound (/ø/)—French ö is still a plain /o/. The tréma only means “pronounce this vowel separately.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"coöperation","native":"coöperation","position":"Middle","cultural_context":"Older or formal spelling of the very familiar word “cooperation”"},{"target":"zoölogie","native":"zoölogie","position":"Middle","cultural_context":"French spelling of “zoology,” a common science term"}]}]
["ù",{"thoughts":"The grave-accented “ù” is very rare in French; it mainly appears in the words “où” (where) and “août” (August). The accent does not change the sound compared with a plain “u” – it still uses the French front-rounded vowel /y/. The accent only distinguishes spelling/meaning from similar words. English has no native /y/ vowel, so the main challenge is shaping the lips as for “oo” while keeping the tongue forward as for “ee.”","pattern":"ù","position":"Anywhere","description":"Pronounce it as the French vowel /y/: round your lips as if saying the English “oo” in “food,” but simultaneously keep the tongue high and forward like the “ee” in “see.” The grave accent does not alter the sound—only the spelling.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"où","native":"where","position":"End","cultural_context":"Appears in the textbook phrase “Où est…?” (‘Where is…?’) often used by beginners and travelers"},{"target":"août","native":"August","position":"Middle","cultural_context":"French name of the month August, seen on bilingual calendars and in holiday dates"}]}]
["û",{"thoughts":"English speakers almost never see a û in their own language, so the character itself is unfamiliar. Pronunciation-wise, however, it is just the regular French /y/ sound (spelled u or û). The circumflex does not change the sound; it usually marks where an old letter (often an s) used to be. /y/ is absent from standard English, so learners must master the “tight-lipped ‘ee’ ” position: say English “ee” in “see” while rounding the lips as if to say “oo.” Because it is the same sound as plain French u, the only real challenge is producing that front-rounded vowel at all.","pattern":"û","position":"Anywhere","description":"û is pronounced exactly like the regular French letter “u”: a front-rounded vowel /y/. To English ears it sits between “ee” in ‘see’ and “oo” in ‘soon’: keep the tongue forward as for ‘ee’ but round the lips as for ‘oo.’ The circumflex (ˆ) does NOT affect the sound; it just signals historical spelling changes.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"crème brûlée","native":"crème brûlée","position":"Middle","cultural_context":"Famous custard dessert you can find on many restaurant menus"},{"target":"Bûche de Noël","native":"Bûche de Noël","position":"Beginning","cultural_context":"Traditional French Yule-log cake often featured in holiday cooking shows"}]}]
["ü",{"thoughts":"French “ü” is extremely rare. It only appears when a diaeresis (tréma) sits on the letter u to show that the u must be pronounced as a separate vowel /y/ instead of being silent inside the digraph “gu.” Native English speech has no exact equivalent of /y/ (a tight, rounded “ee”), so both hearing and producing it can be tricky. Because the spelling is old-fashioned or limited to a few words and proper names, most English speakers have barely encountered it.","pattern":"ü","position":"Anywhere","description":"Pronounce it the same as the regular French u: keep your tongue in the English “ee” position while rounding your lips as for “oo.” The dieresis simply tells you to say the u at all, instead of letting it disappear after g.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"aigüe","native":"aigüe","position":"Middle","cultural_context":"Older spelling of the feminine form of “aigu” (acute); turns up in phrases like “crise aigüe” you might see in news subtitles"},{"target":"ambigüe","native":"ambigüe","position":"Middle","cultural_context":"Looks almost identical to English “ambiguous”; older feminine form used in literature"},{"target":"ciguë","native":"ciguë","position":"End","cultural_context":"The word for hemlock, known from the story of Socrates; sometimes cited in French writing"}]}]
["ÿ",{"thoughts":"The letter ÿ is extremely rare in modern French and only shows up in a handful of proper names (mostly place names connected with Champagne wines). It is simply the letter “y” marked with a tréma to insist that it be pronounced as its own vowel sound, not blended with the vowel before it. The underlying sound is just the regular French /i/ (close to the English “ee” in “see”), so the sound itself is easy; the only thing unusual for an English speaker is seeing the dotted y.","pattern":"ÿ","position":"Anywhere","description":"ÿ = y with a diaeresis.  It tells you to pronounce the y as a separate syllable, usually like a short, pure “ee” sound (/i/), immediately after the preceding vowel.  Think “ah-ee” said quickly for “aÿ.”  It is not the German ü sound and it isn’t blended with the vowel before it.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"Aÿ","native":"Aÿ","position":"End","cultural_context":"Name of a famous Champagne-producing village; appears on some wine and Champagne labels"}]}]
["ç",{"thoughts":"English speakers have seen this squiggly-bottomed c in words like “façade.” It simply forces the letter c to be said like an s before the vowels a, o, or u, where a plain c would normally sound like k. There’s no new mouth position—just remember it’s an s, not a k.","pattern":"ç","position":"Anywhere","description":"The letter “ç” (called a c-cedilla) is always pronounced like the English “s” in “see,” even though it appears before the vowels a, o, or u, where a regular c would be hard (k). Think of it as a visual reminder to soften the c.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"façade","native":"façade","position":"Middle","cultural_context":"Architectural term also used in English for the front of a building"},{"target":"garçon","native":"garçon","position":"Middle","cultural_context":"Commonly heard in films or cafés for a waiter or “boy”"},{"target":"Curaçao","native":"Curaçao","position":"Middle","cultural_context":"Blue Curaçao liqueur featured in many cocktails"},{"target":"ça va","native":"ça va","position":"Beginning","cultural_context":"Famous French phrase meaning “How’s it going?”"}]}]
["œ",{"thoughts":"English has no native front-rounded vowels, so most learners have never had to pronounce the sound spelled with the ligature “œ.”  It sounds a bit like the English “uh” in “up,” but with the lips rounded as if you were starting to say “o.”  Because front-rounded vowels don’t exist in English, the sound feels unfamiliar and tends to drift toward either “uh” (unrounded) or “er” (as in “bird”) unless the learner pays close attention to lip shape.","pattern":"œ","position":"Anywhere","description":"French œ is a single vowel: a front, rounded \"uh\" sound.  Start with the short English \"uh\" in “cup,” but keep your tongue forward (like for “e”) while rounding your lips (like for “o”).  Your mouth should feel as if you’re saying the start of “sir” while whistling an “o” shape.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"œuvre","native":"œuvre","position":"Beginning","cultural_context":"Used in English for an artist’s complete body of work—“his oeuvre”"},{"target":"bœuf","native":"bœuf","position":"Middle","cultural_context":"Seen in dishes like “bœuf bourguignon,” classic French beef stew"},{"target":"œuf","native":"œuf","position":"Beginning","cultural_context":"French word for egg—appears in cooking terms like “œufs Benedict”"},{"target":"cœur","native":"cœur","position":"Middle","cultural_context":"Part of the place-name “Cœur d’Alene” in Idaho and phrases like “cœur de lion” cheese"}]}]
["æ",{"thoughts":"The ligature æ is extremely rare in modern French; it usually appears only in Latin loan-words or proper names. French does not give it a special sound—most speakers just pronounce it like a normal French “é/è” depending on the specific word. So the challenge is more visual (recognising the symbol) than phonetic.","pattern":"æ","position":"Anywhere","description":"Pronounce æ just like the regular French open or closed e sound: somewhere between the English “e” in “bet” (/ɛ/) and the “ay” in “day” (/e/), without the final glide. In practice, say a clean, pure “eh/ay” vowel and you’ll be understood.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"et cætera","native":"and so on, etc.","position":"Middle","cultural_context":"The full Latin phrase for “etc.”—sometimes written this way in formal writing"},{"target":"curriculum vitæ","native":"résumé, CV","position":"End","cultural_context":"You see this phrase on job applications and academic documents"},{"target":"Lætitia","native":"Laetitia (female given name)","position":"Beginning","cultural_context":"Famous French model/actress Laetitia Casta; seen as a first name"}]}]
["h",{"thoughts":"French “h” never carries the audible /h/ sound that English speakers make.  There are two silent types: • h muet – acts as if the word began with a vowel, allowing elision/liaison (l’hôtel). • h aspiré – still silent but blocks elision/liaison (le hamburger).  The main challenge for English speakers is to resist adding a breathy /h/ at the start and to memorize which words permit or block liaison.","pattern":"h","position":"Beginning","description":"Always silent.  Keep your mouth relaxed and start straight with the following vowel or consonant—no puff of air.  Remember: some words behave like they start with a vowel (hôtel), others like they start with a consonant (hamburger), but in both cases you do NOT pronounce an /h/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hôtel","native":"hôtel","position":"Beginning","cultural_context":"Looks like the English word “hotel,” common lodging term"},{"target":"hamburger","native":"hamburger","position":"Beginning","cultural_context":"Same fast-food sandwich known worldwide"},{"target":"haute couture","native":"haute couture","position":"Beginning","cultural_context":"Fashion term used in English for high-end designer clothing"}]}]
["h",{"thoughts":"French “h” is almost always silent, so the main issue for English speakers is remembering NOT to breathe out a /h/ sound. That is fairly easy to do, because English already has a few silent-h words (hour, honor). The only extra wrinkle is the linguistic distinction between “h muet” (allows liaison) and “h aspiré” (blocks liaison), but that does not change how you actually pronounce it—both are silent—so it is more a listening/grammar point than a pronunciation one.","pattern":"h","position":"Anywhere","description":"In French, the letter “h” is never pronounced as an audible /h/ like in English “hat.” You simply start the next vowel or consonant without any burst of air. The mouth stays relaxed; no voiceless puff is made. Remember: silent, with or without liaison depending on the word, but always silent for pronunciation.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"hôtel","native":"hotel","position":"Beginning","cultural_context":"International word—accommodation; you see it on French building signs"},{"target":"hors d’œuvre","native":"appetizer","position":"Beginning","cultural_context":"Common culinary term used in English menus"},{"target":"haute couture","native":"high fashion","position":"Beginning","cultural_context":"Famous phrase in fashion and style magazines"},{"target":"Tahiti","native":"Tahiti","position":"Middle","cultural_context":"Well-known island in French Polynesia, popular travel destination"}]}]
["ch",{"thoughts":"French “ch” is usually the same sound English writes with the letters “sh,” but in a handful of words of Greek origin it is a hard “k.” English speakers already know both of those sounds, so the only real challenge is remembering when to use which.","pattern":"ch","position":"Anywhere","description":"Most of the time “ch” is pronounced like English “sh” (/ʃ/), as in “shower.”  In a small set of Greek-based words it is pronounced like a hard “k” (/k/), as in “kite.”  There is no French word in which “ch” makes the English “ch” (/tʃ/) sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"champagne","native":"champagne","position":"Beginning","cultural_context":"Sparkling wine used for celebrations"},{"target":"chef","native":"chef","position":"Beginning","cultural_context":"Same word in English—head cook"},{"target":"cliché","native":"cliché","position":"Middle","cultural_context":"Same word in English—overused phrase"},{"target":"écho","native":"écho","position":"Middle","cultural_context":"Almost identical to English “echo,” heard in everyday speech and tech"}]}]
["gn",{"thoughts":"French “gn” makes a single nasal sound [ɲ]—close to the Spanish ñ in “piñata” or the “ny” in English “canyon.” English speakers rarely pronounce this sound except in foreign names, so it may feel new; but they have probably seen it in words like “champagne” and “cognac.” Occasionally, mainly in scientific/Latin-based words (e.g., “diagnostic”), French still says it as two separate letters g+n, but the common everyday reading is the soft nasal [ɲ]. Clinch the tongue against the roof of the mouth as if starting an English “y,” while directing air through the nose.","pattern":"gn","position":"Anywhere","description":"Usually a single palatal nasal consonant [ɲ], like Spanish ñ or the “ny” in “canyon.” The tongue touches the roof just behind the teeth, air flows through the nose, and the following vowel starts immediately. Rarely, in learned or foreign words, it can still be pronounced “g + n.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"End","cultural_context":"Sparkling wine used for celebrations"},{"target":"cognac","native":"cognac","position":"Middle","cultural_context":"Famous French brandy"},{"target":"Avignon","native":"Avignon","position":"Middle","cultural_context":"Well-known French city often mentioned in travel and history"}]}]
["ph",{"thoughts":"In French, the digraph “ph” always represents the single consonant sound /f/, exactly like the first sound in English “fish.” English already uses the same spelling-to-sound rule in words such as “phone,” so nothing new to learn except remembering that it is never pronounced /p/ or /ph/—just a plain /f/.","pattern":"ph","position":"Anywhere","description":"Pronounce “ph” as a simple /f/ sound. Put your top teeth lightly on your bottom lip and push air out, the same way you pronounce the English letter “f.” Don’t add a puff of extra air and don’t try to voice it—keep it crisp and voiceless.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"photo","native":"photo","position":"Beginning","cultural_context":"Same word in English for a picture taken with a camera"},{"target":"téléphone","native":"téléphone","position":"Middle","cultural_context":"Close to the English word “telephone,” device you call with"},{"target":"Joseph","native":"Joseph","position":"End","cultural_context":"Biblical first name, appears the same in English"},{"target":"pharmacie","native":"pharmacie","position":"Beginning","cultural_context":"Store where you buy medicine; French shop sign tourists often notice"}]}]
["qu",{"thoughts":"English readers already see “qu” all the time, but in French it nearly always represents a simple /k/ sound with no following /w/. That surprises some beginners, yet the actual pronunciation is easy because English already has the /k/ consonant.","pattern":"qu","position":"Anywhere","description":"In French, the letter pair “qu” is pronounced like a clean hard K sound /k/, never the English “kw” you hear in “quick.” Just press the back of the tongue to the soft palate and release, as in English “ski.” No rounding of the lips or extra “w” glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"quiche","native":"quiche","position":"Beginning","cultural_context":"Popular French savory tart found on many brunch menus"},{"target":"boutique","native":"boutique","position":"Middle","cultural_context":"Common loan-word for a small fashionable shop"},{"target":"clique","native":"clique","position":"End","cultural_context":"Same word in English for an exclusive social group"}]}]
["th",{"thoughts":"English speakers already know the spelling “th,” but in French it is never the English TH sound. The h is silent and the digraph is pronounced exactly like a plain /t/. Learners just have to remember to shut off the English dental-fricative habit.","pattern":"th","position":"Anywhere","description":"Always pronounce it like a clean French t (tip of the tongue against the upper teeth ridge), no tongue between the teeth and no breathy aspiration. It is identical to the regular French “t.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"thé","native":"tea","position":"Beginning","cultural_context":"Basic drink; same word meaning tea"},{"target":"athlète","native":"athlete","position":"Middle","cultural_context":"Olympic athlete—same idea in English"},{"target":"cathédrale","native":"cathedral","position":"Middle","cultural_context":"Famous Gothic buildings like Notre-Dame"}]}]
["rh",{"thoughts":"“rh” never forms a new sound in French; the h is silent and you just pronounce the normal French R /ʁ/. The difficulty therefore is the uvular French R itself, not the presence of the h. It shows up mainly in Greek-origin words (rhum, rhinocéros, Rhône, etc.).","pattern":"rh","position":"Anywhere","description":"Say the regular French R (a voiced uvular fricative made at the back of the throat, somewhat like clearing your throat gently). The written h does NOTHING—you do not add an English H puff. If you can already do the French R, treat “rh” exactly the same.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"rhum","native":"rhum","position":"Beginning","cultural_context":"Caribbean rum; appears on drink menus"},{"target":"rhinocéros","native":"rhinocéros","position":"Beginning","cultural_context":"Same animal name as English ‘rhinoceros’"},{"target":"Rhône","native":"Rhône","position":"Beginning","cultural_context":"Well-known French river and wine region, seen on wine labels"}]}]
["sh",{"thoughts":"French “sh” is just the same /ʃ/ sound English speakers already know from “shoe.” It shows up mostly in modern loan-words, so learners will meet it in familiar contexts. Nothing new articulatorily; the only surprise is that native French spelling rarely uses it—French usually writes the same sound with “ch.”","pattern":"sh","position":"Anywhere","description":"Pronounce it exactly like the “sh” in English “shut.” Tongue is raised toward the roof just behind the alveolar ridge, lips rounded slightly. There is no vocal-cord vibration. If you can say English “sh,” you can say the French one.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"shampooing","native":"shampooing","position":"Beginning","cultural_context":"French word for shampoo, looks like English “shampoo” with an -ing ending"},{"target":"sushi","native":"sushi","position":"Middle","cultural_context":"Same spelling as the Japanese dish popular worldwide"},{"target":"flash","native":"flash","position":"End","cultural_context":"Same word as in English, used for camera or sudden light"}]}]
["ss",{"thoughts":"French “ss” is simply the un-voiced /s/ sound, like the English “s” in “hiss.” It is mainly used between vowels to guarantee the sound stays /s/ (a single “s” between vowels usually becomes /z/ in French). Because the sound itself exists in English, learners rarely struggle with it.","pattern":"ss","position":"Anywhere","description":"Pronounce it exactly like the sharp S in English “snake” or “kiss.” Keep the vocal cords off (no buzzing) – unlike the /z/ in English “rose.” If you see only one “s” between vowels in French, it usually turns into /z/, so the double “ss” is your visual cue to stick with the clear, hissy /s/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Well-known flaky breakfast pastry"},{"target":"dessert","native":"dessert","position":"Middle","cultural_context":"Same word in English for the sweet course after a meal"},{"target":"cassette","native":"cassette","position":"Middle","cultural_context":"Word borrowed into English for tape recordings"}]}]
["ll",{"thoughts":"French “ll” can be either the ordinary clear L sound English speakers already know, or—when it follows the written letter i (ill/ille)—it often melts into a quick y-glide. Learners must remember some common exceptions (ville, mille, tranquille, etc.) where it stays a plain L.","pattern":"ll","position":"Anywhere","description":"Most of the time “ll” is pronounced just like a single English ‘l’.  BUT after the written letter i (and in a few words after e or a), “ill / ille / aille / eille” is pronounced like the English consonant Y in “yes.”  So “ville” = [l], but “famille” = fa-MEE-y.  Memorize the frequent exception group ending in “-ille” (ville, mille, tranquille, etc.) where you still say a clear L.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"famille","native":"family","position":"Middle","cultural_context":"Common beginner textbook word and looks like English “family”"},{"target":"bouillabaisse","native":"bouillabaisse","position":"Middle","cultural_context":"Well-known Provençal fish stew seen on menus and cooking shows"},{"target":"ville","native":"city","position":"End","cultural_context":"Recognized from French place names and the English suffix “-ville” (e.g., Louisville)"},{"target":"Deauville","native":"Deauville","position":"End","cultural_context":"Famous French seaside resort, known from film & fashion circles"}]}]
["ill",{"thoughts":"“ill” is tricky because it has two main pronunciations: most of the time it turns into the English “y” glide /j/, but in a handful of common words it keeps a clear L sound. English speakers know the glide sound, but the switching rule is not obvious, so it causes confusion.","pattern":"ill","position":"Anywhere","description":"1) Most often, especially after a vowel (fa-mille, Bas-tille), “ill” is pronounced like the English “y” in “yes.” It feels as if the tongue moves quickly from the vowel in front toward the front of the roof of the mouth. There is no audible L.\n2) In a small set of frequent words—mainly those that already contain an i before the ll, such as ville, mille, tranquille—the L is pronounced. Say an English “eel” but keep it shorter and clearer: /il/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bastille","native":"Bastille","position":"End","cultural_context":"Famous Paris fortress; Bastille Day is reported in the news"},{"target":"Camille","native":"Camille","position":"End","cultural_context":"Common French first name (e.g., artist Camille Claudel)"},{"target":"ville","native":"ville","position":"End","cultural_context":"Word for “city”; seen in French place names and as a suffix like in Louisville"}]}]
["ille",{"thoughts":"English speakers will have seen “ille” in French names like “famille” or the city “Lille,” but they rarely know that it can be said two different ways. The main hurdle is deciding when it is the y-glide /ij/ (famille) and when it is the clear L sound /il/ (ville). Otherwise the tongue and mouth positions are familiar: either just the long French i (/i/, close to the English “ee”) plus a quick English-like y, or a normal light French L.","pattern":"ille","position":"Anywhere","description":"Two common pronunciations: (1) Most of the time it sounds like “ee-y” run together /ij/, as in famille or vanille – imagine saying English “fee-yuh” but cut the uh; keep the tongue high then glide forward. (2) In a small group of very common words (ville, mille, tranquille, Lille) it is simply /il/, like the English word “eel” but shorter and lighter. Listen for native examples to know which group a word belongs to; there is no spelling change.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"famille","native":"famille","position":"End","cultural_context":"Looks like English word “family”; appears in beginner French phrases"},{"target":"vanille","native":"vanille","position":"End","cultural_context":"Flavor name you’ll see on French ice-cream cartons (vanilla)"},{"target":"ville","native":"ville","position":"End","cultural_context":"Word for “city”; shows up in many place names like Deauville or Louisville"},{"target":"mille-feuille","native":"mille-feuille","position":"Beginning","cultural_context":"Famous layered pastry on French bakery menus"}]}]
["sc",{"thoughts":"Same spelling exists in English, so learners already ‘see’ it. In French it flips between two very ordinary sounds: /sk/ (as in English “ski”) and simple /s/ (as in “see”). The only thing to remember is that before the soft vowels e-i-y it loses the /k/. Nothing new has to be produced in the mouth, just recall when the K is silent.","pattern":"sc","position":"Anywhere","description":"• Before a, o, u or a consonant: pronounce it /sk/, exactly like the English consonant cluster in “skate”.\n• Before e, i, y: pronounce it /s/ (often written phonetically /s/ or /sj/ in ‘sci-’), like the “s” in English “see”.\nTip: glance at the next vowel—if it’s a, o, u you keep the K, if it’s e, i, y you drop it.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"science","native":"science","position":"Beginning","cultural_context":"Same word in English—study of the natural world"},{"target":"scène","native":"scène","position":"Beginning","cultural_context":"Film/theatre term meaning “scene”; often seen in festival or stage names"},{"target":"scorpion","native":"scorpion","position":"Beginning","cultural_context":"Same animal name in English"},{"target":"Escalade","native":"escalade","position":"Middle","cultural_context":"Name of a Cadillac SUV model; original French word means “climb”"}]}]
["sch",{"thoughts":"In French, the string “sch” is almost always a spelling device that forces the sound /ʃ/ (the same “sh” you hear in English “shoe”).  It turns up mostly in words of foreign origin or in technical terms.  The sound itself is totally familiar to English speakers, but the unexpected spelling can slow them down.","pattern":"sch","position":"Anywhere","description":"Pronounce it like the English “sh” in “shoe.”  Your tongue should be close to, but not touching, the roof of the mouth just behind the teeth, letting the air hiss out.  Forget the written “c” and “h”—they don’t add extra sounds in French here.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"schéma","native":"schéma","position":"Beginning","cultural_context":"Looks like English “schema,” meaning a diagram or outline"},{"target":"schizophrénie","native":"schizophrénie","position":"Beginning","cultural_context":"The mental-health term “schizophrenia,” heard in medicine and the news"},{"target":"Schnitzel","native":"Schnitzel","position":"Beginning","cultural_context":"Well-known Austrian dish that appears on French and English menus"},{"target":"Escherichia coli","native":"Escherichia coli","position":"Middle","cultural_context":"Scientific name for the bacterium “E. coli,” often mentioned in food-safety stories"}]}]
["tch",{"thoughts":"“tch” is pronounced exactly like the English “ch” in “chair.” French uses the same /tʃ/ affricate, and the spelling even appears in some English words (match, ketchup). So most English speakers already know both the spelling and the sound.","pattern":"tch","position":"Anywhere","description":"Pronounce it as the single consonant sound /tʃ/ (the ‘ch’ in “church”). Start with a quick ‘t’ and immediately release into a ‘sh,’ but do it so fast it feels like one blended sound. Lips are slightly rounded, tongue tip touches the ridge just behind the top teeth, then pulls back letting air hiss briefly.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"tchao","native":"bye (informal)","position":"Beginning","cultural_context":"French spelling of “ciao,” sometimes seen in subtitles or pop culture good-byes"},{"target":"ketchup","native":"ketchup","position":"Middle","cultural_context":"Same condiment word used worldwide"},{"target":"match","native":"match (sports game)","position":"End","cultural_context":"Looks identical to English “match,” often heard in sports coverage"}]}]
["ps",{"thoughts":"In French the letter pair “ps” has two main behaviors: (1) when it starts a word or sits inside one, both letters are usually pronounced /ps/, just like the last two sounds of the English word “lapse”; (2) when it ends certain common words, both letters often disappear from speech – you pronounce nothing at all after the preceding vowel or consonant. Because English never writes two letters that both go silent, learners have to memorize which French words drop the sound.","pattern":"ps","position":"Anywhere","description":"Inside or at the beginning of a word, say a quick “p” immediately followed by “s” (as in Eng. “oops” without the vowel). At the end of some short, very common words, neither the p nor the s is voiced – the word ends abruptly with the previous sound (e.g., corps = /kɔʁ/). There is no reliable spelling rule to predict the silent case, so it must be learned word-by-word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psychologie","native":"psychology","position":"Beginning","cultural_context":"Academic field; English looks almost identical"},{"target":"Pepsi","native":"Pepsi","position":"Middle","cultural_context":"Global soft-drink brand name"},{"target":"corps","native":"body","position":"End","cultural_context":"Seen in ‘Marine Corps’; French origin word in English"},{"target":"laps","native":"interval / lapse","position":"End","cultural_context":"Appears in phrase “laps de temps,” resembles English word “lapse”"}]}]
["pt",{"thoughts":"English already has the consonant cluster “pt” (apt, script, receipt). In French the letters work the same way when both are pronounced (/pt/), but very often the p is silent so only a /t/ is heard, especially at the end of a word like “sept.” The main thing to remember is to check if the p is said; otherwise, just pronounce a plain French /t/.","pattern":"pt","position":"Anywhere","description":"“pt” can be pronounced two ways:\n1. /pt/ – Both consonants pronounced, much like English “apt.” This happens inside many words (aptitude, rupture).\n2. /t/ – The p is silent, so it sounds like a plain French t. Most common when the cluster ends the word (sept, prompt).\nKeep the French /t/ soft (tongue against upper teeth) and, when the p is heard, release it quickly before the t, as in English “apt.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"sept","native":"sept","position":"End","cultural_context":"The French word for the number seven, often seen on bilingual packaging or subtitles"},{"target":"aptitude","native":"aptitude","position":"Middle","cultural_context":"Same word exists in English meaning natural ability; used in education and psychology"},{"target":"rupture","native":"rupture","position":"Middle","cultural_context":"Borrowed into English (medical or figurative break); used in news and science"}]}]
["gue",{"thoughts":"English speakers already meet “gue” in familiar loan-words like “vague” and “fatigue.” In French it simply guarantees a hard /g/ before the letter e; the u itself is silent. At the end of a word the whole group often collapses to just /g/. When a vowel sound follows (baguette, guérilla) you hear hard /g/ plus the normal French vowel value of the e that follows.","pattern":"gue","position":"Anywhere","description":"Pronounce a hard g, like the g in English “go.” The letter u is NOT pronounced; it only keeps the g hard before the front vowel e. If “gue” is at the very end of the word, you usually hear just /g/ with no vowel after it. If another vowel follows (baguette, guérilla) you say /g/ and then the French e sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"vague","native":"vague","position":"End","cultural_context":"Same word exists in English meaning “unclear”"},{"target":"fatigue","native":"fatigue","position":"End","cultural_context":"Common English word for tiredness and military drill “fatigues”"},{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Iconic long French bread sold worldwide"},{"target":"guérilla","native":"guérilla","position":"Beginning","cultural_context":"Borrowed into English as “guerrilla” warfare"}]}]
["gui",{"thoughts":"“gui” is almost always pronounced like the English hard “g” + the vowel in “machine” (/gi/). The written “u” is silent; its only job is to tell you the “g” should stay hard in front of the front vowel “i.” English speakers see it in ‘guillotine,’ so the sound is not completely foreign, but the silent “u” can be confusing.","pattern":"gui","position":"Anywhere","description":"Say a hard “g” (as in “go”) immediately followed by a long French “ee” sound. Do NOT pronounce an extra “w” or “u.” Think of saying “gee” without letting your tongue move or adding a glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"guide","native":"guide","position":"Beginning","cultural_context":"Same spelling in English— a person or booklet that shows the way"},{"target":"guitare","native":"guitar","position":"Beginning","cultural_context":"Musical instrument; English word is almost identical"},{"target":"guillotine","native":"guillotine","position":"Beginning","cultural_context":"Historical execution device often mentioned in French Revolution stories"},{"target":"linguistique","native":"linguistic","position":"Middle","cultural_context":"Looks like the English word ‘linguistic,’ used in academic contexts"}]}]
["ge",{"thoughts":"For English speakers, the digraph “ge” is almost always the “soft g” /ʒ/, the same sound as the “s” in “measure.”  The only challenge is remembering that the final –e is usually silent unless it carries an accent, and that the sound never becomes a hard /g/.  The sound itself exists in English, but its French spelling can feel counter-intuitive.","pattern":"ge","position":"Anywhere","description":"In French, the letters g + e spell the single consonant /ʒ/ (like the “zh” in English ‘measure’ or ‘vision’).  If the e is plain and word-final, it is normally silent (rouge /ʁuʒ/).  If the e is accented (gé, gè, gén-), you hear both the /ʒ/ and the vowel value of the accented e (génie /ʒe/ or /ʒe.ni/).  The sound is never the hard /g/ of English ‘get.’  Keep the tongue relaxed and place the tip just behind the bottom front teeth while the middle of the tongue makes a narrow channel for the voiced air to buzz.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"genre","native":"genre","position":"Beginning","cultural_context":"Loanword in English for a category of art or film"},{"target":"rouge","native":"rouge","position":"End","cultural_context":"Famous red lipstick shade and the Paris cabaret ‘Moulin Rouge’"},{"target":"génie","native":"génie","position":"Beginning","cultural_context":"Means ‘genie’; English speakers know the magical being from Aladdin"},{"target":"montage","native":"montage","position":"End","cultural_context":"Film-editing term used in English"}]}]
["gi",{"thoughts":"French “gi” can sound either like the soft “zh-ee” (/ʒi/) you hear in English words such as “vision”+“ee”, or—when written “gui”—like a hard “g” plus “ee” (/gi/). English ears meet the soft version in French loan-words (e.g., mirage, regime), so it is not totally foreign, but deciding when it is soft versus hard takes a moment’s study.","pattern":"gi","position":"Anywhere","description":"1) gi without a silent u before it = soft /ʒi/ (similar to the “s” in “measure” followed by the vowel in “see”).\n2) gui (g + silent u + i) = hard /gi/ (like “gee!”). Keep the tongue forward for /ʒ/ and let the tip just touch the lower teeth; for /g/, do the usual English hard g.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Gigi","native":"Gigi (woman’s name, famous musical/film title)","position":"Multiple","cultural_context":"Classic Oscar-winning movie and stage musical that many English speakers know"},{"target":"girafe","native":"giraffe","position":"Beginning","cultural_context":"Looks almost identical to the English animal name “giraffe”"},{"target":"guillotine","native":"guillotine","position":"Beginning","cultural_context":"Famous French execution device often mentioned in history classes"}]}]
["ga",{"thoughts":"‘ga’ in French is straightforward for English speakers: the hard /g/ sound plus the open French ‘a’ that is close to the “ah” in English “father.” No silent letters or nasalization to worry about.","pattern":"ga","position":"Anywhere","description":"Pronounce it with a hard g (as in “go”) followed immediately by the open French a [a] (similar to the “ah” in “father,” but keep your mouth a bit more forward and don’t let it dip toward an ‘r’ sound). It never softens to the ‘zh’ sound because the following letter is a, not e or i.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"gâteau","native":"cake","position":"Beginning","cultural_context":"Famous French pastry word used on menus and cooking shows"},{"target":"garage","native":"garage","position":"Multiple","cultural_context":"Exact same spelling in English; borrowed from French"},{"target":"avant-garde","native":"avant-garde","position":"Middle","cultural_context":"Common term in English for experimental art or ideas"}]}]
["go",{"thoughts":"French “go” is straightforward for English speakers: a hard /g/ (as in English “go”) followed by an “o” vowel. The vowel can be either the closed /o/ (similar to the English long o in “go”) or the open /ɔ/ (like the vowel in British English “thought” but shorter). Context decides which one French uses, but English ears generally accept either without much confusion.","pattern":"go","position":"Anywhere","description":"The letters g + o always give the hard g sound /g/. The following “o” can be pronounced either closed /o/ (rounded, lips more tense) or open /ɔ/ (slightly laxer). Both are close to sounds found in English, so concentrating on keeping the /g/ hard and the vowel short and pure is usually enough.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"golf","native":"golf","position":"Beginning","cultural_context":"International sport; same spelling in English"},{"target":"escargot","native":"snail (dish)","position":"Middle","cultural_context":"Famous French delicacy often mentioned in restaurants and pop culture"},{"target":"logo","native":"logo","position":"End","cultural_context":"Same word in English for a brand symbol"}]}]
["gu",{"thoughts":"“gu” is mainly a spelling device to keep a hard /g/ sound before the front vowels e, i, y; in that common case the u itself is silent. If the u carries a diaeresis (güe, güi) or comes before a back vowel (a, o), the u is heard as a light w/ü-glide, roughly /gw/ or /gɥ/. English speakers know the hard g, so only the silent-u idea is new.","pattern":"gu","position":"Anywhere","description":"Usually pronounced just like the hard g in English “go,” with the u remaining silent (e.g., baguette, guitare).  When the u has ¨ or comes before a or o, pronounce a quick w-like glide after the g, as in /gw/ (e.g., Guadeloupe).","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"baguette","native":"baguette","position":"Middle","cultural_context":"Classic long French bread, word borrowed directly into English"},{"target":"guitare","native":"guitare","position":"Beginning","cultural_context":"Looks like and means “guitar,” the musical instrument"},{"target":"Guadeloupe","native":"Guadeloupe","position":"Beginning","cultural_context":"French Caribbean island often mentioned in travel shows and news"}]}]
["ai",{"thoughts":"Two main French pronunciations: open [ɛ] (“eh”) when followed by a consonant or in a closed syllable; closed [e] (“ay”) when it ends a syllable/word, especially in verb forms. Both vowels exist in English, but English usually turns the closed version into a diphthong, so learners must keep it pure.","pattern":"ai","position":"Anywhere","description":"Usually a single vowel. 1) Most common: open ‘eh’ [ɛ] — like the e in “bet,” but a little longer, no glide. 2) At the very end of a word or syllable (j’ai, parlerai) it’s a closed pure ‘ay’ [e] — start of English “day” but stop before the y-glide. Keep the jaw relaxed, lips neutral, and don’t let the sound slide toward ‘ee’.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"éclair","native":"éclair","position":"Middle","cultural_context":"Famous chocolate-topped pastry sold in many bakeries"},{"target":"parfait","native":"parfait","position":"Middle","cultural_context":"Dessert word used in English for layered yogurt or ice-cream"},{"target":"café au lait","native":"café au lait","position":"End","cultural_context":"Common coffee order meaning coffee with milk"},{"target":"je ne sais quoi","native":"je ne sais quoi","position":"Middle","cultural_context":"French phrase used in English to describe an indescribable charm"}]}]
["ais",{"thoughts":"“ais” is a common letter cluster; the vowel is almost always the open “eh” sound /ɛ/.  The written “s” is silent at the end of a word but is pronounced /s/ if another consonant “s” follows or if it is inside a word.  Very occasionally (older-style speech, some southern accents, or in singing) the vowel can be the closer /e/.  English speakers know the /ɛ/ vowel (as in “bed”), but must avoid turning it into the English diphthong “ay.”","pattern":"ais","position":"Anywhere","description":"Most of the time “ais” is pronounced /ɛ/ – an open “eh” like the e in “bed,” but held a touch longer and without any ending glide.  When “ais” is word-final, the “s” is silent (je fais → /fɛ/).  When another “s” or a vowel follows, the /s/ sound is heard (laissez → /lɛs/).  In a few formal or regional variants, the vowel may be the closer /e/ (similar to the first part of English “ay” but still kept pure, not a diphthong).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"français","native":"français","position":"End","cultural_context":"Seen on language menus and labels to mean “French”"},{"target":"Beaujolais","native":"Beaujolais","position":"End","cultural_context":"Famous French wine and wine-region, heard in food & drink contexts"},{"target":"laissez-faire","native":"laissez-faire","position":"Middle","cultural_context":"Well-known economic term used in English for minimal government intervention"}]}]
["ait",{"thoughts":"English speakers already know the vowel sound /ɛ/ (like “e” in “bet”), but may not expect the three letters “ait” to map to that single vowel and to have a normally-silent final t. The only extra trick is that the t wakes up in liaison before a following vowel.","pattern":"ait","position":"Anywhere","description":"Usually pronounced like the short English “e” in “bet” (/ɛ/). The final “t” is silent unless a liaison makes it pronounced /t/ before a following vowel (rare in the loan phrases you’ll meet). Think of saying “eh” and stop—do NOT add an English diphthong or pronounce the t.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"fait accompli","native":"fait accompli","position":"Beginning","cultural_context":"Common legal / business phrase in English meaning an accomplished fact"},{"target":"café au lait","native":"café au lait","position":"End","cultural_context":"Coffee with milk—seen on café menus and coffee shop boards"},{"target":"parfait","native":"parfait","position":"End","cultural_context":"Layered dessert or yogurt treat called a “parfait” on English menus"},{"target":"trait","native":"trait","position":"End","cultural_context":"Word borrowed into English to mean a characteristic or feature"}]}]
["ai",{"thoughts":"Word-final “ai” in French is usually pronounced as one of the two short ‘e’ vowels: the closed /e/ (similar to the vowel in the English word “say,” but without the off-glide toward a ‘y’ sound) or the open /ɛ/ (like the first part of “bet,” but a touch tenser). Which one you hear depends on region and speaker; most learners can aim for something between the two – a clean, pure “eh” – and be understood.","pattern":"ai","position":"End","description":"At the very end of a French word, the letters “ai” are pronounced as a pure, front ‘e’ sound — somewhere between the English vowels in “say” (but clipped, no “y” glide) and “bed.” Keep the lips relaxed and don’t let the sound trail off into a diphthong.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"chai","native":"chai (wine cellar)","position":"End","cultural_context":"Same spelling as the trendy “chai tea”; shows up in French wine tourism guides"},{"target":"gai","native":"gai (cheerful)","position":"End","cultural_context":"Heard in old songs and the phrase “Gay Paree,” so many English speakers have run across it"}]}]
["ais",{"thoughts":"English speakers usually guess “ais” the way they read “aisle” or “raise” – a long AY sound plus a pronounced S. In French, when “ais” sits at the very end of a word, the S is silent and the vowel is the open e /ɛ/, like the short “e” in English “bet,” but a touch tenser. In liaison the S can come back as a /z/. Spelling-to-sound looks odd, so the main trap is saying “ayz.”","pattern":"ais","position":"End","description":"At the end of a French word, “ais” is pronounced roughly like the English short “e” in “bet” (/ɛ/); the final S is normally silent. If the following word begins with a vowel, the S may link and sound like a soft /z/. Keep the mouth fairly open, tongue forward, no diphthong – just a clean, flat “eh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"français","native":"français","position":"End","cultural_context":"Means “French”; seen on menus and in subtitles"},{"target":"anglais","native":"anglais","position":"End","cultural_context":"Means “English”; used when picking language options"},{"target":"mais","native":"mais","position":"End","cultural_context":"Means “but”; heard in classic phrase “mais oui!” in movies"},{"target":"vais","native":"vais","position":"End","cultural_context":"Means “(I) go”; appears in the common phrase “je vais”"}]}]
["ait",{"thoughts":"“ait” at the end of a French word is almost always pronounced the single open-e sound /ɛ/ – like the “e” in English “bet,” but shorter and cleaner.  The written “t” is silent.  English speakers already know this vowel sound, so the main trap is not to say a long English “ay” or pronounce the final “t.”","pattern":"ait","position":"End","description":"Pronounce it like the short \"eh\" in English “bet,” with no diphthong and no final /t/.  Lips relaxed, tongue forward-mid.  Think of the first half of English “epic.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"lait","native":"milk","position":"End","cultural_context":"Seen in coffee order “café au lait”"},{"target":"parfait","native":"parfait (dessert)","position":"End","cultural_context":"Common yogurt or ice-cream dessert called a parfait"},{"target":"fait accompli","native":"fait accompli","position":"End","cultural_context":"Borrowed English phrase meaning something already done"}]}]
["aie",{"thoughts":"Very few French loan-words with the exact spelling “aie” are common in English, but travelers still bump into it on receipts and signs (paie, monnaie). The letter trio almost always sounds like the open “eh” of English “bet,” the same vowel you hear in French è or ê. It can turn up anywhere in a word, though most often at the end.","pattern":"aie","position":"Anywhere","description":"Say the open “eh” sound as in English “bet,” but keep the tongue slightly forward and the lips relaxed. It is the same vowel you meet in French “près” or “crème.” The final e is silent; you do NOT pronounce a separate ‘y’ or ‘ee’ glide.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"monnaie","native":"monnaie","position":"End","cultural_context":"Tourists see this word on coin-exchange booths and receipts; it means “change / coins.”"},{"target":"paie","native":"paie","position":"End","cultural_context":"A common form of the verb “payer” (to pay); appears on French bills or in the phrase “je paie.”"}]}]
["aie",{"thoughts":"Not many high-profile French loan-words end in “aie”, so English speakers seldom notice the pattern. When it does appear, all three letters shrink to the single French vowel /ɛ/ – the same sound as the “e” in English “bet,” but held a touch longer and a bit more open. There is no “y” or “ee” glide.","pattern":"aie","position":"End","description":"When “aie” sits at the end of a word, pronounce it as one open “eh” (/ɛ/) – similar to the vowel in English “bet.” Don’t say the letters separately and don’t add a trailing “y” or “ee.” Just drop the jaw slightly and release a short, clean “eh.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"baie","native":"baie","position":"End","cultural_context":"French for “bay” or “berry”; familiar in Canada through the department store name “La Baie” (Hudson’s Bay)"},{"target":"aïe","native":"aïe","position":"End","cultural_context":"Comic-book or subtitle exclamation meaning “ouch”"},{"target":"plaie","native":"plaie","position":"End","cultural_context":"Medical term for “wound”; can appear on bilingual first-aid packaging"}]}]
["au",{"thoughts":"“au” is one of the most regular French vowel spellings. Most of the time it is pronounced as a pure closed-mid back rounded vowel /o/ (similar to the long “o” in English ‘go’ but without gliding toward a ‘w’). In front of r it opens slightly to /ɔ/, an ‘aw’ sound as in ‘law’. English speakers already know both vowels, but they tend to turn them into diphthongs, so the main challenge is keeping the sound short and steady.","pattern":"au","position":"Anywhere","description":"Usually pronounced /o/ (pure ‘oh’). Before r it is /ɔ/ (‘aw’ as in ‘law’). Keep lips rounded; do not let the sound slide toward ‘w’.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"chauffeur","native":"chauffeur","position":"Beginning","cultural_context":"Used in English for a hired driver"},{"target":"restaurant","native":"restaurant","position":"Middle","cultural_context":"Same word in English for a place to eat"},{"target":"Renault","native":"Renault","position":"Middle","cultural_context":"Well-known French car brand"},{"target":"au revoir","native":"au revoir","position":"Beginning","cultural_context":"Famous French way to say goodbye, heard in movies"}]}]
["aux",{"thoughts":"English speakers already know the long “o” sound, so the main hurdle is trusting that the final “x” is silent and keeping the vowel pure (no off-glide). Liaison may add a linking /z/, but the core sound is just /o/. Words like “faux” and “Bordeaux” feel familiar and illustrate that “aux” ≈ the English “oh” sound.","pattern":"aux","position":"Anywhere","description":"In modern French, the letter group “aux” is almost always pronounced as a single pure vowel /o/ – similar to the “o” in English “go,” but shorter and without the little finishing “w” glide many English speakers add. The final “x” is silent. If the next word starts with a vowel, a linking /z/ sound may appear (liaison), but the basic pronunciation of “aux” itself stays /o/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"faux","native":"faux","position":"End","cultural_context":"Common in English expressions like “faux fur” or “faux pas,” meaning fake"},{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Well-known French wine region and city; appears on wine labels and travel shows"},{"target":"châteaux","native":"châteaux","position":"End","cultural_context":"Plural of “château”; heard in tourism (Loire Valley châteaux) and wine discussions"}]}]
["eau",{"thoughts":"‘eau’ is almost always pronounced like the single, pure French vowel /o/, similar to the “o” in English “go,” but without the English glide that often turns it into a diphthong.  English speakers already know the spelling from words such as “beau” or “château,” so the look is familiar, but they may need to remember to keep it a short, rounded monophthong.","pattern":"eau","position":"Anywhere","description":"Pronounced as a single, rounded /o/ sound—close to the first part of English “oh,” but keep it short and pure (no ending ‘w’ glide). Just round the lips slightly and sustain one steady vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"beau","native":"beau","position":"End","cultural_context":"Used in English to mean a boyfriend or handsome man"},{"target":"beaucoup","native":"beaucoup","position":"Beginning","cultural_context":"Heard in the phrase “merci beaucoup” meaning “thanks a lot”"},{"target":"bureau","native":"bureau","position":"End","cultural_context":"Borrowed into English for a desk or government agency, e.g., “Federal Bureau”"},{"target":"château","native":"château","position":"End","cultural_context":"Commonly used in English for French castles and on wine labels"}]}]
["eaux",{"thoughts":"“eaux” is almost always pronounced like a pure French /o/ (close-mid back rounded vowel). English speakers already meet this sound in words such as “beau” or “eau de toilette,” so the spelling–sound link is usually familiar. The only trick is to keep the vowel short and pure, without the off-glide you hear in English “go.” The pattern can appear anywhere in a word but, in common vocabulary, it is most often found at the end.","pattern":"eaux","position":"Anywhere","description":"Pronounce “eaux” as a single, pure \"oh\" sound—similar to the first half of English “go,” but do not let it slide toward a “w.” Lips are rounded; tongue is mid-high and back. There is no audible ‘x.’ In plural nouns (châteaux, plateaux) the pronunciation stays the same.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Famous French wine region and its red wine"},{"target":"plateaux","native":"plateaux","position":"End","cultural_context":"Plural of \"plateau,\" used in geography and dieting contexts"},{"target":"tableaux","native":"tableaux","position":"End","cultural_context":"Plural of \"tableau,\" heard in art and theater discussions"}]}]
["ei",{"thoughts":"French “ei” is fairly straightforward for English speakers because its most common value /ɛ/ is close to the “e” in English “bet.” The only trap is when it becomes nasal (/ɛ̃/) before a final written n / m + consonant or at the end of a word; that nasal version has no exact English equivalent and may require practice.","pattern":"ei","position":"Anywhere","description":"Most of the time “ei” is pronounced /ɛ/, the open “eh” vowel you hear in English “bet.” When the letters are followed by an n or m that is itself followed by another consonant or is word-final, the vowel turns nasal: you keep the same “eh” mouth position but let air resonate through the nose, producing /ɛ̃/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Seine","native":"Seine","position":"Middle","cultural_context":"The famous river that flows through Paris—often mentioned in travel shows and literature."},{"target":"beignet","native":"beignet","position":"Middle","cultural_context":"Deep-fried pastry popular in New Orleans cafés and on cooking shows."},{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"French city at the heart of the Champagne region; name appears on many wine bottles."}]}]
["eu",{"thoughts":"English speakers have no native front-rounded vowels, so the French digraph “eu” feels unfamiliar. It is usually pronounced either as a closed /ø/ (lips rounded, tongue like English long “a” in ‘day’ but further forward) or as a more open /œ/ (similar tongue position to English “uh” in ‘cup’, but with rounded lips). Hold the lips rounded the whole time; don’t glide to “oo.”","pattern":"eu","position":"Anywhere","description":"Makes a single vowel. Two main flavors:\n• Closed /ø/ – longer, tenser, often in stressed, word-final, or open-syllable positions (eu, peu, bleu).\n• Open /œ/ – shorter, laxer, often before pronounced consonants (fleur, neuf, heure).\nThink of saying English “uh” while whistling: keep the front of the tongue up and lips rounded.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"euro","native":"euro","position":"Beginning","cultural_context":"Currency used throughout much of Europe"},{"target":"bleu","native":"bleu","position":"End","cultural_context":"As in ‘bleu cheese’ or ‘steak bleu’ on menus"},{"target":"fleur-de-lis","native":"fleur-de-lis","position":"Middle","cultural_context":"Historic French heraldic symbol seen in logos and New Orleans imagery"}]}]
["eux",{"thoughts":"/ø/ (as in eux) is a rounded front vowel English doesn’t have. The silent x can surface as a linking /z/. Few high-profile loanwords show this spelling, the best-known being deux from “pas de deux.”","pattern":"eux","position":"Anywhere","description":"Usually pronounced as a single vowel /ø/: shape your lips as if saying English “oo,” but keep your tongue forward as for the vowel in “ay.” The written x is normally silent; if the next word starts with a vowel, it is pronounced /z/ (deux ans → /dø zɑ̃/).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"deux","native":"two","position":"End","cultural_context":"Heard in the ballet term “pas de deux,” meaning a dance for two"}]}]
["oe",{"thoughts":"English speakers mainly meet “oe” in borrowed expressions like “Noël” or “hors d’oeuvre.” There are two unrelated pronunciations: (1) the ligature œ, pronounced like the French “eu” (rounded version of English ‘er’ in ‘her’); (2) the diaeresis oë, where the o and e are read in separate syllables.","pattern":"oe","position":"Anywhere","description":"Two main cases. (1) œ or œu: one single vowel, lips rounded and slightly protruded, tongue in mid-central position – roughly the vowel in English “nurse” or “bird,” but with rounded lips. (2) oë/öe: the letters are pronounced separately, so you get a clear “oh-EH” sequence, as in “No-EL.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"hors d'œuvre","native":"hors d'œuvre","position":"Middle","cultural_context":"Appetizer course name used on English menus"},{"target":"Noël","native":"Noël","position":"Middle","cultural_context":"Christmas carol title \"The First Noël\""},{"target":"Moët","native":"Moët","position":"Middle","cultural_context":"Famous champagne brand \"Moët & Chandon\""}]}]
["œu",{"thoughts":"English has no front-rounded vowels, so the French œu (usually /ø/ or /œ/) feels exotic. Learners may have read it in food terms like “hors d’œuvre” or “boeuf bourguignon,” so the pattern is somewhat familiar in print, but the sound itself is new. They must learn to round their lips while saying an English “eh/uh” type vowel.","pattern":"œu","position":"Anywhere","description":"œu is pronounced as a rounded version of the English \"uh/er\" sound in \"her,\" but with the lips pushed forward and rounded like when you say “oo.” It can be slightly more closed /ø/ (as in bleu) or more open /œ/ (as in bœuf), but both keep that front-rounded quality. No exact English equivalent exists, so imagine saying “eh” while shaping the lips for “oo.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"œuvre","native":"œuvre","position":"Beginning","cultural_context":"Used in English to mean an artist’s complete body of work"},{"target":"hors d'œuvre","native":"hors d'œuvre","position":"Middle","cultural_context":"French word for appetizer seen on English menus"},{"target":"bœuf bourguignon","native":"bœuf bourguignon","position":"Middle","cultural_context":"Famous French beef stew, often mentioned in cooking shows"},{"target":"cœur","native":"cœur","position":"Middle","cultural_context":"French for “heart”; appears in mottos and place names like Coeur d’Alene"}]}]
["oi",{"thoughts":"French “oi” is almost always pronounced /wa/, a quick rounded w-plus-a sound. English speakers already form /w/ and /ɑː/ in words like “wand,” but they must round the lips more at the start and keep the vowel shorter and farther forward than English “ah.” Because it shows up in many loan-words (croissant, soirée) exposure is moderate, but hitting the tight /wa/ without drifting toward an English “wah” can take practice.","pattern":"oi","position":"Anywhere","description":"Usually pronounced /wa/: start with lips rounded as for “oo,” glide immediately into a short open “a.” Similar to saying English “wah” but faster and with tighter lip-rounding.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant","position":"Middle","cultural_context":"Popular buttery pastry sold in cafés and supermarkets"},{"target":"soirée","native":"soirée","position":"Middle","cultural_context":"Borrowed English word for an evening party"},{"target":"moi","native":"moi","position":"End","cultural_context":"Common French pronoun heard in phrases like “moi aussi”"}]}]
["ou",{"thoughts":"French “ou” is a single, stable vowel /u/ (close-back, rounded). English already has a similar sound in “food,” so recognition is high, but English speakers often turn it into a diphthong (“fooo-uhd”). They must keep it short and pure, with firmly rounded lips.","pattern":"ou","position":"Anywhere","description":"Pronounce it like the “oo” in English “food,” but keep it shorter and without any sliding toward a second vowel. Lips stay rounded the whole time; tongue is high and back.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"boulevard","native":"boulevard","position":"Beginning","cultural_context":"Borrowed into English for wide city street"},{"target":"rouge","native":"rouge","position":"Middle","cultural_context":"Cosmetics term for red blush; also in ‘Moulin Rouge’"},{"target":"souvenir","native":"souvenir","position":"Middle","cultural_context":"A keepsake bought while traveling; same word in English"},{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"Common French greeting heard in movies and travel"}]}]
["ui",{"thoughts":"‘ui’ is quite common in French. When it stands alone (lui, nuit, etc.) it sounds like a single syllable that starts with the tight-lipped ‘y’ glide /ɥ/ and slides straight into the English “ee.” It feels a bit like saying English “wee” while keeping your lips more rounded and pushed forward. However, when the letters follow q or g (quiche, guitare) the u is only there to tell you how to pronounce the consonant; the actual vowel you hear is just /i/ as in English “see.” English speakers know words such as “oui,” “Louis Vuitton,” and “quiche,” but the /ɥ/ glide itself does not exist in English, so producing it can be tricky.","pattern":"ui","position":"Anywhere","description":"Most of the time ‘ui’ is pronounced in a single beat as /ɥi/ – imagine saying English “wee” but with your lips puckered as if you are starting to whistle. After q or g, the u is silent and you simply hear /i/ (“kee” or “gee”).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"oui","native":"oui","position":"End","cultural_context":"The basic French word for “yes”; often heard in movies and travel phrases"},{"target":"Louis","native":"Louis","position":"Middle","cultural_context":"Famous French first name and half of the luxury brand “Louis Vuitton”"},{"target":"quiche","native":"quiche","position":"Middle","cultural_context":"Popular French savory pie served in cafés and brunch spots"}]}]
["ue",{"thoughts":"“ue” in French does two very different jobs. 1) After most consonants it simply spells the vowel /y/ (the very front-rounded French “u”); the final “e” is silent and just tells you to pronounce the preceding “u” as a vowel. 2) After the letters g or q (as in “gue / que”) the “u” is silent – it only protects the hard /g/ or /k/ sound before the front vowel “e”.  English speakers already bump into both spellings in loan-words like “statue” or “Cirque du Soleil”, so the pattern feels familiar, but producing the French /y/ still takes practice.","pattern":"ue","position":"Anywhere","description":"Two main pronunciations:\n• /y/ (French front-rounded \"u\") when “ue” appears on its own at the end of a syllable: rue /ʁy/, statue /sta.ty/.  Think of saying English “ee” while rounding your lips.\n• Silent “u” after g or q: it just keeps the consonant hard, so “cirque” sounds like “sirk”.  English has no real equivalent, so remember the “u” isn’t heard.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"rue","native":"rue","position":"End","cultural_context":"Seen on French street signs; also an English verb meaning “to regret”"},{"target":"statue","native":"statue","position":"End","cultural_context":"Same word as in English – e.g., the Statue of Liberty"},{"target":"cirque","native":"cirque","position":"End","cultural_context":"From “Cirque du Soleil,” the famous Canadian circus show"}]}]
["ie",{"thoughts":"“ie” is fairly common in French.  Sometimes it is a straight long “ee” sound (/i/), very close to the English vowel in “see.”  Other times, especially right after a consonant, it turns into a quick English-style “y” glide plus an open “eh” (/jɛ/ or /je/), something like the start of “yes” followed by the “e” in “bed.”  English speakers have heard both versions in food names and basic phrases, but may mix them up because English spelling never uses “ie” this way.","pattern":"ie","position":"Anywhere","description":"Two main values: (1) /i/ – a pure long “ee” as in English “see,” used at the ends of words such as “Brie” or “copie.”  (2) /jɛ/ (or /je/) – a quick “y” glide plus open “eh,” heard after a consonant before another consonant or a silent final letter, e.g., “pied” or “bien.”  Keep the glide very short and the final vowel open, not the tense English ‘ay.’","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Brie","native":"Brie cheese","position":"End","cultural_context":"Soft French cheese you see on menus and in grocery stores"},{"target":"copie","native":"copy","position":"End","cultural_context":"Looks like the English word ‘copy,’ common in basic vocab lists"},{"target":"pied","native":"foot","position":"End","cultural_context":"Appears in the loan phrase “pied-à-terre” and in basic French courses"},{"target":"bien","native":"well/good","position":"Middle","cultural_context":"Very common word in phrases like “Très bien” taught early in French"}]}]
["ier",{"thoughts":" “ier” is very common in French (endings like –ier, –ière, –ier-) and shows up in English loan-words such as “premier.”  It normally produces a single syllable that sounds like a quick English “y” plus a clipped “ay.”  The written r is silent at the very end of a word, which can surprise English speakers who want to pronounce it.","pattern":"ier","position":"Anywhere","description":"Usually one syllable /je/: start with the English “y” of “yes,” then slide straight into the pure French ‘é’ sound (similar to the first half of English “ay,” but shorter and with no second vowel).  The final written r is silent when nothing follows it.  If another consonant comes before the i (pap-ier, cav-al-ier) that consonant joins the same syllable.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"premier","native":"premier","position":"End","cultural_context":"Used in English for “prime minister” or “Premier League” soccer"},{"target":"papier","native":"papier","position":"End","cultural_context":"Seen in the craft term “papier-mâché”"},{"target":"cavalier","native":"cavalier","position":"End","cultural_context":"English word meaning “carefree” and name of the Cleveland Cavaliers team"},{"target":"pâtissier","native":"pâtissier","position":"End","cultural_context":"Word for a pastry chef; you’ll see it on French bakery signs"}]}]
["ier",{"thoughts":"“ier” almost always sits at the very end of a French word and is pronounced as one quick syllable /je/ — roughly “-yeh.” The final written r is silent, and there is no break between the i and e; glide from a tight English “ee” to a short open “eh.” Native English speakers may want to resist adding an audible r or stretching it to two syllables (“ee-ay”).","pattern":"ier","position":"End","description":"Pronounce it as one smooth syllable /je/ – like saying the English word “yeah” but starting it with a brief “ee” sound. Lips start spread for “ee,” then relax slightly for “eh,” with no r at the end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Courvoisier","native":"Courvoisier","position":"End","cultural_context":"Famous French cognac brand heard in pop culture"},{"target":"cavalier","native":"cavalier","position":"End","cultural_context":"Same spelling in English for a carefree attitude or historical horseman"},{"target":"glacier","native":"glacier","position":"End","cultural_context":"Common term for a river of ice, borrowed from French"}]}]
["iers",{"thoughts":"“iers” only shows up at the very end of a word. In modern standard French the whole string sounds like one syllable /je/, roughly the English “YAY” but shorter. The written r and s disappear; you just glide from a tight “ee” into an open “eh”. If the next word starts with a vowel the normally-silent s can resurface as a liaison /z/ (“premiers‿actes”). English speakers have heard the sound in various French place-names and political titles, but the spelling fools them into trying to pronounce the r and s.","pattern":"iers","position":"End","description":"Pronounce it as one syllable /je/: start with a close “ee” tongue position, then quickly relax toward “eh” while letting the two sounds blend. Do NOT voice the written r or s. Think of saying English “YAY” but without any real y-glide at the start and much shorter. If a following word begins with a vowel, a linking /z/ may appear.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"premiers","native":"premiers","position":"End","cultural_context":"News about the provincial premiers of Canada"},{"target":"Poitiers","native":"Poitiers","position":"End","cultural_context":"Historic French city mentioned in travel shows and the Battle of Poitiers"}]}]
["ien",{"thoughts":"The sequence “ien” is almost always pronounced /jɛ̃/ – a quick English “y” sound followed by the front nasal vowel heard in French “vin.”  When another vowel follows the n (usually –ne, –nes, –ner, etc.), the nasal quality disappears and you get /jɛn/, ending with a clear n.  English has neither the nasal vowel nor the /jɛ̃/ glide-plus-nasal combo, so it feels unfamiliar and tricky.","pattern":"ien","position":"Anywhere","description":"Most of the time pronounced /jɛ̃/: start with the English “y” in “yes,” then let the “eh” vowel resonate through your nose while the mouth stays partly open.  If the n is followed by another vowel (–ienne, –ienn-, etc.), pronounce /jɛn/: the same “y” + regular “eh” and finish with an audible n.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"rien","native":"rien","position":"End","cultural_context":"Line from Edith Piaf’s song 'Je ne regrette rien' often quoted in English-language media"},{"target":"ancien régime","native":"ancien régime","position":"End","cultural_context":"Historical term used in English for France’s pre-Revolution social order"},{"target":"bien","native":"bien","position":"End","cultural_context":"Shows up in the phrase 'bien sûr' ('of course') commonly heard in films and travel guides"},{"target":"julienne","native":"julienne","position":"Middle","cultural_context":"Culinary term for thin, match-stick vegetable cuts"}]}]
["ien",{"thoughts":"‘ien’ at the end of a word is always the nasal glide /jɛ̃/. The tongue starts high-front like the English “y” in “yes,” then slides into a nasal version of the short “eh” sound while the soft palate stays lowered so air escapes through the nose. English has no true nasal vowels, so learners tend to drop the nasal quality or add an extra consonant like “n.”","pattern":"ien","position":"End","description":"Pronounce it /j ɛ̃/: start with a quick English “y” then move into a nasalized “eh” (as if saying the vowel in “set” while humming through your nose). Do NOT pronounce a final n sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bien","native":"bien","position":"End","cultural_context":"Heard in phrases like “bien sûr” or “très bien” meaning “well/very good.”"},{"target":"chien","native":"chien","position":"End","cultural_context":"Common basic word for “dog” in beginner French classes and children’s books."},{"target":"Canadien","native":"Canadien","position":"End","cultural_context":"Seen in sports news for the NHL team “Les Canadiens de Montréal” (the Montreal Canadiens)."}]}]
["iens",{"thoughts":"“iens” only shows up at the very end of a word. In modern French it is pronounced /jɛ̃/: start with the English “y” sound in “yes,” glide immediately into an open “eh” as in “bet,” then let the vowel resonate through your nose (nasal), and do NOT pronounce any final n- or s-sound. English has no nasal vowels, so students tend to drop the nasalization or add an extra n.","pattern":"iens","position":"End","description":"Pronounce it /jɛ̃/: a quick English “y” + a nasalized “eh.” Think “y”+“en” in “yen,” but don’t release the final n—let it fade through the nose. The s at the very end stays silent.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Canadiens","native":"Canadiens","position":"End","cultural_context":"NHL team Montreal Canadiens—often mentioned in sports media"},{"target":"Martiens","native":"Martiens","position":"End","cultural_context":"Means “Martians”—sci-fi references"},{"target":"Parisiens","native":"Parisiens","position":"End","cultural_context":"Refers to people from Paris—seen in travel articles"}]}]
["an",{"thoughts":"French “an” almost always creates the single nasal vowel /ɑ̃/. English has no exact match, but the closest impression is saying the “ah” in “cot” while letting air escape through the nose and keeping the tongue low and back. The lips stay slightly rounded and nothing like the English “an” in “man” (which has a clear n-sound at the end). Because it shows up in many loan-words (croissant, Jean-Luc, etc.), English speakers have probably heard it, but reproducing the nasal quality without adding a final n can be tricky.","pattern":"an","position":"Anywhere","description":"Pronounce it as one nasal vowel: start with an open back “ah” (as in British English ‘father’) and let the sound resonate through the nose. Do NOT finish with an audible ‘n’. The mouth stays open; think of humming an ‘ah’. If you pinch your nose mid-sound, it should stop—this tells you you’re using nasal airflow.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"croissant","native":"croissant","position":"End","cultural_context":"Famous buttery French pastry sold worldwide"},{"target":"Jean","native":"Jean","position":"End","cultural_context":"Common French first name; e.g., actor Jean Reno, Captain Jean-Luc Picard"},{"target":"orange","native":"orange","position":"Middle","cultural_context":"Same word for the fruit; often seen on juice labels"}]}]
["am",{"thoughts":"“am” is one of the spellings for the French nasal vowel /ɑ̃/ (when the m is final or before another consonant) but stays an ordinary “a” plus the consonant /m/ when another vowel follows. English has no exact nasal vowel, so learners often forget to keep the air flowing through the nose, or they pronounce an audible m-sound when there shouldn’t be one.","pattern":"am","position":"Anywhere","description":"Most of the time, am is pronounced as the single nasal vowel /ɑ̃/: open “ah” while letting air escape through the nose and without closing the lips into an m. If the m is followed by another vowel (ami, Madame), it is NOT nasal; pronounce an open “a” like the a in “father” followed by a normal m.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"champagne","native":"champagne","position":"Middle","cultural_context":"Sparkling wine used for celebrations"},{"target":"ambiance","native":"ambiance","position":"Beginning","cultural_context":"Word borrowed into English to mean mood or atmosphere"},{"target":"Madame","native":"Madame","position":"Middle","cultural_context":"Polite form of address for women, seen on restrooms and menus"}]}]
["en",{"thoughts":"French “en” is almost always pronounced as the nasal vowel /ɑ̃/ (roughly “ah” + a faint n, produced with air resonating in the nose). English has no exact equivalent, so learners tend to add a hard n or say a plain “ahn.” You must drop the n sound—keep the mouth open and let the soft palate lower so air flows through the nose.","pattern":"en","position":"Anywhere","description":"Usually a single nasal vowel /ɑ̃/: open your jaw as if saying the British “a” in “father,” but let some air escape through the nose and do NOT finish with an audible n. Before a vowel in the same word, the spelling “en” is pronounced /ɛn/ (regular e-plus-n), but that is much rarer in everyday loan-words.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"encore","native":"encore","position":"Beginning","cultural_context":"Borrowed into English to ask for an additional performance"},{"target":"ensemble","native":"ensemble","position":"Beginning","cultural_context":"Used in English for a coordinating set of clothes or a group of musicians"},{"target":"rendez-vous","native":"rendez-vous","position":"Middle","cultural_context":"Common loan-word meaning a meeting or date"},{"target":"entrepreneur","native":"entrepreneur","position":"Multiple","cultural_context":"Widely used in business English for someone who starts companies"}]}]
["em",{"thoughts":"“em” is one of those French spellings that can sound either like the English “ehm” in “hem” or like a nasalized “ahn” that English doesn’t really have.  The two big clues are: 1) If em is followed by another consonant (emb-, emp-, etc.) or ends the word, it is nasal /ɑ̃/ (no audible m). 2) If em is followed by a vowel, you do pronounce the m and it sounds close to English “hem.”  English speakers have heard both versions in loan-words and names, so the sound is semi-familiar, but the nasal version takes practice.","pattern":"em","position":"Anywhere","description":"Two main pronunciations: (a) Nasal vowel /ɑ̃/ (similar to saying “ah” while letting air leak through the nose) when em is before another consonant or at the end of a word—there’s no audible m. (b) Regular /ɛm/ (like the English word “hem”) when em is followed by a vowel.  Keep lips relaxed; for the nasal one, don’t close them for an m—let the vowel resonate through the nose.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"embargo","native":"embargo","position":"Beginning","cultural_context":"Same word in English for a trade ban; here the em is nasal (/ɑ̃/) before b"},{"target":"crème brûlée","native":"crème brûlée","position":"End","cultural_context":"Famous French dessert; em at the end is pronounced /ɛm/ like English “hem”"},{"target":"Emmanuel","native":"Emmanuel","position":"Beginning","cultural_context":"Given name of France’s current president, Emmanuel Macron; em before a vowel sounds /ɛm/"}]}]
["in",{"thoughts":"French “in” is almost always read as the nasal vowel /ɛ̃/, a sound English doesn’t really have. English speakers may have heard it in words like “vin” or the brand “Michelin.” If an extra vowel follows (as in “cuisine”) the vowel loses its nasal quality and you hear an ordinary /i/ plus an audible n. Showing both cases will help learners.","pattern":"in","position":"Anywhere","description":"Most of the time “in” is the nasal vowel /ɛ̃/: open your mouth a bit like for the “e” in English “bet,” lower the tongue slightly, then let the sound resonate partly through the nose—there is no actual n at the end. If another vowel comes right after the n, you keep it oral: /in/, like the “een” in English “machine,” and you pronounce the n.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"vin","native":"vin","position":"End","cultural_context":"Means “wine”; you see it in phrases like “vin rouge” on menus"},{"target":"cinq","native":"cinq","position":"Middle","cultural_context":"The number five, common in beginner French lessons"},{"target":"Michelin","native":"Michelin","position":"End","cultural_context":"Global tire company and famous restaurant guide"},{"target":"cuisine","native":"cuisine","position":"End","cultural_context":"Borrowed into English to mean a style of cooking; here the n is pronounced and not nasal"}]}]
["im",{"thoughts":"Two separate French pronunciations: (1) nasal vowel /ɛ̃/ when “im” is before another consonant (usually p, b, m) and the m itself is NOT pronounced; (2) regular oral /im/ when the m is doubled, followed by a vowel, or at the very end of the word.  English speakers know the spelling but often keep the English-style /ɪm/ and forget to nasalize when required.","pattern":"im","position":"Anywhere","description":"1. Nasal version – /ɛ̃/: Say the English “eh” as in “bed,” but drop the final d and let the sound resonate partly through your nose, keeping lips slightly open. Do NOT pronounce an m afterward. This happens when “im” is before another consonant (impossible, simple).\n2. Oral version – /im/: Just like the English word “eam” in “team,” with a clear m at the end. You get this when the m is doubled (immigration), followed by a vowel (imagine), or closes the word (crime).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"impossible","native":"impossible","position":"Beginning","cultural_context":"Same word in English – used to talk about something that can’t be done"},{"target":"simple","native":"simple","position":"Middle","cultural_context":"Same word in English – meaning easy or not complex"},{"target":"immigration","native":"immigration","position":"Beginning","cultural_context":"Same political and social term as in English"},{"target":"crime","native":"crime","position":"End","cultural_context":"Same word in English – refers to illegal activity"}]}]
["ain",{"thoughts":"French “ain” normally makes a single nasal vowel /ɛ̃/, something like the short ‘e’ in English “men” but pronounced while letting air resonate through the nose and without releasing a final n-sound. When it comes before another vowel (e.g. pain au…), the vowel usually loses the nasal quality and sounds closer to an open /ɛ/ plus a lightly pronounced n. English has no nasal vowels, so learners tend to either drop the nasal quality or pronounce a full n, but the mouth shape is otherwise familiar.","pattern":"ain","position":"Anywhere","description":"Usually pronounced as one nasal vowel /ɛ̃/: start like the English “eh” in “men,” lower the jaw slightly, then let the sound resonate through the nose and do NOT release an audible n. If a vowel follows (liaison), pronounce an open /ɛ/ + light n instead of nasalizing.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pain","native":"pain","position":"End","cultural_context":"‘Bread’—seen on bakery signs or in the phrase “pain au chocolat.”"},{"target":"pain au chocolat","native":"pain au chocolat","position":"Beginning","cultural_context":"Popular chocolate-filled pastry on café menus."},{"target":"Saint-Laurent","native":"Saint-Laurent","position":"Middle","cultural_context":"Famous fashion house and Paris metro stop (Yves Saint Laurent)."},{"target":"bain-marie","native":"bain-marie","position":"End","cultural_context":"Culinary term for a hot-water bath used in cooking and baking."}]}]
["aim",{"thoughts":"“aim” can give English learners two different French sounds. 1️⃣  When the letters a-i-m are followed by another vowel (aimer, Aimé, j’aime) the group is NOT nasal – you pronounce the m clearly and the ai is an “eh” sound. 2️⃣  When a-i-m is at the end of a word or before another consonant (faim) the m and the preceding vowel fuse into the nasal vowel /ɛ̃/, a sound English doesn’t have in normal words.","pattern":"aim","position":"Anywhere","description":"Two possibilities:\n• Non-nasal: If “aim” is followed by a vowel, say “eh” as in English “bet”, then a clear m: /ɛm/ (j’aime /ʒɛm/).\n• Nasal: If “aim” ends the word or is before another consonant, make the front “eh” vowel while letting air escape through your nose and do NOT finish with an audible m: /ɛ̃/ (faim /fɛ̃/). Think of starting to say “end” but stop before the n forms, all while humming through your nose.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"j'aime","native":"I like / I love","position":"Middle","cultural_context":"The phrase “je t’aime” appears in countless songs and movies"},{"target":"Aimé","native":"Aimé (given name; means “beloved”)","position":"Beginning","cultural_context":"Seen in the fashion brand “Aimé Leon Dore” and in French names like Aimé Césaire"},{"target":"faim","native":"hunger","position":"End","cultural_context":"Used in the textbook phrase “j’ai faim” (“I’m hungry”) in beginner French"}]}]
["ein",{"thoughts":"“ein” spells the French nasal vowel /ɛ̃/. It can occur anywhere in a word, so I mark overall position as “Anywhere.” English has no true nasal vowels, so learners must learn to let the air resonate in the nose while keeping the mouth in the open-“eh” position. The most accessible French words with the exact letters e-i-n are “Seine,” “plein,” and “peinture.” These are reasonably familiar to many English speakers through geography, art terms, or museum labels.","pattern":"ein","position":"Anywhere","description":"Pronounced as the nasal vowel /ɛ̃/: start with an English “eh” as in “bet,” but lower the jaw slightly and let air escape through the nose without adding an ending n sound. Do NOT pronounce a hard n; the n just makes the preceding vowel nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Seine","native":"Seine","position":"Middle","cultural_context":"River that flows through Paris, often mentioned in travel shows and books"},{"target":"plein","native":"plein","position":"End","cultural_context":"Heard in the art phrase “en plein air,” meaning painting outdoors"},{"target":"peinture","native":"peinture","position":"Middle","cultural_context":"French word for painting—commonly seen on museum placards and art discussions"}]}]
["eim",{"thoughts":"The spelling “e i m” is rare but when it does occur in French it works just like the more common spellings “ain/aim/ein/in” : it signals the nasal vowel /ɛ̃/. English has no nasal vowels, but learners usually meet this sound in words like “vin” or “pain,” so it won’t be totally new, just written in an unexpected way.","pattern":"eim","position":"Anywhere","description":"eim is pronounced as the nasal vowel /ɛ̃/: start with the English short “e” in “bet,” then lower your soft palate so air also escapes through your nose, and don’t let your lips close for an m-sound—the m just tells you to nasalize the vowel. It never sounds like an actual “m” unless another vowel follows.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Reims","native":"Reims","position":"Middle","cultural_context":"Well-known Champagne city; heard in travel shows and WWII history"}]}]
["on",{"thoughts":"“on” represents the nasal vowel /ɔ̃/. English has no true nasal vowels, so learners must remember not to release an audible n at the end.","pattern":"on","position":"Anywhere","description":"Pronounced as one nasal vowel, roughly like the vowel in British “aw” (lawn) but with air also flowing through the nose and with NO n-sound after it. Round your lips, lower the soft palate, and cut the vowel off cleanly.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"bonjour","native":"bonjour","position":"Middle","cultural_context":"French word for “hello,” heard in movies and travel"},{"target":"bon appétit","native":"bon appétit","position":"End","cultural_context":"Common cooking-show phrase meaning “enjoy your meal”"},{"target":"macaron","native":"macaron","position":"End","cultural_context":"Trendy French almond cookie sold in many bakeries"},{"target":"Montréal","native":"Montréal","position":"Beginning","cultural_context":"Well-known Canadian city, often anglicized as Montreal"}]}]
["om",{"thoughts":"“om” is common in French; it can either stay a normal o-plus-m sound (when another vowel follows the m) or turn into the nasal vowel /ɔ̃/ (similar to the o in “song” but without the g) when the m is followed by another consonant or nothing at all. English speakers have heard both versions in food, fashion and brand names, so the sound is familiar, but the nasal version still needs practice.","pattern":"om","position":"Anywhere","description":"Two possibilities:\n1) Nasal /ɔ̃/: the lips start to round as for a short open “aw” (as in British “cot”), while air escapes partly through the nose and the m itself is NOT pronounced. This happens when “om” is at the end of a syllable or before another consonant (nom, ombré, Dom).\n2) Non-nasal /ɔm/: a plain o sound plus a clear m, just like the English word “om”, when the m is followed by a written vowel (omelette, homme).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"omelette","native":"omelette","position":"Beginning","cultural_context":"Classic French egg dish found on breakfast menus everywhere"},{"target":"nom","native":"nom","position":"End","cultural_context":"Seen in the phrase “nom de plume” meaning pen name"},{"target":"homme","native":"homme (man)","position":"Middle","cultural_context":"Used in fragrance names like “YSL L’Homme”"},{"target":"ombré","native":"ombré","position":"Beginning","cultural_context":"Popular hair-coloring technique and fashion term"}]}]
["un",{"thoughts":"French “un” is usually read as the nasal vowel /œ̃/—your mouth starts to make an English “uh” but, before you fully voice it, you let the sound resonate up behind the nose while keeping lips loosely rounded. No actual n-sound is released; the tongue stays low. It can occur at the start, middle, or end of a word whenever the letters u n are followed by a consonant or are word-final.","pattern":"un","position":"Anywhere","description":"Pronounce it as a nasalized, slightly rounded “uh,” similar to the vowel in English “sun” but with the airflow also passing through the nose and without finishing with an /n/. Keep the mouth relaxed and don’t close the lips or tongue for an n.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"un","native":"un","position":"Beginning","cultural_context":"Basic French word for “a/one,” seen in phrases like “un café”"},{"target":"Lundi","native":"lundi","position":"Beginning","cultural_context":"French word for Monday—often printed on bilingual calendars or schedules"},{"target":"jungle","native":"jungle","position":"Middle","cultural_context":"Same spelling as English “jungle”; title of the famous book “Le Livre de la jungle” (The Jungle Book)"},{"target":"punch","native":"punch","position":"Middle","cultural_context":"Word for a mixed drink; appears on French cocktail menus and is cognate with English “punch”"}]}]
["um",{"thoughts":"French “um” flips between two very different pronunciations. 1) In many everyday French words (parfum, humble) the letters signal a nasal vowel—no audible m. 2) In scholarly/Latin loan-words (maximum, forum) the vowel is an open “aw” sound followed by an audible m. English speakers know the words but not the sound rules, so they often pronounce the m when it should be silent or use the wrong vowel quality.","pattern":"um","position":"Anywhere","description":"Two main options:\n• Nasal /œ̃/ (close to the French sound in “un”). Lips start to round for an English “uh”, then lower the velum so air leaks through the nose; do NOT voice an m. Happens before b/p/m or at word-end in many native French words.\n• Oral /ɔm/ (like British “o” in “lot” + m) in learned Latin words such as maximum, forum. Here the m is fully pronounced.\nRemember: if the word looks Latin or scientific, say /ɔm/; otherwise suspect the silent-m nasal.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"humble","native":"humble","position":"Middle","cultural_context":"Same spelling in English; adjective meaning modest"},{"target":"parfum","native":"parfum","position":"End","cultural_context":"Seen on perfume bottles as part of “eau de parfum”"},{"target":"maximum","native":"maximum","position":"End","cultural_context":"Math/science term identical to English word"}]}]
["yn",{"thoughts":"“yn” is written exactly like the English letters y-n, but in French it works as one unit: it creates the nasal vowel /ɛ̃/ (the same sound you hear in French “vin” or “pain”). English has no true nasal vowels, so learners must say an “eh” sound while letting the air resonate in the nose and cutting the tongue off before an audible n is released.","pattern":"yn","position":"Anywhere","description":"Pronounced as the nasal vowel /ɛ̃/: start with an English “eh” (as in “set”), then let the sound vibrate in your nose and stop before letting the tongue finish an n. Do NOT pronounce a separate y or n.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"syndrome","native":"syndrome","position":"Beginning","cultural_context":"Same medical term used in English"},{"target":"dynamite","native":"dynamite","position":"Beginning","cultural_context":"Famous explosive; word exists in English"},{"target":"lynx","native":"lynx","position":"Middle","cultural_context":"Wild cat species; spelling is identical in English"},{"target":"synthèse","native":"synthèse","position":"Beginning","cultural_context":"Academic word related to “synthesis,” recognizable to English speakers"}]}]
["ym",{"thoughts":"In French, the sequence “ym” almost always signals the nasal vowel /ɛ̃/, the same sound heard in in/yn/ain/ien. English has no nasal vowels, so learners tend to let air escape only through the mouth; they must relax the jaw, raise the back of the tongue toward the soft palate, and let some air flow out the nose while keeping the lips parted. If another vowel follows the m, the sound is no longer nasal: you pronounce /im/ + vowel instead. This second case is rare in common words.","pattern":"ym","position":"Anywhere","description":"Most of the time “ym” = the nasal vowel /ɛ̃/ (something like the vowel in French “vin”) followed by no audible m. If a vowel immediately follows, pronounce /im/ plus that vowel (no nasalization).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"symbole","native":"symbol","position":"Middle","cultural_context":"Almost identical to English “symbol” – familiar term in art, math, etc."},{"target":"sympa","native":"nice; friendly","position":"Middle","cultural_context":"Common casual word you may see in social media or heard in movies meaning “nice/cool”"},{"target":"sympathique","native":"nice; pleasant","position":"Middle","cultural_context":"Looks like English “sympathetic,” appears in travel guides and subtitles"}]}]
["oin",{"thoughts":"“oin” is one of French’s nasal vowel groups. English has no true nasal vowels, so the sound will feel new. It is written o-i-n but is pronounced as a single nasal vowel that glides from an “w”-like start to a nasalized “eh” ([wɛ̃]). You do not pronounce the n; instead let air resonate in your nose while your mouth moves as if saying the English word “when”, but keep it very short and nasal, starting with rounded lips.","pattern":"oin","position":"Anywhere","description":"Pronounce it as one nasal vowel [wɛ̃]: start with lips rounded as if saying “w” then quickly open toward a short “eh”, letting sound escape through the nose. There is no separate n sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"pointe","native":"pointe","position":"Middle","cultural_context":"Ballet term (as in “en pointe”) familiar from dance and pop culture"},{"target":"Antoine","native":"Antoine","position":"Middle","cultural_context":"First name of Antoine de Saint-Exupéry, author of “The Little Prince”"},{"target":"Poincaré","native":"Poincaré","position":"Middle","cultural_context":"Surname of famous mathematician/physicist Henri Poincaré"},{"target":"coin","native":"coin","position":"End","cultural_context":"Spelled like the English word “coin”; means “corner” in French"}]}]
["oin",{"thoughts":"French “oin” is always pronounced /wɛ̃/: first a quick English-style w-glide, then a nasal version of the vowel in “bet,” with no audible n at the end. English has no direct match, so learners must master both the nasal airflow and dropping the final n.","pattern":"oin","position":"End","description":"Start with a brief w-sound, then move into an ‘eh’ vowel while letting air resonate through the nose. Keep the vowel short, rounded, and do NOT say an n afterward.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"coin","native":"corner","position":"End","cultural_context":"Spelled like English “coin” (money); seen on bilingual signs and basic vocab lists"},{"target":"loin","native":"far","position":"End","cultural_context":"Looks like the English cut of meat “loin”; common in the phrase “loin de” (“far from”)"},{"target":"besoin","native":"need","position":"End","cultural_context":"Part of the beginner phrase “j’ai besoin de…” (“I need…”)"}]}]
["ent",{"thoughts":"English speakers already meet the letters “ent”, but in French the ending behaves very differently: it is either completely silent (verb ending) or turns into the nasal vowel /ɑ̃/. That nasal vowel has no final n-sound, which can surprise learners. The silent version is conceptually easy (just don’t say it), but remembering when it is silent vs. nasal and actually producing a clean French nasal vowel is moderately challenging.","pattern":"ent","position":"End","description":"At the very end of a French word, -ent is usually NOT pronounced the way it looks:\n1. In 3rd-person plural verb forms (ils parlent, ils prennent), the letters are totally silent – you jump straight from the preceding consonant or vowel to the final pause.\n2. In nouns, adjectives, names, etc., -ent is pronounced as the nasal vowel /ɑ̃/ – roughly like an English “ah” said while the back of your tongue is lowered and air also escapes through the nose; do not add an audible n or t.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"agent","native":"agent","position":"End","cultural_context":"Same word as English “agent” – e.g., secret agent"},{"target":"Vincent","native":"Vincent","position":"End","cultural_context":"Famous given name (Vincent van Gogh, actor Vincent Price)"},{"target":"comment","native":"comment","position":"End","cultural_context":"English speakers know the word “comment” on websites; in French it means “how/what”"}]}]
["e",{"thoughts":"Final “e” in French is the well-known “silent e.” English already has a silent e, so the concept is familiar; the difference is that French never turns it into an /ei/ sound or lengthens the vowel—it’s simply dropped. English speakers’ main trap is to give it a full vowel (e.g., “bag-ETT-ee”). Once they remember to end on the last consonant, the sound is easy.","pattern":"e","position":"End","description":"A single, unaccented “e” at the very end of a French word is normally silent. You stop after the last pronounced consonant (ba-“gett,” fro-“mahj”). In slow, formal speech or singing it can surface as a very short, relaxed schwa /ə/, but in everyday conversation you don’t voice it at all.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"baguette","native":"baguette","position":"End","cultural_context":"Iconic long French bread sold worldwide"},{"target":"fromage","native":"fromage","position":"End","cultural_context":"French word for cheese—seen on ‘cheese & charcuterie’ menus"},{"target":"Madame","native":"Madame","position":"End","cultural_context":"Common French title equivalent to “Mrs.” or polite “ma’am”"},{"target":"table","native":"table","position":"End","cultural_context":"Same spelling as English ‘table’; used in beginner French classes"}]}]
["es",{"thoughts":"Final “-es” in French is either totally silent or sounds like a pure “ay” (/e/). English speakers already meet it in names like “Cannes” and articles like “les”. Remember: you never pronounce the final S.","pattern":"es","position":"End","description":"At the very end of a word, ‑es usually drops away completely; you finish on the consonant right before it (Cannes → “kan”). When the whole word is just three letters (les, des, mes, etc.) you do pronounce the vowel as the tight French /e/—similar to the English word “say” without the Y glide—but the S is still silent.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Cannes","native":"Cannes","position":"End","cultural_context":"Famous French Riviera city with its international film festival"},{"target":"les","native":"les","position":"End","cultural_context":"Plural article heard in the title “Les Misérables”"},{"target":"des","native":"des","position":"End","cultural_context":"Common French word meaning “some”, shows up in menus like “salade des fruits”"}]}]
["s",{"thoughts":"English speakers already know the letter “s”, but in French its behavior at the END of a word is unpredictable: often silent, sometimes /s/, and in liaison it can even sound like /z/. They need to un-learn the reflex of always pronouncing it.","pattern":"s","position":"End","description":"At the very end of a French word, a single “s” is USUALLY silent (Paris → “pa-REE”). In some short words or borrowed terms it keeps the unvoiced English /s/ sound (très, bus). When the next word starts with a vowel, the normally silent “s” can link and become the voiced /z/ (vous avez → /vu-za-vé/). So: final s = silent, /s/, or liaison /z/. Same mouth shape as English “s” or “z”, just remember when to drop it.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Paris","native":"Paris","position":"End","cultural_context":"World-famous capital city"},{"target":"très","native":"très","position":"End","cultural_context":"Seen in the fashion phrase “très chic” meaning “very”"},{"target":"bus","native":"bus","position":"End","cultural_context":"Same word for public transport vehicle"},{"target":"vous","native":"vous","position":"End","cultural_context":"Formal “you” in the common phrase “s’il vous plaît”"}]}]
["x",{"thoughts":"Final x in French is usually silent, but in a handful of short words—mostly the numbers six and dix—it is pronounced like an un-voiced English “s.” In liaison before a following vowel it can become a “z” sound, but learners first meet it as either silent or /s/. English speakers are used to silent final letters (e.g., ‘ballet’) but may over-pronounce x because of the English habit of saying /ks/.","pattern":"x","position":"End","description":"At the end of most French words, the letter x is NOT pronounced at all (e.g., Bordeaux → bor-DOH). In a few very short words, mainly the numbers six and dix, it is pronounced like the English “s” in “see” (/sis/ or /dis/). If the next word begins with a vowel, this /s/ can change to a soft “z.” Importantly, you never say the English /ks/ sound at the end of a French word.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bordeaux","native":"Bordeaux","position":"End","cultural_context":"Famous French wine and city; name seen on wine labels"},{"target":"deux","native":"deux (two)","position":"End","cultural_context":"French word for the number two, often heard in phrases like “Tour de France – étape deux”"},{"target":"six","native":"six (six)","position":"End","cultural_context":"French word for the number six; spelling matches English “six”"},{"target":"dix","native":"dix (ten)","position":"End","cultural_context":"French word for the number ten; appears on French clocks and in media titles"}]}]
["t",{"thoughts":"English speakers usually pronounce every written final “t,” but French usually drops it unless the word is very short or clearly borrowed from English/tech terms. Learners must learn to ignore the written t most of the time yet keep it in a few common exceptions such as “internet.”","pattern":"t","position":"End","description":"At the end of a French word, “t” is normally silent (you stop your voice but do not release a burst of air). Think of the final sound in French “ballet” – you do NOT hear a /t/. A pronounced final t only shows up in a handful of brief function-words (est, ouest, huit) or obvious modern loans like “internet,” where it sounds like the normal English /t/. So your default rule: don’t say the t unless you are sure the word is an exception.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ballet","native":"ballet","position":"End","cultural_context":"Classical dance form; same word is used in English"},{"target":"cabaret","native":"cabaret","position":"End","cultural_context":"Night-club style entertainment; English borrows the term"},{"target":"internet","native":"internet","position":"End","cultural_context":"The Internet – global computer network, same word in English"}]}]
["d",{"thoughts":"Final ‑d is one of those French letters that often exists only on paper. Most of the time you do NOTHING with it, but in a handful of very short words you pronounce it just like the normal English /d/. Learners mainly have to remember when to stay silent.","pattern":"d","position":"End","description":"At the end of a French word the letter d is usually silent (you stop on the preceding vowel or nasal sound). Think of it as the English word “cold” but you simply don’t release the final /d/. A few short words—especially “sud” and some proper names like “David”—do pronounce a clear, soft English-style /d/. If the next word starts with a vowel and a liaison is required, the silent d turns into a /t/ sound, but in everyday isolated words you can ignore it.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"froid","native":"froid","position":"End","cultural_context":"Means “cold”; shows up on menus (“boisson froide”) and in weather reports"},{"target":"chaud","native":"chaud","position":"End","cultural_context":"Means “hot”; English speakers meet it in “vin chaud” (mulled wine) or “pain au chocolat chaud”"},{"target":"sud","native":"sud","position":"End","cultural_context":"Means “south”; appears in phrases like “Sud de France” or news about the French Riviera"},{"target":"David","native":"David","position":"End","cultural_context":"Common first name; pronounced with the final /d/ in French as in English"}]}]
["p",{"thoughts":"Final -p in French is usually silent, but some short or borrowed words do pronounce it. The sound itself is the same un-aspirated /p/ an English speaker already knows; the challenge is remembering when not to say it.","pattern":"p","position":"End","description":"At the very end of a French word, the letter p is most often mute, e.g. coup → /ku/. When it IS pronounced (mainly in short words or English borrowings like stop), it’s the same un-aspirated p you hear in the English word “spin” (no puff of air). So: hear it in stop, ignore it in coup.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"coup","native":"coup","position":"End","cultural_context":"You meet it in news phrases like “coup d’état” for a political overthrow"},{"target":"trop","native":"trop","position":"End","cultural_context":"Common slang in phrases like “trop cool” (‘so cool’) seen on social media and T-shirts"},{"target":"stop","native":"stop","position":"End","cultural_context":"French road signs literally read “STOP”; same word as in English and the final p is pronounced"}]}]
["g",{"thoughts":"Final ‑g is one of those letters English speakers ‘see but rarely hear’ in French.  In most native French words (long, sang) the g itself disappears; the preceding n simply becomes the velar nasal /ŋ/, so the result sounds a lot like the “ng” in English song.  In more recent borrowings from English (blog, tag, ping-pong) French keeps the hard g /g/ you already know.  Learners therefore have to decide: older words = no audible g; recent loan-words = pronounce the hard g.","pattern":"g","position":"End","description":"At the very end of a word, g is usually silent; the n before it turns into the nasal /ŋ/, giving a sound like the ng in English “song.”  In modern loan-words and abbreviations, the final g is pronounced as a hard g /g/, identical to the g in English “dog.”  So: native word → no burst of g; imported or trendy word → pronounce the hard g.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"long","native":"long","position":"End","cultural_context":"Spelled the same as English “long”; used in phrases like “week-end long”"},{"target":"blog","native":"blog","position":"End","cultural_context":"Same word as in English for an online journal"},{"target":"ping-pong","native":"ping-pong","position":"Multiple","cultural_context":"Table-tennis game; borrowed intact from English"}]}]
["z",{"thoughts":"French words that end in the letter “z” are usually pronounced in one of two ways: (1) the final z is completely silent, or (2) it is pronounced as the voiced English z sound /z/.  English speakers already know the /z/ sound, but they have to remember that very often the written z simply disappears in French.  Well-known loan-words like “jazz” and basic function words like “chez” conveniently illustrate both cases.","pattern":"z","position":"End","description":"Most French words ending in “z” drop the consonant entirely (chez = /ʃe/).  When the z is pronounced, it is the same voiced z sound as in English “zoo” (gaz = /gaz/, jazz = /ʒaz/).  No aspiration or vowel change—just a clean /z/ or nothing at all.  Knowing whether to pronounce it comes down to memorizing the individual word; the silent pattern is more common.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"chez","native":"chez","position":"End","cultural_context":"Seen in restaurant names like “Chez Pierre”; means “at the house of”"},{"target":"gaz","native":"gaz","position":"End","cultural_context":"French spelling of “gas,” seen on stove knobs and in science contexts"},{"target":"jazz","native":"jazz","position":"End","cultural_context":"Same word as in English for the music style; keeps the /z/ sound"}]}]
["ps",{"thoughts":"English speakers see “ps-” in words like “psychology” but usually drop the p. In French, the p is actually pronounced, so learners must get used to starting a word with the consonant cluster /ps/. The cluster never changes: both consonants are said quickly with no vowel between.","pattern":"ps","position":"Beginning","description":"In French, the letters p + s at the very start of a word are both pronounced: a short, unaspirated /p/ released straight into /s/ (like the end of the English word “lips,” but moved to the front of the word). Do NOT silence the p as in English “psychology.” Close the lips for /p/, then let air pass immediately for /s/ without inserting a vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"psychologie","native":"psychologie","position":"Beginning","cultural_context":"Almost identical to English “psychology,” a common academic subject"},{"target":"pseudo","native":"pseudo","position":"Beginning","cultural_context":"Used in English too, meaning “fake” or “false”"},{"target":"psy","native":"psy","position":"Beginning","cultural_context":"French short form for psychologist/psychiatrist; appears in news and pop culture"},{"target":"psoriasis","native":"psoriasis","position":"Beginning","cultural_context":"Medical term for a common skin condition, same word in English"}]}]
["pt",{"thoughts":"Initial ‘pt-’ in French keeps BOTH consonants, unlike English where the p is silent. English speakers therefore have to learn to release a very quick /p/ immediately followed by /t/ with no vowel in between.","pattern":"pt","position":"Beginning","description":"Say a light /p/ and /t/ back-to-back with no vowel break: lips pop open for /p/, tongue tip touches the ridge right after for /t/. It feels a bit like starting to say “apt” but without the leading vowel. English usually drops the /p/ in similar Greek words (pterodactyl), so remember that French doesn’t.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Ptérodactyle","native":"pterodactyl","position":"Beginning","cultural_context":"Famous flying dinosaur mentioned in movies and museums"},{"target":"Ptolémée","native":"Ptolemy","position":"Beginning","cultural_context":"Ancient astronomer/cartographer often cited in history of science"}]}]
["gn",{"thoughts":"French “gn” at the very start of a word is always the single palatal-nasal sound /ɲ/, the same consonant written “ñ” in Spanish. English has the mouth movement only inside words (ca-nyon, o-ni-on), never at the beginning, so the placement feels unusual.","pattern":"gn","position":"Beginning","description":"Say an English “n” while the middle of your tongue is pressed high against the hard palate, as if you were starting the word “nyah.” There is no separate “g” sound—just one smooth, buzzing nasal consonant like Spanish “ñ.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"gnome","native":"gnome","position":"Beginning","cultural_context":"Fairy-tale garden figure; same written word in English"},{"target":"gnu","native":"gnu","position":"Beginning","cultural_context":"Name of the African antelope (and the famous software license)"},{"target":"gnocchi","native":"gnocchi","position":"Beginning","cultural_context":"Well-known Italian potato dumplings sold in supermarkets"}]}]
