["가끔",{"thoughts":"The Korean term '가끔' is an adverb commonly used to describe frequency of actions or events. It's important for learners to understand how it fits into sentences to describe how often something occurs.","target_language_multi_word_term":"가끔","meaning":"'sometimes' or 'occasionally'.","additional_notes":"가끔 is an adverb used to indicate that something happens from time to time or not regularly. It is placed before the verb it describes.","target_language_example":"나는 가끔 커피를 마십니다.","native_language_example":"I sometimes drink coffee."}]
["가지고 있다",{"thoughts":"The phrase '가지고 있다' is used to express possession or ownership of something and is common in everyday Korean language.","target_language_multi_word_term":"가지고 있다","meaning":"to have or possess","additional_notes":"'가지고 있다' combines the verb '가지다' (to have) with '있다' (to be/to exist), often used in both formal and informal contexts for possession.","target_language_example":"그는 좋은 카메라를 가지고 있다.","native_language_example":"He has a good camera."}]
["같은",{"thoughts":"'같은' is the attributive adjective form of '같다', meaning 'same as' or 'like'. It's often used to compare or express similarities between items.","target_language_multi_word_term":"같은","meaning":"'same', 'like', or 'such as'.","additional_notes":"'같은' is commonly used to describe things that are similar in nature, kind, or appearance. It is often part of phrases that compare or indicate similarity.","target_language_example":"나는 그녀와 같은 책을 읽고 있어요.","native_language_example":"I am reading the same book as her."}]
["같이",{"thoughts":"The Korean word '같이' is often used to mean 'together' or 'with'. It's useful for beginners to understand contexts of doing things with others.","target_language_multi_word_term":"같이","meaning":"Together, with.","additional_notes":"In Korean, '같이' is typically used to describe actions done with other people. It is commonly used in everyday conversations to suggest doing activities together or to indicate accompaniment.","target_language_example":"우리는 같이 영화를 봐요.","native_language_example":"We watch a movie together."}]
["거의",{"thoughts":"'거의' is a Korean adverb that signifies approximation, often used to indicate something that is nearly or almost completed or reached.","target_language_multi_word_term":"거의","meaning":"'almost' or 'nearly'.","additional_notes":"Used to express that something is close to a certain state or quantity but not quite there. It is often used with verbs to modify their meaning.","target_language_example":"그는 거의 다 왔어요.","native_language_example":"He is almost here."}]
["것 같다",{"thoughts":"것 같다 is a Korean expression used for making assumptions or guesses. It often follows a verb or adjective stem and implies that the speaker is not entirely certain but has a feeling or guess about something.","target_language_multi_word_term":"것 같다","meaning":"'It seems that' or 'I think'.","additional_notes":"Used to express uncertainty or a tentative conclusion. The expression can follow verbs, adjectives, or copulas to convey the speaker's hypothesis or opinion on an observed situation.","target_language_example":"비가 올 것 같아요.","native_language_example":"It seems like it will rain."}]
["것이다",{"thoughts":"'것이다' is a frequently used Korean phrase that is used to express a fact or assertion and can often imply a future tense or intention.","target_language_multi_word_term":"것이다","meaning":"is/am/are (a fact or intention).","additional_notes":"'것이다' is commonly used to indicate a statement of fact or an intention. It can also be used to give an explanation or reason for something. It's often seen in written Korean, such as in essays or formal situations, but is also used in spoken language to emphasize something.","target_language_example":"내일 우리는 산에 갈 것이다.","native_language_example":"Tomorrow, we are going to the mountain."}]
["계속",{"thoughts":"The Korean term '계속' is often used to express continuity or to indicate that something is continuing without interruption. It is similar to the English words 'continuously', 'continually', 'constantly', or 'still'.","target_language_multi_word_term":"계속","meaning":"continuously, constantly, still.","additional_notes":"'계속' is used to describe an ongoing action or state. It can be used when discussing habits, processes, or situations that do not stop or change over time.","target_language_example":"비가 계속 내리고 있어요.","native_language_example":"It is continuously raining."}]
["곧",{"thoughts":"The Korean term '곧' is a versatile word that is frequently used in conversations to indicate something that is imminent or about to happen shortly. It helps learners grasp the nuance of time, enriching their communication skills by understanding how to express soon-to-occur events.","target_language_multi_word_term":"곧","meaning":"soon or shortly.","additional_notes":"Used when referring to something expected to happen in the near future. It can also imply promptness or immediacy, like \"right away.\"","target_language_example":"밥이 곧 준비될 거예요.","native_language_example":"The meal will be ready soon."}]
["그런",{"thoughts":"The Korean term '그런' is often used as a demonstrative adjective to describe a situation, object, or condition that is similar or of a certain type, often referring to something that was mentioned before.","target_language_multi_word_term":"그런","meaning":"'such', 'that kind of'.","additional_notes":"It is used to refer to a category or type based on a previous context or conversation, similar to saying 'such a thing' or 'that kind of situation'.","target_language_example":"나는 그런 영화를 좋아해요.","native_language_example":"I like movies like that."}]
["그렇게",{"thoughts":"The term '그렇게' is often used in Korean to describe the manner or approach to something, typically translating to 'like that' or 'in that way'. It is a useful term for emphasizing a way of doing things or referring back to a previous statement.","target_language_multi_word_term":"그렇게","meaning":"'like that' or 'in that way'.","additional_notes":"It's used to describe a method, manner, or idea that has already been mentioned or is understood from context. Can refer to actions, behaviors, or characteristics and is often combined with verbs to indicate doing something 'like that'.","target_language_example":"그렇게 말하지 마세요.","native_language_example":"Don't say it like that."}]
["꼭",{"thoughts":"The term '꼭' is an adverb in Korean often used to express certainty, necessity, or emphasis similar to 'definitely' or 'surely' in English. It's an important word for beginners as it frequently appears in daily conversations.","target_language_multi_word_term":"꼭","meaning":"definitely, certainly, for sure.","additional_notes":"Often used to emphasize the necessity or certainty of an action or statement. It can be used to affirm an intention or obligation.","target_language_example":"내일 꼭 전화해 주세요.","native_language_example":"Please make sure to call me tomorrow."}]
["꽤",{"thoughts":"'꽤' is a Korean adverb used to describe something to a considerable degree. It's useful for beginners to express levels of intensity or assurance in casual conversations.","target_language_multi_word_term":"꽤","meaning":"'quite', 'fairly', or 'rather'.","additional_notes":"Used to indicate a higher degree of something than expected, often in a positive sense. Commonly used in informal situations. It can modify adjectives and verbs to amplify their meaning.","target_language_example":"이 음식은 꽤 맛있어요.","native_language_example":"This food is quite tasty."}]
["나중에",{"thoughts":"The term '나중에' is used to refer to a later point in time, which can be useful for beginner learners to understand timing in conversations.","target_language_multi_word_term":"나중에","meaning":"'later' or 'at a later time'.","additional_notes":"Often used to indicate postponement or a future action or event. Can be used in casual conversations to suggest doing something after the current moment.","target_language_example":"나중에 만나요.","native_language_example":"See you later."}]
["내 것이다",{"thoughts":"'내 것이다' is a Korean phrase used to indicate possession or ownership. It translates directly to 'it's mine' and is useful for expressing that something belongs to the speaker.","target_language_multi_word_term":"내 것이다","meaning":"'it's mine'.","additional_notes":"Use this phrase to assert ownership over an object or when stating that something belongs to you. The word '내' means 'my' and '것이다' is a formal way to say 'is'.","target_language_example":"이 책은 내 것이다.","native_language_example":"This book is mine."}]
["내일",{"thoughts":"The term '내일' is a common word used in Korean to refer to the day after the current one. Beginners learning Korean will frequently encounter this word when discussing schedules, plans, or daily activities. It is fundamental vocabulary that is relevant to everyday conversation.","target_language_multi_word_term":"내일","meaning":"'tomorrow'.","additional_notes":"Commonly used in everyday conversation to discuss future plans or events. It indicates the day following today.","target_language_example":"내일 학교에 가요.","native_language_example":"I'm going to school tomorrow."}]
["너무",{"thoughts":"'너무' is an adverb in Korean that is commonly used to express the degree or intensity of a situation or emotion. Although it often translates to 'too,' it is not always negative in Korean as it can also emphasize positive feelings or amounts.","target_language_multi_word_term":"너무","meaning":"'too' or 'very'.","additional_notes":"In Korean, 너무 can mean both 'too much' (negative connotation) or simply 'very' (positive connotation) depending on the context. It's widely used in daily conversation to express strong feelings or extreme degrees.","target_language_example":"너무 맛있어요.","native_language_example":"It's very delicious."}]
["누구",{"thoughts":"The Korean term '누구' is a common question word used to ask about a person or people. It translates to 'who' and is essential for basic conversational questions.","target_language_multi_word_term":"누구","meaning":"'who'.","additional_notes":"Used to ask about someone's identity or to inquire about which person did or will do something. It's commonly used in questions.","target_language_example":"누구예요?","native_language_example":"Who is it?"}]
["누구나",{"thoughts":"The Korean term '누구나' is used to refer to 'anyone' or 'everyone', often in a context that implies inclusivity or universality.","target_language_multi_word_term":"누구나","meaning":"'anyone' or 'everyone'.","additional_notes":"This term is used to express that something applies to all people without exception. It's commonly used to emphasize inclusivity.","target_language_example":"누구나 이 프로그램을 사용할 수 있습니다.","native_language_example":"Anyone can use this program."}]
["다",{"thoughts":"The word '다' is a common Korean adverb meaning 'all', 'everything', or 'completely'. It is used to indicate completeness or entirety.","target_language_multi_word_term":"다","meaning":"'all' or 'everything'.","additional_notes":"Often used to signify that something or someone has been completely considered or included. It is a versatile term that can be used in various contexts.","target_language_example":"그들은 다 왔어요.","native_language_example":"They all came."}]
["다른",{"thoughts":"The term '다른' means 'different' or 'another' and it is commonly used to describe something that is not the same as something else, or to refer to an additional item or person. Beginner learners would find it useful when distinguishing objects or making choices.","target_language_multi_word_term":"다른","meaning":"'different' or 'another'.","additional_notes":"Used to describe something that is not the same as something already mentioned or something additional.","target_language_example":"다른 색깔을 원해요.","native_language_example":"I want a different color."}]
["다시",{"thoughts":"The word '다시' is a useful adverb in Korean that learners often encounter. It is similar to saying 'again' or 'anew' in English, commonly utilized when repeating actions or revisiting topics. Beginner learners will often find it useful in conversational contexts where actions are repeated or revisited.","target_language_multi_word_term":"다시","meaning":"'again' or 'once more.'","additional_notes":"'다시' is frequently used when you want to redo something or try something again. It can also imply retrying, revisiting a situation, or executing an action anew.","target_language_example":"다시 해봐요.","native_language_example":"Try it again."}]
["다시 한 번",{"thoughts":"The phrase '다시 한 번' is commonly used in Korean to request repetition or to emphasize doing something again. It translates directly to 'one more time' or 'again'. This is useful for beginners who need things repeated for practice or understanding. It's often heard in classrooms or casual settings when someone needs clarification or a second chance.","target_language_multi_word_term":"다시 한 번","meaning":"'once more' or 'again'.","additional_notes":"Can be used to politely ask someone to repeat themselves or to indicate a repeat action. It's applicable in various contexts, from casual conversations to formal settings.","target_language_example":"죄송하지만, 다시 한 번 말씀해 주세요.","native_language_example":"Sorry, but could you please say that one more time?"}]
["당장",{"thoughts":"The Korean term '당장' is used to express immediacy or urgency, equivalent to 'right now' or 'immediately' in English. It is often used when someone wants something to be done with no delay.","target_language_multi_word_term":"당장","meaning":"'right now' or 'immediately'.","additional_notes":"This term emphasizes the need for immediate action or response. It is used when there is an urgency or when something has to be done without any delay.","target_language_example":"당장 그 일을 끝내세요.","native_language_example":"Finish that task right now."}]
["대부분",{"thoughts":"The term '대부분' is often used in Korean to express the concept of the majority or most of something. It's useful for beginners to understand this common word as it frequently appears in conversations, especially when discussing generalities or common occurrences.","target_language_multi_word_term":"대부분","meaning":"'most' or 'the majority'.","additional_notes":"Used to refer to the larger part or majority of a group or quantity. It can be used with subjects like people, objects, or situations.","target_language_example":"사람들이 대부분 너무 바빠요.","native_language_example":"Most people are too busy."}]
["대한",{"thoughts":"The Korean term '대한' is often used in various contexts, frequently appearing in formal or official names and expressions related to national matters, or directly translating concepts involving 'about' or 'relating to'. For beginner learners, it might be relevant to focus on its use in conversational and written contexts.","target_language_multi_word_term":"대한","meaning":"'of' or 'about'","additional_notes":"대한 is commonly used in official titles, documents, and phrases to imply 'relating to' or 'concerning'. The word can also indicate national or international matters, especially linked with Korea itself, such as in the phrase '대한민국' (Republic of Korea).","target_language_example":"이 책은 환경 문제에 대한 정보를 제공합니다.","native_language_example":"This book provides information about environmental issues."}]
["대해",{"thoughts":"The Korean term '대해' is a postposition, often used to indicate that a statement or expression is about something or concerning something. It is derived from the verb '대하다' which means 'to treat' or 'to regard'. This term is very common and can appear in discussions, descriptions, or clarifications about a given subject.","target_language_multi_word_term":"대해","meaning":"'about' or 'concerning'.","additional_notes":"It is used to specify that something is the subject or focus of an expression or discussion, similar to 'about' in English. Often combined with nouns to explain what the topic is centered on.","target_language_example":"이 책은 환경문제에 대해 이야기합니다.","native_language_example":"This book talks about environmental issues."}]
["더",{"thoughts":"The term '더' is a common adverb in Korean used to indicate a comparative aspect, like 'more' in English. This term is likely to be useful for learners when constructing sentences that involve comparisons or expressing a desire for something additional.","target_language_multi_word_term":"더","meaning":"'more'","additional_notes":"'더' is often used to describe something in greater quantity or degree. It can be applied in various contexts, such as asking for more of something, or comparing two items where one is greater than the other.","target_language_example":"더 크게 말해 주세요.","native_language_example":"Please speak louder."}]
["더 이상",{"thoughts":"The Korean phrase '더 이상' is used to indicate 'no longer' or 'not anymore,' especially in the context of changes or stopping an activity. It's useful for expressing the cessation of a habitual action or a state that will not continue.","target_language_multi_word_term":"더 이상","meaning":"'no longer' or 'not anymore'.","additional_notes":"Used to indicate that something will not continue or has stopped happening. Commonly used in negative sentences to express a cessation of actions or states.","target_language_example":"저는 더 이상 그곳에 살지 않아요.","native_language_example":"I no longer live there."}]
["둘 다",{"thoughts":"The Korean phrase '둘 다' is commonly used when referring to both items or both people, often implying inclusivity. Understanding and using this phrase allows beginners to accurately refer to multiple subjects simultaneously.","target_language_multi_word_term":"둘 다","meaning":"'both' or 'both of them'.","additional_notes":"Used when referring to two items, people, or options, indicating that both are included or considered.","target_language_example":"사과랑 바나나 둘 다 먹고 싶어요.","native_language_example":"I want to eat both an apple and a banana."}]
["드디어",{"thoughts":"'드디어' is an adverb often used to express excitement or relief that something has finally happened after a long wait.","target_language_multi_word_term":"드디어","meaning":"'finally' or 'at last'.","additional_notes":"Used to emphasize the completion or arrival of a desired event or situation after a period of waiting.","target_language_example":"드디어 휴가가 시작되었다.","native_language_example":"Finally, the vacation has started."}]
["따라",{"thoughts":"The Korean term '따라' is often used with verbs to indicate actions of following, copying, or according to something. It can be found in phrases like '따라서' (therefore, consequently) or used after a noun to express 'depending on' or 'according to'. For beginners, understanding its role in context is essential since it's adaptable.","target_language_multi_word_term":"따라","meaning":"'according to' or 'following'.","additional_notes":"'따라' can be used to indicate following someone or something, or to express actions taken according to a statement, rule, or condition. It's often used after the noun it refers to.","target_language_example":"그의 계획에 따라 우리는 움직였다.","native_language_example":"We moved according to his plan."}]
["딱",{"thoughts":"The Korean word '딱' is a versatile term often used to indicate something happening precisely, exactly, or fittingly. It conveys the idea of precision or perfect suitability in a situation.","target_language_multi_word_term":"딱","meaning":"exactly or precisely.","additional_notes":"Often used to emphasize the exactness or suitability of a situation. It can describe something fitting perfectly both in physical and metaphorical contexts.","target_language_example":"그는 딱 맞는 신발을 찾았다.","native_language_example":"He found shoes that fit perfectly."}]
["때문에",{"thoughts":"'때문에' is commonly used to express the reason or cause of a certain situation or action, and is often translated to 'because of' or 'due to'. It connects the cause to the effect and is frequently used in both written and spoken Korean.","target_language_multi_word_term":"때문에","meaning":"'because of' or 'due to'.","additional_notes":"It is used to explain the reason for something, often appearing after a noun or a noun phrase. It indicates causation between the first and second parts of the sentence.","target_language_example":"비가 많이 와서 콘서트가 취소되었습니다. 날씨 때문에요.","native_language_example":"The concert was canceled because it rained a lot. Because of the weather."}]
["막",{"thoughts":"The Korean term '막' can have several meanings based on context, but it is often used as an adverb indicating doing something just now, immediately before talking, or randomly. Understanding its context is crucial for accurate use and interpretation.","target_language_multi_word_term":"막","meaning":"'just' or 'recklessly'.","additional_notes":"'막' is versatile and context-dependent, often used to indicate something done just before or without much thought. It can convey actions done without prior notice or planning. Additionally, it can suggest doing something randomly or haphazardly.","target_language_example":"나는 막 도착했어.","native_language_example":"I just arrived."}]
["말고",{"thoughts":"The term '말고' means 'instead of' or 'not A but B'. It's used to show preference or suggest a substitution or alternative to something else.","target_language_multi_word_term":"말고","meaning":"instead of; not A but B.","additional_notes":"This phrase is used to suggest an alternative to something previously stated and generally appears with lists or when clarifying choices.","target_language_example":"이거 말고 저걸 주세요.","native_language_example":"Give me that one, not this one."}]
["매우",{"thoughts":"The term '매우' is an adverb often used in Korean to convey a higher degree or intensity of something, similar to the English words 'very' or 'extremely'. It is useful for beginners to learn because it frequently appears in everyday conversation to express strong feelings or descriptions.","target_language_multi_word_term":"매우","meaning":"'very' or 'extremely'.","additional_notes":"Often used to emphasize adjectives and can be replaced with '아주' in some contexts. It is formal compared to '너무' which can also mean 'very'.","target_language_example":"그녀는 매우 아름다워요.","native_language_example":"She is very beautiful."}]
["매일",{"thoughts":"The Korean term '매일' is commonly used to express daily occurrences or routines.","target_language_multi_word_term":"매일","meaning":"every day.","additional_notes":"'매일' is used to express repetition or habitual action happening on a daily basis. It is often used at the start or end of a sentence.","target_language_example":"저는 매일 운동해요.","native_language_example":"I exercise every day."}]
["몇",{"thoughts":"몇 is a determiner meaning 'how many' or 'a few' used to ask about quantity.","target_language_multi_word_term":"몇","meaning":"'how many' or 'a few'.","additional_notes":"This word is often used in questions to ask about the number of objects or people. It can be followed by a counter to specify what exactly is being counted, such as 명 for people or 개 for general objects.","target_language_example":"이 방에 몇 명 있어요?","native_language_example":"How many people are in this room?"}]
["몇 개",{"thoughts":"The Korean term '몇 개' is commonly used to ask for or specify a number of items. It involves counting objects and can be linked to various nouns.","target_language_multi_word_term":"몇 개","meaning":"'how many' or 'a few'.","additional_notes":"Typically used when asking about the quantity of countable objects. '몇' means 'how many' or 'some', and '개' is a counter for items.","target_language_example":"사과 몇 개 있어요?","native_language_example":"How many apples are there?"}]
["몇 시에",{"thoughts":"The phrase '몇 시에' is used in Korean to ask about the time something occurs. It's equivalent to asking 'at what time' in English. This is a useful phrase for learners to know when scheduling activities or appointments.","target_language_multi_word_term":"몇 시에","meaning":"'at what time?'.","additional_notes":"Used when asking about the time something will happen or asking what time it is currently.","target_language_example":"영화는 몇 시에 시작해요?","native_language_example":"At what time does the movie start?"}]
["모든",{"thoughts":"The term '모든' is an adjective in Korean that is frequently used to indicate totality or entirety, similar to 'all' in English. It's relevant for beginners to understand how to describe things collectively.","target_language_multi_word_term":"모든","meaning":"'all' or 'every'.","additional_notes":"'모든' is used before nouns to describe all members or items of a set. It’s commonly used in sentences to indicate that the subject includes every part or aspect of something.","target_language_example":"모든 사람들이 함께 웃었다.","native_language_example":"All the people laughed together."}]
["무슨",{"thoughts":"'무슨' is a Korean interrogative modifier used to ask about the nature or kind of something, similar to 'what kind of' in English.","target_language_multi_word_term":"무슨","meaning":"'what kind of' or 'which'.","additional_notes":"Used with nouns to inquire specifically about the type or kind of the noun being referenced.","target_language_example":"무슨 책을 읽고 있어요?","native_language_example":"What kind of book are you reading?"}]
["무슨 일이",{"thoughts":"The phrase '무슨 일이' is used in Korean to ask about what happened or what's going on. It is commonly used in everyday conversation to show curiosity or concern about a situation.","target_language_multi_word_term":"무슨 일이","meaning":"'what's happening' or 'what's the matter'.","additional_notes":"The phrase is often used at the beginning of a sentence when expressing concern or curiosity about an event or situation. It can be followed by a verb to specify the context, such as '있어요' (is there) or '있었어요' (was there).","target_language_example":"무슨 일이 있었어요?","native_language_example":"What happened?"}]
["무엇을",{"thoughts":"The term '무엇을' (mu-eo-seul) is the accusative form of '무엇', meaning 'what'. It is used to ask questions or make statements about 'what' someone is doing or wants.","target_language_multi_word_term":"무엇을","meaning":"'what' (object form).","additional_notes":"Used when asking questions about the object of an action. It's commonly used in conversation to clarify or inquire what the subject is acting upon.","target_language_example":"무엇을 먹고 싶습니까?","native_language_example":"What do you want to eat?"}]
["무엇이",{"thoughts":"'무엇이' is the subject form of 'what' in Korean, specifically used when 'what' is the subject of the sentence. Understanding its usage is important for forming questions and statements in Korean.","target_language_multi_word_term":"무엇이","meaning":"'what', as a subject.","additional_notes":"Used when asking questions where 'what' is the subject. Often used in formal or written Korean, with more casual or spoken contexts using '뭐가' instead.","target_language_example":"무엇이 가장 중요합니까?","native_language_example":"What is the most important?"}]
["뭐",{"thoughts":"‘뭐’ is a common Korean word used in everyday conversation. It is often used in questions or to express curiosity about something. It can also be used informally in broader contexts like ‘What’s up?’ or ‘What?’ in response to something surprising or confusing.","target_language_multi_word_term":"뭐","meaning":"'what'.","additional_notes":"Used in questions or to express curiosity, surprise, or confusion. Often used informally.","target_language_example":"뭐 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["뭐가",{"thoughts":"'뭐가' is a contraction of '무엇이', which translates to 'what is' or 'what's'. This phrase is often used to ask about something specific or emphasize the subject in a question. It is a part of conversational Korean used informally.","target_language_multi_word_term":"뭐가","meaning":"'what is'.","additional_notes":"It is used in informal settings to ask questions emphasizing 'what'. It's a contraction of '무엇이', more commonly used in conversation.","target_language_example":"그게 뭐가 문제야?","native_language_example":"What's the problem with that?"}]
["뭐야",{"thoughts":"The term '뭐야' is often used in casual or informal conversation in Korean. It's a way to express surprise, confusion, or ask what something is. It's a contraction of '무엇이야', and it's very common to hear in everyday conversations.","target_language_multi_word_term":"뭐야","meaning":"'What is it?' or 'What?!'.","additional_notes":"Used frequently in casual conversations to express surprise or a request for clarification about something. Often seen in informal settings.","target_language_example":"이거 뭐야?","native_language_example":"What is this?"}]
["뭘",{"thoughts":"'뭘' is a contracted form of '무엇을', which means 'what' in English. It is often used in conversation to ask about something in a casual manner.","target_language_multi_word_term":"뭘","meaning":"'what'.","additional_notes":"Used in informal contexts to ask questions or inquire about something; often comes at the beginning of a sentence. '뭘' is short for '무엇을' and is the object of the verb in the sentence.","target_language_example":"뭘 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["바로",{"thoughts":"The term '바로' can have several meanings depending on the context, such as 'right away', 'immediately', or direct/straight. It's often used to describe actions that should be done without delay or to indicate immediacy or directness.","target_language_multi_word_term":"바로","meaning":"'immediately' or 'directly'.","additional_notes":"'바로' is often used to emphasize that something should happen without delay or to indicate movement in a straight direction. It is sometimes used as an adverb to ensure clarity of time or space.","target_language_example":"제가 바로 갈게요.","native_language_example":"I will go right away."}]
["밖에",{"thoughts":"The Korean postposition '밖에' roughly translates to 'nothing but' or 'only'. It is used to express limitations or exclusivity with a negative connotation, often forming a constraining sentiment about an action or entity.","target_language_multi_word_term":"밖에","meaning":"'nothing but', 'only'.","additional_notes":"Typically used with negative endings to emphasize a limited quantity or capacity. For example, when saying 'I only have one apple', the implication is that having only one is insufficient.","target_language_example":"쌀이 조금밖에 없어요.","native_language_example":"There is nothing but a little rice."}]
["비해",{"thoughts":"'비해' is used in Korean to indicate comparison, similar to the English term 'compared to' or 'than'. It's often used to contrast two things or situations.","target_language_multi_word_term":"비해","meaning":"'compared to' or 'than'.","additional_notes":"Usually used with the particle '에' or '는' to make comparisons between two subjects or conditions.","target_language_example":"올해는 작년에 비해 더운 것 같아요.","native_language_example":"It seems hotter this year compared to last year."}]
["빨리",{"thoughts":"The Korean word '빨리' is an adverb and commonly used to express urgency or haste, meaning 'quickly' or 'fast'. It's an essential word for beginners to understand basic instructions or to communicate urgency in everyday situations.","target_language_multi_word_term":"빨리","meaning":"quickly or fast","additional_notes":"Used to express urgency or the need to hurry. Common in everyday speech and frequently used to encourage others to act faster or to describe something being done rapidly.","target_language_example":"빨리 와!","native_language_example":"Come quickly!"}]
["세상에",{"thoughts":"'세상에' is an exclamatory phrase in Korean that expresses surprise, astonishment, or disbelief. It is similar to expressing 'Oh my!' or 'Wow!' in English.","target_language_multi_word_term":"세상에","meaning":"'Oh my!' or 'Wow!'","additional_notes":"Used to express surprise or disbelief, often in reaction to unexpected news or situations.","target_language_example":"세상에, 그게 정말 사실이야?","native_language_example":"Wow, is that really true?"}]
["수 있다",{"thoughts":"The phrase '수 있다' is used in Korean to express the ability to do something or the possibility that something can happen.","target_language_multi_word_term":"수 있다","meaning":"'can' or 'be able to'.","additional_notes":"This expression is typically placed after a verb stem, indicating the ability or possibility related to the action. For example, when placed after '먹' (from '먹다' meaning 'to eat'), it becomes '먹을 수 있다' meaning 'can eat'.","target_language_example":"저는 운전할 수 있어요.","native_language_example":"I can drive."}]
["수도 있다",{"thoughts":"The Korean phrase '수도 있다' is commonly used to express a possibility or potential in a sentence. It's a key structure for indicating that something might or could happen.","target_language_multi_word_term":"수도 있다","meaning":"'might' or 'could'.","additional_notes":"Used after verbs to express a possibility or potential for an action or situation to occur. Commonly used in predictions or suggestions.","target_language_example":"비가 올 수도 있어요.","native_language_example":"It might rain."}]
["아마",{"thoughts":"The term '아마' is often used in Korean to express a sense of uncertainty or probability of a future event. It's similar to saying 'probably' or 'maybe' in English, conveying that something is likely or assumed but not certain.","target_language_multi_word_term":"아마","meaning":"probably or maybe.","additional_notes":"'아마' is used when you want to express uncertainty or speculate about a situation. It's often used in combination with future or present tense verbs to suggest probability.","target_language_example":"아마 비가 올 거예요.","native_language_example":"It will probably rain."}]
["아무것도",{"thoughts":"The Korean term '아무것도' is a common expression used to denote 'nothing' or the absence of anything. It's typically used in negative sentences.","target_language_multi_word_term":"아무것도","meaning":"'nothing'.","additional_notes":"Often used with negation to emphasize that there is not even one thing or no particular thing at all. It can be used in various contexts where you want to emphasize emptiness or absence.","target_language_example":"그는 아무것도 먹지 않았어요.","native_language_example":"He didn't eat anything."}]
["아무도",{"thoughts":"The word '아무도' in Korean is a pronoun that means 'nobody' or 'anybody' when used in negative sentences. It is useful for expressing absence of action or involvement by anyone. This is a common term used in everyday Korean speech to describe scenarios without a particular doer or when emphasizing that no person is involved.","target_language_multi_word_term":"아무도","meaning":"'nobody' or 'no one'.","additional_notes":"In Korean, '아무도' is primarily used in negative contexts to indicate that no person is involved in the action or situation. It often pairs with negative verbs or phrases like '없다' (not exist) or '못하다' (cannot do).","target_language_example":"아무도 없어요.","native_language_example":"There's nobody here."}]
["아주",{"thoughts":"The Korean term '아주' is a commonly used adverb that has a simple yet effective role in expressing intensity. It's comparable to English words that enhance or magnify the adjectives or verbs they modify. This term is quite useful for beginners to know, as it can be used in a variety of contexts to convey emphasis.","target_language_multi_word_term":"아주","meaning":"'very' or 'quite'.","additional_notes":"'아주' is used to intensify adjectives or verbs. It's commonly used in everyday speech to express a strong degree of something. It's akin to saying 'really' in English when trying to stress how good, bad, etc., something is.","target_language_example":"이 영화는 아주 재미있어요.","native_language_example":"This movie is very interesting."}]
["아직",{"thoughts":"The word '아직' is a basic Korean adverb that is used to express the sense of 'still' or 'yet', indicating a continuation of an action or state from the past into the present.","target_language_multi_word_term":"아직","meaning":"'still' or 'not yet'.","additional_notes":"Used to describe a situation or condition that has not yet changed or been completed. It can imply that something has remained the same over a period of time or that a condition or event is expected to occur in the future.","target_language_example":"아직 숙제를 안 했어요.","native_language_example":"I haven't done my homework yet."}]
["아직도",{"thoughts":"'아직도' is a Korean adverb used frequently in conversations to indicate that a certain condition or action continues to exist or occur, despite expectations it would change by now.","target_language_multi_word_term":"아직도","meaning":"still, yet","additional_notes":"Used to express surprise or incredulity that something is continuing longer than expected, or when asking if something is still the case.","target_language_example":"너 아직도 일하고 있어?","native_language_example":"Are you still working?"}]
["알고 있다",{"thoughts":"'알고 있다' is a common Korean phrase used to express the state of knowing or being aware of something. It's derived from the verb '알다' (to know) and the verb '있다' (to be/exist, indicating a state or condition). This combination implies that someone is keeping knowledge about something currently in mind.","target_language_multi_word_term":"알고 있다","meaning":"to know or to be aware of.","additional_notes":"It is used to indicate that someone has awareness or understanding of a fact or situation. Commonly employed in both spoken and written Korean to convey that knowledge is possessed or retained.","target_language_example":"나는 그 사실을 알고 있다.","native_language_example":"I know that fact."}]
["알고 있어",{"thoughts":"The Korean phrase '알고 있어' is an informal expression used in casual settings. It is derived from the verb '알다' meaning 'to know' and is often used in conversations among friends or close acquaintances to indicate that the speaker is aware of or has understood something.","target_language_multi_word_term":"알고 있어","meaning":"'I know' or 'I'm aware'.","additional_notes":"This phrase is informal and commonly used with friends or people of the same age group. It conveys understanding or acknowledgment in response to information or a situation. It should not be used in formal situations, where '압니다' might be more appropriate.","target_language_example":"그 영화 너무 재밌었어!","native_language_example":"I already know."}]
["어느",{"thoughts":"'어느' is a common Korean determiner used to ask questions about choices or specify an item from a set.","target_language_multi_word_term":"어느","meaning":"'which' or 'which one'.","additional_notes":"This term is used to ask about a choice or selection among different options. It's often used in a question format to inquire about a specific item or group.","target_language_example":"어느 책을 읽고 싶어요?","native_language_example":"Which book do you want to read?"}]
["어디",{"thoughts":"The Korean word '어디' is a basic term used in questions to ask about location, meaning 'where'. Beginner learners often encounter it along with various verbs to form questions related to location.","target_language_multi_word_term":"어디","meaning":"'where'.","additional_notes":"Often used in questions to inquire about place or position. Commonly used with location-related verbs such as 가다 (to go), 있다 (to be), etc.","target_language_example":"당신은 어디에 있습니까?","native_language_example":"Where are you?"}]
["어디로",{"thoughts":"The term '어디로' is made up of '어디' meaning 'where' and the particle '로', which indicates direction or method, often translated as 'to' or 'towards'. It's commonly used when asking about destinations or directions.","target_language_multi_word_term":"어디로","meaning":"'to where' or 'towards where'.","additional_notes":"Used when asking for or giving directions, or when determining the destination someone or something is headed to.","target_language_example":"이 버스는 어디로 가나요?","native_language_example":"Where is this bus going to?"}]
["어디서",{"thoughts":"The term '어디서' is a question word used to ask about locations. It's a fundamental part of learning how to form questions about place or origin in Korean.","target_language_multi_word_term":"어디서","meaning":"'where'.","additional_notes":"Used when asking for the location where an action takes place or the origin of something.","target_language_example":"이 책을 어디서 샀어요?","native_language_example":"Where did you buy this book?"}]
["어디에",{"thoughts":"'어디에' is a Korean phrase used to ask or talk about the location of something or someone. It is a combination of '어디' meaning 'where' and the particle '에' which denotes location or direction.","target_language_multi_word_term":"어디에","meaning":"'where'.","additional_notes":"It is often used to ask about someone's location or to specify where an event is happening.","target_language_example":"당신은 지금 어디에 있습니까?","native_language_example":"Where are you now?"}]
["어디에서",{"thoughts":"The term '어디에서' is crucial for beginners learning Korean as it helps them form location-based questions, indicating where something is taking place.","target_language_multi_word_term":"어디에서","meaning":"'Where at' or 'from where'.","additional_notes":"Used to ask about the location or place where something occurs or from where someone or something is coming.","target_language_example":"어디에서 오셨어요?","native_language_example":"Where are you from?"}]
["어떤",{"thoughts":"'어떤' is an interrogative word used in Korean. It functions as an adjective to inquire about the nature or kind of something.","target_language_multi_word_term":"어떤","meaning":"'what kind of' or 'which'.","additional_notes":"'어떤' is often used to ask about the characteristics or types of things, focusing on the identity or quality rather than amounts or numbers.","target_language_example":"어떤 책을 좋아하세요?","native_language_example":"What kind of books do you like?"}]
["어떻게",{"thoughts":"The Korean term '어떻게' is used to ask 'how' or inquire about the manner in which something is done.","target_language_multi_word_term":"어떻게","meaning":"'how'.","additional_notes":"It is often used in questions to ask about methods or ways of doing something. It's a common and versatile term in everyday conversation.","target_language_example":"이걸 어떻게 해요?","native_language_example":"How do you do this?"}]
["어떻게 하면",{"thoughts":"The phrase '어떻게 하면' is often used in Korean to ask about the means or method of accomplishing something. It's a common way to inquire about how to do something or how to achieve a certain result.","target_language_multi_word_term":"어떻게 하면","meaning":"'how to do' or 'how to achieve'.","additional_notes":"Used when asking for advice or instructions on achieving a goal or completing an action. It often starts a question about methods or strategies.","target_language_example":"어떻게 하면 한국어를 잘할 수 있을까요?","native_language_example":"How can I become good at Korean?"}]
["어서",{"thoughts":"The Korean term '어서' is an adverb used to express haste or urgency in an action, akin to 'quickly' or 'hurry' in English. It is often used in everyday conversation, especially when encouraging someone to do something promptly.","target_language_multi_word_term":"어서","meaning":"'quickly' or 'hurry'.","additional_notes":"Commonly used in situations where time is of the essence or when prompting someone to do something fast. It can be used both politely and informally.","target_language_example":"어서 가세요!","native_language_example":"Hurry, go!"}]
["어제",{"thoughts":"The term '어제' is commonly used in everyday Korean conversation to refer to the day before today. It's essential for learners to grasp basic temporal markers to help them communicate about events happening relative to the present day.","target_language_multi_word_term":"어제","meaning":"'yesterday'.","additional_notes":"'어제' is used to talk about events, actions, or plans that occurred or were relevant the day before today. It is used much like its English counterpart in sentences.","target_language_example":"어제 친구랑 영화를 봤어요.","native_language_example":"I watched a movie with a friend yesterday."}]
["언제",{"thoughts":"The Korean word '언제' is used in questions related to time. Beginner learners might frequently encounter it when learning to ask about when something occurs.","target_language_multi_word_term":"언제","meaning":"'when'.","additional_notes":"It is used to ask about the time or date something happens or happened. It can appear at the beginning, middle, or end of a question sentence, depending on the structure.","target_language_example":"언제 시간이 있나요?","native_language_example":"When do you have time?"}]
["얼마나",{"thoughts":"'얼마나' is used to ask about the degree or extent of something and can translate to 'how much', 'how many', or 'how'. It's common in questions asking about quantity, frequency, or extent.","target_language_multi_word_term":"얼마나","meaning":"'how much', 'how many', or 'how'.","additional_notes":"Used to inquire about the degree, quantity, or extent of something. Commonly used in questions to ask for additional details about a situation or object.","target_language_example":"이 케이크가 얼마나 커요?","native_language_example":"How big is this cake?"}]
["여전히",{"thoughts":"'여전히' is a Korean adverb used frequently to express the idea that a situation or state remains the same as it was before, similar to the English 'still'. This term is useful for learners when describing persistence or continuity in states or actions.","target_language_multi_word_term":"여전히","meaning":"'still' or 'as before'.","additional_notes":"It is commonly used to indicate that something or someone continues to be in the same state or situation as previously mentioned. This adverb is often used in both written and spoken Korean.","target_language_example":"그 사람은 여전히 그곳에 있다.","native_language_example":"That person is still there."}]
["왜",{"thoughts":"The Korean word '왜' means 'why'. It is commonly used in questions to ask for reasons or explanations.","target_language_multi_word_term":"왜","meaning":"'why'","additional_notes":"Used to inquire about reasons or causes behind an action or situation. It's commonly used in spoken and written Korean to start a question.","target_language_example":"왜 그렇게 말했어요?","native_language_example":"Why did you say that?"}]
["위해",{"thoughts":"The term '위해' is commonly used in various contexts in Korean to mean 'for' or 'in order to'. It is often seen in sentences indicating purpose or reason.","target_language_multi_word_term":"위해","meaning":"'for' or 'in order to'.","additional_notes":"Used to express purpose, intention, or aim in a sentence. Often followed by a verb or a phrase indicating the intended outcome.","target_language_example":"그녀는 건강을 위해 운동을 해요.","native_language_example":"She exercises for her health."}]
["위해서",{"thoughts":"\"위해서\" is a Korean phrase often used to express purpose or intent. It typically translates to 'for' or 'in order to'.","target_language_multi_word_term":"위해서","meaning":"'for' or 'in order to'.","additional_notes":"Used to indicate the purpose or reason for an action. Typically followed by verb clauses.","target_language_example":"건강을 위해서 매일 운동해요.","native_language_example":"I exercise every day for my health."}]
["을 수 있다",{"thoughts":"The phrase '을 수 있다' is a grammatical construction in Korean that indicates the ability or possibility of performing an action. It is used after a verb stem. Understanding this concept is crucial for beginners to express abilities and probabilities in Korean.","target_language_multi_word_term":"을 수 있다","meaning":"'can' or 'to be able to'.","additional_notes":"This phrase is attached to verb stems to express that someone is capable of doing something or that something is possible. The form changes slightly depending on whether the verb stem ends in a consonant or a vowel, becoming ‘ㄹ 수 있다’ for vowel endings.","target_language_example":"저는 피아노를 칠 수 있어요.","native_language_example":"I can play the piano."}]
["이런",{"thoughts":"The Korean term '이런' is often used as a determiner and translates to 'such' or 'like this'. It describes something in a similar manner to what has just been mentioned or is nearby. It is a useful word when pointing out something specific.","target_language_multi_word_term":"이런","meaning":"'such', 'like this'.","additional_notes":"It is used to describe objects, situations, or actions that are similar to what is currently being discussed or pointed out. It often sets a context or example for what is being talked about.","target_language_example":"이런 나쁜 날씨엔 집에 있는 게 좋아요.","native_language_example":"It's good to stay home in such bad weather."}]
["이렇게",{"thoughts":"'이렇게' is a Korean adverb often used to describe the manner or state of something, meaning 'like this,' 'this way,' or 'in this manner.' It's commonly used in both spoken and written Korean to refer to actions or things that are done or presented in a similar manner to what is currently happening or being demonstrated.","target_language_multi_word_term":"이렇게","meaning":"'like this' or 'this way'.","additional_notes":"Often used to describe or illustrate the manner in which an action is carried out. It can also be used to show similarity or to ask or wonder why something is done in a particular way.","target_language_example":"이렇게 하면 더 좋아요.","native_language_example":"It's better if you do it like this."}]
["이미",{"thoughts":"'이미' is a common adverb in Korean meaning 'already'. It's used to indicate an action or state that has occurred before the present time.","target_language_multi_word_term":"이미","meaning":"'already'.","additional_notes":"Typically used to emphasize that something has been done or completed before now or before a specified point in time. It can be used in various tenses, usually conveying a sense that the speaker expected something to occur earlier.","target_language_example":"그 영화는 이미 봤어요.","native_language_example":"I have already seen that movie."}]
["있다",{"thoughts":"The Korean verb '있다' is fundamental and essential for beginners as it is used to indicate existence or possession. ","target_language_multi_word_term":"있다","meaning":"to have; to exist; to be (in a location).","additional_notes":"In Korean, '있다' is used to indicate possession (to have), existence (to exist), and location (to be somewhere). It is an important verb that beginners need to master for basic expressions relating to having things, describing existence, or specifying location.","target_language_example":"가방에 책이 있어요.","native_language_example":"There is a book in the bag."}]
["자고",{"thoughts":"The term '자고' is commonly used in Korean to indicate a suggestion or proposal to do something together, often as part of a direct or indirect speech construction. It is a form of the verb '자다' which means 'to sleep,' but the auxiliary ending has a broader use in conversational contexts. It is also used to suggest indirect quotations that align with this intent.","target_language_multi_word_term":"자고","meaning":"'let's' or 'suggested to'.","additional_notes":"'자고' is often used in sentences to convey a suggestion or proposal, such as sleeping or resting together, or can be part of reported speech indicating what someone suggested.","target_language_example":"우리 집에 가서 같이 자고 해.","native_language_example":"Let's go to my house and sleep together."}]
["자주",{"thoughts":"The word '자주' is frequently used in everyday Korean conversation and is relevant for learners to express frequency.","target_language_multi_word_term":"자주","meaning":"often, frequently","additional_notes":"'자주' is used to describe actions that happen regularly or with high frequency. It is an adverb that typically precedes a verb in a sentence.","target_language_example":"저는 주말에 자주 산책해요.","native_language_example":"I often go for a walk on the weekend."}]
["잠깐",{"thoughts":"'잠깐' is a common Korean word used to indicate a very short period of time. It's relevant for beginners to understand as it can be used in daily conversations to ask for a brief pause or attention.","target_language_multi_word_term":"잠깐","meaning":"'a moment' or 'just a second'.","additional_notes":"Used to indicate a brief amount of time. Commonly used when asking someone to wait or when you need a short interruption.","target_language_example":"잠깐 기다려 주세요.","native_language_example":"Please wait a moment."}]
["잠깐만",{"thoughts":"'잠깐만' is a frequently used Korean phrase that expresses a request for someone to wait momentarily. It is an informal way to ask someone to wait a short period of time, often used in casual settings.","target_language_multi_word_term":"잠깐만","meaning":"'just a moment' or 'wait a minute'.","additional_notes":"Used to politely ask someone to wait briefly, typically in casual conversations. It is derived from '잠깐', meaning 'a short time', and '만', meaning 'only' or 'just'. It can be used in a variety of contexts where a quick pause or hold is needed.","target_language_example":"잠깐만 기다려 주세요.","native_language_example":"Please wait just a moment."}]
["전부",{"thoughts":"The term '전부' in Korean is commonly used to refer to the entirety or the whole of something. It's a basic term that can be beneficial for beginners when expressing concepts of all-inclusive or completeness in Korean.","target_language_multi_word_term":"전부","meaning":"'all' or 'everything'.","additional_notes":"'전부' is used to talk about something in its entirety. It can be used to describe complete amounts or groups and is often synonymous with '모두', which also means 'all'.","target_language_example":"전부 먹었어요.","native_language_example":"I ate everything."}]
["전혀",{"thoughts":"'전혀' is an adverb that typically appears in negative sentences, emphasizing the nonexistence or complete absence of something. It is used to amplify the extent of negation, similar to how 'at all' or 'completely' is used in English in negative contexts.","target_language_multi_word_term":"전혀","meaning":"'not at all' or 'completely not'.","additional_notes":"Used mainly in negative sentences to emphasize the lack of something. It's often followed by a negative form of the verb, like 없다 (do not have) or 못하다 (cannot do).","target_language_example":"그 영화는 전혀 재미없었어.","native_language_example":"That movie was not fun at all."}]
["절대",{"thoughts":"The Korean word '절대' is an adverb that means 'absolutely' or 'never'. It's often used for strong negative sentences to emphasize a prohibition or something that must not happen.","target_language_multi_word_term":"절대","meaning":"'never' or 'absolutely'.","additional_notes":"'절대' is typically used in negative sentences to strongly assert that something will not or should not happen. It can also convey a sense of certainty when discussing things that are absolute.","target_language_example":"절대 늦지 마세요.","native_language_example":"Never be late."}]
["점점",{"thoughts":"The Korean term '점점' is frequently used to describe gradual or continuous change. It's akin to the English word 'gradually' or 'little by little.' This term is useful when talking about progressive actions or developments.","target_language_multi_word_term":"점점","meaning":"'gradually' or 'little by little'.","additional_notes":"A versatile adverb used to indicate that something is happening slowly over time. It is often used to describe a situation or condition that becomes more pronounced or changes progressively.","target_language_example":"날씨가 점점 따뜻해지고 있어요.","native_language_example":"The weather is gradually getting warmer."}]
["정도로",{"thoughts":"The Korean term '정도로' is often used to express a degree or extent of comparison or condition. This terminology is often used when discussing the level of something or to indicate 'to the extent that' or 'to the degree of'. This is a useful phrase for learners to understand comparison and conditionals in Korean.","target_language_multi_word_term":"정도로","meaning":"'to the extent that' or 'to the degree of'.","additional_notes":"Used to indicate a level or extent, often in comparisons, descriptions, or conditions. It helps in explaining how much or how far something goes in relation to something else.","target_language_example":"그는 숨을 쉴 수 없을 정도로 웃었다.","native_language_example":"He laughed to the extent that he couldn't breathe."}]
["정말",{"thoughts":"The Korean term '정말' is often used as an adverb to express emphasis, meaning 'really' or 'truly'. It adds emphasis to statements, similar to saying 'very much' in English.","target_language_multi_word_term":"정말","meaning":"'really' or 'truly'.","additional_notes":"Used to add emphasis or express sincerity. Common in both formal and informal contexts.","target_language_example":"정말 감사합니다.","native_language_example":"Thank you very much."}]
["정말로",{"thoughts":"The Korean term '정말로' is used for emphasis and is often added to questions or statements to assert sincerity or truthfulness.","target_language_multi_word_term":"정말로","meaning":"truly; really.","additional_notes":"'정말로' is used for emphasis and can be placed at the beginning or end of a sentence. It adds weight or seriousness to the statement, indicating that the speaker is sincere or truly interested.","target_language_example":"정말로 이 영화를 이미 봤어요?","native_language_example":"Have you really already seen this movie?"}]
["조금",{"thoughts":"The word '조금' is used to indicate a small amount or degree of something, similar to 'a little' or 'a bit' in English.","target_language_multi_word_term":"조금","meaning":"'a little', 'a bit', or 'slightly'.","additional_notes":"Often used to describe small quantities or slight degrees in situations like expressing quantity, mild emotions, or making polite requests. It modifies verbs or adjectives to soften them.","target_language_example":"저는 매운 음식을 조금 먹을 수 있어요.","native_language_example":"I can eat spicy food a little."}]
["좀",{"thoughts":"The Korean word '좀' is a versatile particle often used to indicate politeness, make requests, or add emphasis in a sentence.","target_language_multi_word_term":"좀","meaning":"Please; a little bit.","additional_notes":"'좀' is often used to soften requests or commands, making them more polite. It can also indicate a small amount or slight degree when referring to quantity or intensity.","target_language_example":"물이 좀 주세요.","native_language_example":"Please give me some water."}]
["좀 더",{"thoughts":"The term '좀 더' is a Korean phrase used to request or suggest 'a little more' of something, often used to ask for something additional or to do something more.","target_language_multi_word_term":"좀 더","meaning":"A little more.","additional_notes":"This phrase is commonly used when requesting more of something, whether it's more food, time, or effort. It's a polite way of asking for extra.","target_language_example":"물을 좀 더 주세요.","native_language_example":"Please give me a little more water."}]
["진짜",{"thoughts":"'진짜' is a versatile Korean adverb and adjective used frequently in informal settings. It can mean 'really' or 'real', adding emphasis to a statement or question.","target_language_multi_word_term":"진짜","meaning":"'really' or 'real'.","additional_notes":"It is often used to express surprise, disbelief, or to emphasize sincerity. It's commonly heard in casual conversations.","target_language_example":"이거 진짜 맛있어!","native_language_example":"This is really delicious!"}]
["진짜로",{"thoughts":"The term '진짜로' is often used in spoken Korean to emphasize sincerity or truth, akin to saying 'really' or 'truly' in English. It's an intensifier that adds emphasis to the statement it accompanies. Beginner learners are likely to encounter this in casual conversations.","target_language_multi_word_term":"진짜로","meaning":"'really' or 'truly'.","additional_notes":"Used to emphasize sincerity or truthfulness. Often appears in informal contexts and is commonly used for emphasis.","target_language_example":"진짜로 맛있어요!","native_language_example":"It's really delicious!"}]
["필요하다",{"thoughts":"The Korean term '필요하다' is an adjective meaning needed, necessary, or required. It often appears in contexts where someone is talking about needing something or someone, or when indicating necessity. Understanding '필요하다' helps with forming simple necessity statements and asking about needs, which are common in everyday conversation.","target_language_multi_word_term":"필요하다","meaning":"'to be necessary' or 'to need'.","additional_notes":"This term is used to express a requirement or necessity. It's often used in everyday situations to express what you need or what is necessary for you or others.","target_language_example":"이것이 필요하다.","native_language_example":"This is necessary."}]
["할 수 있다",{"thoughts":"The Korean phrase '할 수 있다' is essential for beginners, as it expresses capability or possibility in a similar way to 'can' in English. It consists of the verb '하다' (to do) and '수 있다' (to be able to), which together mean 'can do.' It's often used to express one's ability to perform an action.","target_language_multi_word_term":"할 수 있다","meaning":"'can do' or 'be able to'.","additional_notes":"This phrase is used to express the ability or possibility of doing something. It is typically followed by a verb stem to describe what can be done. It is a versatile expression and can be used in various contexts to talk about potential, capability, or questions of permission.","target_language_example":"저는 한국어를 할 수 있어요.","native_language_example":"I can speak Korean."}]
["함께",{"thoughts":"The Korean term '함께' is commonly used to indicate doing something together with one or more people. It's akin to the English words 'together' or 'with'. For a beginner, understanding its usage is key to forming sentences about joint activities.","target_language_multi_word_term":"함께","meaning":"Together or with.","additional_notes":"Used to describe an action done in the company of others. Often interchangeable with '같이', although '함께' can sound a bit more formal or written than '같이'.","target_language_example":"우리 함께 영화를 보러 가자.","native_language_example":"Let's go watch a movie together."}]
["항상",{"thoughts":"항상 is an adverb in Korean that means 'always'. It is used to describe actions or states that occur all the time, without change. This is useful for beginner learners as it's helpful in talking about routines or habitual actions.","target_language_multi_word_term":"항상","meaning":"always","additional_notes":"This term is used to describe actions or states that are consistently repeated over time. It can be used with various verb forms to indicate habitual or continual action.","target_language_example":"그녀는 항상 웃고 있어요.","native_language_example":"She is always smiling."}]
["훨씬",{"thoughts":"The Korean term '훨씬' is often used to emphasize a large difference or extent, generally meaning 'much more' or 'far more'. This phrase commonly appears in comparisons to indicate a significant contrast in degree or amount.","target_language_multi_word_term":"훨씬","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize a great difference or degree in comparisons. It often enhances adjectives or adverbs to indicate something is much more of a certain quality than something else.","target_language_example":"이 책이 저 책보다 훨씬 재미있어요.","native_language_example":"This book is much more interesting than that book."}]
["훨씬 더",{"thoughts":"'훨씬 더' is used in Korean to express a much greater degree or amount, similar to \"much more\" or \"far more\" in English. It is commonly used to emphasize differences or to compare two things where one exceeds the other significantly.","target_language_multi_word_term":"훨씬 더","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize greater amounts, degrees, or intensities between comparative entities.","target_language_example":"올해는 작년보다 훨씬 더 춥다.","native_language_example":"This year is much colder than last year."}]
