["가끔",{"thoughts":"The Korean term '가끔' is an adverb commonly used to describe frequency of actions or events. It's important for learners to understand how it fits into sentences to describe how often something occurs.","target_language_multi_word_term":"가끔","meaning":"'sometimes' or 'occasionally'.","additional_notes":"가끔 is an adverb used to indicate that something happens from time to time or not regularly. It is placed before the verb it describes.","target_language_example":"나는 가끔 커피를 마십니다.","native_language_example":"I sometimes drink coffee."}]
["가지고 있다",{"thoughts":"The phrase '가지고 있다' is used to express possession or ownership of something and is common in everyday Korean language.","target_language_multi_word_term":"가지고 있다","meaning":"to have or possess","additional_notes":"'가지고 있다' combines the verb '가지다' (to have) with '있다' (to be/to exist), often used in both formal and informal contexts for possession.","target_language_example":"그는 좋은 카메라를 가지고 있다.","native_language_example":"He has a good camera."}]
["같은",{"thoughts":"'같은' is the attributive adjective form of '같다', meaning 'same as' or 'like'. It's often used to compare or express similarities between items.","target_language_multi_word_term":"같은","meaning":"'same', 'like', or 'such as'.","additional_notes":"'같은' is commonly used to describe things that are similar in nature, kind, or appearance. It is often part of phrases that compare or indicate similarity.","target_language_example":"나는 그녀와 같은 책을 읽고 있어요.","native_language_example":"I am reading the same book as her."}]
["같이",{"thoughts":"The Korean word '같이' is often used to mean 'together' or 'with'. It's useful for beginners to understand contexts of doing things with others.","target_language_multi_word_term":"같이","meaning":"Together, with.","additional_notes":"In Korean, '같이' is typically used to describe actions done with other people. It is commonly used in everyday conversations to suggest doing activities together or to indicate accompaniment.","target_language_example":"우리는 같이 영화를 봐요.","native_language_example":"We watch a movie together."}]
["거의",{"thoughts":"'거의' is a Korean adverb that signifies approximation, often used to indicate something that is nearly or almost completed or reached.","target_language_multi_word_term":"거의","meaning":"'almost' or 'nearly'.","additional_notes":"Used to express that something is close to a certain state or quantity but not quite there. It is often used with verbs to modify their meaning.","target_language_example":"그는 거의 다 왔어요.","native_language_example":"He is almost here."}]
["것 같다",{"thoughts":"것 같다 is a Korean expression used for making assumptions or guesses. It often follows a verb or adjective stem and implies that the speaker is not entirely certain but has a feeling or guess about something.","target_language_multi_word_term":"것 같다","meaning":"'It seems that' or 'I think'.","additional_notes":"Used to express uncertainty or a tentative conclusion. The expression can follow verbs, adjectives, or copulas to convey the speaker's hypothesis or opinion on an observed situation.","target_language_example":"비가 올 것 같아요.","native_language_example":"It seems like it will rain."}]
["것이다",{"thoughts":"'것이다' is a frequently used Korean phrase that is used to express a fact or assertion and can often imply a future tense or intention.","target_language_multi_word_term":"것이다","meaning":"is/am/are (a fact or intention).","additional_notes":"'것이다' is commonly used to indicate a statement of fact or an intention. It can also be used to give an explanation or reason for something. It's often seen in written Korean, such as in essays or formal situations, but is also used in spoken language to emphasize something.","target_language_example":"내일 우리는 산에 갈 것이다.","native_language_example":"Tomorrow, we are going to the mountain."}]
["계속",{"thoughts":"The Korean term '계속' is often used to express continuity or to indicate that something is continuing without interruption. It is similar to the English words 'continuously', 'continually', 'constantly', or 'still'.","target_language_multi_word_term":"계속","meaning":"continuously, constantly, still.","additional_notes":"'계속' is used to describe an ongoing action or state. It can be used when discussing habits, processes, or situations that do not stop or change over time.","target_language_example":"비가 계속 내리고 있어요.","native_language_example":"It is continuously raining."}]
["곧",{"thoughts":"The Korean term '곧' is a versatile word that is frequently used in conversations to indicate something that is imminent or about to happen shortly. It helps learners grasp the nuance of time, enriching their communication skills by understanding how to express soon-to-occur events.","target_language_multi_word_term":"곧","meaning":"soon or shortly.","additional_notes":"Used when referring to something expected to happen in the near future. It can also imply promptness or immediacy, like \"right away.\"","target_language_example":"밥이 곧 준비될 거예요.","native_language_example":"The meal will be ready soon."}]
["관한",{"thoughts":"'관한' is often used to mean 'about' or 'concerning,' and is commonly used when discussing topics or subjects pertaining to something.","target_language_multi_word_term":"관한","meaning":"'about' or 'concerning'.","additional_notes":"Used to specify that something is related to or associated with a particular subject. Frequently used in conjunction with other nouns to indicate the topic being discussed.","target_language_example":"이 책은 환경 문제에 관한 내용이에요.","native_language_example":"This book is about environmental issues."}]
["관해",{"thoughts":"The term '관해' is often used in Korean to talk about the subject or topic related to something. It's derived from the noun '관(관하다)' which means 'related to' or 'about.' This is a useful expression for beginner learners when they describe or discuss topics in conversation or writing.","target_language_multi_word_term":"관해","meaning":"'about' or 'concerning'.","additional_notes":"관해 is used to specify a topic or subject of discussion. It is commonly paired with the particle '에' ('에 관한' or '에 관해') to indicate something being related to a particular topic. This structure is frequently used in both spoken and written Korean, especially in more formal contexts.","target_language_example":"이 책은 환경 문제에 관해 이야기합니다.","native_language_example":"This book talks about environmental issues."}]
["관해서",{"thoughts":"'관해서' is a Korean phrase often used to indicate the topic or subject matter related to something. It is frequently used when discussing topics or presenting information related to a specific subject.","target_language_multi_word_term":"관해서","meaning":"'about', 'concerning', or 'regarding'.","additional_notes":"Used to discuss a specific topic or subject, indicating a connection to the matter being talked about.","target_language_example":"그 문제에 관해서 이야기해 봅시다.","native_language_example":"Let's talk about that issue."}]
["그런",{"thoughts":"The Korean term '그런' is often used as a demonstrative adjective to describe a situation, object, or condition that is similar or of a certain type, often referring to something that was mentioned before.","target_language_multi_word_term":"그런","meaning":"'such', 'that kind of'.","additional_notes":"It is used to refer to a category or type based on a previous context or conversation, similar to saying 'such a thing' or 'that kind of situation'.","target_language_example":"나는 그런 영화를 좋아해요.","native_language_example":"I like movies like that."}]
["그렇게",{"thoughts":"The term '그렇게' is often used in Korean to describe the manner or approach to something, typically translating to 'like that' or 'in that way'. It is a useful term for emphasizing a way of doing things or referring back to a previous statement.","target_language_multi_word_term":"그렇게","meaning":"'like that' or 'in that way'.","additional_notes":"It's used to describe a method, manner, or idea that has already been mentioned or is understood from context. Can refer to actions, behaviors, or characteristics and is often combined with verbs to indicate doing something 'like that'.","target_language_example":"그렇게 말하지 마세요.","native_language_example":"Don't say it like that."}]
["그렇다면",{"thoughts":"'그렇다면' is an often used conjunction in Korean that sets conditions or transitions related sentences. It's useful to understand expressions of conditionality or logical flow.","target_language_multi_word_term":"그렇다면","meaning":"'if so' or 'in that case'.","additional_notes":"Used to state what will happen or what is true if a preceding statement is acknowledged as true. It's often used to connect ideas logically or in hypothetical situations.","target_language_example":"그렇다면 우리는 어떻게 해야 합니까?","native_language_example":"In that case, what should we do?"}]
["꽤",{"thoughts":"'꽤' is a Korean adverb used to describe something to a considerable degree. It's useful for beginners to express levels of intensity or assurance in casual conversations.","target_language_multi_word_term":"꽤","meaning":"'quite', 'fairly', or 'rather'.","additional_notes":"Used to indicate a higher degree of something than expected, often in a positive sense. Commonly used in informal situations. It can modify adjectives and verbs to amplify their meaning.","target_language_example":"이 음식은 꽤 맛있어요.","native_language_example":"This food is quite tasty."}]
["나중에",{"thoughts":"The term '나중에' is used to refer to a later point in time, which can be useful for beginner learners to understand timing in conversations.","target_language_multi_word_term":"나중에","meaning":"'later' or 'at a later time'.","additional_notes":"Often used to indicate postponement or a future action or event. Can be used in casual conversations to suggest doing something after the current moment.","target_language_example":"나중에 만나요.","native_language_example":"See you later."}]
["내일",{"thoughts":"The term '내일' is a common word used in Korean to refer to the day after the current one. Beginners learning Korean will frequently encounter this word when discussing schedules, plans, or daily activities. It is fundamental vocabulary that is relevant to everyday conversation.","target_language_multi_word_term":"내일","meaning":"'tomorrow'.","additional_notes":"Commonly used in everyday conversation to discuss future plans or events. It indicates the day following today.","target_language_example":"내일 학교에 가요.","native_language_example":"I'm going to school tomorrow."}]
["너무",{"thoughts":"'너무' is an adverb in Korean that is commonly used to express the degree or intensity of a situation or emotion. Although it often translates to 'too,' it is not always negative in Korean as it can also emphasize positive feelings or amounts.","target_language_multi_word_term":"너무","meaning":"'too' or 'very'.","additional_notes":"In Korean, 너무 can mean both 'too much' (negative connotation) or simply 'very' (positive connotation) depending on the context. It's widely used in daily conversation to express strong feelings or extreme degrees.","target_language_example":"너무 맛있어요.","native_language_example":"It's very delicious."}]
["너무 좋다",{"thoughts":"너무 좋다 is a phrase frequently used to express strong positive feelings, such as joy or satisfaction. It's a common phrase used in everyday conversations when someone really likes something, or when they find an experience particularly enjoyable.","target_language_multi_word_term":"너무 좋다","meaning":"'so good' or 'very nice'.","additional_notes":"This phrase can be used to describe anything highly positive, from the taste of food to an experience or someone's actions.","target_language_example":"이 영화가 너무 좋아요!","native_language_example":"This movie is so good!"}]
["누구나",{"thoughts":"The Korean term '누구나' is used to refer to 'anyone' or 'everyone', often in a context that implies inclusivity or universality.","target_language_multi_word_term":"누구나","meaning":"'anyone' or 'everyone'.","additional_notes":"This term is used to express that something applies to all people without exception. It's commonly used to emphasize inclusivity.","target_language_example":"누구나 이 프로그램을 사용할 수 있습니다.","native_language_example":"Anyone can use this program."}]
["다",{"thoughts":"The word '다' is a common Korean adverb meaning 'all', 'everything', or 'completely'. It is used to indicate completeness or entirety.","target_language_multi_word_term":"다","meaning":"'all' or 'everything'.","additional_notes":"Often used to signify that something or someone has been completely considered or included. It is a versatile term that can be used in various contexts.","target_language_example":"그들은 다 왔어요.","native_language_example":"They all came."}]
["다르게",{"thoughts":"The Korean word '다르게' translates to 'differently' or 'in another way' in English. It is often used to express doing something in a way that is not usual or is different from how it was done before.","target_language_multi_word_term":"다르게","meaning":"Differently or in another way.","additional_notes":"Used to describe an action being done in a different manner from usual, or to suggest an alternative approach.","target_language_example":"그 문제를 다르게 생각해 보세요.","native_language_example":"Try thinking about that problem differently."}]
["다른",{"thoughts":"The term '다른' means 'different' or 'another' and it is commonly used to describe something that is not the same as something else, or to refer to an additional item or person. Beginner learners would find it useful when distinguishing objects or making choices.","target_language_multi_word_term":"다른","meaning":"'different' or 'another'.","additional_notes":"Used to describe something that is not the same as something already mentioned or something additional.","target_language_example":"다른 색깔을 원해요.","native_language_example":"I want a different color."}]
["다시",{"thoughts":"The word '다시' is a useful adverb in Korean that learners often encounter. It is similar to saying 'again' or 'anew' in English, commonly utilized when repeating actions or revisiting topics. Beginner learners will often find it useful in conversational contexts where actions are repeated or revisited.","target_language_multi_word_term":"다시","meaning":"'again' or 'once more.'","additional_notes":"'다시' is frequently used when you want to redo something or try something again. It can also imply retrying, revisiting a situation, or executing an action anew.","target_language_example":"다시 해봐요.","native_language_example":"Try it again."}]
["다시 한 번",{"thoughts":"The phrase '다시 한 번' is commonly used in Korean to request repetition or to emphasize doing something again. It translates directly to 'one more time' or 'again'. This is useful for beginners who need things repeated for practice or understanding. It's often heard in classrooms or casual settings when someone needs clarification or a second chance.","target_language_multi_word_term":"다시 한 번","meaning":"'once more' or 'again'.","additional_notes":"Can be used to politely ask someone to repeat themselves or to indicate a repeat action. It's applicable in various contexts, from casual conversations to formal settings.","target_language_example":"죄송하지만, 다시 한 번 말씀해 주세요.","native_language_example":"Sorry, but could you please say that one more time?"}]
["당장",{"thoughts":"The Korean term '당장' is used to express immediacy or urgency, equivalent to 'right now' or 'immediately' in English. It is often used when someone wants something to be done with no delay.","target_language_multi_word_term":"당장","meaning":"'right now' or 'immediately'.","additional_notes":"This term emphasizes the need for immediate action or response. It is used when there is an urgency or when something has to be done without any delay.","target_language_example":"당장 그 일을 끝내세요.","native_language_example":"Finish that task right now."}]
["대부분",{"thoughts":"The term '대부분' is often used in Korean to express the concept of the majority or most of something. It's useful for beginners to understand this common word as it frequently appears in conversations, especially when discussing generalities or common occurrences.","target_language_multi_word_term":"대부분","meaning":"'most' or 'the majority'.","additional_notes":"Used to refer to the larger part or majority of a group or quantity. It can be used with subjects like people, objects, or situations.","target_language_example":"사람들이 대부분 너무 바빠요.","native_language_example":"Most people are too busy."}]
["대한",{"thoughts":"The Korean term '대한' is often used in various contexts, frequently appearing in formal or official names and expressions related to national matters, or directly translating concepts involving 'about' or 'relating to'. For beginner learners, it might be relevant to focus on its use in conversational and written contexts.","target_language_multi_word_term":"대한","meaning":"'of' or 'about'","additional_notes":"대한 is commonly used in official titles, documents, and phrases to imply 'relating to' or 'concerning'. The word can also indicate national or international matters, especially linked with Korea itself, such as in the phrase '대한민국' (Republic of Korea).","target_language_example":"이 책은 환경 문제에 대한 정보를 제공합니다.","native_language_example":"This book provides information about environmental issues."}]
["대해",{"thoughts":"The Korean term '대해' is a postposition, often used to indicate that a statement or expression is about something or concerning something. It is derived from the verb '대하다' which means 'to treat' or 'to regard'. This term is very common and can appear in discussions, descriptions, or clarifications about a given subject.","target_language_multi_word_term":"대해","meaning":"'about' or 'concerning'.","additional_notes":"It is used to specify that something is the subject or focus of an expression or discussion, similar to 'about' in English. Often combined with nouns to explain what the topic is centered on.","target_language_example":"이 책은 환경문제에 대해 이야기합니다.","native_language_example":"This book talks about environmental issues."}]
["대해서",{"thoughts":"대해서 is a Korean term often used to mean 'about' or 'regarding' when discussing or referring to a subject or topic in various contexts.","target_language_multi_word_term":"대해서","meaning":"'about', 'regarding'.","additional_notes":"Used to indicate the subject of conversation or inquiry. Often follows nouns to specify what the conversation or question is concerning. It is commonly used in both spoken and written contexts.","target_language_example":"나는 그 문제에 대해서 생각하고 있어.","native_language_example":"I am thinking about the problem."}]
["더",{"thoughts":"The term '더' is a common adverb in Korean used to indicate a comparative aspect, like 'more' in English. This term is likely to be useful for learners when constructing sentences that involve comparisons or expressing a desire for something additional.","target_language_multi_word_term":"더","meaning":"'more'","additional_notes":"'더' is often used to describe something in greater quantity or degree. It can be applied in various contexts, such as asking for more of something, or comparing two items where one is greater than the other.","target_language_example":"더 크게 말해 주세요.","native_language_example":"Please speak louder."}]
["더 이상",{"thoughts":"The Korean phrase '더 이상' is used to indicate 'no longer' or 'not anymore,' especially in the context of changes or stopping an activity. It's useful for expressing the cessation of a habitual action or a state that will not continue.","target_language_multi_word_term":"더 이상","meaning":"'no longer' or 'not anymore'.","additional_notes":"Used to indicate that something will not continue or has stopped happening. Commonly used in negative sentences to express a cessation of actions or states.","target_language_example":"저는 더 이상 그곳에 살지 않아요.","native_language_example":"I no longer live there."}]
["드디어",{"thoughts":"'드디어' is an adverb often used to express excitement or relief that something has finally happened after a long wait.","target_language_multi_word_term":"드디어","meaning":"'finally' or 'at last'.","additional_notes":"Used to emphasize the completion or arrival of a desired event or situation after a period of waiting.","target_language_example":"드디어 휴가가 시작되었다.","native_language_example":"Finally, the vacation has started."}]
["둘 다",{"thoughts":"The Korean phrase '둘 다' is commonly used when referring to both items or both people, often implying inclusivity. Understanding and using this phrase allows beginners to accurately refer to multiple subjects simultaneously.","target_language_multi_word_term":"둘 다","meaning":"'both' or 'both of them'.","additional_notes":"Used when referring to two items, people, or options, indicating that both are included or considered.","target_language_example":"사과랑 바나나 둘 다 먹고 싶어요.","native_language_example":"I want to eat both an apple and a banana."}]
["따라",{"thoughts":"The Korean term '따라' is often used with verbs to indicate actions of following, copying, or according to something. It can be found in phrases like '따라서' (therefore, consequently) or used after a noun to express 'depending on' or 'according to'. For beginners, understanding its role in context is essential since it's adaptable.","target_language_multi_word_term":"따라","meaning":"'according to' or 'following'.","additional_notes":"'따라' can be used to indicate following someone or something, or to express actions taken according to a statement, rule, or condition. It's often used after the noun it refers to.","target_language_example":"그의 계획에 따라 우리는 움직였다.","native_language_example":"We moved according to his plan."}]
["딱",{"thoughts":"The Korean word '딱' is a versatile term often used to indicate something happening precisely, exactly, or fittingly. It conveys the idea of precision or perfect suitability in a situation.","target_language_multi_word_term":"딱","meaning":"exactly or precisely.","additional_notes":"Often used to emphasize the exactness or suitability of a situation. It can describe something fitting perfectly both in physical and metaphorical contexts.","target_language_example":"그는 딱 맞는 신발을 찾았다.","native_language_example":"He found shoes that fit perfectly."}]
["때문에",{"thoughts":"'때문에' is commonly used to express the reason or cause of a certain situation or action, and is often translated to 'because of' or 'due to'. It connects the cause to the effect and is frequently used in both written and spoken Korean.","target_language_multi_word_term":"때문에","meaning":"'because of' or 'due to'.","additional_notes":"It is used to explain the reason for something, often appearing after a noun or a noun phrase. It indicates causation between the first and second parts of the sentence.","target_language_example":"비가 많이 와서 콘서트가 취소되었습니다. 날씨 때문에요.","native_language_example":"The concert was canceled because it rained a lot. Because of the weather."}]
["막",{"thoughts":"The Korean term '막' can have several meanings based on context, but it is often used as an adverb indicating doing something just now, immediately before talking, or randomly. Understanding its context is crucial for accurate use and interpretation.","target_language_multi_word_term":"막","meaning":"'just' or 'recklessly'.","additional_notes":"'막' is versatile and context-dependent, often used to indicate something done just before or without much thought. It can convey actions done without prior notice or planning. Additionally, it can suggest doing something randomly or haphazardly.","target_language_example":"나는 막 도착했어.","native_language_example":"I just arrived."}]
["만큼",{"thoughts":"'만큼' is a Korean postposition used to indicate comparison, usually translated as 'as much as' or 'to the extent that'.","target_language_multi_word_term":"만큼","meaning":"'as much as' or 'to the extent that'.","additional_notes":"It is attached to nouns or noun phrases to compare quantities, amounts, or degrees. It is often used in expressions of equality, where two things are compared in terms of their attributes or actions.","target_language_example":"그는 나만큼 열심히 일해요.","native_language_example":"He works as hard as I do."}]
["말고",{"thoughts":"The term '말고' means 'instead of' or 'not A but B'. It's used to show preference or suggest a substitution or alternative to something else.","target_language_multi_word_term":"말고","meaning":"instead of; not A but B.","additional_notes":"This phrase is used to suggest an alternative to something previously stated and generally appears with lists or when clarifying choices.","target_language_example":"이거 말고 저걸 주세요.","native_language_example":"Give me that one, not this one."}]
["말하자면",{"thoughts":"'말하자면' is a Korean phrase used to introduce a statement or explanation. It's equivalent to saying 'in other words' or 'that is to say' in English. This term is useful for learners to clarify or expand upon a statement.","target_language_multi_word_term":"말하자면","meaning":"'in other words' or 'that is to say'","additional_notes":"Frequently used when providing clarification or elaborating on something previously mentioned. It's an informal way to bridge ideas and aid in explanations.","target_language_example":"그녀는 정말 성실한 학생이에요. 말하자면, 매일 도서관에 가요.","native_language_example":"She is a very diligent student. In other words, she goes to the library every day."}]
["매년",{"thoughts":"The Korean term '매년' is used to describe a recurring action or event that happens every year, often used in both written and spoken contexts.","target_language_multi_word_term":"매년","meaning":"'every year'.","additional_notes":"This term is used to denote something that occurs on a yearly basis, such as events, celebrations, or regular occurrences.","target_language_example":"매년 우리는 가족과 함께 여행을 갑니다.","native_language_example":"Every year, we go on a trip with our family."}]
["매우",{"thoughts":"The term '매우' is an adverb often used in Korean to convey a higher degree or intensity of something, similar to the English words 'very' or 'extremely'. It is useful for beginners to learn because it frequently appears in everyday conversation to express strong feelings or descriptions.","target_language_multi_word_term":"매우","meaning":"'very' or 'extremely'.","additional_notes":"Often used to emphasize adjectives and can be replaced with '아주' in some contexts. It is formal compared to '너무' which can also mean 'very'.","target_language_example":"그녀는 매우 아름다워요.","native_language_example":"She is very beautiful."}]
["매일",{"thoughts":"The Korean term '매일' is commonly used to express daily occurrences or routines.","target_language_multi_word_term":"매일","meaning":"every day.","additional_notes":"'매일' is used to express repetition or habitual action happening on a daily basis. It is often used at the start or end of a sentence.","target_language_example":"저는 매일 운동해요.","native_language_example":"I exercise every day."}]
["몇",{"thoughts":"몇 is a determiner meaning 'how many' or 'a few' used to ask about quantity.","target_language_multi_word_term":"몇","meaning":"'how many' or 'a few'.","additional_notes":"This word is often used in questions to ask about the number of objects or people. It can be followed by a counter to specify what exactly is being counted, such as 명 for people or 개 for general objects.","target_language_example":"이 방에 몇 명 있어요?","native_language_example":"How many people are in this room?"}]
["몇 개",{"thoughts":"The Korean term '몇 개' is commonly used to ask for or specify a number of items. It involves counting objects and can be linked to various nouns.","target_language_multi_word_term":"몇 개","meaning":"'how many' or 'a few'.","additional_notes":"Typically used when asking about the quantity of countable objects. '몇' means 'how many' or 'some', and '개' is a counter for items.","target_language_example":"사과 몇 개 있어요?","native_language_example":"How many apples are there?"}]
["몇 시에",{"thoughts":"The phrase '몇 시에' is used in Korean to ask about the time something occurs. It's equivalent to asking 'at what time' in English. This is a useful phrase for learners to know when scheduling activities or appointments.","target_language_multi_word_term":"몇 시에","meaning":"'at what time?'.","additional_notes":"Used when asking about the time something will happen or asking what time it is currently.","target_language_example":"영화는 몇 시에 시작해요?","native_language_example":"At what time does the movie start?"}]
["모든",{"thoughts":"The term '모든' is an adjective in Korean that is frequently used to indicate totality or entirety, similar to 'all' in English. It's relevant for beginners to understand how to describe things collectively.","target_language_multi_word_term":"모든","meaning":"'all' or 'every'.","additional_notes":"'모든' is used before nouns to describe all members or items of a set. It’s commonly used in sentences to indicate that the subject includes every part or aspect of something.","target_language_example":"모든 사람들이 함께 웃었다.","native_language_example":"All the people laughed together."}]
["모든 걸",{"thoughts":"'모든 걸' stems from the Korean phrase meaning 'everything.' It is a contraction of '모든 것을,' where '모든' means 'all' or 'every,' and '것을' means 'thing.' The contraction is common in spoken Korean, making it sound more natural. It's frequently used to describe someone who is offering or promising 'everything' or 'all things.'","target_language_multi_word_term":"모든 걸","meaning":"'everything' or 'all things'.","additional_notes":"'모든 걸' is a contraction of '모든 것을.' It's used in informal contexts and indicates a sense of completion or inclusivity about objects or topics being referred to.","target_language_example":"난 너에게 모든 걸 줄게.","native_language_example":"I will give you everything."}]
["무슨",{"thoughts":"'무슨' is a Korean interrogative modifier used to ask about the nature or kind of something, similar to 'what kind of' in English.","target_language_multi_word_term":"무슨","meaning":"'what kind of' or 'which'.","additional_notes":"Used with nouns to inquire specifically about the type or kind of the noun being referenced.","target_language_example":"무슨 책을 읽고 있어요?","native_language_example":"What kind of book are you reading?"}]
["무슨 말을",{"thoughts":"'무슨 말을' is a common Korean phrase used to inquire about or express confusion about what has been said in a conversation.","target_language_multi_word_term":"무슨 말을","meaning":"'what words' or 'what is being said'.","additional_notes":"It is often used in questions or expressions of confusion to clarify what someone has said or to indicate that you didn't understand something fully.","target_language_example":"무슨 말을 하는지 모르겠어요.","native_language_example":"I don't understand what you're saying."}]
["무슨 일이",{"thoughts":"The phrase '무슨 일이' is used in Korean to ask about what happened or what's going on. It is commonly used in everyday conversation to show curiosity or concern about a situation.","target_language_multi_word_term":"무슨 일이","meaning":"'what's happening' or 'what's the matter'.","additional_notes":"The phrase is often used at the beginning of a sentence when expressing concern or curiosity about an event or situation. It can be followed by a verb to specify the context, such as '있어요' (is there) or '있었어요' (was there).","target_language_example":"무슨 일이 있었어요?","native_language_example":"What happened?"}]
["무엇을",{"thoughts":"The term '무엇을' (mu-eo-seul) is the accusative form of '무엇', meaning 'what'. It is used to ask questions or make statements about 'what' someone is doing or wants.","target_language_multi_word_term":"무엇을","meaning":"'what' (object form).","additional_notes":"Used when asking questions about the object of an action. It's commonly used in conversation to clarify or inquire what the subject is acting upon.","target_language_example":"무엇을 먹고 싶습니까?","native_language_example":"What do you want to eat?"}]
["무엇이",{"thoughts":"'무엇이' is the subject form of 'what' in Korean, specifically used when 'what' is the subject of the sentence. Understanding its usage is important for forming questions and statements in Korean.","target_language_multi_word_term":"무엇이","meaning":"'what', as a subject.","additional_notes":"Used when asking questions where 'what' is the subject. Often used in formal or written Korean, with more casual or spoken contexts using '뭐가' instead.","target_language_example":"무엇이 가장 중요합니까?","native_language_example":"What is the most important?"}]
["무엇",{"thoughts":"'무엇' is a common question word in Korean used to ask about things or concepts. It's equivalent to 'what' in English.","target_language_multi_word_term":"무엇","meaning":"'what'.","additional_notes":"Used when asking about the identity, nature, or quality of an object or concept. Often used in questions.","target_language_example":"여기서 무엇을 찾고 있어요?","native_language_example":"What are you looking for here?"}]
["무엇인지",{"thoughts":"'무엇인지' is a Korean phrase used to express 'what it is' or 'what something is' and is often found in indirect questions or statements.","target_language_multi_word_term":"무엇인지","meaning":"'what it is'.","additional_notes":"Used to refer to or question the identity or nature of something in indirect statements or questions. It asks or explains the essence or content of an unknown object or situation.","target_language_example":"그게 무엇인지 알아요?","native_language_example":"Do you know what that is?"}]
["누구와도",{"thoughts":"'누구와도' is a Korean phrase meaning 'with anyone' or 'with everyone,' typically used to express someone's flexibility regarding social interactions or activities with any person.","target_language_multi_word_term":"누구와도","meaning":"'with anyone' or 'with everyone'.","additional_notes":"Used to express an openness or willingness to interact or do something with any person, often conveying a sense of inclusivity.","target_language_example":"그는 누구와도 쉽게 친해져요.","native_language_example":"He easily becomes friends with anyone."}]
["뭐",{"thoughts":"‘뭐’ is a common Korean word used in everyday conversation. It is often used in questions or to express curiosity about something. It can also be used informally in broader contexts like ‘What’s up?’ or ‘What?’ in response to something surprising or confusing.","target_language_multi_word_term":"뭐","meaning":"'what'.","additional_notes":"Used in questions or to express curiosity, surprise, or confusion. Often used informally.","target_language_example":"뭐 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["몇 시간이나",{"thoughts":"'몇 시간이나' is a Korean phrase used to ask about the duration or amount of time, translating roughly to 'how many hours'. It's used to inquire about time spans for activities or events.","target_language_multi_word_term":"몇 시간이나","meaning":"'how many hours.'","additional_notes":"This phrase is commonly used to ask about the length of time something takes or lasts. It can be applied in various contexts, such as waiting time, travel duration, or amount of time spent doing an activity.","target_language_example":"그 영화는 몇 시간이나 해요?","native_language_example":"How many hours does that movie run?"}]
["뭐가",{"thoughts":"'뭐가' is a contraction of '무엇이', which translates to 'what is' or 'what's'. This phrase is often used to ask about something specific or emphasize the subject in a question. It is a part of conversational Korean used informally.","target_language_multi_word_term":"뭐가","meaning":"'what is'.","additional_notes":"It is used in informal settings to ask questions emphasizing 'what'. It's a contraction of '무엇이', more commonly used in conversation.","target_language_example":"그게 뭐가 문제야?","native_language_example":"What's the problem with that?"}]
["누구랑도",{"thoughts":"'누구랑도' is a Korean phrase that can be used to express the idea of doing something with anyone or everyone. It can imply openness or flexibility, often appearing in conversational contexts.","target_language_multi_word_term":"누구랑도","meaning":"'with anyone' or 'with everybody'.","additional_notes":"This phrase is versatile and is often used when indicating a willingness or flexibility to interact or engage with any person. It can emphasize inclusivity in social contexts.","target_language_example":"저는 누구랑도 이야기를 잘 할 수 있어요.","native_language_example":"I can talk well with anyone."}]
["것이 아니다",{"thoughts":"The phrase '것이 아니다' is used to express negation, indicating that something is not what it is assumed to be or expected. It's a common structure in Korean to clarify or refute a statement.","target_language_multi_word_term":"것이 아니다","meaning":"'is not' or 'isn't'.","additional_notes":"Often used to explain that something is not the case or to negate a previous statement. The phrase can be used in various contexts, either in formal or informal speech, depending on the formality level of the sentence.","target_language_example":"이건 내가 원한 것이 아니다.","native_language_example":"This is not what I wanted."}]
["몇 번이나",{"thoughts":"The phrase '몇 번이나' is often used in Korean to ask or state how many times something has occurred. It is a phrase that combines '몇' meaning 'how many', '번' meaning 'times', and '이나', which can add emphasis. This could be useful for beginners to comprehend frequency and emphasis in daily conversations.","target_language_multi_word_term":"몇 번이나","meaning":"'how many times'.","additional_notes":"It is used to emphasize the frequency of an action or event. Useful in conversations about repeated actions or experiences.","target_language_example":"그 영화를 몇 번이나 봤어요?","native_language_example":"How many times have you watched that movie?"}]
["뭐든",{"thoughts":"The Korean word '뭐든' combines '뭐', meaning 'what', with '든', which indicates 'anything' or 'whatever'. It's an informal way to express the idea of being open to any possibility or option.","target_language_multi_word_term":"뭐든","meaning":"'anything', 'whatever'.","additional_notes":"'뭐든' is commonly used to express openness or indifference towards a choice among multiple options. It is often used in casual conversations.","target_language_example":"나는 뭐든 괜찮아.","native_language_example":"Whatever is fine with me."}]
["뭐라고",{"thoughts":"The term '뭐라고' is often used in Korean to ask for clarification or repetition. It's an informal expression generally used in casual conversations.","target_language_multi_word_term":"뭐라고","meaning":"'What did you say?' or 'Pardon?'","additional_notes":"This expression is informal and commonly used when you didn't hear or understand something properly. It's equivalent to saying 'What?' in English when you want someone to repeat themselves or clarify what they just said.","target_language_example":"네가 뭐라고 했어?","native_language_example":"What did you say?"}]
["거짓말을 하다",{"thoughts":"The Korean term '거짓말을 하다' is a verb phrase meaning 'to lie' or 'to tell a lie.' It involves deceit or saying something that is not true. This phrase will be useful for learners to describe situations involving honesty or dishonesty.","target_language_multi_word_term":"거짓말을 하다","meaning":"to lie, to tell a lie.","additional_notes":"This phrase is used to describe the act of intentionally deceiving someone by not telling the truth. It can be used in various contexts, such as when warning against deception or discussing honesty.","target_language_example":"그는 언제나 거짓말을 해요.","native_language_example":"He always tells lies."}]
["무슨 일을",{"thoughts":"The phrase '무슨 일을' is often part of sentence structures asking about what kind of work or thing someone is doing. It's a combination of '무슨', meaning 'what kind of', and '일', meaning 'work' or 'thing'.","target_language_multi_word_term":"무슨 일을","meaning":"'what kind of work' or 'what are you doing'.","additional_notes":"Used to ask about the type of work or activity someone is engaged in. Can be used in both formal and informal contexts depending on the sentence it is part of.","target_language_example":"무슨 일을 하고 계세요?","native_language_example":"What kind of work are you doing?"}]
["뭐야",{"thoughts":"The term '뭐야' is often used in casual or informal conversation in Korean. It's a way to express surprise, confusion, or ask what something is. It's a contraction of '무엇이야', and it's very common to hear in everyday conversations.","target_language_multi_word_term":"뭐야","meaning":"'What is it?' or 'What?!'.","additional_notes":"Used frequently in casual conversations to express surprise or a request for clarification about something. Often seen in informal settings.","target_language_example":"이거 뭐야?","native_language_example":"What is this?"}]
["가야 되다",{"thoughts":"The Korean phrase '가야 되다' is frequently used when expressing obligation or necessity, particularly in terms of needing to go somewhere.","target_language_multi_word_term":"가야 되다","meaning":"'need to go' or 'must go'.","additional_notes":"'가야 되다' is used to express the necessity or obligation to go somewhere. It combines the verb '가다' meaning 'to go' with '되다' implying something must be done.","target_language_example":"지금 가야 돼.","native_language_example":"I need to go now."}]
["뭘",{"thoughts":"'뭘' is a contracted form of '무엇을', which means 'what' in English. It is often used in conversation to ask about something in a casual manner.","target_language_multi_word_term":"뭘","meaning":"'what'.","additional_notes":"Used in informal contexts to ask questions or inquire about something; often comes at the beginning of a sentence. '뭘' is short for '무엇을' and is the object of the verb in the sentence.","target_language_example":"뭘 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["바로",{"thoughts":"The term '바로' can have several meanings depending on the context, such as 'right away', 'immediately', or direct/straight. It's often used to describe actions that should be done without delay or to indicate immediacy or directness.","target_language_multi_word_term":"바로","meaning":"'immediately' or 'directly'.","additional_notes":"'바로' is often used to emphasize that something should happen without delay or to indicate movement in a straight direction. It is sometimes used as an adverb to ensure clarity of time or space.","target_language_example":"제가 바로 갈게요.","native_language_example":"I will go right away."}]
["밖에",{"thoughts":"The Korean postposition '밖에' roughly translates to 'nothing but' or 'only'. It is used to express limitations or exclusivity with a negative connotation, often forming a constraining sentiment about an action or entity.","target_language_multi_word_term":"밖에","meaning":"'nothing but', 'only'.","additional_notes":"Typically used with negative endings to emphasize a limited quantity or capacity. For example, when saying 'I only have one apple', the implication is that having only one is insufficient.","target_language_example":"쌀이 조금밖에 없어요.","native_language_example":"There is nothing but a little rice."}]
["보다",{"thoughts":"The Korean word '보다' is versatile, acting as both a verb and a comparative particle, often confusing for beginners because it means to 'see' or 'look' as a verb, but can also be used to indicate comparison between two entities.","target_language_multi_word_term":"보다","meaning":"To 'see' or 'look'; also used for comparisons ('than').","additional_notes":"As a verb, '보다' commonly means 'to see', 'to look', or 'to watch'. In comparative sentences, it is used to compare two things, similar to the English word 'than'.","target_language_example":"영화를 보다.","native_language_example":"To watch a movie."}]
["머리가 아프다",{"thoughts":"The phrase '머리가 아프다' is commonly used in Korean to express having a headache. It's a basic physical complaint that is frequently applicable in daily conversations.","target_language_multi_word_term":"머리가 아프다","meaning":"to have a headache.","additional_notes":"This phrase literally translates to 'the head hurts' in English, and is used to describe physical pain in the head. It's similar to saying 'I have a headache' in English.","target_language_example":"오늘 아침부터 머리가 아파요.","native_language_example":"I've had a headache since this morning."}]
["도와주다",{"thoughts":"The Korean term '도와주다' is a verb used to express the action of helping someone. It is a common phrase that beginners might encounter early in their learning as it is widely applicable in everyday situations.","target_language_multi_word_term":"도와주다","meaning":"to help someone.","additional_notes":"This verb combines the word '돕다' (to help) with '주다' (to give), indicating you are giving help to someone else. It is often used when offering assistance or asking for help.","target_language_example":"어려울 때 친구를 도와주세요.","native_language_example":"Please help your friend when they are in trouble."}]
["말이야",{"thoughts":"The term '말이야' is a common Korean expression used to clarify or emphasize what one is referring to, often added at the end of a sentence for emphasis or clarification.","target_language_multi_word_term":"말이야","meaning":"I mean, I say, or as for.","additional_notes":"It's often used to draw attention to or specify what's being talked about. It's casual and can be used to reiterate or emphasize a point.","target_language_example":"그 사람 말이야, 정말 친절해.","native_language_example":"That person, I mean, is really kind."}]
["비해",{"thoughts":"'비해' is used in Korean to indicate comparison, similar to the English term 'compared to' or 'than'. It's often used to contrast two things or situations.","target_language_multi_word_term":"비해","meaning":"'compared to' or 'than'.","additional_notes":"Usually used with the particle '에' or '는' to make comparisons between two subjects or conditions.","target_language_example":"올해는 작년에 비해 더운 것 같아요.","native_language_example":"It seems hotter this year compared to last year."}]
["돈이 많다",{"thoughts":"The Korean phrase '돈이 많다' is a basic phrase describing financial status that could be essential for beginners to express or understand wealth related statements.","target_language_multi_word_term":"돈이 많다","meaning":"to have a lot of money.","additional_notes":"Used to describe someone who is wealthy or mentions having significant financial resources. It can be used both literally and figuratively when discussing the concept of wealth.","target_language_example":"그 사람은 돈이 많다.","native_language_example":"That person has a lot of money."}]
["빨리",{"thoughts":"The Korean word '빨리' is an adverb and commonly used to express urgency or haste, meaning 'quickly' or 'fast'. It's an essential word for beginners to understand basic instructions or to communicate urgency in everyday situations.","target_language_multi_word_term":"빨리","meaning":"quickly or fast","additional_notes":"Used to express urgency or the need to hurry. Common in everyday speech and frequently used to encourage others to act faster or to describe something being done rapidly.","target_language_example":"빨리 와!","native_language_example":"Come quickly!"}]
["누구랑",{"thoughts":"'누구랑' is used to ask or talk about who someone is with, involving the particle '랑' which means 'with'. It is informal and commonly used in everyday conversation.","target_language_multi_word_term":"누구랑","meaning":"'with whom'.","additional_notes":"This is an informal way to ask about the person with whom someone is or was. It is often used in casual conversations among friends.","target_language_example":"너 오늘 누구랑 영화 봤어?","native_language_example":"Who did you watch the movie with today?"}]
["몇 번이고",{"thoughts":"The term '몇 번이고' is used in Korean to express the idea of doing something multiple times or several times. It reflects frequency and repetitiveness, suitable when emphasizing the countless number of times an action occurs.","target_language_multi_word_term":"몇 번이고","meaning":"'again and again' or 'several times'.","additional_notes":"This expression is used to emphasize repetition or numerous occurrences of an action. It can convey a sense of persistence or insistence.","target_language_example":"나는 몇 번이고 그 책을 읽었어.","native_language_example":"I read that book several times."}]
["누구한테든",{"thoughts":"'누구한테든' is a Korean phrase combining '누구' (anybody) and '한테든' (indicative of 'to', 'at', or 'by', with a nuance of universality). It is often used to indicate an action or state is applicable to any person without exception.","target_language_multi_word_term":"누구한테든","meaning":"'to anyone' or 'by anyone'.","additional_notes":"Used to indicate that something applies universally to any person or that someone is willing to engage with anybody. Common in conversational contexts.","target_language_example":"누구한테든 물어봐도 돼요.","native_language_example":"You can ask anyone."}]
["뿐이다",{"thoughts":"The Korean term '뿐이다' is often used to emphasize that something is the only choice or option. It's like the English phrase 'only' in a similar context.","target_language_multi_word_term":"뿐이다","meaning":"'only', 'just'.","additional_notes":"Used to emphasize that something is limited to the mentioned condition, often highlighting exclusivity or a singular option. It's a way to express limitations or singularity, similar to saying 'there is only this option'.","target_language_example":"그녀를 사랑할 뿐이다.","native_language_example":"I only love her."}]
["뿐이야",{"thoughts":"The Korean term '뿐이야' is a colloquial expression often used to convey limitation or exclusivity, similar to saying 'only' or 'just' in English.","target_language_multi_word_term":"뿐이야","meaning":"'only' or 'just'.","additional_notes":"Used to emphasize the exclusivity or limitation of an action or subject. Commonly used in informal conversations.","target_language_example":"그는 그냥 친구일 뿐이야.","native_language_example":"He's just a friend."}]
["뿐이지",{"thoughts":"The term '뿐이지' is often used in Korean to express limitation or restriction, similar to saying 'just' or 'only' in English. It can convey a sense of resignation or narrowing of options.","target_language_multi_word_term":"뿐이지","meaning":"'just' or 'only'.","additional_notes":"Used to emphasize that what is mentioned is the exact and only possibility or option. Often conveys a sense of resignation or confirmation of limitations.","target_language_example":"그건 단지 오해일 뿐이지.","native_language_example":"That's just a misunderstanding."}]
["세상에",{"thoughts":"'세상에' is an exclamatory phrase in Korean that expresses surprise, astonishment, or disbelief. It is similar to expressing 'Oh my!' or 'Wow!' in English.","target_language_multi_word_term":"세상에","meaning":"'Oh my!' or 'Wow!'","additional_notes":"Used to express surprise or disbelief, often in reaction to unexpected news or situations.","target_language_example":"세상에, 그게 정말 사실이야?","native_language_example":"Wow, is that really true?"}]
["가능하면",{"thoughts":"The term '가능하면' is used in Korean to suggest an action if it is possible. It's a common phrase seen in conditional sentences and can be useful when making polite requests or expressing preferences.","target_language_multi_word_term":"가능하면","meaning":"'if possible'.","additional_notes":"It's used to express a preference or a suggestion that should be followed if it is feasible. Often used in requests or to politely express a wish.","target_language_example":"가능하면 내일 만나자.","native_language_example":"Let's meet tomorrow if possible."}]
["무슨 일",{"thoughts":"The Korean multi-word term '무슨 일' combines the question word '무슨' (what kind of/which) with '일' (thing/matter/job). This phrase is often used to inquire about something that has occurred or someone’s occupation.","target_language_multi_word_term":"무슨 일","meaning":"'what happened', 'what's going on', or 'what kind of work'.","additional_notes":"'무슨 일' can be used to ask about an event or situation that's currently happening or has occurred, as well as to inquire about someone's job or task.","target_language_example":"무슨 일이 있었어요?","native_language_example":"What happened?"}]
["그만하다",{"thoughts":"The term '그만하다' is a versatile verb in Korean. It is commonly used to indicate stopping or ceasing an action. This is important for beginner learners as it's essential for expressing and understanding when to halt activities. It can also imply 'to quit' or 'no more.'","target_language_multi_word_term":"그만하다","meaning":"'to stop' or 'to cease'.","additional_notes":"Used when you want to signify stopping something that is currently happening. It can also be interpreted as 'to quit' when referring to stopping an ongoing involvement, like a job or activity.","target_language_example":"빠르게 걷는 것을 그만하세요.","native_language_example":"Stop walking so fast."}]
["수 있다",{"thoughts":"The phrase '수 있다' is used in Korean to express the ability to do something or the possibility that something can happen.","target_language_multi_word_term":"수 있다","meaning":"'can' or 'be able to'.","additional_notes":"This expression is typically placed after a verb stem, indicating the ability or possibility related to the action. For example, when placed after '먹' (from '먹다' meaning 'to eat'), it becomes '먹을 수 있다' meaning 'can eat'.","target_language_example":"저는 운전할 수 있어요.","native_language_example":"I can drive."}]
["갈수록",{"thoughts":"The term '갈수록' is often used in Korean to indicate a situation or condition that is changing or intensifying over time. It usually precedes an adjective or adverb.","target_language_multi_word_term":"갈수록","meaning":"'increasingly' or 'more and more'.","additional_notes":"This term is used to describe a trend or ongoing change, usually in a negative context or to express that something is becoming more pronounced. It is often paired with expressions that describe how something is progressing.","target_language_example":"날씨가 갈수록 추워져요.","native_language_example":"The weather is getting colder and colder."}]
["몇 시",{"thoughts":"The term '몇 시' is used in Korean to inquire about the current time or to ask at what time a particular event occurs. The full meaning often involves the word '시간' (time) but beginners typically focus on '몇 시' to ask simple time-related questions.","target_language_multi_word_term":"몇 시","meaning":"'What time is it?' or 'At what time?'","additional_notes":"Commonly used when asking for the current time or when inquiring about the timing of an event. Often accompanied by verbs like '예요?' for more complete questions.","target_language_example":"지금 몇 시예요?","native_language_example":"What time is it now?"}]
["무엇이고",{"thoughts":"The term '무엇이고' is used in Korean to refer to or question what something is, often in relative clauses. It combines '무엇' meaning 'what' and '이고' which is a particle often used to connect clauses, similar to 'and' or 'is' in English.","target_language_multi_word_term":"무엇이고","meaning":"'what is'.","additional_notes":"Used to query or explain what something is, especially in the context of a relative clause or in casual conversations.","target_language_example":"이것은 무엇이고, 저것은 무엇이야?","native_language_example":"What is this, and what is that?"}]
["아마",{"thoughts":"The term '아마' is often used in Korean to express a sense of uncertainty or probability of a future event. It's similar to saying 'probably' or 'maybe' in English, conveying that something is likely or assumed but not certain.","target_language_multi_word_term":"아마","meaning":"probably or maybe.","additional_notes":"'아마' is used when you want to express uncertainty or speculate about a situation. It's often used in combination with future or present tense verbs to suggest probability.","target_language_example":"아마 비가 올 거예요.","native_language_example":"It will probably rain."}]
["아무것도",{"thoughts":"The Korean term '아무것도' is a common expression used to denote 'nothing' or the absence of anything. It's typically used in negative sentences.","target_language_multi_word_term":"아무것도","meaning":"'nothing'.","additional_notes":"Often used with negation to emphasize that there is not even one thing or no particular thing at all. It can be used in various contexts where you want to emphasize emptiness or absence.","target_language_example":"그는 아무것도 먹지 않았어요.","native_language_example":"He didn't eat anything."}]
["아무도",{"thoughts":"The word '아무도' in Korean is a pronoun that means 'nobody' or 'anybody' when used in negative sentences. It is useful for expressing absence of action or involvement by anyone. This is a common term used in everyday Korean speech to describe scenarios without a particular doer or when emphasizing that no person is involved.","target_language_multi_word_term":"아무도","meaning":"'nobody' or 'no one'.","additional_notes":"In Korean, '아무도' is primarily used in negative contexts to indicate that no person is involved in the action or situation. It often pairs with negative verbs or phrases like '없다' (not exist) or '못하다' (cannot do).","target_language_example":"아무도 없어요.","native_language_example":"There's nobody here."}]
["아주",{"thoughts":"The Korean term '아주' is a commonly used adverb that has a simple yet effective role in expressing intensity. It's comparable to English words that enhance or magnify the adjectives or verbs they modify. This term is quite useful for beginners to know, as it can be used in a variety of contexts to convey emphasis.","target_language_multi_word_term":"아주","meaning":"'very' or 'quite'.","additional_notes":"'아주' is used to intensify adjectives or verbs. It's commonly used in everyday speech to express a strong degree of something. It's akin to saying 'really' in English when trying to stress how good, bad, etc., something is.","target_language_example":"이 영화는 아주 재미있어요.","native_language_example":"This movie is very interesting."}]
["아직",{"thoughts":"The word '아직' is a basic Korean adverb that is used to express the sense of 'still' or 'yet', indicating a continuation of an action or state from the past into the present.","target_language_multi_word_term":"아직","meaning":"'still' or 'not yet'.","additional_notes":"Used to describe a situation or condition that has not yet changed or been completed. It can imply that something has remained the same over a period of time or that a condition or event is expected to occur in the future.","target_language_example":"아직 숙제를 안 했어요.","native_language_example":"I haven't done my homework yet."}]
["아직도",{"thoughts":"'아직도' is a Korean adverb used frequently in conversations to indicate that a certain condition or action continues to exist or occur, despite expectations it would change by now.","target_language_multi_word_term":"아직도","meaning":"still, yet","additional_notes":"Used to express surprise or incredulity that something is continuing longer than expected, or when asking if something is still the case.","target_language_example":"너 아직도 일하고 있어?","native_language_example":"Are you still working?"}]
["안 돼",{"thoughts":"The phrase '안 돼' in Korean is commonly used to express disagreement or refusal. It is one of the first phrases learners encounter due to its frequent usage in everyday conversation, especially in informal and casual contexts. It is an important phrase for learners to recognize and understand, enabling them to navigate basic interactions and responses.","target_language_multi_word_term":"안 돼","meaning":"'No', 'it doesn't work', or 'don't do it'.","additional_notes":"This phrase can be used as a standalone expression to indicate that something is not permissible or possible. It's often used in informal settings. It can express disapproval, denial, or rejection.","target_language_example":"안 돼! 그거 하지 마!","native_language_example":"No! Don't do that!"}]
["무엇인가",{"thoughts":"'무엇인가' is used in Korean to convey the idea of 'something' or 'anything.' It indicates uncertainty or an unspecified object or idea, often used in questions or when the subject is not fully known.","target_language_multi_word_term":"무엇인가","meaning":"'something' or 'anything'.","additional_notes":"Often used when the exact object or concept is unknown or unspecified, similar to asking if there is anything or noting the existence of something without specifics.","target_language_example":"저기 무엇인가 있어요?","native_language_example":"Is there something over there?"}]
["알고 있어",{"thoughts":"The Korean phrase '알고 있어' is an informal expression used in casual settings. It is derived from the verb '알다' meaning 'to know' and is often used in conversations among friends or close acquaintances to indicate that the speaker is aware of or has understood something.","target_language_multi_word_term":"알고 있어","meaning":"'I know' or 'I'm aware'.","additional_notes":"This phrase is informal and commonly used with friends or people of the same age group. It conveys understanding or acknowledgment in response to information or a situation. It should not be used in formal situations, where '압니다' might be more appropriate.","target_language_example":"그 영화 너무 재밌었어!","native_language_example":"I already know."}]
["말하다",{"thoughts":"'말하다' is a common Korean verb used to express the action of speaking or saying something. It is important for beginners as it is frequently used in daily conversation and when learning to communicate in Korean.","target_language_multi_word_term":"말하다","meaning":"'to speak' or 'to say'.","additional_notes":"'말하다' can be used in various contexts, such as stating facts, giving opinions, or recounting information. It often appears in conjugated forms like '말해요' or '말했어요' to fit different grammatical contexts and levels of politeness.","target_language_example":"그는 진실을 말했어요.","native_language_example":"He told the truth."}]
["약간",{"thoughts":"'약간' is a Korean term commonly used in conversation indicating a small or limited degree of something, similar to 'a bit' or 'slightly' in English.","target_language_multi_word_term":"약간","meaning":"a little bit; slightly.","additional_notes":"Used when expressing a small quantity or minor extent of something. It's often used to soften statements or describe slight degrees of difference or feelings.","target_language_example":"날씨가 약간 추워요.","native_language_example":"The weather is a little bit cold."}]
["어느",{"thoughts":"'어느' is a common Korean determiner used to ask questions about choices or specify an item from a set.","target_language_multi_word_term":"어느","meaning":"'which' or 'which one'.","additional_notes":"This term is used to ask about a choice or selection among different options. It's often used in a question format to inquire about a specific item or group.","target_language_example":"어느 책을 읽고 싶어요?","native_language_example":"Which book do you want to read?"}]
["어디",{"thoughts":"The Korean word '어디' is a basic term used in questions to ask about location, meaning 'where'. Beginner learners often encounter it along with various verbs to form questions related to location.","target_language_multi_word_term":"어디","meaning":"'where'.","additional_notes":"Often used in questions to inquire about place or position. Commonly used with location-related verbs such as 가다 (to go), 있다 (to be), etc.","target_language_example":"당신은 어디에 있습니까?","native_language_example":"Where are you?"}]
["어디서",{"thoughts":"The term '어디서' is a question word used to ask about locations. It's a fundamental part of learning how to form questions about place or origin in Korean.","target_language_multi_word_term":"어디서","meaning":"'where'.","additional_notes":"Used when asking for the location where an action takes place or the origin of something.","target_language_example":"이 책을 어디서 샀어요?","native_language_example":"Where did you buy this book?"}]
["어떤",{"thoughts":"'어떤' is an interrogative word used in Korean. It functions as an adjective to inquire about the nature or kind of something.","target_language_multi_word_term":"어떤","meaning":"'what kind of' or 'which'.","additional_notes":"'어떤' is often used to ask about the characteristics or types of things, focusing on the identity or quality rather than amounts or numbers.","target_language_example":"어떤 책을 좋아하세요?","native_language_example":"What kind of books do you like?"}]
["떨어지다",{"thoughts":"The term '떨어지다' in Korean is a verb that can be used in various contexts to describe the act of falling or dropping from a higher position to a lower one. It's often used literally for objects but can also be metaphorical, such as describing the failure in a test or a reduction in temperature or quality.","target_language_multi_word_term":"떨어지다","meaning":"to fall, to drop.","additional_notes":"Can be used both literally (like an object falling) and metaphorically (like a decline in quality or failing a test). Often appears in daily conversations.","target_language_example":"사과가 나무에서 떨어졌어요.","native_language_example":"The apple fell from the tree."}]
["나면서",{"thoughts":"The Korean term '나면서' is derived from the verb '나다' which means 'to emerge' or 'to be born', combined with the suffix '-면서', which indicates simultaneous actions or states. This combination suggests an expression of doing something while being born or emerging.","target_language_multi_word_term":"나면서","meaning":"'while being born.'","additional_notes":"This phrase is used to describe an action that happens or exists concurrently with the moment of birth or emergence.","target_language_example":"그는 나면서부터 음악에 재능이 있었어요.","native_language_example":"He had a talent for music since he was born."}]
["말이다",{"thoughts":"The term '말이다' is a Korean expression similar to saying 'I mean' or 'you know' in English. It's used to clarify or emphasize a previous statement or to add more information.","target_language_multi_word_term":"말이다","meaning":"'I mean' or 'you know'.","additional_notes":"Used to clarify, explain, or emphasize what you have just said. It can be used to make your point clearer or to indicate further explanation is coming.","target_language_example":"그 영화 진짜 재미있었어, 말이다!","native_language_example":"That movie was really fun, I mean!"}]
["어떻게",{"thoughts":"The Korean term '어떻게' is used to ask 'how' or inquire about the manner in which something is done.","target_language_multi_word_term":"어떻게","meaning":"'how'.","additional_notes":"It is often used in questions to ask about methods or ways of doing something. It's a common and versatile term in everyday conversation.","target_language_example":"이걸 어떻게 해요?","native_language_example":"How do you do this?"}]
["몇 시간",{"thoughts":"'몇 시간' translates to 'how many hours' and is used in questions regarding duration or time measurement.","target_language_multi_word_term":"몇 시간","meaning":"'how many hours'.","additional_notes":"Commonly used when asking about the duration of an activity or the length of time something takes.","target_language_example":"이 영화는 몇 시간이에요?","native_language_example":"How many hours is this movie?"}]
["말을 듣다",{"thoughts":"'말을 듣다' is a Korean expression that means to listen to or obey someone. It combines '말' (speech/words) and '듣다' (to hear), but it's more about following or respecting someone's advice or instructions.","target_language_multi_word_term":"말을 듣다","meaning":"to listen to or obey.","additional_notes":"This phrase is often used when describing someone following instructions, advice, or paying attention to what is being said. It can imply both the literal listening and the figurative obeying of instructions or advice.","target_language_example":"아이들이 선생님의 말을 잘 들어요.","native_language_example":"The children listen well to the teacher."}]
["무슨 말",{"thoughts":"The term '무슨 말' is used in Korean to ask about or refer to an explanation or something that has been said. It can be translated to 'what words' or 'what do you mean,' often used to seek clarification or to ask someone to repeat or elaborate on what they've said.","target_language_multi_word_term":"무슨 말","meaning":"'what words' or 'what do you mean?'","additional_notes":"Used to ask for clarification or more information about something that was said. It is often used in conversations to ensure understanding.","target_language_example":"그게 무슨 말이야?","native_language_example":"What do you mean by that?"}]
["어떻게 하면",{"thoughts":"The phrase '어떻게 하면' is often used in Korean to ask about the means or method of accomplishing something. It's a common way to inquire about how to do something or how to achieve a certain result.","target_language_multi_word_term":"어떻게 하면","meaning":"'how to do' or 'how to achieve'.","additional_notes":"Used when asking for advice or instructions on achieving a goal or completing an action. It often starts a question about methods or strategies.","target_language_example":"어떻게 하면 한국어를 잘할 수 있을까요?","native_language_example":"How can I become good at Korean?"}]
["모든 것",{"thoughts":"'모든 것' is a Korean term that translates to 'everything' or 'all things' in English. It's used to refer to all possible entities or items within a given context, making it a useful phrase for learners to know when expressing completeness or entirety.","target_language_multi_word_term":"모든 것","meaning":"'everything' or 'all things'.","additional_notes":"Used to express the entirety of something, encompassing all elements or aspects within a particular setting or situation.","target_language_example":"그는 모든 것을 다 끝냈어요.","native_language_example":"He finished everything."}]
["나 나",{"thoughts":"\"나 나\" is a Korean phrase that emphasizes the first-person pronoun, similar to saying \"I myself\" or \"me\" in English.","target_language_multi_word_term":"나 나","meaning":"\"I myself\" or \"me\".","additional_notes":"The repetition of \"나\" serves to emphasize the speaker, often used in Korean to highlight the involvement or action of oneself distinctly from others. It can be used in a conversational context or to clarify responsibility or agency.","target_language_example":"이번 프로젝트는 나 나 맡고 싶어.","native_language_example":"I want to take on this project myself."}]
["노래를 부르다",{"thoughts":"This Korean phrase is used to describe the action of singing a song. It involves a verb structure common in Korean where an object (in this case, the song '노래') is acted upon by a verb ('부르다'). This reflects the typical subject-object-verb sentence order in Korean.","target_language_multi_word_term":"노래를 부르다","meaning":"'to sing a song'.","additional_notes":"In Korean, '노래' means 'song' and '부르다' is the verb 'to sing'. This term is often used in casual and conversational settings when speaking about the activity of singing.","target_language_example":"저는 친구들과 함께 노래를 부릅니다.","native_language_example":"I sing a song with my friends."}]
["몇 개쯤",{"thoughts":"This Korean phrase is used to ask or estimate a quantity, often in a conversational or casual context.","target_language_multi_word_term":"몇 개쯤","meaning":"'about how many'.","additional_notes":"This phrase combines '몇' for 'how many,' '개' indicating a counter for items, and '쯤,' meaning 'approximately' or 'about.' It is used to ask or suggest an approximate number of things.","target_language_example":"사과 몇 개쯤 필요해요?","native_language_example":"About how many apples do you need?"}]
["어떻게 해야",{"thoughts":"The phrase '어떻게 해야' is often used in Korean to inquire about the method or manner in which something should be done. It is a common phrase used when seeking advice or directions.","target_language_multi_word_term":"어떻게 해야","meaning":"'how to do' or 'what should I do'.","additional_notes":"This phrase is typically used to ask for instructions or guidance on accomplishing a task. It can be part of a larger question, asking for advice or clarification on how to proceed in a particular situation.","target_language_example":"이 문제를 어떻게 해야 할까요?","native_language_example":"How should I solve this problem?"}]
["누구와",{"thoughts":"\"누구와\" is a question phrase in Korean that translates to \"with whom\" in English. It combines 누구 (who) with 와 (with), which is the particle used for 'and' or 'with' in sentences. It's often used in sentences to ask about a person someone is accompanied by or interacting with.","target_language_multi_word_term":"누구와","meaning":"\"with whom\".","additional_notes":"Use it to inquire about the person someone is with. '와' is typically followed after nouns to indicate accompaniment or conjunction.","target_language_example":"누구와 같이 갔어요?","native_language_example":"With whom did you go?"}]
["어서",{"thoughts":"The Korean term '어서' is an adverb used to express haste or urgency in an action, akin to 'quickly' or 'hurry' in English. It is often used in everyday conversation, especially when encouraging someone to do something promptly.","target_language_multi_word_term":"어서","meaning":"'quickly' or 'hurry'.","additional_notes":"Commonly used in situations where time is of the essence or when prompting someone to do something fast. It can be used both politely and informally.","target_language_example":"어서 가세요!","native_language_example":"Hurry, go!"}]
["몇 번씩",{"thoughts":"The term '몇 번씩' is used to ask or refer to frequency in a way similar to 'how many times' or 'several times'. It can be combined with other verbs to inquire about or state repetition of actions.","target_language_multi_word_term":"몇 번씩","meaning":"'how many times' or 'several times'.","additional_notes":"Used to talk about the frequency of repeated actions or to inquire how often something occurs. It is often used in questions to determine routines or the regular occurrence of events.","target_language_example":"그는 하루에 몇 번씩 운동을 해요?","native_language_example":"How many times a day does he exercise?"}]
["너희 둘",{"thoughts":"The term '너희 둘' is a casual expression used in Korean to refer to two people in an informal setting. It's often used when addressing two people who are peers or younger, as '너희' is an informal way to say 'you (plural)'. It is commonly heard among friends, siblings, or in situations where honorifics aren't necessary.","target_language_multi_word_term":"너희 둘","meaning":"'you two'.","additional_notes":"Used to address or talk about two people informally, often reflecting familiarity or friendship. It can be used in both direct address and in third-person references.","target_language_example":"너희 둘은 언제 시간이 돼?","native_language_example":"When do you two have time?"}]
["어제",{"thoughts":"The term '어제' is commonly used in everyday Korean conversation to refer to the day before today. It's essential for learners to grasp basic temporal markers to help them communicate about events happening relative to the present day.","target_language_multi_word_term":"어제","meaning":"'yesterday'.","additional_notes":"'어제' is used to talk about events, actions, or plans that occurred or were relevant the day before today. It is used much like its English counterpart in sentences.","target_language_example":"어제 친구랑 영화를 봤어요.","native_language_example":"I watched a movie with a friend yesterday."}]
["언제",{"thoughts":"The Korean word '언제' is used in questions related to time. Beginner learners might frequently encounter it when learning to ask about when something occurs.","target_language_multi_word_term":"언제","meaning":"'when'.","additional_notes":"It is used to ask about the time or date something happens or happened. It can appear at the beginning, middle, or end of a question sentence, depending on the structure.","target_language_example":"언제 시간이 있나요?","native_language_example":"When do you have time?"}]
["얼마나",{"thoughts":"'얼마나' is used to ask about the degree or extent of something and can translate to 'how much', 'how many', or 'how'. It's common in questions asking about quantity, frequency, or extent.","target_language_multi_word_term":"얼마나","meaning":"'how much', 'how many', or 'how'.","additional_notes":"Used to inquire about the degree, quantity, or extent of something. Commonly used in questions to ask for additional details about a situation or object.","target_language_example":"이 케이크가 얼마나 커요?","native_language_example":"How big is this cake?"}]
["담배를 피우다",{"thoughts":"The phrase '담배를 피우다' is commonly used to describe the action of smoking tobacco, which is a common enough activity for it to be relevant in many everyday social or health-related discussions. Beginner learners would benefit from understanding this phrase as it’s often mentioned in warnings, rules, and conversations about habits.","target_language_multi_word_term":"담배를 피우다","meaning":"'to smoke a cigarette'.","additional_notes":"The phrase is often used in contexts related to smoking policies, health advisories, or social habits. Be aware of the cultural and legal attitudes towards smoking in Korea when using this phrase.","target_language_example":"그는 매일 담배를 피워요.","native_language_example":"He smokes a cigarette every day."}]
["가야 하다",{"thoughts":"The phrase '가야 하다' is commonly used in Korean to express obligation or necessity, akin to 'have to' or 'must' in English. This is a crucial phrase for beginners to learn as it forms part of essential verb conjugation patterns to convey necessity in everyday conversation.","target_language_multi_word_term":"가야 하다","meaning":"'have to go' or 'must go'.","additional_notes":"Used to express an obligation or necessity to go somewhere. It is the future/obligative form of the verb '가다' which means 'to go'. This form is frequently used to indicate a mandatory or necessary action in various contexts.","target_language_example":"저는 지금 집에 가야 해요.","native_language_example":"I have to go home now."}]
["여전히",{"thoughts":"'여전히' is a Korean adverb used frequently to express the idea that a situation or state remains the same as it was before, similar to the English 'still'. This term is useful for learners when describing persistence or continuity in states or actions.","target_language_multi_word_term":"여전히","meaning":"'still' or 'as before'.","additional_notes":"It is commonly used to indicate that something or someone continues to be in the same state or situation as previously mentioned. This adverb is often used in both written and spoken Korean.","target_language_example":"그 사람은 여전히 그곳에 있다.","native_language_example":"That person is still there."}]
["모자를 쓰다",{"thoughts":"The term '모자를 쓰다' is a verb phrase meaning to wear or put on a hat or cap. It's common in daily Korean language, especially in contexts about clothing or dressing appropriately for weather conditions.","target_language_multi_word_term":"모자를 쓰다","meaning":"to wear/put on a hat.","additional_notes":"'모자' means a hat or cap, and '쓰다' is a verb meaning to use or wear something. This phrase is often used when talking about dressing or preparing for outdoor activities.","target_language_example":"밖에 나갈 때 모자를 쓰세요.","native_language_example":"Wear a hat when you go outside."}]
["몇 개나",{"thoughts":"The phrase '몇 개나' is commonly used in Korean to ask about the quantity or number of items, weighing on the curiosity of 'how many' in terms of interest or expectation.","target_language_multi_word_term":"몇 개나","meaning":"'how many' or 'how much'.","additional_notes":"It is used when asking about the number of countable items. Often adds emphasis, suggesting that the speaker is more interested in the quantity, potentially expecting it to be large or significant.","target_language_example":"사과가 몇 개나 있어요?","native_language_example":"How many apples are there?"}]
["왜",{"thoughts":"The Korean word '왜' means 'why'. It is commonly used in questions to ask for reasons or explanations.","target_language_multi_word_term":"왜","meaning":"'why'","additional_notes":"Used to inquire about reasons or causes behind an action or situation. It's commonly used in spoken and written Korean to start a question.","target_language_example":"왜 그렇게 말했어요?","native_language_example":"Why did you say that?"}]
["길어야",{"thoughts":"The Korean term '길어야' is derived from '길다' meaning 'long.' It's often used in expressions to indicate maximum length or duration, suggesting a limit or upper bound. Understanding its use in context is crucial as it cannot be translated directly to a single English word but rather serves a specific grammatical function in a sentence.","target_language_multi_word_term":"길어야","meaning":"'at most,' 'at the longest,' or 'no longer than'.","additional_notes":"Used when describing the maximum possible extent or duration of something, highlighting a limit or ceiling.","target_language_example":"회의는 길어야 한 시간 걸릴 거예요.","native_language_example":"The meeting will take at most one hour."}]
["위한",{"thoughts":"'위한' is a Korean preposition that broadly translates to 'for' in English, denoting purpose or intent. It's a common term used in various contexts to indicate that an action is done for the benefit or purpose of someone or something.","target_language_multi_word_term":"위한","meaning":"'for' or 'to'; indicating purpose or intent.","additional_notes":"It is often used in contexts where you are talking about doing something for someone else or for a specific purpose. It comes before nouns.","target_language_example":"이 책은 어린이를 위한 선물입니다.","native_language_example":"This book is a gift for children."}]
["위해",{"thoughts":"The term '위해' is commonly used in various contexts in Korean to mean 'for' or 'in order to'. It is often seen in sentences indicating purpose or reason.","target_language_multi_word_term":"위해","meaning":"'for' or 'in order to'.","additional_notes":"Used to express purpose, intention, or aim in a sentence. Often followed by a verb or a phrase indicating the intended outcome.","target_language_example":"그녀는 건강을 위해 운동을 해요.","native_language_example":"She exercises for her health."}]
["위해서",{"thoughts":"\"위해서\" is a Korean phrase often used to express purpose or intent. It typically translates to 'for' or 'in order to'.","target_language_multi_word_term":"위해서","meaning":"'for' or 'in order to'.","additional_notes":"Used to indicate the purpose or reason for an action. Typically followed by verb clauses.","target_language_example":"건강을 위해서 매일 운동해요.","native_language_example":"I exercise every day for my health."}]
["그러고는",{"thoughts":"The Korean conjunctive adverb '그러고는' is used to link a series of events or actions, implying a sequence. It can be translated as 'then' or 'and then' in English when narrating actions in the past tense or when describing a series of events.","target_language_multi_word_term":"그러고는","meaning":"'and then', 'then'.","additional_notes":"This term is commonly used in storytelling or when describing events that occur in succession. It helps to maintain the flow of a narrative by showing that one action follows another.","target_language_example":"그녀는 문을 열고 방에 들어갔다. 그러고는 창문을 열었다.","native_language_example":"She opened the door and entered the room. Then she opened the window."}]
["몇 번",{"thoughts":"The term '몇 번' combines the interrogative word for 'how many' (몇) with the numeral classifier for 'times' or 'number' (번). It's often used to ask about the frequency of actions or specific instances, like asking 'how many times' or 'what number'.","target_language_multi_word_term":"몇 번","meaning":"'how many times' or 'what number'.","additional_notes":"Used to ask about frequency or specific instances, such as visit occurrences or telephone numbers. '몇' means 'how many', and '번' is a counter for times or sequence numbers.","target_language_example":"몇 번이나 가봤어요?","native_language_example":"How many times have you been there?"}]
["꺼지다",{"thoughts":"The Korean term '꺼지다' can have multiple meanings depending on the context, such as to turn off, go out, or to develop a hole or impression. For beginner learners, the common and slightly rude imperative form which means 'go away' or 'get lost' might be relevant.","target_language_multi_word_term":"꺼지다","meaning":"to go out (light), to turn off, or rudely, 'get lost'.","additional_notes":"In its common usage, '꺼지다' can refer to a light going out or an electronic device turning off. However, in conversational Korean, it is also used as a slangy, impolite way to tell someone to go away. It should be used with caution as it can be rude.","target_language_example":"불이 꺼졌다.","native_language_example":"The light went out."}]
["이렇게",{"thoughts":"'이렇게' is a Korean adverb often used to describe the manner or state of something, meaning 'like this,' 'this way,' or 'in this manner.' It's commonly used in both spoken and written Korean to refer to actions or things that are done or presented in a similar manner to what is currently happening or being demonstrated.","target_language_multi_word_term":"이렇게","meaning":"'like this' or 'this way'.","additional_notes":"Often used to describe or illustrate the manner in which an action is carried out. It can also be used to show similarity or to ask or wonder why something is done in a particular way.","target_language_example":"이렇게 하면 더 좋아요.","native_language_example":"It's better if you do it like this."}]
["그러고서",{"thoughts":"'그러고서' is a Korean adverbial phrase used to indicate sequence, similar to the English 'and then' or 'after that'. It adds a sense of continuity between actions.","target_language_multi_word_term":"그러고서","meaning":"'and then' or 'after that'.","additional_notes":"This phrase is used to indicate that one action follows another, often to show a sequence of events in storytelling or descriptions.","target_language_example":"그는 아침을 먹고 그러고서 운동을 했어요.","native_language_example":"He ate breakfast and then exercised."}]
["말을 하다",{"thoughts":"The phrase '말을 하다' means 'to speak' or 'to talk'. It is a common expression in Korean for describing the act of verbal communication. The word '말' means 'speech' or 'words', and '하다' is a verb meaning 'to do'. For a beginner, it is important to understand that '하다' is often added to nouns to form a verb meaning 'to do' the noun in question, like '운동을 하다' for 'to exercise'. This construction is fundamental in learning how to form verbs in Korean.","target_language_multi_word_term":"말을 하다","meaning":"'to speak' or 'to talk'.","additional_notes":"'말을 하다' can be used in both formal and informal contexts. The structure '말을 [verb] 하다' can frequently appear with different nuances depending on the situation, like emphasizing the act of speaking in particular moments.","target_language_example":"그는 계속 말을 해요.","native_language_example":"He keeps talking."}]
["이미",{"thoughts":"'이미' is a common adverb in Korean meaning 'already'. It's used to indicate an action or state that has occurred before the present time.","target_language_multi_word_term":"이미","meaning":"'already'.","additional_notes":"Typically used to emphasize that something has been done or completed before now or before a specified point in time. It can be used in various tenses, usually conveying a sense that the speaker expected something to occur earlier.","target_language_example":"그 영화는 이미 봤어요.","native_language_example":"I have already seen that movie."}]
["문을 열다",{"thoughts":"The phrase '문을 열다' literally translates to 'to open the door'. It's a basic action phrase useful in daily conversations when discussing opening doors or even metaphorical openings like starting a business.","target_language_multi_word_term":"문을 열다","meaning":"'to open the door'.","additional_notes":"This phrase can be used both literally, when physically opening a door, or metaphorically, such as opening a new opportunity or beginning a new activity.","target_language_example":"그녀가 문을 열고 방에 들어왔다.","native_language_example":"She opened the door and came into the room."}]
["어떻게 알다",{"thoughts":"This Korean phrase combines '어떻게' meaning 'how' with '알다' meaning 'to know.' It can be used to ask about the means or way of knowing something.","target_language_multi_word_term":"어떻게 알다","meaning":"'how to know' or 'how do you know?'.","additional_notes":"This phrase is often used when asking for methods or seeking clarification on how someone came to know specific information.","target_language_example":"그 사실을 어떻게 알았어요?","native_language_example":"How did you know that fact?"}]
["뭐 하러",{"thoughts":"The Korean phrase '뭐 하러' can be directly translated to 'what for' or 'why'. It's used when asking someone the reason or purpose behind doing something. Since it's informal, beginners should be aware of appropriate contexts for its use.","target_language_multi_word_term":"뭐 하러","meaning":"'what for' or 'why'.","additional_notes":"Typically used in casual conversations to ask why someone is doing something. It implies asking about the purpose or reason.","target_language_example":"너는 뭐 하러 왔어?","native_language_example":"Why did you come?"}]
["비가 오다",{"thoughts":"'비가 오다' is a common Korean expression used to describe weather conditions, specifically indicating that rain is falling.","target_language_multi_word_term":"비가 오다","meaning":"to rain","additional_notes":"The phrase describes the action of rain falling from the sky. '비' means 'rain' and '오다' means 'to come', so literally it means 'rain comes'. Used to describe rainy weather or when stating that it is raining.","target_language_example":"오늘은 비가 와요.","native_language_example":"It's raining today."}]
["뭐라고 할까",{"thoughts":"'뭐라고 할까' is a Korean phrase that translates approximately to 'What should I say?' or 'How should I put it?'. It is often used when the speaker is uncertain about how to express a thought or searching for words.","target_language_multi_word_term":"뭐라고 할까","meaning":"'What should I say?' or 'How should I put it?'.","additional_notes":"Commonly used in conversations when the speaker is thinking of the right way to express something or is unsure of how to convey their thoughts accurately.","target_language_example":"이 상황에 뭐라고 할까?","native_language_example":"What should I say in this situation?"}]
["어떤 사람이",{"thoughts":"'어떤 사람이' translates to 'some person' or 'a certain person' and is used when referring to an unspecified person.\n\nA beginner might encounter it in simple conversations or stories when talking about people hypothetically or in general terms.","target_language_multi_word_term":"어떤 사람이","meaning":"'some person' or 'a certain person'.","additional_notes":"Used when referring to an unspecified or hypothetical person.","target_language_example":"어떤 사람이 그 일을 했는지 모릅니다.","native_language_example":"I don't know which person did that job."}]
["자고",{"thoughts":"The term '자고' is commonly used in Korean to indicate a suggestion or proposal to do something together, often as part of a direct or indirect speech construction. It is a form of the verb '자다' which means 'to sleep,' but the auxiliary ending has a broader use in conversational contexts. It is also used to suggest indirect quotations that align with this intent.","target_language_multi_word_term":"자고","meaning":"'let's' or 'suggested to'.","additional_notes":"'자고' is often used in sentences to convey a suggestion or proposal, such as sleeping or resting together, or can be part of reported speech indicating what someone suggested.","target_language_example":"우리 집에 가서 같이 자고 해.","native_language_example":"Let's go to my house and sleep together."}]
["비가 내리다",{"thoughts":"The phrase '비가 내리다' is often used in Korean to describe rain coming down. It's a straightforward expression involving the word '비' (rain) and '내리다' (to come down or fall). It's relevant for beginners as it can be part of weather-related conversations.","target_language_multi_word_term":"비가 내리다","meaning":"Rain is falling.","additional_notes":"This phrase is used to describe the occurrence of rain, similar to saying 'It's raining' in English. It uses the noun for rain '비' and the verb '내리다' which means to fall or come down.","target_language_example":"오늘 아침에 비가 내렸어요.","native_language_example":"It rained this morning."}]
["비한",{"thoughts":"'비한' is a Korean expression combining '비', usually associated with comparison or contrast, with '한', which is derived from 하다 (to do). It is typically used in phrases comparing something's value or suitability.","target_language_multi_word_term":"비한","meaning":"'compared to' or 'in comparison to'.","additional_notes":"It is often used in contexts where two items or scenarios are being compared to highlight a contrast or preference.","target_language_example":"그것은 다른 것들에 비한 가격이 싸다.","native_language_example":"In comparison to the others, it is inexpensive."}]
["뭐라 할까",{"thoughts":"This phrase literally translates to 'what shall I say' or 'how shall I phrase it'. It's often used when someone is unsure of how to express something or needs a moment to think about their words.","target_language_multi_word_term":"뭐라 할까","meaning":"'what should I say' or 'how should I put it'.","additional_notes":"Often used when hesitating or pondering the best way to phrase an idea or statement. Common in casual or conversational contexts.","target_language_example":"음... 뭐라 할까, 이 영화는 정말 감동적이야.","native_language_example":"Hmm... how should I put it, this movie is really touching."}]
["손을 들다",{"thoughts":"'손을 들다' is a common Korean phrase meaning 'to raise one's hand'. It's often used in the context of classrooms or meetings when someone is indicating they have something to say or wish to participate.","target_language_multi_word_term":"손을 들다","meaning":"'to raise one's hand'.","additional_notes":"This phrase is commonly used in educational or group settings where raising one's hand is a standard gesture to indicate a desire to speak or answer a question.","target_language_example":"수업 중에 질문이 있으면 손을 드세요.","native_language_example":"If you have a question during class, please raise your hand."}]
["안 되다",{"thoughts":"'안 되다' is a commonly used phrase in Korean that often means 'not to work' or 'to be impossible'. It indicates that something cannot or should not be done.","target_language_multi_word_term":"안 되다","meaning":"'not work' or 'be impossible'.","additional_notes":"Used to indicate that something is not allowed, cannot happen, or doesn't work properly. Often used in negative or prohibitive contexts.","target_language_example":"이 기계가 안 돼요.","native_language_example":"This machine doesn't work."}]
["자주",{"thoughts":"The word '자주' is frequently used in everyday Korean conversation and is relevant for learners to express frequency.","target_language_multi_word_term":"자주","meaning":"often, frequently","additional_notes":"'자주' is used to describe actions that happen regularly or with high frequency. It is an adverb that typically precedes a verb in a sentence.","target_language_example":"저는 주말에 자주 산책해요.","native_language_example":"I often go for a walk on the weekend."}]
["잠깐",{"thoughts":"'잠깐' is a common Korean word used to indicate a very short period of time. It's relevant for beginners to understand as it can be used in daily conversations to ask for a brief pause or attention.","target_language_multi_word_term":"잠깐","meaning":"'a moment' or 'just a second'.","additional_notes":"Used to indicate a brief amount of time. Commonly used when asking someone to wait or when you need a short interruption.","target_language_example":"잠깐 기다려 주세요.","native_language_example":"Please wait a moment."}]
["잠깐만",{"thoughts":"'잠깐만' is a frequently used Korean phrase that expresses a request for someone to wait momentarily. It is an informal way to ask someone to wait a short period of time, often used in casual settings.","target_language_multi_word_term":"잠깐만","meaning":"'just a moment' or 'wait a minute'.","additional_notes":"Used to politely ask someone to wait briefly, typically in casual conversations. It is derived from '잠깐', meaning 'a short time', and '만', meaning 'only' or 'just'. It can be used in a variety of contexts where a quick pause or hold is needed.","target_language_example":"잠깐만 기다려 주세요.","native_language_example":"Please wait just a moment."}]
["저런",{"thoughts":"The term '저런' is often used in Korean to express surprise, disappointment, or sympathy when reacting to something that has just happened. It's a more colloquial expression and is generally used in everyday conversation.","target_language_multi_word_term":"저런","meaning":"'such a thing', 'oh dear', or 'look at that'.","additional_notes":"Used to express mild surprise or regret, often in reaction to someone else's misfortune or unexpected event. It can convey emotions such as sympathy, regret, or simply drawing attention to the situation.","target_language_example":"저런, 비가 오네요.","native_language_example":"Oh dear, it's raining."}]
["전부",{"thoughts":"The term '전부' in Korean is commonly used to refer to the entirety or the whole of something. It's a basic term that can be beneficial for beginners when expressing concepts of all-inclusive or completeness in Korean.","target_language_multi_word_term":"전부","meaning":"'all' or 'everything'.","additional_notes":"'전부' is used to talk about something in its entirety. It can be used to describe complete amounts or groups and is often synonymous with '모두', which also means 'all'.","target_language_example":"전부 먹었어요.","native_language_example":"I ate everything."}]
["전혀",{"thoughts":"'전혀' is an adverb that typically appears in negative sentences, emphasizing the nonexistence or complete absence of something. It is used to amplify the extent of negation, similar to how 'at all' or 'completely' is used in English in negative contexts.","target_language_multi_word_term":"전혀","meaning":"'not at all' or 'completely not'.","additional_notes":"Used mainly in negative sentences to emphasize the lack of something. It's often followed by a negative form of the verb, like 없다 (do not have) or 못하다 (cannot do).","target_language_example":"그 영화는 전혀 재미없었어.","native_language_example":"That movie was not fun at all."}]
["비해서",{"thoughts":"'비해서' is used in Korean to establish a comparison between two things and is equivalent to saying 'compared to' or 'compared with' in English. It is often followed by a noun or noun phrase that indicates what the subject is being compared to.","target_language_multi_word_term":"비해서","meaning":"'compared to' or 'compared with'.","additional_notes":"Used to make comparisons in sentences. Often part of the expression '에 비해서', with '에' preceding a noun to specify the comparison target.","target_language_example":"그녀는 이전에 비해서 더 행복해 보여요.","native_language_example":"She looks happier compared to before."}]
["절대",{"thoughts":"The Korean word '절대' is an adverb that means 'absolutely' or 'never'. It's often used for strong negative sentences to emphasize a prohibition or something that must not happen.","target_language_multi_word_term":"절대","meaning":"'never' or 'absolutely'.","additional_notes":"'절대' is typically used in negative sentences to strongly assert that something will not or should not happen. It can also convey a sense of certainty when discussing things that are absolute.","target_language_example":"절대 늦지 마세요.","native_language_example":"Never be late."}]
["점점",{"thoughts":"The Korean term '점점' is frequently used to describe gradual or continuous change. It's akin to the English word 'gradually' or 'little by little.' This term is useful when talking about progressive actions or developments.","target_language_multi_word_term":"점점","meaning":"'gradually' or 'little by little'.","additional_notes":"A versatile adverb used to indicate that something is happening slowly over time. It is often used to describe a situation or condition that becomes more pronounced or changes progressively.","target_language_example":"날씨가 점점 따뜻해지고 있어요.","native_language_example":"The weather is gradually getting warmer."}]
["정도",{"thoughts":"The word '정도' is frequently used in Korean to indicate a degree or an extent to which something occurs. It's useful for beginners to understand how to express various degrees of intensity or quantify something in Korean.","target_language_multi_word_term":"정도","meaning":"'degree', 'extent', or 'level'.","additional_notes":"'정도' is used to describe the level or intensity of something. It is similar to using 'about' or 'approximately' when talking about quantity or frequency.","target_language_example":"하루에 두 시간 정도 운동해요.","native_language_example":"I exercise about two hours a day."}]
["정말",{"thoughts":"The Korean term '정말' is often used as an adverb to express emphasis, meaning 'really' or 'truly'. It adds emphasis to statements, similar to saying 'very much' in English.","target_language_multi_word_term":"정말","meaning":"'really' or 'truly'.","additional_notes":"Used to add emphasis or express sincerity. Common in both formal and informal contexts.","target_language_example":"정말 감사합니다.","native_language_example":"Thank you very much."}]
["정말로",{"thoughts":"The Korean term '정말로' is used for emphasis and is often added to questions or statements to assert sincerity or truthfulness.","target_language_multi_word_term":"정말로","meaning":"truly; really.","additional_notes":"'정말로' is used for emphasis and can be placed at the beginning or end of a sentence. It adds weight or seriousness to the statement, indicating that the speaker is sincere or truly interested.","target_language_example":"정말로 이 영화를 이미 봤어요?","native_language_example":"Have you really already seen this movie?"}]
["조금",{"thoughts":"The word '조금' is used to indicate a small amount or degree of something, similar to 'a little' or 'a bit' in English.","target_language_multi_word_term":"조금","meaning":"'a little', 'a bit', or 'slightly'.","additional_notes":"Often used to describe small quantities or slight degrees in situations like expressing quantity, mild emotions, or making polite requests. It modifies verbs or adjectives to soften them.","target_language_example":"저는 매운 음식을 조금 먹을 수 있어요.","native_language_example":"I can eat spicy food a little."}]
["뭐냐",{"thoughts":"\"뭐냐\" is an informal Korean phrase often used to ask, \"what is it?\" It is derived from \"뭐\" (what) and \"냐\" (an informal question ending).","target_language_multi_word_term":"뭐냐","meaning":"\"What is it?\"","additional_notes":"This is a casual, informal way to ask 'what is it?' or 'what's that?' among friends or peers. It's not suitable for formal situations.","target_language_example":"이상한 소리가 나는데, 이거 뭐냐?","native_language_example":"There's a strange sound, what is it?"}]
["보고 싶다",{"thoughts":"The Korean term '보고 싶다' combines two words: '보다' (to see) and '싶다' (want), literally translating to 'want to see.' It is often used to express missing someone or something and the desire to see them/it again.","target_language_multi_word_term":"보고 싶다","meaning":"'to miss (someone/something)' or 'want to see.'","additional_notes":"Often used to express emotional longing or missing a person, typically understood as a longing beyond just sight.","target_language_example":"너무 보고 싶어.","native_language_example":"I miss you so much."}]
["뭐라고 해야",{"thoughts":"The phrase '뭐라고 해야' is used in Korean to express uncertainty or difficulty in expressing something in words. It's like saying 'what should I say' or 'how should I put it' in English. This is particularly useful when one is unsure how to articulate their thoughts or choose appropriate words.","target_language_multi_word_term":"뭐라고 해야","meaning":"'what should I say' or 'how should I put it'.","additional_notes":"Used when hesitating or trying to find the right words to express something. It can also convey a sense of searching for polite or accurate phrasing.","target_language_example":"이 상황에서 뭐라고 해야 할지 모르겠어요.","native_language_example":"I don't know what to say in this situation."}]
["손을 씻다",{"thoughts":"In Korean, '손을 씻다' translates to 'wash hands'. It's a common and basic phrase, especially in the context of hygiene, which is important for beginners to know in daily life. Considering the importance of handwashing in health, this phrase would be practical for learners.","target_language_multi_word_term":"손을 씻다","meaning":"wash hands","additional_notes":"This phrase is often used when discussing hygiene and cleanliness. It is a basic action that is commonly part of daily routines.","target_language_example":"식사 전에 손을 씻다.","native_language_example":"Wash your hands before eating."}]
["좀",{"thoughts":"The Korean word '좀' is a versatile particle often used to indicate politeness, make requests, or add emphasis in a sentence.","target_language_multi_word_term":"좀","meaning":"Please; a little bit.","additional_notes":"'좀' is often used to soften requests or commands, making them more polite. It can also indicate a small amount or slight degree when referring to quantity or intensity.","target_language_example":"물이 좀 주세요.","native_language_example":"Please give me some water."}]
["좀 더",{"thoughts":"The term '좀 더' is a Korean phrase used to request or suggest 'a little more' of something, often used to ask for something additional or to do something more.","target_language_multi_word_term":"좀 더","meaning":"A little more.","additional_notes":"This phrase is commonly used when requesting more of something, whether it's more food, time, or effort. It's a polite way of asking for extra.","target_language_example":"물을 좀 더 주세요.","native_language_example":"Please give me a little more water."}]
["종종",{"thoughts":"The term '종종' is used in Korean to convey frequency. Beginners may encounter it when discussing how often they do something.","target_language_multi_word_term":"종종","meaning":"Often or frequently.","additional_notes":"Used to describe something that happens fairly often but not all the time. It's less frequent than \"항상\" (always) but more frequent than \"가끔\" (sometimes).","target_language_example":"나는 종종 그 카페에 가요.","native_language_example":"I often go to that cafe."}]
["지도",{"thoughts":"The term '지도' in Korean can mean both 'map' and 'leadership'. This might confuse beginner learners, but usually context determines which meaning applies. Maps are common in travel contexts or when giving directions. Leadership, on the other hand, might appear in organisational or political discussions.","target_language_multi_word_term":"지도","meaning":"'map' or 'leadership'.","additional_notes":"Context determines the meaning of '지도'. If discussing navigation, travel, or directions, it likely means 'map'. In a social or organizational context, it can mean 'leadership'.","target_language_example":"이 지도에서 한국을 찾을 수 있어요?","native_language_example":"Can you find Korea on this map?"}]
["오늘 아침",{"thoughts":"This term is used to specify a particular time in a day, often to talk about recent or upcoming activities.","target_language_multi_word_term":"오늘 아침","meaning":"this morning.","additional_notes":"Used to refer to events or actions that happened or were planned for the morning of the current day.","target_language_example":"오늘 아침에 비가 왔어요.","native_language_example":"It rained this morning."}]
["진짜",{"thoughts":"'진짜' is a versatile Korean adverb and adjective used frequently in informal settings. It can mean 'really' or 'real', adding emphasis to a statement or question.","target_language_multi_word_term":"진짜","meaning":"'really' or 'real'.","additional_notes":"It is often used to express surprise, disbelief, or to emphasize sincerity. It's commonly heard in casual conversations.","target_language_example":"이거 진짜 맛있어!","native_language_example":"This is really delicious!"}]
["진짜로",{"thoughts":"The term '진짜로' is often used in spoken Korean to emphasize sincerity or truth, akin to saying 'really' or 'truly' in English. It's an intensifier that adds emphasis to the statement it accompanies. Beginner learners are likely to encounter this in casual conversations.","target_language_multi_word_term":"진짜로","meaning":"'really' or 'truly'.","additional_notes":"Used to emphasize sincerity or truthfulness. Often appears in informal contexts and is commonly used for emphasis.","target_language_example":"진짜로 맛있어요!","native_language_example":"It's really delicious!"}]
["어떻게 해서라도",{"thoughts":"The phrase '어떻게 해서라도' conveys a sense of determination and involves the idea of doing whatever it takes to achieve a certain outcome.","target_language_multi_word_term":"어떻게 해서라도","meaning":"'no matter how' or 'by any means necessary'.","additional_notes":"This phrase is used to express determination to accomplish something despite difficulties. It often implies exploring all possible methods or taking extraordinary measures.","target_language_example":"어떻게 해서라도 이 일을 끝내야 해요.","native_language_example":"We must finish this task by any means necessary."}]
["손 들다",{"thoughts":"The phrase '손 들다' is a common expression in Korean, literally translating to 'to raise a hand'. It's used in various contexts, usually indicating a physical action of raising the hand to signal attention, agreement, or readiness to speak. This could be in a classroom, meeting, or any setting where someone needs to get the attention of others.","target_language_multi_word_term":"손 들다","meaning":"'to raise a hand'.","additional_notes":"Used to signal willingness to participate, ask a question, or give an answer. Common in classrooms or formal discussions.","target_language_example":"질문이 있으면 손 드세요.","native_language_example":"If you have a question, raise your hand."}]
["어서는",{"thoughts":"The term '어서는' is used in Korean to indicate a causal relationship, often meaning 'because' or 'since'. It's a conjugation form of the verb ending '아서/어서', which shows cause or reason.","target_language_multi_word_term":"어서는","meaning":"because, since.","additional_notes":"Use '어서는' after verbs to explain cause, reason, or precondition, often leading to advice or subjective opinion.","target_language_example":"길이 막혀서는 늦을 것 같아요.","native_language_example":"Since the road is jammed, I think I'll be late."}]
["뿐이겠어",{"thoughts":"The Korean phrase '뿐이겠어' is used at the end of sentences to emphasize that there is no alternative or that something is an exclusive choice or action, implying inevitability or definiteness.","target_language_multi_word_term":"뿐이겠어","meaning":"'only that' or 'nothing but that'.","additional_notes":"This phrase is often used to emphasize the exclusivity or singularity of an action or condition, similar to saying 'it's nothing but that' in English. It often implies a rhetorical question or a confirmation bias.","target_language_example":"그가 할 수 있는 거라곤 기다리는 것뿐이겠어.","native_language_example":"The only thing he can do is wait."}]
["알다",{"thoughts":"The Korean verb '알다' is a basic and essential verb for beginner learners. It is important for expressing understanding or knowledge, making it useful in conversation and learning contexts.","target_language_multi_word_term":"알다","meaning":"'to know'.","additional_notes":"알다 is often used to express recognition, comprehension, or familiarity with information. It can be used in various tenses and often appears in conversational contexts. It can be combined with other words to form phrases indicating different degrees or subjects of knowledge, like 몰라 (to not know) or 아는 (knowing).","target_language_example":"저는 그 사실을 알아요.","native_language_example":"I know that fact."}]
["어서 오다",{"thoughts":"The term '어서 오다' in Korean is a polite expression that is often used to invite or welcome someone to come in or return promptly. It's commonly used in social and formal settings, such as when greeting a guest at home or in a business context, reflecting Korean hospitality and formality.","target_language_multi_word_term":"어서 오다","meaning":"Hurry up and come (in).","additional_notes":"This expression is often used to warmly invite someone to enter a place or to invite them to come over quickly. It's a welcoming and polite invitation used in both social and formal contexts.","target_language_example":"어서 오세요.","native_language_example":"Please come in quickly."}]
["많아야",{"thoughts":"The term '많아야' comes from the verb '많다,' meaning 'to be many' or 'to be much.' The addition of '-아야' or '-어야' indicates a condition, making it mean something like 'at most' or 'if there is a lot.' It's often used to suggest a maximum limit or a conditional situation.","target_language_multi_word_term":"많아야","meaning":"'at most' or 'if there is a lot'.","additional_notes":"Used to express maximum limitation or condition in a context where something is being evaluated for its quantity or extent.","target_language_example":"사람이 많아야 20명 올 거예요.","native_language_example":"At most, 20 people will come."}]
["필요하다",{"thoughts":"The Korean term '필요하다' is an adjective meaning needed, necessary, or required. It often appears in contexts where someone is talking about needing something or someone, or when indicating necessity. Understanding '필요하다' helps with forming simple necessity statements and asking about needs, which are common in everyday conversation.","target_language_multi_word_term":"필요하다","meaning":"'to be necessary' or 'to need'.","additional_notes":"This term is used to express a requirement or necessity. It's often used in everyday situations to express what you need or what is necessary for you or others.","target_language_example":"이것이 필요하다.","native_language_example":"This is necessary."}]
["신문을 읽다",{"thoughts":"'신문을 읽다' means 'to read the newspaper' in Korean. It's a basic phrase useful when learning about daily routines or discussing reading materials.","target_language_multi_word_term":"신문을 읽다","meaning":"'to read the newspaper'.","additional_notes":"This phrase can be used in different tenses to describe the action of reading a newspaper in the past, present, or future. It can be part of a daily routine or a leisure activity.","target_language_example":"저는 아침에 신문을 읽습니다.","native_language_example":"I read the newspaper in the morning."}]
["나요",{"thoughts":"‘나요’ is a polite question ending attached to verb or adjective stems (typically those ending in a vowel or ㄹ) to show curiosity or gently ask about a fact or state. It’s softer than –습니까? and slightly more formal than –아/어(요). Beginners should know it’s used like “Is it…?”, “Do you…?”, “Are you…?” etc.","target_language_multi_word_term":"나요","meaning":"polite question ending: “Is it…? / Do you…?”","additional_notes":"Attach directly to a verb/adjective stem to ask a gentle question or seek confirmation. Use –나요 after stems ending in a vowel or ㄹ; use –은/는가요 after consonant-ending stems. Slightly formal but friendly.","target_language_example":"지금 시간이 있나요?","native_language_example":"Do you have time now?"}]
["뿐이겠지",{"thoughts":"The Korean phrase '뿐이겠지' is often used to imply limitation or assumption. It's typically seen at the end of sentences to express guesses or assumptions about a limited situation or condition.","target_language_multi_word_term":"뿐이겠지","meaning":"'I guess it's only' or 'it must only be'.","additional_notes":"Used to express an assumption or guess with a sense of limitation or boundary. Often indicates that something is perceived as being the only option or outcome likely to happen, usually in a somewhat resigned tone.","target_language_example":"그가 이렇게 화를 낼 이유는 너 때문뿐이겠지.","native_language_example":"I guess the only reason he's so angry is because of you."}]
["뭐니",{"thoughts":"The term '뭐니' in Korean is a casual way to say 'what is it?' or 'what's that?' It's often used informally between friends or peers. It comes from the contraction of '무엇이니', which uses the pronoun '뭐' (what) and the copula '이다' (to be), ending with the informal question ending '-니'.","target_language_multi_word_term":"뭐니","meaning":"'what is it?' (informal)","additional_notes":"Commonly used casually among friends or close peers to ask about something they notice or are curious about. It's an informal contraction and should not be used in formal situations.","target_language_example":"이 가게는 뭐니? 재미있는 물건들이 많아.","native_language_example":"What's this store? It has lots of interesting things."}]
["어떻게 해서",{"thoughts":"\"어떻게 해서\" is used to inquire about the method or means by which something is done, often involving a process or steps.","target_language_multi_word_term":"어떻게 해서","meaning":"'how' or 'by what means'.","additional_notes":"Used to ask about the process or means of action. Often seen in contexts where the emphasis is on explaining or understanding the steps involved.","target_language_example":"그 문제를 어떻게 해서 풀었어요?","native_language_example":"How did you solve that problem?"}]
["뿐이고",{"thoughts":"'뿐이고' is a Korean colloquial phrase meaning 'and that's it' or 'just that'. It is often used to emphasize the exclusivity or finality of a statement.","target_language_multi_word_term":"뿐이고","meaning":"'and that's it' or 'just'.","additional_notes":"Used to emphasize that there is nothing more to say or to highlight the singularity of an action or state. Often adds a slightly humorous or emphatic tone.","target_language_example":"나는 그냥 집에 있었을 뿐이고.","native_language_example":"I was just at home, and that's it."}]
["할 수 있다",{"thoughts":"The Korean phrase '할 수 있다' is essential for beginners, as it expresses capability or possibility in a similar way to 'can' in English. It consists of the verb '하다' (to do) and '수 있다' (to be able to), which together mean 'can do.' It's often used to express one's ability to perform an action.","target_language_multi_word_term":"할 수 있다","meaning":"'can do' or 'be able to'.","additional_notes":"This phrase is used to express the ability or possibility of doing something. It is typically followed by a verb stem to describe what can be done. It is a versatile expression and can be used in various contexts to talk about potential, capability, or questions of permission.","target_language_example":"저는 한국어를 할 수 있어요.","native_language_example":"I can speak Korean."}]
["어떻게 해서든",{"thoughts":"The phrase '어떻게 해서든' is a Korean idiom used to express determination in achieving a goal, regardless of the means. It captures the essence of persistence and resourcefulness.","target_language_multi_word_term":"어떻게 해서든","meaning":"'by any means possible'.","additional_notes":"This phrase is used when someone is committed to accomplishing something, no matter the challenges or resources required. It's often used in contexts of determination and problem-solving.","target_language_example":"어떻게 해서든 목표를 이루고 싶어.","native_language_example":"I want to achieve my goal by any means possible."}]
["함께",{"thoughts":"The Korean term '함께' is commonly used to indicate doing something together with one or more people. It's akin to the English words 'together' or 'with'. For a beginner, understanding its usage is key to forming sentences about joint activities.","target_language_multi_word_term":"함께","meaning":"Together or with.","additional_notes":"Used to describe an action done in the company of others. Often interchangeable with '같이', although '함께' can sound a bit more formal or written than '같이'.","target_language_example":"우리 함께 영화를 보러 가자.","native_language_example":"Let's go watch a movie together."}]
["항상",{"thoughts":"항상 is an adverb in Korean that means 'always'. It is used to describe actions or states that occur all the time, without change. This is useful for beginner learners as it's helpful in talking about routines or habitual actions.","target_language_multi_word_term":"항상","meaning":"always","additional_notes":"This term is used to describe actions or states that are consistently repeated over time. It can be used with various verb forms to indicate habitual or continual action.","target_language_example":"그녀는 항상 웃고 있어요.","native_language_example":"She is always smiling."}]
["어떻게 하든",{"thoughts":"The term '어떻게 하든' is used to express taking any kind of action or effort regardless of the circumstances. It's akin to the idea of 'whatever it takes' or 'no matter how'. This expression conveys determination or inexorability, often seen in contexts where one is committed to achieving a result or overcoming a challenge despite difficulties.","target_language_multi_word_term":"어떻게 하든","meaning":"'Whatever it takes' or 'no matter how'.","additional_notes":"Commonly used to show determination to achieve a result regardless of the difficulty or method. It can be used in both positive contexts (determination) and neutral contexts (indicating varying possible approaches).","target_language_example":"저는 어떻게 하든 성공할 거예요.","native_language_example":"I will succeed no matter what it takes."}]
["수영을 하다",{"thoughts":"The Korean phrase '수영을 하다' means 'to swim'. It combines the noun '수영' (swimming) with the verb '하다' (to do), which is a common way to form verb phrases in Korean.","target_language_multi_word_term":"수영을 하다","meaning":"'to swim'.","additional_notes":"Often used to describe the action of swimming. The structure 'Noun + 을/를 하다' is commonly used in Korean to express 'to do [noun]', where the noun represents an activity.","target_language_example":"저는 매일 아침에 수영을 해요.","native_language_example":"I swim every morning."}]
["어떤 사람",{"thoughts":"The term '어떤 사람' means 'some person' or 'a certain person' in Korean. It's used to describe an unspecified person, often when referring to someone in a general or non-specific sense. It is quite common in conversational and written Korean.","target_language_multi_word_term":"어떤 사람","meaning":"'some person' or 'a certain person'.","additional_notes":"Used to refer to an unspecified or generalized person. Often employed when the specific identity of the person is either unknown or not important for the context.","target_language_example":"어떤 사람이 문을 두드렸어요.","native_language_example":"Somebody knocked on the door."}]
["어려움을 겪다",{"thoughts":"The phrase '어려움을 겪다' in Korean literally translates to 'experience difficulties' or 'face hardships'. It's a versatile phrase that can be used to describe encountering problems or challenges in various situations. Beginner learners should understand how and when to use this phrase to express that someone is going through tough times.","target_language_multi_word_term":"어려움을 겪다","meaning":"experience difficulties","additional_notes":"This phrase is used to describe encountering hardships or facing problems in life. It can relate to personal, professional, or any other types of difficulties.","target_language_example":"그 친구는 최근에 많은 어려움을 겪었어요.","native_language_example":"That friend has experienced a lot of difficulties recently."}]
["확실하게",{"thoughts":"'확실하게' is an adverb commonly used in Korean to express certainty or assurance. It's derived from the word '확실하다' which means 'to be certain' or 'to be sure'. This term is useful for learners when they want to emphasize their certainty about a decision, fact, or action.","target_language_multi_word_term":"확실하게","meaning":"certainly or surely","additional_notes":"This term is often used to assert the certainty of an action or statement. It can be combined with verbs to emphasize that something will be done with certainty.","target_language_example":"그 문제를 확실하게 해결하겠습니다.","native_language_example":"I will certainly solve that problem."}]
["훨씬",{"thoughts":"The Korean term '훨씬' is often used to emphasize a large difference or extent, generally meaning 'much more' or 'far more'. This phrase commonly appears in comparisons to indicate a significant contrast in degree or amount.","target_language_multi_word_term":"훨씬","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize a great difference or degree in comparisons. It often enhances adjectives or adverbs to indicate something is much more of a certain quality than something else.","target_language_example":"이 책이 저 책보다 훨씬 재미있어요.","native_language_example":"This book is much more interesting than that book."}]
["훨씬 더",{"thoughts":"'훨씬 더' is used in Korean to express a much greater degree or amount, similar to \"much more\" or \"far more\" in English. It is commonly used to emphasize differences or to compare two things where one exceeds the other significantly.","target_language_multi_word_term":"훨씬 더","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize greater amounts, degrees, or intensities between comparative entities.","target_language_example":"올해는 작년보다 훨씬 더 춥다.","native_language_example":"This year is much colder than last year."}]
["에 있어",{"thoughts":"The phrase '에 있어' is a particle phrase in Korean that can be used to convey the existence or location of something in a specific context. It's often used to indicate that something is situated somewhere or involved in a certain situation. It's important for beginners to grasp common sentence-ending particles and phrases like this, as they frequently appear in conversational Korean.","target_language_multi_word_term":"에 있어","meaning":"'exists in' or 'is located in'.","additional_notes":"This phrase is often used to indicate the presence or involvement of something or someone in a specific place or context. It is typically preceded by a noun that designates location or context.","target_language_example":"그는 도서관에 있어.","native_language_example":"He is in the library."}]
["어떤 사람을",{"thoughts":"The phrase '어떤 사람을' is in Korean and typically used to describe or refer to a certain person. '어떤' means 'a certain' or 'some', '사람' means 'person', and '을' is a case marker used for the object of a verb. For beginners, understanding its use in sentences will help grasp how to talk about people in a slightly vague or particular context.","target_language_multi_word_term":"어떤 사람을","meaning":"'certain person' or 'some person'.","additional_notes":"Used to describe or refer to a person that may not be specified or when the person is not directly known. '어떤' is a determiner and '사람을' is the noun 'person' marked as the object. Typically used in questions or statements where the object is someone not clearly defined.","target_language_example":"저는 어떤 사람을 기다리고 있어요.","native_language_example":"I am waiting for a certain person."}]
["시간을 보내다",{"thoughts":"The phrase '시간을 보내다' is a common Korean expression used for describing how one spends their time. It literally translates to 'spend time' or 'pass time.' This is likely to be a phrase beginner Korean learners would encounter when discussing daily activities or leisure. The expression can be used in a wide variety of contexts, from casual outings to more introspective activities.","target_language_multi_word_term":"시간을 보내다","meaning":"to spend time","additional_notes":"This phrase is used to describe how one occupies their time, whether through activities, hobbies, or simply passing time leisurely. It can be used in various tenses and contexts.","target_language_example":"저는 주말에 친구들과 시간을 보냈어요.","native_language_example":"I spent time with my friends over the weekend."}]
["이라면",{"thoughts":"'이라면' is a conditional grammar structure in Korean that is used to express 'if' or 'in case of'. It follows a noun and indicates a hypothetical or conditional situation.","target_language_multi_word_term":"이라면","meaning":"'if (it is)' or 'in case of'.","additional_notes":"This structure is often used in conditional sentences to discuss hypothetical situations, plans, or possibilities. It attaches to nouns and is commonly seen in both spoken and written Korean.","target_language_example":"내일 비가 온다면 우산을 가져오세요.","native_language_example":"If it rains tomorrow, bring an umbrella."}]
["영화를 보다",{"thoughts":"\"영화를 보다\" is a straightforward Korean phrase meaning 'to watch a movie.' It's useful for conversations involving cinema or leisure activities.","target_language_multi_word_term":"영화를 보다","meaning":"'to watch a movie'.","additional_notes":"This phrase is commonly used when discussing plans or recounting past activities. Verbally, the verb 보다 is often conjugated to fit the sentence's grammatical structure.","target_language_example":"주말에 친구들과 영화를 봤어요.","native_language_example":"I watched a movie with friends on the weekend."}]
["에 있어서",{"thoughts":"'에 있어서' is a Korean phrase often used to indicate a context, situation, or condition related to a noun. It is roughly equivalent to 'in terms of' or 'regarding' in English.","target_language_multi_word_term":"에 있어서","meaning":"'in terms of' or 'regarding'.","additional_notes":"Used to introduce a topic or aspect being considered in a discussion or explanation. It often precedes a noun to specify the context or area something pertains to.","target_language_example":"그 문제에 있어서 우리는 같은 의견이다.","native_language_example":"Regarding that issue, we have the same opinion."}]
["이라고",{"thoughts":"The Korean term '이라고' is a common ending attached to nouns to mean 'is called' or 'is said to be'. It's frequently used in both spoken and written Korean to express what someone or something is referred to as.","target_language_multi_word_term":"이라고","meaning":"'is called' or 'is said to be'.","additional_notes":"'이라고' is used after a consonant, and '라고' is used after a vowel. It's often used to introduce names or titles.","target_language_example":"그 친구가 영웅이라고 부른다.","native_language_example":"They call that friend a hero."}]
["이메일을 보내다",{"thoughts":"이메일을 보내다 is a common phrase used when talking about internet communication, specifically sending emails.","target_language_multi_word_term":"이메일을 보내다","meaning":"to send an email.","additional_notes":"This phrase is used when someone is performing the action of sending an email. The word 이메일 (imeil) comes from the English 'email', and 보내다 (bonaeda) means 'to send'. This phrase is widely used in both personal and professional contexts.","target_language_example":"나는 매일 이메일을 보냅니다.","native_language_example":"I send emails every day."}]
["음식을 먹다",{"thoughts":"The Korean phrase '음식을 먹다' is a basic and frequently used phrase, meaning 'to eat food'. It's composed of '음식' meaning 'food' and '먹다' meaning 'to eat'. This phrase is relevant for beginner learners as it is foundational for talking about meals and dining habits.","target_language_multi_word_term":"음식을 먹다","meaning":"'to eat food'.","additional_notes":"This phrase is commonly used in everyday conversations about meals and eating. You can replace '음식' with specific food items to describe eating those items.","target_language_example":"저녁에 음식을 먹어요.","native_language_example":"I eat food in the evening."}]
["나니까",{"thoughts":"\"나니까\" is the first-person pronoun 나 (I/me) plus the causal ending 니까, giving the meaning \"because (it is) me.\" Often used in casual speech to justify or reassure by pointing to the speaker’s own identity.","target_language_multi_word_term":"나니까","meaning":"because it’s me","additional_notes":"Casual, explanatory tone. Used to give a reason based on the fact that the speaker is the one involved. Often placed at the end of a clause or as a standalone sentence for emphasis.","target_language_example":"걱정 마, 나니까 괜찮아.","native_language_example":"Don’t worry, it’s fine because it’s me."}]
["이렇게나",{"thoughts":"'이렇게나' is an intensified form of '이렇게', which already means 'this way' or 'like this'. The '-나' suffix adds emphasis, so '이렇게나' implies surprise or emphasis about the extent, degree, or manner of something.","target_language_multi_word_term":"이렇게나","meaning":"'so much' or 'to such an extent'.","additional_notes":"The term '이렇게나' is often used to express amazement, surprise, or disbelief about how something is done or how things appear. It is generally used informally in spoken conversation.","target_language_example":"우리가 이렇게나 빨리 도착할 줄은 몰랐어요.","native_language_example":"I didn't expect us to arrive this quickly."}]
["이야기하다",{"thoughts":"The Korean term '이야기하다' is a verb that will be important for learners as it refers both to engaging in conversation and sharing or narrating stories.","target_language_multi_word_term":"이야기하다","meaning":"to talk or to tell a story.","additional_notes":"This verb can be used to describe the action of having a conversation or narrating an event. It is a regular verb and often used in everyday conversation.","target_language_example":"친구와 이야기를 많이 했어요.","native_language_example":"I talked a lot with my friend."}]
["위하다",{"thoughts":"The Korean multi-word verb '위하다' generally means 'to do something for a person or cause'. It signifies actions taken with the intention of benefiting someone or something. This verb is often used in expressions to denote care, consideration, and dedication. It is frequently used in conjugated forms or as part of compound verbs like '위를 위해'.","target_language_multi_word_term":"위하다","meaning":"'to do for', 'for the sake of'.","additional_notes":"Frequently used in contexts indicating an action taken for the benefit or sake of another person or cause. Can be used in declarative, imperative, and interrogative sentences.","target_language_example":"그녀는 가족을 위해 요리한다.","native_language_example":"She cooks for her family."}]
["자니",{"thoughts":"The term '자니' is often used informally to ask if someone is sleeping or awake. It usually appears towards the end of a sentence and uses the verb '자다,' which means 'to sleep,' appended with an informal interrogative ending.","target_language_multi_word_term":"자니","meaning":"Are you sleeping?","additional_notes":"Commonly used when texting or chatting informally to check if someone is awake or available to talk. It is often used with friends or close acquaintances.","target_language_example":"너 지금 자니?","native_language_example":"Are you sleeping now?"}]
["자고는",{"thoughts":"The term '자고는' is used to imply the suggestion or intention of sleeping or lying down as a means of achieving something or as part of a plan.","target_language_multi_word_term":"자고는","meaning":"'and then sleep' or 'after sleeping'.","additional_notes":"Often used in the context of suggesting someone sleeps as part of a plan or routine. It may appear in phrases advising rest before the next activity.","target_language_example":"우리는 밥을 먹고 자고는 다시 일어나서 공부할 거야.","native_language_example":"We'll eat, sleep, and then wake up to study again."}]
["이보다",{"thoughts":"The term '이보다' is often used in comparisons, acting like 'than this' or 'more than this'. It's typically found in sentences where something is being compared to an established standard or condition.","target_language_multi_word_term":"이보다","meaning":"'than this' or 'more than this'.","additional_notes":"Used in sentences to compare something to the current situation or standard. Indicates a comparison to something immediately present or just stated.","target_language_example":"이보다 더 좋은 날씨는 없을 거야.","native_language_example":"There will be no better weather than this."}]
["조용히 하다",{"thoughts":"The Korean phrase '조용히 하다' literally translates to 'do quietly'. It is commonly used to ask someone to be quiet or to do something quietly. This phrase is useful in many everyday situations where noise levels need to be reduced.","target_language_multi_word_term":"조용히 하다","meaning":"'to be quiet' or 'to do quietly'.","additional_notes":"Used when asking or telling someone to lower their voice or to perform an action quietly.","target_language_example":"아이들이 잠들었으니 조용히 하세요.","native_language_example":"Please be quiet because the children are asleep."}]
["찾다",{"thoughts":"찾다 means to look for or to find in Korean. It's a basic verb that beginners should learn early on as it's commonly used in everyday conversations.","target_language_multi_word_term":"찾다","meaning":"'to look for' or 'to find'.","additional_notes":"Typically used to indicate searching for or discovering something. The verb follows the standard Korean conjugation patterns depending on the tense and politeness level.","target_language_example":"나는 내 열쇠를 찾고 있어요.","native_language_example":"I am looking for my keys."}]
["지하철을 타다",{"thoughts":"The phrase '지하철을 타다' is commonly used in Korean to describe the action of taking or riding the subway. Subway systems are an integral part of public transportation in Korea, especially in urban areas like Seoul.","target_language_multi_word_term":"지하철을 타다","meaning":"to ride the subway.","additional_notes":"This phrase is useful for navigating urban transportation and is commonly used in daily conversation when discussing travel plans or commutes.","target_language_example":"저는 매일 아침 지하철을 타고 회사에 가요.","native_language_example":"I take the subway to go to work every morning."}]
["찾고 있다",{"thoughts":"'찾고 있다' is a present progressive form in Korean that means 'looking for' or 'searching for'. It is used to express ongoing action. This is essential for expressing continuous actions in conversations.","target_language_multi_word_term":"찾고 있다","meaning":"'looking for' or 'searching for'.","additional_notes":"It is the present continuous form, indicating an action currently taking place. Used when actively searching for something.","target_language_example":"나는 열쇠를 찾고 있다.","native_language_example":"I am looking for my keys."}]
["질문을 하다",{"thoughts":"The phrase '질문을 하다' literally means 'to make a question' or 'to ask a question'. It is often used in a variety of contexts where someone is seeking information or clarification.","target_language_multi_word_term":"질문을 하다","meaning":"'to ask a question'.","additional_notes":"It's a common phrase used when someone is looking for information or clarification. The verb '하다' (to do) is combined with '질문' (question) to create the concept of posing a question.","target_language_example":"학생들은 선생님에게 질문을 했다.","native_language_example":"The students asked the teacher a question."}]
["잊어버리다",{"thoughts":"'잊어버리다' is a common Korean verb used to express the action of forgetting something entirely. It's often used in everyday conversation to indicate that something has slipped one's mind.","target_language_multi_word_term":"잊어버리다","meaning":"'to forget'.","additional_notes":"Used to describe the act of completely forgetting something. The '-버리다' suffix implies that the action is completed or beyond retrieval, adding emphasis to the forgetting.","target_language_example":"나는 그의 이름을 잊어버렸어.","native_language_example":"I forgot his name."}]
["일을 하다",{"thoughts":"The Korean term '일을 하다' translates directly to 'do work' or 'work' in English. It is a basic verb phrase useful for expressing actions related to working or completing tasks. Beginner learners should understand it as a fundamental phrase for discussing daily activities involving work or employment.","target_language_multi_word_term":"일을 하다","meaning":"'to work' or 'to do work'.","additional_notes":"The term '일을 하다' is used to refer to performing work, whether it's job-related, household chores, or other tasks. It’s frequently used in everyday conversations to describe any activity considered work.","target_language_example":"저는 매일 9시에 일을 시작해요.","native_language_example":"I start work every day at 9 o'clock."}]
["자니까",{"thoughts":"The term '자니까' is a colloquial form derived from the verb '자다' (to sleep) combined with the ending '니까', which indicates a reason or cause. It is used to explain the reason for something related to sleeping, often expressing an ongoing action or habitual sleep pattern.","target_language_multi_word_term":"자니까","meaning":"'since (someone) is sleeping' or 'because (someone) is asleep'.","additional_notes":"Often used when explaining actions, requests, or comments related to someone's sleeping state. It implies the reason for a situation based on someone being asleep.","target_language_example":"조용히 해, 아기가 자니까.","native_language_example":"Be quiet, since the baby is sleeping."}]
["줄 알다",{"thoughts":"'줄 알다' is a phrase often used in Korean to indicate having an expectation or assumption about something. It is commonly utilized in conversational contexts.","target_language_multi_word_term":"줄 알다","meaning":"To expect or think (incorrectly).","additional_notes":"Used to express that one assumed or expected something, indicating a misunderstanding or incorrect assumption. It often follows a verb in its tense-marked stems, indicating that the speaker expected that action or situation to occur or be a certain way.","target_language_example":"그가 오지 않을 줄 알았어.","native_language_example":"I thought he wouldn't come."}]
["일하다",{"thoughts":"'일하다' is a commonly used Korean verb that means 'to work'. It is a fundamental verb that is useful for beginner learners to describe employment situations, daily activities, and tasks.","target_language_multi_word_term":"일하다","meaning":"'to work'.","additional_notes":"Often used to indicate someone's occupation, routine tasks, or general activity. It can be combined with different subjects and objects to specify the type of work being done.","target_language_example":"저는 매일 오전 9시부터 오후 6시까지 일해요.","native_language_example":"I work from 9 AM to 6 PM every day."}]
["최선을 다하다",{"thoughts":"The phrase '최선을 다하다' is used in Korean to express the idea of putting in one's best effort. It is a motivational phrase often used in contexts where encouragement is needed or when expressing determination.","target_language_multi_word_term":"최선을 다하다","meaning":"To do one's best.","additional_notes":"This phrase is commonly used to encourage someone or to express personal determination in any task or challenge. It can apply to work, studies, sports, and other contexts where effort and dedication are valued.","target_language_example":"시험 공부에 최선을 다할게요.","native_language_example":"I'll do my best to study for the exam."}]
["자면",{"thoughts":"'자면' is a conditional expression in Korean. It is often used to express 'if' something happens, specifically related to actions involving sleep. It can be found in sentences discussing hypothetical scenarios or future conditions about sleeping.","target_language_multi_word_term":"자면","meaning":"'if [someone] sleeps'.","additional_notes":"'자면' comes from the verb '자다' (to sleep) and the conditional particle '면', which is used to imply 'if'. It is used in the context of making a condition around the action of sleeping.","target_language_example":"내일 일찍 일어나야 자면, 지금 자야 해.","native_language_example":"If you want to get up early tomorrow, you should sleep now."}]
["지도 모르다",{"thoughts":"The phrase '지도 모르다' in Korean is used to express uncertainty or possibility, often translated to 'might' or 'may'. It is formed by adding '지도' to the verb '모르다', which means 'to not know', indicating a speculative or uncertain situation. This is useful for beginners to create sentences where they're unsure or guessing.","target_language_multi_word_term":"지도 모르다","meaning":"'might' or 'may'.","additional_notes":"Used to indicate uncertainty or possibility, often implying that something may or may not happen. It is used in various tenses and informal/formal situations. Put '지도 모르다' after the verb stem to express this meaning.","target_language_example":"비가 올지도 몰라요.","native_language_example":"It might rain."}]
["해야 하다",{"thoughts":"The term '해야 하다' in Korean expresses necessity or obligation. It is formed by attaching 하다 ('to do') to 해야, which comes from 하다's nominal form '해야' (have to). This grammatical construction is commonly used when describing something that needs to be done, similar to 'must do' or 'have to do' in English.","target_language_multi_word_term":"해야 하다","meaning":"'must do' or 'have to do'.","additional_notes":"This phrase is used to express necessity or obligation. It is often used in daily conversations when discussing tasks, responsibilities, or actions that need to be completed.","target_language_example":"숙제를 해야 해요.","native_language_example":"I have to do my homework."}]
["책을 읽다",{"thoughts":"The term '책을 읽다' is a basic phrase composed of '책 (chaek)' meaning 'book' and '읽다 (ikda)' meaning 'to read'. It is a simple and useful phrase for beginners learning Korean, especially when discussing daily activities or hobbies.","target_language_multi_word_term":"책을 읽다","meaning":"to read a book","additional_notes":"This phrase is used to describe the action of reading a book. It is a straightforward activity verb construction. In conversations, it is typically used to describe current actions, hobbies, or future plans.","target_language_example":"저는 매일 저녁 책을 읽어요.","native_language_example":"I read a book every evening."}]
["조심하다",{"thoughts":"The Korean word '조심하다' is a common verb used when advising someone to be careful or take caution. It's relevant to beginners as it frequently appears in safety-related contexts.","target_language_multi_word_term":"조심하다","meaning":"to be careful or cautious.","additional_notes":"Often used in imperative form to give warnings or advice. Can apply to physical situations or in a broader metaphorical sense, such as being cautious with actions or words.","target_language_example":"길을 건널 때 조심하세요.","native_language_example":"Be careful when crossing the road."}]
["하지 않다",{"thoughts":"The phrase '하지 않다' is used to form negative sentences in Korean. It negates verbs and is frequently used in everyday conversation.","target_language_multi_word_term":"하지 않다","meaning":"'to not do'.","additional_notes":"This phrase is used to express that an action is not taking place. In sentences, it generally appears after a verb to negate it. You can use this for a wide range of actions by placing it after the dictionary form of the verb you want to negate.","target_language_example":"그는 숙제를 하지 않습니다.","native_language_example":"He does not do his homework."}]
["어떻게 하든지",{"thoughts":"어떻게 하든지 is a phrase that suggests no matter how something is done or regardless of the method used.","target_language_multi_word_term":"어떻게 하든지","meaning":"'no matter how'","additional_notes":"This phrase is often used to express that the outcome will be the same regardless of the specific method, plan, or manner in which something is done. It's commonly followed by a result or goal that is intended to be achieved.","target_language_example":"어떻게 하든지 이번 프로젝트를 끝내자.","native_language_example":"No matter how we do it, let's finish this project."}]
["혼자 살다",{"thoughts":"The phrase '혼자 살다' directly translates to 'live alone' in English. It is commonly used to describe someone who lives by themselves, without any roommates or family members. This term is relevant for beginners as it introduces a basic verb form combined with an adverb, which is a common structure in Korean. This can also provide cultural insight since living alone is a notable aspect of modern living in many cities.","target_language_multi_word_term":"혼자 살다","meaning":"'live alone'.","additional_notes":"Used to describe the situation of living independently, without roommates or family. Useful when talking about one's living situation or independence.","target_language_example":"저는 혼자 살아요.","native_language_example":"I live alone."}]
["하든 말든",{"thoughts":"This Korean expression is a colloquial way to indicate indifference or a lack of concern about someone's actions or decisions. It's used to convey that one doesn't care whether the action is done or not.","target_language_multi_word_term":"하든 말든","meaning":"'Whether or not (someone) does something.'","additional_notes":"This phrase is often used to express indifference or nonchalance. It can sometimes have a dismissive or even slightly rude tone, implying that the speaker is unaffected by the outcome.","target_language_example":"그가 오든 말든 상관없어.","native_language_example":"I don't care whether he comes or not."}]
["하고 있다",{"thoughts":"The phrase '하고 있다' is used in Korean to describe an action that is currently ongoing, similar to the present continuous tense in English. It literally means 'doing' and pairs with a verb stem to convey an action in progress.","target_language_multi_word_term":"하고 있다","meaning":"'doing' (present continuous).","additional_notes":"Used to indicate an action that is currently happening. Attach '고 있다' to the stem of a verb to form a sentence like 'I am doing something.'","target_language_example":"지금 숙제를 하고 있어요.","native_language_example":"I am doing my homework now."}]
["전혀 없다",{"thoughts":"The phrase '전혀 없다' is used to express complete non-existence or absence of something. '전혀' means 'not at all' or 'entirely not', while '없다' means 'do not have' or 'there isn't'. It's important for learners to grasp its use for emphasis in negative sentences.","target_language_multi_word_term":"전혀 없다","meaning":"'not at all' or 'none whatsoever'.","additional_notes":"This phrase is used to deny or express the total absence of something. It's often used in contexts where you want to emphasize that something doesn't exist or is completely absent.","target_language_example":"그 문제에 대해 전혀 아는 것이 없다.","native_language_example":"I have no knowledge about that issue at all."}]
["하지 말다",{"thoughts":"The Korean phrase '하지 말다' is used as a prohibitive form, often equivalent to 'don't do' in English. It's formed from the verb '하다' meaning 'to do' and '말다' which is used to negate or prohibit something. This phrase is commonly used to tell someone not to do something.","target_language_multi_word_term":"하지 말다","meaning":"'Do not do.'","additional_notes":"Often used to instruct or advise someone against performing a certain action. It can be adjusted for politeness or formality by modifying the ending.","target_language_example":"여기서 사진을 찍지 마세요.","native_language_example":"Do not take pictures here."}]
["하고 싶다",{"thoughts":"The term '하고 싶다' is used to express a desire to do something. It's a common way to talk about wanting to perform an activity or action. The '싶다' part indicates the want or desire, and '하고' implies doing something, associated with a verb as a stem form before 하고. This would be useful for learners to express their intentions or desires.","target_language_multi_word_term":"하고 싶다","meaning":"'want to do'","additional_notes":"This phrase is used with a verb stem to indicate a desire to perform an action. For example, '먹다' (to eat) becomes '먹고 싶다' (want to eat).","target_language_example":"저는 여행하고 싶어요.","native_language_example":"I want to travel."}]
["해야 되다",{"thoughts":"The Korean phrase '해야 되다' combines the verb '하다' (to do) with '되다' (to become) to form an expression that conveys obligation or necessity. It's a useful phrase for expressing obligations, making plans, or stating what tasks need to be completed.","target_language_multi_word_term":"해야 되다","meaning":"'to have to' or 'must'.","additional_notes":"Used to express necessity or obligation to perform a specific action. This phrase is often followed by a verb indicating the action that must be done.","target_language_example":"나는 숙제를 해야 돼.","native_language_example":"I have to do my homework."}]
["화가 나다",{"thoughts":"'화가 나다' is a Korean expression that means to become angry or upset. It's a useful phrase for learners to know when expressing negative emotions. Understanding this phrase helps learners communicate how they feel when something upsetting happens.","target_language_multi_word_term":"화가 나다","meaning":"'to be angry' or 'to get upset'.","additional_notes":"This phrase is used to describe the feeling or state of being angry. It's often reflexive, implying that something caused the person to become angry. It's also common to hear the expression in the past tense, '화가 났어요', meaning 'I got angry.'","target_language_example":"그는 작은 일에 쉽게 화가 납니다.","native_language_example":"He gets angry easily over small things."}]
["차다",{"thoughts":"The Korean term '차다' is multifaceted, with uses in everyday conversation and specific contexts like sports or time. It can be a verb meaning 'to kick', or 'to be cold', and is also used in expressions for satisfaction or being filled, depending on the context. This might be confusing for beginners.","target_language_multi_word_term":"차다","meaning":"'to kick' or 'to be cold'.","additional_notes":"'차다' is a versatile verb in Korean. Its meaning varies by context: 'to kick' when used in sports or physical actions, and 'to be cold' in describing temperature. It's important to recognize the sentence context to determine its meaning.","target_language_example":"축구공을 차다.","native_language_example":"Kick the soccer ball."}]
["할 수 있다면",{"thoughts":"The phrase '할 수 있다면' is commonly used in Korean to express a conditional ability or possibility. It is directly linked to the verb '하다' (to do), which when combined with '수 있다' forms a phrase that means 'can do'. It is often used when discussing potential actions one can take if conditions allow.","target_language_multi_word_term":"할 수 있다면","meaning":"'if (one) can' or 'if (it is) possible'.","additional_notes":"The phrase is typically used to introduce conditional actions or possibilities in a conversation. It signifies that something will be done if it is possible or feasible under the given circumstances.","target_language_example":"할 수 있다면 내일 만나자.","native_language_example":"If you can, let's meet tomorrow."}]
["춤을 추다",{"thoughts":"The phrase '춤을 추다' is a commonly used phrase in Korean, often encountered in everyday conversations and media. For beginners, understanding phrases that describe basic actions like dancing can be especially useful culturally and socially.","target_language_multi_word_term":"춤을 추다","meaning":"to dance","additional_notes":"This phrase is a combination of '춤' (dance) and '추다' (to dance) and is used to describe the action of dancing. The structure is noun + verb, where the noun '춤' takes an objective modifier '-을' or '-를', dependent on the next word having a vowel or consonant, respectively.","target_language_example":"그녀는 축제에서 춤을 췄다.","native_language_example":"She danced at the festival."}]
["있다",{"thoughts":"'있다' is one of the most common Korean verbs, used for existence, possession, or location, essential for beginners.","target_language_multi_word_term":"있다","meaning":"to exist; to have; to be (located).","additional_notes":"Used to say something exists, someone has something, or something is at a place. Opposite of 없다. Conjugates like 있어요 (polite), 있습니다 (formal).","target_language_example":"책이 책상 위에 있어요.","native_language_example":"The book is on the desk."}]
["하다",{"thoughts":"\"하다\" is one of the most common Korean verbs, meaning \"to do\". It often combines with many Sino-Korean nouns to form verbs like 공부하다 (to study), 운동하다 (to exercise). For a beginner, knowing 하다 lets them understand hundreds of verb combinations.","target_language_multi_word_term":"하다","meaning":"to do","additional_notes":"Frequently attaches to nouns to create verbs (e.g., 일하다 ‘to work’). Conjugates regularly: 해요 (polite), 합니다 (formal), 했다 (past), 할 거예요 (future).","target_language_example":"저는 숙제를 해요.","native_language_example":"I do my homework."}]
["어떻게 해서든지",{"thoughts":"The Korean term '어떻게 해서든지' is an idiomatic expression used to indicate doing something by any means necessary or no matter what, showing determination or emphasis on attempting something, regardless of the difficulty involved.","target_language_multi_word_term":"어떻게 해서든지","meaning":"'by any means necessary' or 'no matter what'.","additional_notes":"Often used to express a strong determination to achieve a result or find a way to do something, regardless of obstacles or challenges.","target_language_example":"그 일을 어떻게 해서든지 끝낼 것입니다.","native_language_example":"I will finish the job by any means necessary."}]
["자면서",{"thoughts":"The term '자면서' is derived from the verb '자다' which means 'to sleep', combined with the suffix '-면서', which implies that two actions occur simultaneously.","target_language_multi_word_term":"자면서","meaning":"while sleeping","additional_notes":"Used to describe an action happening concurrently with sleeping. Often appears in contexts where something happens to or because of a sleeping person.","target_language_example":"그녀는 꿈을 자면서 웃었다.","native_language_example":"She laughed while sleeping, because of a dream."}]
