["가끔",{"thoughts":"The Korean term '가끔' is an adverb commonly used to describe frequency of actions or events. It's important for learners to understand how it fits into sentences to describe how often something occurs.","target_language_multi_word_term":"가끔","meaning":"'sometimes' or 'occasionally'.","additional_notes":"가끔 is an adverb used to indicate that something happens from time to time or not regularly. It is placed before the verb it describes.","target_language_example":"나는 가끔 커피를 마십니다.","native_language_example":"I sometimes drink coffee."}]
["가끔씩",{"thoughts":"The Korean term '가끔씩' is used to describe events or actions that occur intermittently or not regularly, similar to 'sometimes' or 'occasionally' in English. It is a common adverb that can be useful for learners to express frequency in conversation.","target_language_multi_word_term":"가끔씩","meaning":"'sometimes' or 'occasionally'.","additional_notes":"Used to indicate events that occur intermittently or without a fixed pattern. It often precedes a verb in sentences.","target_language_example":"가끔씩 운동하러 공원에 가요.","native_language_example":"Sometimes I go to the park to exercise."}]
["간신히",{"thoughts":"The Korean term '간신히' is an adverb used to describe situations where something is achieved with great difficulty or narrowly achieved. It conveys the idea of just barely doing something or managing to do something against odds.","target_language_multi_word_term":"간신히","meaning":"Just barely or narrowly.","additional_notes":"This term is used when describing situations where something is done with difficulty or only achieved by a small margin. It's often associated with making a tough effort to accomplish something.","target_language_example":"시험에 간신히 합격했어요.","native_language_example":"I barely passed the exam."}]
["같은",{"thoughts":"'같은' is the attributive adjective form of '같다', meaning 'same as' or 'like'. It's often used to compare or express similarities between items.","target_language_multi_word_term":"같은","meaning":"'same', 'like', or 'such as'.","additional_notes":"'같은' is commonly used to describe things that are similar in nature, kind, or appearance. It is often part of phrases that compare or indicate similarity.","target_language_example":"나는 그녀와 같은 책을 읽고 있어요.","native_language_example":"I am reading the same book as her."}]
["같이",{"thoughts":"The Korean word '같이' is often used to mean 'together' or 'with'. It's useful for beginners to understand contexts of doing things with others.","target_language_multi_word_term":"같이","meaning":"Together, with.","additional_notes":"In Korean, '같이' is typically used to describe actions done with other people. It is commonly used in everyday conversations to suggest doing activities together or to indicate accompaniment.","target_language_example":"우리는 같이 영화를 봐요.","native_language_example":"We watch a movie together."}]
["개인적으로",{"thoughts":"The Korean word '개인적으로' is often used when expressing a personal opinion or perspective.","target_language_multi_word_term":"개인적으로","meaning":"'personally' or 'in my opinion'.","additional_notes":"It is used when conveying a personal viewpoint or individual experience rather than a general fact or objective statement.","target_language_example":"개인적으로 그 영화가 별로였어요.","native_language_example":"Personally, I didn't like the movie."}]
["거의",{"thoughts":"'거의' is a Korean adverb that signifies approximation, often used to indicate something that is nearly or almost completed or reached.","target_language_multi_word_term":"거의","meaning":"'almost' or 'nearly'.","additional_notes":"Used to express that something is close to a certain state or quantity but not quite there. It is often used with verbs to modify their meaning.","target_language_example":"그는 거의 다 왔어요.","native_language_example":"He is almost here."}]
["거의 다",{"thoughts":"The Korean phrase '거의 다' means 'almost all' or 'almost everything' and is used to express that a large portion of something is completed, consumed, or understood. It's a useful phrase for beginners to describe quantities or states.","target_language_multi_word_term":"거의 다","meaning":"'almost all', 'almost everything'.","additional_notes":"Used to indicate that something is nearly complete or that almost everything described has been included. Common in everyday conversation when talking about completion or consumption.","target_language_example":"숙제를 거의 다 했어요.","native_language_example":"I almost finished my homework."}]
["것 같다",{"thoughts":"것 같다 is a Korean expression used for making assumptions or guesses. It often follows a verb or adjective stem and implies that the speaker is not entirely certain but has a feeling or guess about something.","target_language_multi_word_term":"것 같다","meaning":"'It seems that' or 'I think'.","additional_notes":"Used to express uncertainty or a tentative conclusion. The expression can follow verbs, adjectives, or copulas to convey the speaker's hypothesis or opinion on an observed situation.","target_language_example":"비가 올 것 같아요.","native_language_example":"It seems like it will rain."}]
["것이다",{"thoughts":"'것이다' is a frequently used Korean phrase that is used to express a fact or assertion and can often imply a future tense or intention.","target_language_multi_word_term":"것이다","meaning":"is/am/are (a fact or intention).","additional_notes":"'것이다' is commonly used to indicate a statement of fact or an intention. It can also be used to give an explanation or reason for something. It's often seen in written Korean, such as in essays or formal situations, but is also used in spoken language to emphasize something.","target_language_example":"내일 우리는 산에 갈 것이다.","native_language_example":"Tomorrow, we are going to the mountain."}]
["게다가",{"thoughts":"The Korean word '게다가' is an adverb used to add additional information or enumerate items. It's similar to saying 'moreover,' 'besides,' or 'furthermore' in English and is used to strengthen the statement or argument being made by adding another point.","target_language_multi_word_term":"게다가","meaning":"'besides' or 'moreover'.","additional_notes":"Use '게다가' to introduce additional information that supports or complements the main point being discussed. It often adds emphasis to the following statement.","target_language_example":"그 식당 음식이 싸고 맛있어요. 게다가 서비스도 좋아요.","native_language_example":"That restaurant's food is cheap and delicious. Besides, the service is also good."}]
["겨우",{"thoughts":"'겨우' is a Korean adverb often used to emphasize that something happened with great difficulty or that something barely happened. It's typically positioned before verbs and adjectives.","target_language_multi_word_term":"겨우","meaning":"'barely' or 'narrowly'.","additional_notes":"It is used to signal that something was achieved with difficulty, close to not happening at all. Common contexts might include time limits or constraints.","target_language_example":"그는 지하철을 겨우 탔다.","native_language_example":"He barely caught the subway."}]
["결국",{"thoughts":"The term '결국' is used in Korean to indicate the final outcome or conclusion of a series of events.","target_language_multi_word_term":"결국","meaning":"'finally' or 'in the end'.","additional_notes":"Used to express the conclusion or result of a situation or story. Often used when describing how a series of actions or events lead to a certain outcome.","target_language_example":"그는 결국 성공했다.","native_language_example":"He finally succeeded."}]
["결국은",{"thoughts":"'결국은' is an adverbial phrase in Korean that expresses the idea of 'in the end' or 'after all,' often used to summarize or conclude previous statements or situations.","target_language_multi_word_term":"결국은","meaning":"'in the end' or 'eventually'.","additional_notes":"Used to indicate the final outcome or the ultimate result of a sequence of events or a process. It's often used to provide a conclusion or to emphasize the resolution of a matter.","target_language_example":"결국은 모두가 행복했어요.","native_language_example":"In the end, everyone was happy."}]
["결코",{"thoughts":"\nThe Korean term '결코' is an adverb often used to emphasize the absolute negation in a sentence, typically paired with negative verbs. It's important for learners to understand it as it can drastically change the meaning of a statement, emphasizing something is 'in no way' or 'never.'","target_language_multi_word_term":"결코","meaning":"'never' or 'by no means'.","additional_notes":"Used to express strong negation, often requires a negative verb form in a sentence. It reinforces the impossibility of something occurring.","target_language_example":"그는 결코 포기하지 않는다.","native_language_example":"He never gives up."}]
["계속",{"thoughts":"The Korean term '계속' is often used to express continuity or to indicate that something is continuing without interruption. It is similar to the English words 'continuously', 'continually', 'constantly', or 'still'.","target_language_multi_word_term":"계속","meaning":"continuously, constantly, still.","additional_notes":"'계속' is used to describe an ongoing action or state. It can be used when discussing habits, processes, or situations that do not stop or change over time.","target_language_example":"비가 계속 내리고 있어요.","native_language_example":"It is continuously raining."}]
["계속해서",{"thoughts":"The term '계속해서' can be broken down into '계속' meaning 'continuously' or 'constantly', and '해서', which is derived from the verb '하다' and connects the phrase to actions. It's an adverbial expression to denote that an action is ongoing or repeatedly happening without interruption.","target_language_multi_word_term":"계속해서","meaning":"Continuously or repeatedly.","additional_notes":"'계속해서' is often used to describe actions or events that occur without stopping. It's an adverb that modifies verbs to indicate that the action is being carried out repeatedly or continuously.","target_language_example":"비가 계속해서 내리고 있어요.","native_language_example":"It is continuously raining."}]
["곧",{"thoughts":"The Korean term '곧' is a versatile word that is frequently used in conversations to indicate something that is imminent or about to happen shortly. It helps learners grasp the nuance of time, enriching their communication skills by understanding how to express soon-to-occur events.","target_language_multi_word_term":"곧","meaning":"soon or shortly.","additional_notes":"Used when referring to something expected to happen in the near future. It can also imply promptness or immediacy, like \"right away.\"","target_language_example":"밥이 곧 준비될 거예요.","native_language_example":"The meal will be ready soon."}]
["공식적으로",{"thoughts":"The Korean term '공식적으로' is an adverb that means 'officially'. It is derived from '공식', meaning 'official', and the suffix '-적으로', which turns nouns into adverbs. The term is useful for beginner learners to understand because it is commonly used in formal contexts to describe actions or statements made in an official capacity.","target_language_multi_word_term":"공식적으로","meaning":"officially","additional_notes":"This term is often found in formal documents, news reports, and announcements when describing actions, decisions, or statements made by authorities or organizations. It indicates that something has been done following established rules or procedures.","target_language_example":"그 결정은 공식적으로 발표되었습니다.","native_language_example":"The decision was officially announced."}]
["관한",{"thoughts":"'관한' is often used to mean 'about' or 'concerning,' and is commonly used when discussing topics or subjects pertaining to something.","target_language_multi_word_term":"관한","meaning":"'about' or 'concerning'.","additional_notes":"Used to specify that something is related to or associated with a particular subject. Frequently used in conjunction with other nouns to indicate the topic being discussed.","target_language_example":"이 책은 환경 문제에 관한 내용이에요.","native_language_example":"This book is about environmental issues."}]
["관해",{"thoughts":"The term '관해' is often used in Korean to talk about the subject or topic related to something. It's derived from the noun '관(관하다)' which means 'related to' or 'about.' This is a useful expression for beginner learners when they describe or discuss topics in conversation or writing.","target_language_multi_word_term":"관해","meaning":"'about' or 'concerning'.","additional_notes":"관해 is used to specify a topic or subject of discussion. It is commonly paired with the particle '에' ('에 관한' or '에 관해') to indicate something being related to a particular topic. This structure is frequently used in both spoken and written Korean, especially in more formal contexts.","target_language_example":"이 책은 환경 문제에 관해 이야기합니다.","native_language_example":"This book talks about environmental issues."}]
["관해서",{"thoughts":"'관해서' is a Korean phrase often used to indicate the topic or subject matter related to something. It is frequently used when discussing topics or presenting information related to a specific subject.","target_language_multi_word_term":"관해서","meaning":"'about', 'concerning', or 'regarding'.","additional_notes":"Used to discuss a specific topic or subject, indicating a connection to the matter being talked about.","target_language_example":"그 문제에 관해서 이야기해 봅시다.","native_language_example":"Let's talk about that issue."}]
["굉장히",{"thoughts":"'굉장히' is an adverb in Korean that is used to express a high degree or intensity, similar to 'very' or 'extremely' in English.","target_language_multi_word_term":"굉장히","meaning":"'very' or 'extremely'.","additional_notes":"Often used to intensify adjectives or verbs, indicating something is done to a great extent.","target_language_example":"그 영화는 굉장히 재미있었어요.","native_language_example":"The movie was really enjoyable."}]
["그 누구도",{"thoughts":"The Korean phrase '그 누구도' is used to indicate 'nobody' or 'no one' in a sentence. It is typically used in negative contexts to emphasize exclusion or the absence of someone.","target_language_multi_word_term":"그 누구도","meaning":"'no one' or 'nobody'.","additional_notes":"This phrase is often used for emphasizing that not a single person is being referred to or involved. It is typically used in sentences where negation is present, such as 'nobody did' or 'no one knows'.","target_language_example":"그 누구도 그 소식을 듣지 못했다.","native_language_example":"No one heard the news."}]
["그 전에",{"thoughts":"This Korean expression literally translates to 'before that' or 'beforehand.' It's used to refer to a time or action that happens before another event. This kind of phrase could be useful for beginners learning to sequence events in Korean sentences.","target_language_multi_word_term":"그 전에","meaning":"'before that' or 'prior to that'.","additional_notes":"Used to refer to an action or event occurring before a reference point in time.","target_language_example":"나는 밥을 먹기 전에 손을 씻어요.","native_language_example":"I wash my hands before eating."}]
["그거 말고",{"thoughts":"The Korean phrase '그거 말고' is commonly used to suggest an alternative, meaning 'not that one' or 'other than that.'","target_language_multi_word_term":"그거 말고","meaning":"'not that one'.","additional_notes":"Used to express a preference for an alternative or rejection of the mentioned item or option.","target_language_example":"그거 말고 다른 거 주세요.","native_language_example":"Give me a different one, not that one."}]
["그것도",{"thoughts":"The Korean phrase '그것도' often translates to 'that too' or 'also that', which makes it a useful phrase to emphasize addition or inclusion in a conversation.","target_language_multi_word_term":"그것도","meaning":"'that too' or 'also that'.","additional_notes":"Used to emphasize the addition of something, indicating that the mentioned item is included along with others.","target_language_example":"그것도 정말 좋았어요.","native_language_example":"That was really good, too."}]
["그때까지",{"thoughts":"The term '그때까지' is used in Korean to specify a time limit or deadline. It combines '그때' meaning 'that time' or 'then' with '까지', meaning 'until'.","target_language_multi_word_term":"그때까지","meaning":"'until then' or 'by that time'.","additional_notes":"Used to indicate a point in time up to which an action or state continues. It can refer to a deadline or an expected time for an event.","target_language_example":"우리는 그때까지 기다릴 것이다.","native_language_example":"We will wait until then."}]
["그래 그래",{"thoughts":"The phrase '그래 그래' is used as a casual, friendly way to agree or assent. It is often used among friends or in informal situations.","target_language_multi_word_term":"그래 그래","meaning":"'yeah, yeah' or 'okay, okay'.","additional_notes":"Used to show agreement or acknowledge what someone is saying, usually in a casual or light-hearted context. It can also convey a sense of 'I understand you' or 'I got it'.","target_language_example":"A: 내일 영화 보러 갈래? B: 그래 그래, 좋아!","native_language_example":"A: Do you want to go watch a movie tomorrow? B: Yeah, yeah, sounds good!"}]
["그래도",{"thoughts":"'그래도' is often used to express a contrast or to indicate an outcome despite an opposing factor.","target_language_multi_word_term":"그래도","meaning":"'nevertheless' or 'still'.","additional_notes":"Used when acknowledging a previous statement or situation, yet highlighting a different or contrasting result.","target_language_example":"비가 많이 왔어요. 그래도 산책을 갔어요.","native_language_example":"It rained a lot. Nevertheless, I went for a walk."}]
["그래서",{"thoughts":"'그래서' is a common Korean conjunctive adverb used to express causation or a reason that leads to a result, equivalent to the English 'so' or 'therefore'.","target_language_multi_word_term":"그래서","meaning":"'Therefore' or 'so'.","additional_notes":"Used to connect two clauses where the first provides a reason or cause, and the second indicates the result. Common in both spoken and written Korean.","target_language_example":"나는 배가 고파서, 그래서 점심을 먹었어요.","native_language_example":"I was hungry, so I had lunch."}]
["그러나",{"thoughts":"'그러나' is a Korean conjunction similar to 'but' or 'however' in English, often used to introduce a contrast or exception to a previous statement.","target_language_multi_word_term":"그러나","meaning":"'but' or 'however'.","additional_notes":"This conjunction is used to contrast two clauses, indicating that the second clause provides a contrasting idea or exception to the first.","target_language_example":"비가 왔어요. 그러나 우리는 소풍을 갔어요.","native_language_example":"It rained. However, we went on a picnic."}]
["그러니까",{"thoughts":"The word '그러니까' is often used in Korean conversation to connect ideas in discourse, indicating reason or result. It's a versatile term that a beginner might encounter in daily conversation.","target_language_multi_word_term":"그러니까","meaning":"'therefore', 'so', or 'that's why'.","additional_notes":"Used to explain or reason a preceding statement, or to emphasize that something follows logically from what has been said.","target_language_example":"그러니까 더 열심히 해야 해요.","native_language_example":"So you need to work harder."}]
["그러면",{"thoughts":"'그러면' is a frequently used Korean conjunction that connects sentences, offering a relation in terms of sequence or consequence. For a beginner, understanding its causal implication is crucial in conversation.","target_language_multi_word_term":"그러면","meaning":"'then', 'if so', or 'in that case'.","additional_notes":"Used to suggest a sequence of actions or consequences based on a previous statement. It is often used in conditional or resultative contexts and can often be used to motivate a next step or decision.","target_language_example":"지금 비가 많이 와요. 그러면 우산을 가져가세요.","native_language_example":"It's raining a lot right now. Then, take an umbrella."}]
["그런",{"thoughts":"The Korean term '그런' is often used as a demonstrative adjective to describe a situation, object, or condition that is similar or of a certain type, often referring to something that was mentioned before.","target_language_multi_word_term":"그런","meaning":"'such', 'that kind of'.","additional_notes":"It is used to refer to a category or type based on a previous context or conversation, similar to saying 'such a thing' or 'that kind of situation'.","target_language_example":"나는 그런 영화를 좋아해요.","native_language_example":"I like movies like that."}]
["그런 거",{"thoughts":"'그런 거' is a casual Korean expression used to indicate something like 'those kinds of things' or 'such a thing'. It is often used in everyday conversation to refer to general or non-specific things.","target_language_multi_word_term":"그런 거","meaning":"'such a thing' or 'things like that'.","additional_notes":"It's used to refer to things that have been mentioned earlier or things that are implied by the context. Common in spoken Korean, often in informal settings.","target_language_example":"나는 그런 거 안 좋아해.","native_language_example":"I don't like things like that."}]
["그런 것",{"thoughts":"The phrase '그런 것' in Korean roughly translates to 'such a thing' or 'something like that'. It is often used to refer to a previously described idea, object, or concept, or when speaking about something in a general or tentative manner.","target_language_multi_word_term":"그런 것","meaning":"'such a thing' or 'something like that'.","additional_notes":"Used to vaguely refer to an example or category of things mentioned previously, or to imply generality or skepticism about something.","target_language_example":"나는 그런 것이 좋아요.","native_language_example":"I like things like that."}]
["그런 말을",{"thoughts":"The phrase '그런 말을' in Korean can be broken down into '그런' (such or like that) and '말' (words or speech). It refers to words said in a particular manner or tone, often after someone makes a comment that may be surprising or unexpected. It is usually followed by verbs that relate to speaking or thinking.","target_language_multi_word_term":"그런 말을","meaning":"'words like that' or 'such talk'.","additional_notes":"This phrase is often used in conversational contexts when someone expresses disbelief, surprise, or mild disapproval about what's been said. Sometimes it carries a nuance of mild admonishment or teasing.","target_language_example":"그런 말을 하면 어떡해요?","native_language_example":"What do you mean by saying something like that?"}]
["그런 식으로",{"thoughts":"'그런 식으로' is a Korean expression used to describe the manner or way in which something is done. It is often used to convey 'in that way' or 'like that.'","target_language_multi_word_term":"그런 식으로","meaning":"'in that way' or 'like that.'","additional_notes":"This phrase is used to describe the manner in which something happens, often referring back to a previously mentioned method or example. It can also imply doing things in a similar way as someone else or as previously described.","target_language_example":"나는 그런 식으로 문제를 해결하지 않아.","native_language_example":"I don't solve problems in that way."}]
["그런 짓을",{"thoughts":"The phrase '그런 짓을' is often used in Korean to express disapproval or to describe an unwanted or inappropriate action.","target_language_multi_word_term":"그런 짓을","meaning":"'such a deed' or 'that kind of act'.","additional_notes":"The phrase '그런 짓을' is typically used in a negative context, often implying that the action being referred to is inappropriate, unacceptable, or shameful. It is commonly used when expressing disapproval or cautioning someone against doing something undesirable.","target_language_example":"너는 왜 그런 짓을 했어?","native_language_example":"Why did you do such a thing?"}]
["그런데",{"thoughts":"The term '그런데' is commonly used in Korean to contrast two clauses or introduce an unexpected element in a conversation. It's comparable to the English terms like 'but', 'however', or 'by the way'. This is relevant to beginners for connecting sentences and expressing nuances in speech.","target_language_multi_word_term":"그런데","meaning":"'but', 'however', or 'by the way'.","additional_notes":"It is used to introduce a contrast or shift in topic. Often used to start a new sentence that either adds to or contrasts with the previous statement.","target_language_example":"저는 매운 음식을 좋아해요. 그런데 친구는 매운 음식을 못 먹어요.","native_language_example":"I like spicy food. However, my friend can't eat spicy food."}]
["그렇게",{"thoughts":"The term '그렇게' is often used in Korean to describe the manner or approach to something, typically translating to 'like that' or 'in that way'. It is a useful term for emphasizing a way of doing things or referring back to a previous statement.","target_language_multi_word_term":"그렇게","meaning":"'like that' or 'in that way'.","additional_notes":"It's used to describe a method, manner, or idea that has already been mentioned or is understood from context. Can refer to actions, behaviors, or characteristics and is often combined with verbs to indicate doing something 'like that'.","target_language_example":"그렇게 말하지 마세요.","native_language_example":"Don't say it like that."}]
["그렇다면",{"thoughts":"'그렇다면' is an often used conjunction in Korean that sets conditions or transitions related sentences. It's useful to understand expressions of conditionality or logical flow.","target_language_multi_word_term":"그렇다면","meaning":"'if so' or 'in that case'.","additional_notes":"Used to state what will happen or what is true if a preceding statement is acknowledged as true. It's often used to connect ideas logically or in hypothetical situations.","target_language_example":"그렇다면 우리는 어떻게 해야 합니까?","native_language_example":"In that case, what should we do?"}]
["그렇지만",{"thoughts":"'그렇지만' is a Korean conjunction used to contrast two ideas or statements, similar to 'but' or 'however' in English. It is commonly used in conversational Korean when a speaker wants to present a contrasting point or exception to the previous statement.","target_language_multi_word_term":"그렇지만","meaning":"'but' or 'however'.","additional_notes":"Used to introduce a contrasting statement, often giving an exception or presenting a different perspective. Common in both spoken and written Korean.","target_language_example":"비가 많이 왔어요. 그렇지만 우리 계획을 변경하지 않았어요.","native_language_example":"It rained a lot. However, we didn't change our plans."}]
["그리",{"thoughts":"The term '그리' in Korean often acts as an adverb meaning 'so' or 'in that manner'. It's used to describe the extent or manner of an action or condition. Beginners might encounter '그리' in various contexts, so understanding its adverbial use is helpful.","target_language_multi_word_term":"그리","meaning":"'so' or 'in that way'.","additional_notes":"그리 is often used to describe the degree of something, indicating that something is done to such an extent or in a particular manner. It can be subtle and is often used for emphasis or clarification.","target_language_example":"그리 어렵지 않아요.","native_language_example":"It's not so difficult."}]
["그리고 나서",{"thoughts":"This phrase is used to indicate a sequence of events or actions, essentially meaning 'and then', in Korean.","target_language_multi_word_term":"그리고 나서","meaning":"'and then'.","additional_notes":"It's used to describe what happens next in a sequence of actions or events.","target_language_example":"저는 아침을 먹고 그리고 나서 산책을 갔어요.","native_language_example":"I had breakfast and then went for a walk."}]
["그만 좀",{"thoughts":"'그만 좀' is a common Korean phrase used to tell someone to stop doing something, often out of irritation or frustration. This expression is casual and may imply a degree of impatience or annoyance.","target_language_multi_word_term":"그만 좀","meaning":"\"stop it a bit\" or \"cut it out\".","additional_notes":"Used to request someone to stop an action, often with a tone of annoyance or impatience. It is a casual expression and can be used among friends or when the speaker feels comfortable expressing irritation.","target_language_example":"그만 좀 해!","native_language_example":"Stop it already!"}]
["그보다",{"thoughts":"'그보다' is a Korean phrase commonly used to shift the focus of conversation or emphasize a point in comparison to something previously mentioned.","target_language_multi_word_term":"그보다","meaning":"'rather than that' or 'instead'.","additional_notes":"Used to introduce a new topic or emphasize something more important than what was previously mentioned.","target_language_example":"그보다, 지금 해야 할 일이 있어요.","native_language_example":"Rather than that, I have something I need to do right now."}]
["금방",{"thoughts":"The Korean term '금방' can be somewhat confusing for learners because it is used to indicate both a near past action and an imminent future action. It can mean something happened 'just now' or will happen 'soon'. It is commonly used in conversation to give a sense of time close to the present moment.","target_language_multi_word_term":"금방","meaning":"soon or just now.","additional_notes":"'금방' is context-dependent and is used to describe something that just happened or something that will happen shortly. It is often used in casual conversation.","target_language_example":"금방 도착할 거예요.","native_language_example":"It will arrive soon."}]
["기도",{"thoughts":"The term '기도' is frequently used in Korean with a twofold meaning: referring to prayer and an aspect of hope or wish. Its usage varies based on religious or secular context.","target_language_multi_word_term":"기도","meaning":"prayer or wish.","additional_notes":"'기도' can refer to both religious prayers as well as hopes or wishes, often used symbolically or metaphorically.","target_language_example":"그는 매일 밤 가족을 위해 기도합니다.","native_language_example":"He prays for his family every night."}]
["까지",{"thoughts":"The Korean term '까지' is a postposition indicating a point in time or place until something happens. It's commonly used to express a limit or endpoint in time or space.","target_language_multi_word_term":"까지","meaning":"'until' or 'to'.","additional_notes":"'까지' is used after nouns to specify the ending point in time or space, similar to 'until' for time or 'to' for location in English.","target_language_example":"저는 5시까지 일해요.","native_language_example":"I work until 5 o'clock."}]
["꼭",{"thoughts":"The term '꼭' is an adverb in Korean often used to express certainty, necessity, or emphasis similar to 'definitely' or 'surely' in English. It's an important word for beginners as it frequently appears in daily conversations.","target_language_multi_word_term":"꼭","meaning":"definitely, certainly, for sure.","additional_notes":"Often used to emphasize the necessity or certainty of an action or statement. It can be used to affirm an intention or obligation.","target_language_example":"내일 꼭 전화해 주세요.","native_language_example":"Please make sure to call me tomorrow."}]
["꽤",{"thoughts":"'꽤' is a Korean adverb used to describe something to a considerable degree. It's useful for beginners to express levels of intensity or assurance in casual conversations.","target_language_multi_word_term":"꽤","meaning":"'quite', 'fairly', or 'rather'.","additional_notes":"Used to indicate a higher degree of something than expected, often in a positive sense. Commonly used in informal situations. It can modify adjectives and verbs to amplify their meaning.","target_language_example":"이 음식은 꽤 맛있어요.","native_language_example":"This food is quite tasty."}]
["끝내",{"thoughts":"The term '끝내' is an adverb used very commonly in Korean, particularly to convey the sense of finality or culmination, often translated to 'finally' or 'in the end'.","target_language_multi_word_term":"끝내","meaning":"'finally' or 'in the end'.","additional_notes":"This term is often used when discussing the conclusion of a prolonged process or event. It highlights that after various efforts or conditions, a situation has reached its culmination.","target_language_example":"그는 끝내 목표를 이루었다.","native_language_example":"He finally achieved his goal."}]
["나면",{"thoughts":"The term '나면' is a conditional ending in Korean, often used in hypothetical or conditional sentences. It means 'if (it) happens' or 'once (it) happens'. It's used to express a condition that triggers the action of the following clause.","target_language_multi_word_term":"나면","meaning":"'if' or 'when'.","additional_notes":"This expression is used to indicate a conditional situation, similar to how 'if' or 'when' is used in English to express conditions or possibilities.","target_language_example":"돈이 많으면 여행을 가고 싶어요.","native_language_example":"If I have a lot of money, I want to travel."}]
["나요",{"thoughts":"'나요' is a Korean sentence ending particle often used to form polite questions or to soften statements, making them sound more gentle and inquisitive.","target_language_multi_word_term":"나요","meaning":"used for forming polite questions.","additional_notes":"This suffix is added to verbs or adjectives to make the sentence sound more polite and seeking confirmation or an answer. It's often used in conversational contexts where politeness is important.","target_language_example":"책을 읽고 있나요?","native_language_example":"Are you reading a book?"}]
["나중에",{"thoughts":"The term '나중에' is used to refer to a later point in time, which can be useful for beginner learners to understand timing in conversations.","target_language_multi_word_term":"나중에","meaning":"'later' or 'at a later time'.","additional_notes":"Often used to indicate postponement or a future action or event. Can be used in casual conversations to suggest doing something after the current moment.","target_language_example":"나중에 만나요.","native_language_example":"See you later."}]
["내일",{"thoughts":"The term '내일' is a common word used in Korean to refer to the day after the current one. Beginners learning Korean will frequently encounter this word when discussing schedules, plans, or daily activities. It is fundamental vocabulary that is relevant to everyday conversation.","target_language_multi_word_term":"내일","meaning":"'tomorrow'.","additional_notes":"Commonly used in everyday conversation to discuss future plans or events. It indicates the day following today.","target_language_example":"내일 학교에 가요.","native_language_example":"I'm going to school tomorrow."}]
["너 말이야",{"thoughts":"The Korean phrase '너 말이야' is commonly used in informal speech to draw attention to or emphasize something about the person one is speaking to.","target_language_multi_word_term":"너 말이야","meaning":"'as for you' or 'you know'.","additional_notes":"Typically used to bring focus to the listener in a conversation, either to remind them of something or to emphasize what is being said about them.","target_language_example":"너 말이야, 정말 대단해.","native_language_example":"You know, you're really amazing."}]
["너무",{"thoughts":"'너무' is an adverb in Korean that is commonly used to express the degree or intensity of a situation or emotion. Although it often translates to 'too,' it is not always negative in Korean as it can also emphasize positive feelings or amounts.","target_language_multi_word_term":"너무","meaning":"'too' or 'very'.","additional_notes":"In Korean, 너무 can mean both 'too much' (negative connotation) or simply 'very' (positive connotation) depending on the context. It's widely used in daily conversation to express strong feelings or extreme degrees.","target_language_example":"너무 맛있어요.","native_language_example":"It's very delicious."}]
["너무 좋다",{"thoughts":"너무 좋다 is a phrase frequently used to express strong positive feelings, such as joy or satisfaction. It's a common phrase used in everyday conversations when someone really likes something, or when they find an experience particularly enjoyable.","target_language_multi_word_term":"너무 좋다","meaning":"'so good' or 'very nice'.","additional_notes":"This phrase can be used to describe anything highly positive, from the taste of food to an experience or someone's actions.","target_language_example":"이 영화가 너무 좋아요!","native_language_example":"This movie is so good!"}]
["너무나",{"thoughts":"'너무나' is a Korean adverb used to emphasize or intensify the degree of something, similar to 'so' or 'very much' in English. It's often used to express extreme emotion or condition, making it relevant for learners to understand how to emphasize statements in Korean.","target_language_multi_word_term":"너무나","meaning":"'so much' or 'extremely'.","additional_notes":"Used to intensify the degree of an emotion or condition. It can be paired with adjectives or verbs to emphasize their meaning.","target_language_example":"이 영화가 너무나 재미있어요.","native_language_example":"This movie is so much fun."}]
["누구",{"thoughts":"The Korean term '누구' is a common question word used to ask about a person or people. It translates to 'who' and is essential for basic conversational questions.","target_language_multi_word_term":"누구","meaning":"'who'.","additional_notes":"Used to ask about someone's identity or to inquire about which person did or will do something. It's commonly used in questions.","target_language_example":"누구예요?","native_language_example":"Who is it?"}]
["누구나",{"thoughts":"The Korean term '누구나' is used to refer to 'anyone' or 'everyone', often in a context that implies inclusivity or universality.","target_language_multi_word_term":"누구나","meaning":"'anyone' or 'everyone'.","additional_notes":"This term is used to express that something applies to all people without exception. It's commonly used to emphasize inclusivity.","target_language_example":"누구나 이 프로그램을 사용할 수 있습니다.","native_language_example":"Anyone can use this program."}]
["누구든",{"thoughts":"'누구든' consists of '누구' meaning 'who' and '든' which implies 'any' or 'every'. It means any person or anyone.\n","target_language_multi_word_term":"누구든","meaning":"'anyone' or 'whoever'.","additional_notes":"It is used to refer to any person in a general sense, often to indicate an open choice or inclusivity of any individual.","target_language_example":"누구든 참여할 수 있어요.","native_language_example":"Anyone can participate."}]
["누구라도",{"thoughts":"'누구라도' is a Korean term that means 'anyone' or 'whomever'. It's used to indicate that no specific person is singled out. This word is useful for making general statements that apply universally.","target_language_multi_word_term":"누구라도","meaning":"'anyone' or 'whomever'.","additional_notes":"It implies that the statement applies to everyone without exception. Often used to suggest that any person could be involved or capable of something.","target_language_example":"누구라도 그것을 할 수 있어요.","native_language_example":"Anyone can do it."}]
["늘",{"thoughts":"The Korean word '늘' means 'always' or 'constantly,' and it is used to describe actions or states that occur continuously or habitually. It is a simple yet essential word for beginners to indicate frequency, particularly when expressing routines or regular actions in Korean.","target_language_multi_word_term":"늘","meaning":"always, constantly.","additional_notes":"Used to describe actions or states that occur regularly or without change. It can be placed before verbs or adjectives to convey this meaning.","target_language_example":"그는 늘 웃는다.","native_language_example":"He always smiles."}]
["다",{"thoughts":"Although only one syllable, ‘다’ is extremely common in Korean. For beginners, the most helpful sense is as an adverb meaning “all / everything,” placed before a verb or noun to indicate completeness. (It can also be a formal declarative ending, but that’s a separate grammar point.)","target_language_multi_word_term":"다","meaning":"all; everything","additional_notes":"Used before verbs or nouns to show the action or amount is complete or total.","target_language_example":"다 했어요.","native_language_example":"I finished everything."}]
["다르게",{"thoughts":"The Korean word '다르게' translates to 'differently' or 'in another way' in English. It is often used to express doing something in a way that is not usual or is different from how it was done before.","target_language_multi_word_term":"다르게","meaning":"Differently or in another way.","additional_notes":"Used to describe an action being done in a different manner from usual, or to suggest an alternative approach.","target_language_example":"그 문제를 다르게 생각해 보세요.","native_language_example":"Try thinking about that problem differently."}]
["다른",{"thoughts":"The term '다른' means 'different' or 'another' and it is commonly used to describe something that is not the same as something else, or to refer to an additional item or person. Beginner learners would find it useful when distinguishing objects or making choices.","target_language_multi_word_term":"다른","meaning":"'different' or 'another'.","additional_notes":"Used to describe something that is not the same as something already mentioned or something additional.","target_language_example":"다른 색깔을 원해요.","native_language_example":"I want a different color."}]
["다른 거",{"thoughts":"The Korean term '다른 거' literally translates to 'another thing' or 'something else'. It's used when you're talking about an alternative option or something different from what was previously mentioned. This term is quite useful in everyday conversations, especially when expressing preferences or changing topics.","target_language_multi_word_term":"다른 거","meaning":"'another thing' or 'something else'.","additional_notes":"\"다른 거\" is used when referring to an alternative or different item or topic. It's often used in contexts where you want to specify something different from what is being discussed.","target_language_example":"다른 거 있어요?","native_language_example":"Is there something else?"}]
["다른 사람",{"thoughts":"The term '다른 사람' is likely to be useful for beginner learners as it is a common phrase used frequently in everyday conversation to refer to people other than the speaker or listener. Understanding this term can aid in talking about social dynamics, instructions, and more.","target_language_multi_word_term":"다른 사람","meaning":"'another person' or 'other people'.","additional_notes":"'다른' means 'different' or 'other', and '사람' means 'person' or 'people'. Together, they're used to refer to someone else other than the speaker or the person being spoken to.","target_language_example":"그는 다른 사람과 이야기하고 있어요.","native_language_example":"He is talking with another person."}]
["다시",{"thoughts":"The word '다시' is a useful adverb in Korean that learners often encounter. It is similar to saying 'again' or 'anew' in English, commonly utilized when repeating actions or revisiting topics. Beginner learners will often find it useful in conversational contexts where actions are repeated or revisited.","target_language_multi_word_term":"다시","meaning":"'again' or 'once more.'","additional_notes":"'다시' is frequently used when you want to redo something or try something again. It can also imply retrying, revisiting a situation, or executing an action anew.","target_language_example":"다시 해봐요.","native_language_example":"Try it again."}]
["다시 한 번",{"thoughts":"The phrase '다시 한 번' is commonly used in Korean to request repetition or to emphasize doing something again. It translates directly to 'one more time' or 'again'. This is useful for beginners who need things repeated for practice or understanding. It's often heard in classrooms or casual settings when someone needs clarification or a second chance.","target_language_multi_word_term":"다시 한 번","meaning":"'once more' or 'again'.","additional_notes":"Can be used to politely ask someone to repeat themselves or to indicate a repeat action. It's applicable in various contexts, from casual conversations to formal settings.","target_language_example":"죄송하지만, 다시 한 번 말씀해 주세요.","native_language_example":"Sorry, but could you please say that one more time?"}]
["다시 한번",{"thoughts":"The term '다시 한번' translates to 'once again,' often used when asking someone to repeat something or do something another time. It can be broken down into '다시,' meaning 'again,' and '한번,' meaning 'once.' This is a very useful expression for beginners who want to ask for repetition without all the nuance of more complex phrases.","target_language_multi_word_term":"다시 한번","meaning":"'once again' or 'one more time'.","additional_notes":"Used to politely request repetition or to ask someone to do something again. It's often used in everyday conversation when you want someone to repeat their words.","target_language_example":"죄송하지만, 다시 한번 말씀해 주세요.","native_language_example":"I'm sorry, but could you say that once again?"}]
["당장",{"thoughts":"The Korean term '당장' is used to express immediacy or urgency, equivalent to 'right now' or 'immediately' in English. It is often used when someone wants something to be done with no delay.","target_language_multi_word_term":"당장","meaning":"'right now' or 'immediately'.","additional_notes":"This term emphasizes the need for immediate action or response. It is used when there is an urgency or when something has to be done without any delay.","target_language_example":"당장 그 일을 끝내세요.","native_language_example":"Finish that task right now."}]
["대단히",{"thoughts":"대단히 is an adverb that is used to express a high degree of intensity or admiration. It is often used with words like '감사합니다' to emphasize gratitude or appreciation. It's a formal term, one that's often found in polite or formal speech.","target_language_multi_word_term":"대단히","meaning":"Very; greatly; extremely.","additional_notes":"대단히 is typically used in formal contexts to express strong feelings, often of gratitude or appreciation. It can be used before adjectives or verbs to enhance their intensity.","target_language_example":"대단히 감사합니다.","native_language_example":"Thank you very much."}]
["대부분",{"thoughts":"The term '대부분' is often used in Korean to express the concept of the majority or most of something. It's useful for beginners to understand this common word as it frequently appears in conversations, especially when discussing generalities or common occurrences.","target_language_multi_word_term":"대부분","meaning":"'most' or 'the majority'.","additional_notes":"Used to refer to the larger part or majority of a group or quantity. It can be used with subjects like people, objects, or situations.","target_language_example":"사람들이 대부분 너무 바빠요.","native_language_example":"Most people are too busy."}]
["대부분은",{"thoughts":"The term '대부분은' is a frequently used Korean phrase that signifies 'most' or 'the majority of'. It is often used when discussing generalities or common scenarios that apply to the majority within a group. This phrase is helpful for language learners to express ideas that apply to a large portion of a group or situation.","target_language_multi_word_term":"대부분은","meaning":"'most' or 'the majority of'.","additional_notes":"This term is used to indicate that something applies to the largest part of a group or situation. It's useful for general statements or observations.","target_language_example":"대부분은 여름을 좋아해요.","native_language_example":"Most people like summer."}]
["대부분의",{"thoughts":"The Korean term '대부분의' is used to express the idea of 'most of' something or 'the majority of'. It is commonly used in both spoken and written Korean when referring to most parts of a group or category.","target_language_multi_word_term":"대부분의","meaning":"'most of' or 'the majority of'.","additional_notes":"'대부분의' is adjectival and modifies a noun to indicate that it covers the larger part or nearly all of something.\n\nThis phrase is versatile and can be used in various contexts to talk about people, objects, time, or events when the speaker wants to emphasize that they are focusing on the majority rather than the entirety.","target_language_example":"대부분의 사람들이 그 영화를 좋아했어요.","native_language_example":"Most of the people liked the movie."}]
["대신에",{"thoughts":"The term '대신에' is used in Korean to indicate substituting or replacing one thing with another. It's similar to saying 'instead of' or 'in place of' in English and is often used to express preferences or alternatives.","target_language_multi_word_term":"대신에","meaning":"'instead of' or 'in place of'.","additional_notes":"This term is typically used to express a choice or substitution between two options, indicating that one option is preferred or chosen over another.","target_language_example":"커피 대신에 차를 마셨어요.","native_language_example":"I drank tea instead of coffee."}]
["대한",{"thoughts":"The Korean term '대한' is often used in various contexts, frequently appearing in formal or official names and expressions related to national matters, or directly translating concepts involving 'about' or 'relating to'. For beginner learners, it might be relevant to focus on its use in conversational and written contexts.","target_language_multi_word_term":"대한","meaning":"'of' or 'about'","additional_notes":"대한 is commonly used in official titles, documents, and phrases to imply 'relating to' or 'concerning'. The word can also indicate national or international matters, especially linked with Korea itself, such as in the phrase '대한민국' (Republic of Korea).","target_language_example":"이 책은 환경 문제에 대한 정보를 제공합니다.","native_language_example":"This book provides information about environmental issues."}]
["대해",{"thoughts":"The Korean term '대해' is a postposition, often used to indicate that a statement or expression is about something or concerning something. It is derived from the verb '대하다' which means 'to treat' or 'to regard'. This term is very common and can appear in discussions, descriptions, or clarifications about a given subject.","target_language_multi_word_term":"대해","meaning":"'about' or 'concerning'.","additional_notes":"It is used to specify that something is the subject or focus of an expression or discussion, similar to 'about' in English. Often combined with nouns to explain what the topic is centered on.","target_language_example":"이 책은 환경문제에 대해 이야기합니다.","native_language_example":"This book talks about environmental issues."}]
["대해서",{"thoughts":"대해서 is a Korean term often used to mean 'about' or 'regarding' when discussing or referring to a subject or topic in various contexts.","target_language_multi_word_term":"대해서","meaning":"'about', 'regarding'.","additional_notes":"Used to indicate the subject of conversation or inquiry. Often follows nouns to specify what the conversation or question is concerning. It is commonly used in both spoken and written contexts.","target_language_example":"나는 그 문제에 대해서 생각하고 있어.","native_language_example":"I am thinking about the problem."}]
["더",{"thoughts":"‘더’ is a very common adverb meaning “more,” used before verbs or adjectives to request or indicate a greater amount or degree.","target_language_multi_word_term":"더","meaning":"“more,” to a greater extent or quantity.","additional_notes":"Placed before verbs or adjectives to intensify or ask for an increased amount/degree. Often combined with 조금 (a little) as 좀 더 for politeness.","target_language_example":"조금 더 크게 말해 주세요.","native_language_example":"Please speak a bit louder (more loudly)."}]
["더 가까이",{"thoughts":"The Korean phrase '더 가까이' means 'closer' or 'nearer' and is often used when asking someone to come closer or move something closer. It is an adverbial phrase typically used in commands, suggestions, or descriptions of movement. Understanding such practical language can be very useful for a beginner learner in everyday situations.","target_language_multi_word_term":"더 가까이","meaning":"'closer' or 'nearer'.","additional_notes":"Used to indicate a desire for something or someone to be closer in physical distance. Common in conversational requests, such as asking someone to come nearer or bring an object closer.","target_language_example":"의자를 더 가까이 가져와 주세요.","native_language_example":"Please bring the chair closer."}]
["더 높이",{"thoughts":"The term '더 높이' is used in Korean to express the idea of achieving or doing something to a greater extent, specifically 'higher' or 'loftier.' It combines the adverb '더' meaning 'more' with '높이,' which refers to height.","target_language_multi_word_term":"더 높이","meaning":"'higher' or 'more elevated'.","additional_notes":"Often used in contexts where a comparative height is discussed, whether physical or metaphorical. Frequently found in motivational contexts or descriptions.","target_language_example":"그 산을 더 높이 올라가고 싶어요.","native_language_example":"I want to climb higher on that mountain."}]
["더 많이",{"thoughts":"'더 많이' is a Korean phrase used to express the concept of having 'more' of something in terms of quantity. It's relevant for beginner learners because it's commonly used in everyday conversations when comparing amounts or expressing a desire for more.","target_language_multi_word_term":"더 많이","meaning":"'more' or 'a larger amount'.","additional_notes":"Used to indicate a greater amount or degree of something, often in comparison to something else. It can be used with nouns, verbs, or adjectives to enhance the magnitude.","target_language_example":"나는 더 많이 먹고 싶어요.","native_language_example":"I want to eat more."}]
["더 빨리",{"thoughts":"'더 빨리' is a Korean phrase often used to express the idea of doing something faster or more quickly.","target_language_multi_word_term":"더 빨리","meaning":"'faster' or 'more quickly'.","additional_notes":"This phrase modifies verbs to indicate that the action should be performed with greater speed.","target_language_example":"그녀는 더 빨리 달리기를 시작했다.","native_language_example":"She started running faster."}]
["더 이상",{"thoughts":"The Korean phrase '더 이상' is used to indicate 'no longer' or 'not anymore,' especially in the context of changes or stopping an activity. It's useful for expressing the cessation of a habitual action or a state that will not continue.","target_language_multi_word_term":"더 이상","meaning":"'no longer' or 'not anymore'.","additional_notes":"Used to indicate that something will not continue or has stopped happening. Commonly used in negative sentences to express a cessation of actions or states.","target_language_example":"저는 더 이상 그곳에 살지 않아요.","native_language_example":"I no longer live there."}]
["더 이상은",{"thoughts":"The phrase '더 이상은' can be translated to mean 'any more' or 'any longer.' It is often used to indicate that something is no longer happening or should no longer happen.","target_language_multi_word_term":"더 이상은","meaning":"'any more' or 'any longer'.","additional_notes":"Often used with negative forms to express that something should stop or is not happening anymore.","target_language_example":"그 일을 더 이상은 하지 마세요.","native_language_example":"Don't do that work any more."}]
["더는",{"thoughts":"The term '더는' is commonly used in Korean as a negation phrase implying that something is no longer or no more. It often precedes the negative form of verbs.","target_language_multi_word_term":"더는","meaning":"'no longer', 'not anymore'.","additional_notes":"Used to express cessation or discontinuation of an action. Often followed by a negative verb form.","target_language_example":"더는 기다리지 않겠어요.","native_language_example":"I will not wait any longer."}]
["더욱",{"thoughts":"The Korean term '더욱' is a common word used to emphasize an increased degree of something. Beginners learning Korean might often see this in various contexts to denote 'more' or 'increasingly'.","target_language_multi_word_term":"더욱","meaning":"'more' or 'increasingly'.","additional_notes":"It is often used in comparative or superlative contexts to express an intensification. You might encounter it in both written and spoken Korean, emphasizing a quality or quantity.","target_language_example":"그는 더욱 열심히 공부했다.","native_language_example":"He studied more diligently."}]
["덕분에",{"thoughts":"The term '덕분에' is often used to express gratitude or to indicate that something positive happened thanks to someone or something else.","target_language_multi_word_term":"덕분에","meaning":"Thanks to","additional_notes":"'덕분에' is a polite expression used to acknowledge someone else's help or contribution. It can be used in both formal and informal contexts but always carries a sense of gratitude.","target_language_example":"네 덕분에 시험에 합격했어.","native_language_example":"Thanks to you, I passed the exam."}]
["도움이 필요하다",{"thoughts":"The term '도움이 필요하다' is commonly used to express the need for help or assistance in Korean. It's a phrase that beginner learners might use when they are in a situation where they require help from others.","target_language_multi_word_term":"도움이 필요하다","meaning":"to need help.","additional_notes":"This phrase is used when one is in need of assistance or support from others. It is a direct way to express that you cannot do something alone and require someone else's help.","target_language_example":"저에게 도움이 필요합니다.","native_language_example":"I need help."}]
["동시에",{"thoughts":"The Korean term '동시에' is commonly used to talk about events or actions occurring at the same time.","target_language_multi_word_term":"동시에","meaning":"'at the same time'.","additional_notes":"Often used to indicate simultaneous actions or occurrences. It can be used in a variety of contexts to emphasize that several things are happening together.","target_language_example":"그녀는 동시에 두 가지 일을 하고 있어요.","native_language_example":"She is doing two things at the same time."}]
["두 번째",{"thoughts":"The term '두 번째' is used to specify the second item in a series. It is a straightforward ordinal number construction necessary for basic counting in Korean.","target_language_multi_word_term":"두 번째","meaning":"the second","additional_notes":"It indicates the position in a sequence. '두' means 'two', and '번째' is used to denote a positional order, like 'first', 'second', etc.","target_language_example":"두 번째 순서가 내 차례입니다.","native_language_example":"The second turn is my turn."}]
["둘 다",{"thoughts":"The Korean phrase '둘 다' is commonly used when referring to both items or both people, often implying inclusivity. Understanding and using this phrase allows beginners to accurately refer to multiple subjects simultaneously.","target_language_multi_word_term":"둘 다","meaning":"'both' or 'both of them'.","additional_notes":"Used when referring to two items, people, or options, indicating that both are included or considered.","target_language_example":"사과랑 바나나 둘 다 먹고 싶어요.","native_language_example":"I want to eat both an apple and a banana."}]
["뒤에",{"thoughts":"The term '뒤에' is a postposition in Korean used to indicate location or time, similar to the English word 'behind' or 'after.' It is attached to nouns to show the relative position or sequence of events.","target_language_multi_word_term":"뒤에","meaning":"'behind' or 'after'.","additional_notes":"'뒤에' can be used to talk about physical location (e.g., behind a building) or to describe time (e.g., after an event). It is often combined with nouns to indicate a position or time relative to something else.","target_language_example":"수업이 끝난 뒤에 친구를 만났어요.","native_language_example":"I met a friend after class."}]
["드디어",{"thoughts":"'드디어' is an adverb often used to express excitement or relief that something has finally happened after a long wait.","target_language_multi_word_term":"드디어","meaning":"'finally' or 'at last'.","additional_notes":"Used to emphasize the completion or arrival of a desired event or situation after a period of waiting.","target_language_example":"드디어 휴가가 시작되었다.","native_language_example":"Finally, the vacation has started."}]
["따라",{"thoughts":"The Korean term '따라' is often used with verbs to indicate actions of following, copying, or according to something. It can be found in phrases like '따라서' (therefore, consequently) or used after a noun to express 'depending on' or 'according to'. For beginners, understanding its role in context is essential since it's adaptable.","target_language_multi_word_term":"따라","meaning":"'according to' or 'following'.","additional_notes":"'따라' can be used to indicate following someone or something, or to express actions taken according to a statement, rule, or condition. It's often used after the noun it refers to.","target_language_example":"그의 계획에 따라 우리는 움직였다.","native_language_example":"We moved according to his plan."}]
["따라서",{"thoughts":"The Korean word '따라서' is commonly used as a conjunction to indicate causality or consequence, similar to 'therefore' or 'thus' in English. It's useful for explaining reasons or outcomes, making it relevant for beginners learning to connect ideas or sentences in Korean.","target_language_multi_word_term":"따라서","meaning":"'therefore', 'thus', 'so', 'consequently'.","additional_notes":"Used to connect sentences or clauses when explaining a logical conclusion or consequence.","target_language_example":"비가 많이 왔어요. 따라서 소풍을 취소했어요.","native_language_example":"It rained a lot. Therefore, we canceled the picnic."}]
["딱",{"thoughts":"The Korean word '딱' is a versatile term often used to indicate something happening precisely, exactly, or fittingly. It conveys the idea of precision or perfect suitability in a situation.","target_language_multi_word_term":"딱","meaning":"exactly or precisely.","additional_notes":"Often used to emphasize the exactness or suitability of a situation. It can describe something fitting perfectly both in physical and metaphorical contexts.","target_language_example":"그는 딱 맞는 신발을 찾았다.","native_language_example":"He found shoes that fit perfectly."}]
["때때로",{"thoughts":"The Korean term '때때로' is used to indicate something that happens occasionally or at times. It's an adverb that beginner learners might find useful when describing the frequency of actions or events.","target_language_multi_word_term":"때때로","meaning":"'occasionally' or 'at times'.","additional_notes":"This term is often used to describe actions or events that do not occur regularly but happen from time to time.","target_language_example":"때때로 나는 공원에 산책하러 가요.","native_language_example":"Occasionally, I go for a walk in the park."}]
["때로는",{"thoughts":"The Korean term '때로는' is used to express 'sometimes' or 'at times'. It's common in daily conversations when describing something that happens occasionally but not regularly.","target_language_multi_word_term":"때로는","meaning":"'sometimes' or 'at times'.","additional_notes":"Used to indicate something that happens occasionally or from time to time. It can be used at the beginning of a sentence or within it, depending on the structure.","target_language_example":"때로는 혼자 있는 게 좋아요.","native_language_example":"Sometimes, I like being alone."}]
["때문에",{"thoughts":"'때문에' is commonly used to express the reason or cause of a certain situation or action, and is often translated to 'because of' or 'due to'. It connects the cause to the effect and is frequently used in both written and spoken Korean.","target_language_multi_word_term":"때문에","meaning":"'because of' or 'due to'.","additional_notes":"It is used to explain the reason for something, often appearing after a noun or a noun phrase. It indicates causation between the first and second parts of the sentence.","target_language_example":"비가 많이 와서 콘서트가 취소되었습니다. 날씨 때문에요.","native_language_example":"The concert was canceled because it rained a lot. Because of the weather."}]
["또 다른",{"thoughts":"‘또 다른’ is a common phrase in Korean used to convey the idea of 'another' or 'additional'. It is often used to indicate the presence or introduction of something new or different from what was previously mentioned.","target_language_multi_word_term":"또 다른","meaning":"'another', 'additional'.","additional_notes":"It is used to refer to something that is distinct but similar, often introducing a new object or concept in conversation.","target_language_example":"또 다른 문제가 생겼어요.","native_language_example":"Another problem has arisen."}]
["또다시",{"thoughts":"The Korean term '또다시' is used to mean 'again' or 'once more' and is often used to indicate repetition or recurrence.","target_language_multi_word_term":"또다시","meaning":"'again' or 'once more'.","additional_notes":"'또다시' emphasizes a repeated action or event, often with a sense of something recurring unexpectedly or undesirably.","target_language_example":"그는 시험에서 또다시 실패했다.","native_language_example":"He failed the exam once again."}]
["똑같은",{"thoughts":"The term '똑같은' is used to describe things that are identical or exactly the same.","target_language_multi_word_term":"똑같은","meaning":"'the same' or 'identical'","additional_notes":"Used when comparing two or more things to indicate that they are exactly alike in every detail.","target_language_example":"우리는 똑같은 옷을 입고 있어요.","native_language_example":"We are wearing the same clothes."}]
["똑같이",{"thoughts":"The Korean term '똑같이' is an adverb that means 'in the same way' or 'equally'. It's used to indicate that something is done in a manner that is identical to something else, highlighting similarity or equal treatment.","target_language_multi_word_term":"똑같이","meaning":"'in the same way' or 'equally'.","additional_notes":"This term emphasizes equality or uniformity in the way an action is performed or a situation is handled. It is often used in comparisons to show that two or more things are done or feel the same way.","target_language_example":"그들은 모든 문제를 똑같이 해결했다.","native_language_example":"They solved all the problems in the same way."}]
["똑똑히",{"thoughts":"The Korean term '똑똑히' is an adverb that is used to describe clarity or intelligence, typically in relation to speaking or understanding. It's important for beginner learners to identify contexts where clarity or precision is emphasized.","target_language_multi_word_term":"똑똑히","meaning":"clearly; smartly.","additional_notes":"This term is often used when referring to doing something with precision or when someone is communicating in a way that is easy to understand. It's used to emphasize the clarity or intelligence behind an action.","target_language_example":"그는 똑똑히 설명했다.","native_language_example":"He explained it clearly."}]
["똑바로",{"thoughts":"The term '똑바로' is a Korean adverb commonly used in everyday conversation. It often describes how something is done in a straight, direct, or proper manner.","target_language_multi_word_term":"똑바로","meaning":"'straight', 'upright', or 'properly'.","additional_notes":"Used to emphasize correctness or precision in doing something, such as following directions or behaving properly. It is often used for instructions on how to perform an action, like sitting or moving.","target_language_example":"똑바로 앉으세요.","native_language_example":"Please sit upright."}]
["라고",{"thoughts":"'라고' is a Korean particle used in direct quotations or to indicate naming or calling something. This can be crucial for beginners learning how to form sentences involving speech or names.","target_language_multi_word_term":"라고","meaning":"'as' or 'so-called'.","additional_notes":"Used to attribute a name or label, often in quotations to mean 'saying that' or 'called'. Common when someone mentions what another person said or calls something.","target_language_example":"그가 저를 친구라고 불렀어요.","native_language_example":"He called me a friend."}]
["마저",{"thoughts":"The Korean term '마저' is a particle that can be used to mean 'even' or 'all'. It's often used to emphasize that something was not excluded or was the last one left.","target_language_multi_word_term":"마저","meaning":"'even' or 'all the rest'.","additional_notes":"'마저' is used to emphasize that something is included or completed, sometimes adding a sense of inevitability.","target_language_example":"그는 마지막 한 조각 마저 먹었다.","native_language_example":"He ate even the last piece."}]
["마찬가지",{"thoughts":"The Korean term '마찬가지' is commonly used to express similarity or equality between situations, actions, or conditions.","target_language_multi_word_term":"마찬가지","meaning":"'the same' or 'likewise'.","additional_notes":"Used when comparing two things or situations to indicate that they are similar or that the same holds true for both.","target_language_example":"나는 월요일에 바빴어. 화요일도 마찬가지였어.","native_language_example":"I was busy on Monday. Tuesday was the same."}]
["마침내",{"thoughts":"The Korean term '마침내' is used to express the conclusion of a situation, often where there has been some anticipation or effort involved.","target_language_multi_word_term":"마침내","meaning":"'finally' or 'at last'.","additional_notes":"Used to indicate that something has been achieved or has occurred after a delay or period of effort.","target_language_example":"마침내 문제가 해결됐다.","native_language_example":"The problem has finally been resolved."}]
["막",{"thoughts":"The Korean term '막' can have several meanings based on context, but it is often used as an adverb indicating doing something just now, immediately before talking, or randomly. Understanding its context is crucial for accurate use and interpretation.","target_language_multi_word_term":"막","meaning":"'just' or 'recklessly'.","additional_notes":"'막' is versatile and context-dependent, often used to indicate something done just before or without much thought. It can convey actions done without prior notice or planning. Additionally, it can suggest doing something randomly or haphazardly.","target_language_example":"나는 막 도착했어.","native_language_example":"I just arrived."}]
["만",{"thoughts":"The Korean particle '만' is often used to mean 'only' or 'just'. It is a basic grammatical particle that attaches to nouns and verb stems to indicate limitation or exclusivity.","target_language_multi_word_term":"만","meaning":"'only' or 'just'.","additional_notes":"Emphasizes exclusivity or limitation, indicating that something is the only one or a singular focus out of a group or options. Attaches directly after the word or phrase it modifies.","target_language_example":"저는 물만 마셔요.","native_language_example":"I only drink water."}]
["만약에",{"thoughts":"'만약에' is a conditional marker often translated as 'if' or 'in case'. It's used to introduce hypothetical or conditional statements.","target_language_multi_word_term":"만약에","meaning":"'if' or 'in case'.","additional_notes":"It's frequently used at the beginning of sentences to present a condition or possibility. It helps set the stage for a scenario or condition being discussed.","target_language_example":"만약에 비가 오면, 우리는 안에 있을 거예요.","native_language_example":"If it rains, we will stay inside."}]
["만큼",{"thoughts":"'만큼' is a Korean postposition used to indicate comparison, usually translated as 'as much as' or 'to the extent that'.","target_language_multi_word_term":"만큼","meaning":"'as much as' or 'to the extent that'.","additional_notes":"It is attached to nouns or noun phrases to compare quantities, amounts, or degrees. It is often used in expressions of equality, where two things are compared in terms of their attributes or actions.","target_language_example":"그는 나만큼 열심히 일해요.","native_language_example":"He works as hard as I do."}]
["말고",{"thoughts":"The term '말고' means 'instead of' or 'not A but B'. It's used to show preference or suggest a substitution or alternative to something else.","target_language_multi_word_term":"말고","meaning":"instead of; not A but B.","additional_notes":"This phrase is used to suggest an alternative to something previously stated and generally appears with lists or when clarifying choices.","target_language_example":"이거 말고 저걸 주세요.","native_language_example":"Give me that one, not this one."}]
["말이죠",{"thoughts":"The term '말이죠' is a conversational filler in Korean, often used to add emphasis or indicate the speaker's contemplation or explanation of a previous point.","target_language_multi_word_term":"말이죠","meaning":"'you know', 'I mean'.","additional_notes":"Often used to draw attention to or emphasize what is about to be said, or to revisit and expand upon something previously mentioned.","target_language_example":"그 영화 말이죠, 정말 재미있었어요.","native_language_example":"That movie, you know, was really interesting."}]
["말하자면",{"thoughts":"'말하자면' is a Korean phrase used to introduce a statement or explanation. It's equivalent to saying 'in other words' or 'that is to say' in English. This term is useful for learners to clarify or expand upon a statement.","target_language_multi_word_term":"말하자면","meaning":"'in other words' or 'that is to say'","additional_notes":"Frequently used when providing clarification or elaborating on something previously mentioned. It's an informal way to bridge ideas and aid in explanations.","target_language_example":"그녀는 정말 성실한 학생이에요. 말하자면, 매일 도서관에 가요.","native_language_example":"She is a very diligent student. In other words, she goes to the library every day."}]
["매년",{"thoughts":"The Korean term '매년' is used to describe a recurring action or event that happens every year, often used in both written and spoken contexts.","target_language_multi_word_term":"매년","meaning":"'every year'.","additional_notes":"This term is used to denote something that occurs on a yearly basis, such as events, celebrations, or regular occurrences.","target_language_example":"매년 우리는 가족과 함께 여행을 갑니다.","native_language_example":"Every year, we go on a trip with our family."}]
["매우",{"thoughts":"The term '매우' is an adverb often used in Korean to convey a higher degree or intensity of something, similar to the English words 'very' or 'extremely'. It is useful for beginners to learn because it frequently appears in everyday conversation to express strong feelings or descriptions.","target_language_multi_word_term":"매우","meaning":"'very' or 'extremely'.","additional_notes":"Often used to emphasize adjectives and can be replaced with '아주' in some contexts. It is formal compared to '너무' which can also mean 'very'.","target_language_example":"그녀는 매우 아름다워요.","native_language_example":"She is very beautiful."}]
["매일",{"thoughts":"The Korean term '매일' is commonly used to express daily occurrences or routines.","target_language_multi_word_term":"매일","meaning":"every day.","additional_notes":"'매일' is used to express repetition or habitual action happening on a daily basis. It is often used at the start or end of a sentence.","target_language_example":"저는 매일 운동해요.","native_language_example":"I exercise every day."}]
["먼저",{"thoughts":"The Korean term '먼저' is frequently used to express the idea of priority or order in time. It is a versatile word that can be translated as 'first' or 'before' and often appears in sentences where actions are to be done sequentially. Beginner learners will encounter it in everyday conversation scenarios and when explaining steps or sequences.","target_language_multi_word_term":"먼저","meaning":"'first' or 'before'.","additional_notes":"Used to express an action or step taken prior to others. Commonly appears in instructions or when expressing actions taken in a sequence.","target_language_example":"먼저 숙제를 끝내고 영화를 봐요.","native_language_example":"First, finish the homework and then watch a movie."}]
["명확하게",{"thoughts":"The term '명확하게' is an adverb used to describe an action done clearly or distinctly. It is important for beginners to understand adverbs for describing how actions are performed.","target_language_multi_word_term":"명확하게","meaning":"clearly, distinctly.","additional_notes":"It is used to describe actions performed in a clear and understandable manner. Often used to emphasize clarity in communication or reasoning.","target_language_example":"문제를 명확하게 설명해 주세요.","native_language_example":"Please explain the problem clearly."}]
["몇",{"thoughts":"몇 is a determiner meaning 'how many' or 'a few' used to ask about quantity.","target_language_multi_word_term":"몇","meaning":"'how many' or 'a few'.","additional_notes":"This word is often used in questions to ask about the number of objects or people. It can be followed by a counter to specify what exactly is being counted, such as 명 for people or 개 for general objects.","target_language_example":"이 방에 몇 명 있어요?","native_language_example":"How many people are in this room?"}]
["몇 가지",{"thoughts":"The term '몇 가지' is used in Korean to refer to a countable, yet indefinite number of things. It is typically used to ask about or state a few things from a larger set.","target_language_multi_word_term":"몇 가지","meaning":"'a few things' or 'several kinds'.","additional_notes":"It is used when you are referring to a small number of items or types, usually when the exact number is either unknown or unspecified.","target_language_example":"몇 가지 질문이 있습니다.","native_language_example":"I have a few questions."}]
["몇 년",{"thoughts":"The term '몇 년' is a basic phrase in Korean used to inquire about or specify years. It combines the word for 'how many' with the word for 'year', resulting in a phrase relevant for counting or questioning the number of years. This phrase could be useful for beginner learners, particularly when talking about age, durations, or dates.","target_language_multi_word_term":"몇 년","meaning":"'how many years'","additional_notes":"Commonly used in questions to ask about the duration of time in years, it might appear in contexts such as asking someone's age or how long something has been happening.","target_language_example":"몇 년 동안 한국어를 공부했어요?","native_language_example":"How many years have you studied Korean?"}]
["몇 달",{"thoughts":"The term '몇 달' is a useful phrase for counting or asking about the number of months. It is relevant for learners who want to talk about time durations in Korean.","target_language_multi_word_term":"몇 달","meaning":"'how many months'.","additional_notes":"Used when asking or stating a specific number of months for a duration or time frame.","target_language_example":"이 프로젝트는 몇 달이 걸릴까요?","native_language_example":"How many months will this project take?"}]
["몇 주",{"thoughts":"The Korean term '몇 주' translates to 'how many weeks' in English. It is often used to ask about and specify a number of weeks, whether in terms of past duration, future planning, or an ongoing period.","target_language_multi_word_term":"몇 주","meaning":"'how many weeks'.","additional_notes":"Used to inquire about the duration of weeks in a given context, such as planning future events or discussing past durations.","target_language_example":"이번 프로젝트는 몇 주 동안 진행되나요?","native_language_example":"How many weeks will this project take?"}]
["모든",{"thoughts":"The term '모든' is an adjective in Korean that is frequently used to indicate totality or entirety, similar to 'all' in English. It's relevant for beginners to understand how to describe things collectively.","target_language_multi_word_term":"모든","meaning":"'all' or 'every'.","additional_notes":"'모든' is used before nouns to describe all members or items of a set. It’s commonly used in sentences to indicate that the subject includes every part or aspect of something.","target_language_example":"모든 사람들이 함께 웃었다.","native_language_example":"All the people laughed together."}]
["모든 걸",{"thoughts":"'모든 걸' stems from the Korean phrase meaning 'everything.' It is a contraction of '모든 것을,' where '모든' means 'all' or 'every,' and '것을' means 'thing.' The contraction is common in spoken Korean, making it sound more natural. It's frequently used to describe someone who is offering or promising 'everything' or 'all things.'","target_language_multi_word_term":"모든 걸","meaning":"'everything' or 'all things'.","additional_notes":"'모든 걸' is a contraction of '모든 것을.' It's used in informal contexts and indicates a sense of completion or inclusivity about objects or topics being referred to.","target_language_example":"난 너에게 모든 걸 줄게.","native_language_example":"I will give you everything."}]
["무슨",{"thoughts":"'무슨' is a Korean interrogative modifier used to ask about the nature or kind of something, similar to 'what kind of' in English.","target_language_multi_word_term":"무슨","meaning":"'what kind of' or 'which'.","additional_notes":"Used with nouns to inquire specifically about the type or kind of the noun being referenced.","target_language_example":"무슨 책을 읽고 있어요?","native_language_example":"What kind of book are you reading?"}]
["무슨 말을",{"thoughts":"'무슨 말을' is a common Korean phrase used to inquire about or express confusion about what has been said in a conversation.","target_language_multi_word_term":"무슨 말을","meaning":"'what words' or 'what is being said'.","additional_notes":"It is often used in questions or expressions of confusion to clarify what someone has said or to indicate that you didn't understand something fully.","target_language_example":"무슨 말을 하는지 모르겠어요.","native_language_example":"I don't understand what you're saying."}]
["무슨 일이",{"thoughts":"The phrase '무슨 일이' is used in Korean to ask about what happened or what's going on. It is commonly used in everyday conversation to show curiosity or concern about a situation.","target_language_multi_word_term":"무슨 일이","meaning":"'what's happening' or 'what's the matter'.","additional_notes":"The phrase is often used at the beginning of a sentence when expressing concern or curiosity about an event or situation. It can be followed by a verb to specify the context, such as '있어요' (is there) or '있었어요' (was there).","target_language_example":"무슨 일이 있었어요?","native_language_example":"What happened?"}]
["무슨 일이 있어도",{"thoughts":"'무슨 일이 있어도' is a Korean expression used to express determination and resolve, often translated as 'no matter what' or 'at all costs'. It can also indicate a strong commitment to do something regardless of the circumstances.","target_language_multi_word_term":"무슨 일이 있어도","meaning":"'no matter what' or 'at all costs'.","additional_notes":"This phrase is used to indicate a determination to do something under any circumstances. It conveys a strong sense of resolve and commitment.","target_language_example":"무슨 일이 있어도 내일 일찍 일어날 거야.","native_language_example":"No matter what, I will wake up early tomorrow."}]
["무엇을",{"thoughts":"The term '무엇을' (mu-eo-seul) is the accusative form of '무엇', meaning 'what'. It is used to ask questions or make statements about 'what' someone is doing or wants.","target_language_multi_word_term":"무엇을","meaning":"'what' (object form).","additional_notes":"Used when asking questions about the object of an action. It's commonly used in conversation to clarify or inquire what the subject is acting upon.","target_language_example":"무엇을 먹고 싶습니까?","native_language_example":"What do you want to eat?"}]
["무엇이",{"thoughts":"'무엇이' is the subject form of 'what' in Korean, specifically used when 'what' is the subject of the sentence. Understanding its usage is important for forming questions and statements in Korean.","target_language_multi_word_term":"무엇이","meaning":"'what', as a subject.","additional_notes":"Used when asking questions where 'what' is the subject. Often used in formal or written Korean, with more casual or spoken contexts using '뭐가' instead.","target_language_example":"무엇이 가장 중요합니까?","native_language_example":"What is the most important?"}]
["무엇이든",{"thoughts":"'무엇이든' is a Korean phrase that means 'anything' or 'whatever.' It is often used to indicate that any option is acceptable or possible.","target_language_multi_word_term":"무엇이든","meaning":"'anything' or 'whatever'.","additional_notes":"Used to express openness to any choice or to indicate no preference. Commonly used in casual and formal contexts alike.","target_language_example":"무엇이든 마음에 드는 것을 골라요.","native_language_example":"Choose whatever you like."}]
["무엇인지",{"thoughts":"'무엇인지' is a Korean phrase used to express 'what it is' or 'what something is' and is often found in indirect questions or statements.","target_language_multi_word_term":"무엇인지","meaning":"'what it is'.","additional_notes":"Used to refer to or question the identity or nature of something in indirect statements or questions. It asks or explains the essence or content of an unknown object or situation.","target_language_example":"그게 무엇인지 알아요?","native_language_example":"Do you know what that is?"}]
["무조건",{"thoughts":"The Korean term '무조건' is frequently used to express the idea of doing something unconditionally or without any exceptions. It is useful for beginners as it often appears in various contexts to emphasize certainty or lack of requirements.","target_language_multi_word_term":"무조건","meaning":"unconditionally or without condition.","additional_notes":"'무조건' is often used to assert something firmly or to emphasize that there are no strings attached, no exceptions, or all conditions are accepted.","target_language_example":"무조건 따라와!","native_language_example":"Follow me unconditionally!"}]
["무척",{"thoughts":"The word '무척' is used in Korean to express a high degree of something, commonly translated as 'very' in English.","target_language_multi_word_term":"무척","meaning":"'very' or 'extremely'.","additional_notes":"Used to emphasize adjectives or adverbs, indicating a high degree or intensity of something.","target_language_example":"이 영화는 무척 재미있어요.","native_language_example":"This movie is very entertaining."}]
["뭐",{"thoughts":"‘뭐’ is a common Korean word used in everyday conversation. It is often used in questions or to express curiosity about something. It can also be used informally in broader contexts like ‘What’s up?’ or ‘What?’ in response to something surprising or confusing.","target_language_multi_word_term":"뭐","meaning":"'what'.","additional_notes":"Used in questions or to express curiosity, surprise, or confusion. Often used informally.","target_language_example":"뭐 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["뭐가",{"thoughts":"'뭐가' is a contraction of '무엇이', which translates to 'what is' or 'what's'. This phrase is often used to ask about something specific or emphasize the subject in a question. It is a part of conversational Korean used informally.","target_language_multi_word_term":"뭐가","meaning":"'what is'.","additional_notes":"It is used in informal settings to ask questions emphasizing 'what'. It's a contraction of '무엇이', more commonly used in conversation.","target_language_example":"그게 뭐가 문제야?","native_language_example":"What's the problem with that?"}]
["뭐고",{"thoughts":"The term '뭐고' is a colloquial expression used in Korean to express confusion or ask what something is.","target_language_multi_word_term":"뭐고","meaning":"'what is it?' or 'what's that?'","additional_notes":"Commonly used in casual spoken Korean, '뭐고' is an informal way of asking what something is, often used when someone encounters something unexpected or confusing.","target_language_example":"이거 뭐고?","native_language_example":"What's this?"}]
["뭐든",{"thoughts":"The Korean word '뭐든' combines '뭐', meaning 'what', with '든', which indicates 'anything' or 'whatever'. It's an informal way to express the idea of being open to any possibility or option.","target_language_multi_word_term":"뭐든","meaning":"'anything', 'whatever'.","additional_notes":"'뭐든' is commonly used to express openness or indifference towards a choice among multiple options. It is often used in casual conversations.","target_language_example":"나는 뭐든 괜찮아.","native_language_example":"Whatever is fine with me."}]
["뭐든지",{"thoughts":"'뭐든지' is a Korean word that combines '뭐' (what) and '든지' (any, all) to express a sense of 'anything' or 'whatever'. It is useful for learners to make general statements or express open-ended ideas.","target_language_multi_word_term":"뭐든지","meaning":"'anything' or 'whatever'.","additional_notes":"Use it to indicate openness or indifference to various options or possibilities. Often used in contexts where there is no specific preference.","target_language_example":"뭐든지 할 수 있어요.","native_language_example":"I can do anything."}]
["뭐라고",{"thoughts":"The term '뭐라고' is often used in Korean to ask for clarification or repetition. It's an informal expression generally used in casual conversations.","target_language_multi_word_term":"뭐라고","meaning":"'What did you say?' or 'Pardon?'","additional_notes":"This expression is informal and commonly used when you didn't hear or understand something properly. It's equivalent to saying 'What?' in English when you want someone to repeat themselves or clarify what they just said.","target_language_example":"네가 뭐라고 했어?","native_language_example":"What did you say?"}]
["뭐라도",{"thoughts":"The term '뭐라도' is a compound of '뭐', meaning 'what' or 'something', and '라도', a particle that implies 'even' or 'at least', used to suggest a basic or minimum condition. It can be used to express indifference or a suggestion when you don't have a specific preference.","target_language_multi_word_term":"뭐라도","meaning":"'something' or 'anything'.","additional_notes":"It is often used when the speaker is suggesting doing 'something' as opposed to nothing at all, or when anything is acceptable. It conveys flexibility or a lack of specificity in choice.","target_language_example":"배가 고프면 뭐라도 먹어.","native_language_example":"If you're hungry, eat something."}]
["뭐야",{"thoughts":"The term '뭐야' is often used in casual or informal conversation in Korean. It's a way to express surprise, confusion, or ask what something is. It's a contraction of '무엇이야', and it's very common to hear in everyday conversations.","target_language_multi_word_term":"뭐야","meaning":"'What is it?' or 'What?!'.","additional_notes":"Used frequently in casual conversations to express surprise or a request for clarification about something. Often seen in informal settings.","target_language_example":"이거 뭐야?","native_language_example":"What is this?"}]
["뭘",{"thoughts":"'뭘' is a contracted form of '무엇을', which means 'what' in English. It is often used in conversation to ask about something in a casual manner.","target_language_multi_word_term":"뭘","meaning":"'what'.","additional_notes":"Used in informal contexts to ask questions or inquire about something; often comes at the beginning of a sentence. '뭘' is short for '무엇을' and is the object of the verb in the sentence.","target_language_example":"뭘 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["바로",{"thoughts":"The term '바로' can have several meanings depending on the context, such as 'right away', 'immediately', or direct/straight. It's often used to describe actions that should be done without delay or to indicate immediacy or directness.","target_language_multi_word_term":"바로","meaning":"'immediately' or 'directly'.","additional_notes":"'바로' is often used to emphasize that something should happen without delay or to indicate movement in a straight direction. It is sometimes used as an adverb to ensure clarity of time or space.","target_language_example":"제가 바로 갈게요.","native_language_example":"I will go right away."}]
["바로 그",{"thoughts":"'바로 그' is a Korean phrase used to emphasize a specific noun, often translating to 'the very' or 'just that'. It highlights precision or exactness in what is being referred to.","target_language_multi_word_term":"바로 그","meaning":"'the very', 'just that'.","additional_notes":"It is typically used to emphasize a specific thing or point, indicating that there is no doubt about what is being referred to.","target_language_example":"바로 그 사람이 내 친구야.","native_language_example":"That very person is my friend."}]
["바로 여기",{"thoughts":"The phrase '바로 여기' is used to indicate a specific location that is immediate or right here. This is relevant for beginners learning location words and expressing presence or proximity in conversations.","target_language_multi_word_term":"바로 여기","meaning":"'right here'.","additional_notes":"Used to emphasize exactness or proximity in location. Commonly used to draw attention to a specific spot or to confirm a location during face-to-face interactions.","target_language_example":"책은 바로 여기에 있어요.","native_language_example":"The book is right here."}]
["바로 이",{"thoughts":"\"바로 이\" is a Korean phrase used for emphasis, often to point out something very specific or to emphasize that 'this one' is being referred to directly.","target_language_multi_word_term":"바로 이","meaning":"precisely this","additional_notes":"This phrase is often used to emphasize or specify something very explicitly, like pointing out something in particular or making it clear that 'this one here' is the thing being talked about.","target_language_example":"바로 이 책이 제가 읽고 싶었던 것입니다.","native_language_example":"This is the exact book I wanted to read."}]
["바로 저",{"thoughts":"'바로 저' is a Korean phrase that is often used to point out something specific. It combines '바로', which means 'right' or 'exactly', with '저', which can mean 'that' pointing to something a bit far from both the speaker and listener. This would typically be relevant when a speaker is identifying a specific item or concept to a listener. It can be used in a variety of contexts, like directions or identifying objects.","target_language_multi_word_term":"바로 저","meaning":"right there or that exact (one).","additional_notes":"This phrase is used to emphasize something specific or exact, often something visible to both the speaker and listener.","target_language_example":"거기 보이는 책이 바로 저 책입니다.","native_language_example":"The book you see there is that exact book."}]
["바로 지금",{"thoughts":"The Korean phrase '바로 지금' directly translates to 'right now' and is used to emphasize immediacy or urgency, much like in English. It can be used in various contexts where immediate action or attention is needed.","target_language_multi_word_term":"바로 지금","meaning":"'right now'.","additional_notes":"Used to emphasize immediacy and urgency. It can be used in requests, commands, or descriptions occurring at the present moment.","target_language_example":"바로 지금 시작하세요!","native_language_example":"Start right now!"}]
["밖에",{"thoughts":"The Korean postposition '밖에' roughly translates to 'nothing but' or 'only'. It is used to express limitations or exclusivity with a negative connotation, often forming a constraining sentiment about an action or entity.","target_language_multi_word_term":"밖에","meaning":"'nothing but', 'only'.","additional_notes":"Typically used with negative endings to emphasize a limited quantity or capacity. For example, when saying 'I only have one apple', the implication is that having only one is insufficient.","target_language_example":"쌀이 조금밖에 없어요.","native_language_example":"There is nothing but a little rice."}]
["반대로",{"thoughts":"'반대로' is an adverb in Korean that conveys the sense of opposition or reversal. It's commonly used to indicate the idea of 'on the contrary' or 'in reverse'.","target_language_multi_word_term":"반대로","meaning":"'on the contrary' or 'in reverse'.","additional_notes":"This term is often used when you want to express a contrasting idea or situation, indicating a switch in perspective or direction.","target_language_example":"그들은 산책을 즐겼지만, 반대로 나는 집에 머물렀다.","native_language_example":"They enjoyed the walk, but on the contrary, I stayed at home."}]
["반면에",{"thoughts":"The term '반면에' is a conjunction used to contrast two ideas or situations.","target_language_multi_word_term":"반면에","meaning":"'on the other hand' or 'in contrast'.","additional_notes":"Used to present an opposing or contrasting idea to what was previously mentioned. Commonly used in writing or formal speech to discuss pros and cons or different perspectives.","target_language_example":"이 제품은 가격이 비싸다. 반면에, 성능이 뛰어나다.","native_language_example":"This product is expensive. On the other hand, its performance is excellent."}]
["방금",{"thoughts":"The Korean term '방금' is used to refer to something that has recently happened. It's similar to saying 'just now' in English.","target_language_multi_word_term":"방금","meaning":"'just now' or 'a moment ago'.","additional_notes":"This term is often used in conversation to indicate that something occurred very recently, typically within the past few minutes.","target_language_example":"방금 나갔어요.","native_language_example":"He just left."}]
["벌써",{"thoughts":"'벌써' is a common Korean adverb that typically conveys an element of surprise or realization about something having already happened sooner or earlier than expected. It can be used to express both positive and negative reactions depending on the context.","target_language_multi_word_term":"벌써","meaning":"already; sooner than expected.","additional_notes":"'벌써' is usually used when something has happened unexpectedly early or to indicate a surprise at the quick passage of time. It can be used in various contexts to express astonishment or realization.","target_language_example":"그가 벌써 집에 갔어요.","native_language_example":"He already went home."}]
["별로",{"thoughts":"The Korean term '별로' is often used to express disapproval or mild negativity. It literally means 'particularly', but in context, it's often used in phrases similar to 'not really'.","target_language_multi_word_term":"별로","meaning":"'not particularly', 'not really'.","additional_notes":"'별로' is often used with a negative verb to express that something is not very good or not liked. In informal contexts, it might be used to politely decline or show a lukewarm reception.","target_language_example":"그 영화는 별로였어.","native_language_example":"That movie was not really good."}]
["보다",{"thoughts":"The Korean word '보다' is versatile, acting as both a verb and a comparative particle, often confusing for beginners because it means to 'see' or 'look' as a verb, but can also be used to indicate comparison between two entities.","target_language_multi_word_term":"보다","meaning":"To 'see' or 'look'; also used for comparisons ('than').","additional_notes":"As a verb, '보다' commonly means 'to see', 'to look', or 'to watch'. In comparative sentences, it is used to compare two things, similar to the English word 'than'.","target_language_example":"영화를 보다.","native_language_example":"To watch a movie."}]
["보다 더",{"thoughts":"The phrase '보다 더' is used in Korean to form comparisons, meaning 'more than' or intensifying something to be 'even more'. It is typically used in sentences where one compares the degree or extent of something to another.","target_language_multi_word_term":"보다 더","meaning":"'more than' or 'even more'.","additional_notes":"Used to make comparisons or to emphasize the degree of something, often placed before an adjective or an adverb.","target_language_example":"이 집은 저 집보다 더 커요.","native_language_example":"This house is bigger than that house."}]
["봐 봐",{"thoughts":"The Korean phrase '봐 봐' is a casual way to ask someone to look at something or pay attention to something. It's like saying 'look' or 'look here' in English. This phrase is commonly used among friends and in informal settings.","target_language_multi_word_term":"봐 봐","meaning":"'look' or 'look here', in an informal sense.","additional_notes":"This phrase is often used to get someone's attention in a casual way. It's important to note that '봐 봐' is informal and should be used with friends, peers, or younger people. For a more formal context, you would use a different form like '보세요'.","target_language_example":"저기 봐 봐! 예쁜 고양이가 있어.","native_language_example":"Look over there! There's a cute cat."}]
["분명히",{"thoughts":"The Korean term '분명히' is used for emphasis, often to assert that something is clear or definite. This term is useful for learners to convey certainty or strong conviction about a statement.","target_language_multi_word_term":"분명히","meaning":"clearly; definitely; certainly.","additional_notes":"'분명히' is often used to underscore the certainty or clarity of a statement, making it a useful term for expressing strong opinions or facts.","target_language_example":"그는 분명히 올 거예요.","native_language_example":"He will definitely come."}]
["비록",{"thoughts":"The Korean word '비록' is an adverb used to express contrast or concession, often found in complex sentences and is an equivalent to 'even though' or 'although' in English.","target_language_multi_word_term":"비록","meaning":"'even though' or 'although'.","additional_notes":"비록 is used to introduce a clause that indicates a condition or situation contrary to what is expected or desirable. It typically appears in complex sentences and is important for forming concessive clauses.","target_language_example":"비록 늦었지만 파티에 참여할게요.","native_language_example":"Even though I'm late, I will attend the party."}]
["빨리",{"thoughts":"The Korean word '빨리' is an adverb and commonly used to express urgency or haste, meaning 'quickly' or 'fast'. It's an essential word for beginners to understand basic instructions or to communicate urgency in everyday situations.","target_language_multi_word_term":"빨리","meaning":"quickly or fast","additional_notes":"Used to express urgency or the need to hurry. Common in everyday speech and frequently used to encourage others to act faster or to describe something being done rapidly.","target_language_example":"빨리 와!","native_language_example":"Come quickly!"}]
["빨리빨리",{"thoughts":"'빨리빨리' is a common Korean expression that captures the cultural attitude emphasizing speed and efficiency. It can convey a sense of urgency and impatience, often used in both formal and informal contexts.","target_language_multi_word_term":"빨리빨리","meaning":"'quickly, quickly' or 'hurry, hurry'.","additional_notes":"Refers to the Korean culture of promptness and efficiency. Commonly heard in everyday situations where quick action or decision-making is necessary.","target_language_example":"빨리빨리 해 주세요.","native_language_example":"Please do it quickly."}]
["뿐",{"thoughts":"The Korean term '뿐' is used to express limitation or emphasis equivalent to 'only' or 'just' in English.","target_language_multi_word_term":"뿐","meaning":"only; just.","additional_notes":"Used to indicate that something is limited to a specific condition or number, often highlighting exclusivity or limitation.","target_language_example":"그녀는 일요일에만 집에 있어요, 그것 뿐이에요.","native_language_example":"She is only at home on Sundays, that's all."}]
["뿐이다",{"thoughts":"The Korean term '뿐이다' is often used to emphasize that something is the only choice or option. It's like the English phrase 'only' in a similar context.","target_language_multi_word_term":"뿐이다","meaning":"'only', 'just'.","additional_notes":"Used to emphasize that something is limited to the mentioned condition, often highlighting exclusivity or a singular option. It's a way to express limitations or singularity, similar to saying 'there is only this option'.","target_language_example":"그녀를 사랑할 뿐이다.","native_language_example":"I only love her."}]
["뿐이야",{"thoughts":"The Korean term '뿐이야' is a colloquial expression often used to convey limitation or exclusivity, similar to saying 'only' or 'just' in English.","target_language_multi_word_term":"뿐이야","meaning":"'only' or 'just'.","additional_notes":"Used to emphasize the exclusivity or limitation of an action or subject. Commonly used in informal conversations.","target_language_example":"그는 그냥 친구일 뿐이야.","native_language_example":"He's just a friend."}]
["뿐이지",{"thoughts":"The term '뿐이지' is often used in Korean to express limitation or restriction, similar to saying 'just' or 'only' in English. It can convey a sense of resignation or narrowing of options.","target_language_multi_word_term":"뿐이지","meaning":"'just' or 'only'.","additional_notes":"Used to emphasize that what is mentioned is the exact and only possibility or option. Often conveys a sense of resignation or confirmation of limitations.","target_language_example":"그건 단지 오해일 뿐이지.","native_language_example":"That's just a misunderstanding."}]
["사방에",{"thoughts":"The Korean term '사방에' is a versatile term used to describe a spatial position, indicating something is surrounding or present in all directions.","target_language_multi_word_term":"사방에","meaning":"in all directions; everywhere.","additional_notes":"This term is often used in contexts where something is present or occurs in many places around a certain point, often creating a sense of being surrounded.","target_language_example":"그림이 방의 사방에 걸려 있어요.","native_language_example":"There are pictures hung up all around the room."}]
["상당히",{"thoughts":"The term '상당히' in Korean is an adverb meaning 'quite', 'considerably', or 'fairly'. It's used to describe something that is notable in degree or extent, and is often used to add emphasis to adjectives or other adverbs.","target_language_multi_word_term":"상당히","meaning":"'quite' or 'considerably'.","additional_notes":"It is used to emphasize the degree to which something is true or the extent of an action or description. It can be used in both positive and negative contexts to imply a significant amount or degree.","target_language_example":"그는 상당히 똑똑해.","native_language_example":"He is quite smart."}]
["서둘러",{"thoughts":"This Korean term is an informal way to encourage someone to hurry or do something quickly.","target_language_multi_word_term":"서둘러","meaning":"hurry up","additional_notes":"Often used to tell someone to do something more quickly, usually in a casual or informal context.","target_language_example":"빨리 서둘러, 지각하겠어!","native_language_example":"Hurry up, we're going to be late!"}]
["설마",{"thoughts":"\"설마\" is an expression used in Korean to convey skepticism, disbelief, or doubt about something. It reflects an attitude of \"Surely not...\", \"I can't believe...\", or \"No way...\". It often appears at the beginning of a sentence to lead into a reaction of surprise or disbelief.","target_language_multi_word_term":"설마","meaning":"\"Surely not\" or \"No way\".","additional_notes":"Used to express disbelief or to question the likelihood of something happening. Often used when the speaker hopes or assumes that the event in question is not true, or does not want it to be true.","target_language_example":"설마 진짜로 그랬어?","native_language_example":"No way, did he really do that?"}]
["순식간에",{"thoughts":"The Korean phrase '순식간에' is an adverb used to describe something that happens very quickly, or in the blink of an eye.","target_language_multi_word_term":"순식간에","meaning":"'in an instant' or 'in the blink of an eye'.","additional_notes":"It conveys the sense of something occurring almost immediately or very fast. It's often used when emphasizing suddenness or rapid changes.","target_language_example":"그는 순식간에 사라져 버렸어요.","native_language_example":"He disappeared in the blink of an eye."}]
["신속하게",{"thoughts":"신속하게 is an adverb in Korean that describes doing something quickly or promptly. This term is useful for beginners to understand contexts where speed or urgency is important.","target_language_multi_word_term":"신속하게","meaning":"quickly, promptly","additional_notes":"Used to describe actions that need to be done without delay or with urgency. Often used in formal contexts or in situations where efficiency is required.","target_language_example":"그 문제를 신속하게 해결해야 합니다.","native_language_example":"We need to solve that problem quickly."}]
["심지어",{"thoughts":"The word '심지어' is used in Korean to emphasize a point by adding unexpected or extreme information. It is similar to 'even' or 'what's more' in English, and is often used to highlight something surprising or noteworthy.","target_language_multi_word_term":"심지어","meaning":"'even' or 'what's more'.","additional_notes":"Used to introduce an unexpected or extreme element, often to emphasize a point. It can be used in both casual and formal contexts.","target_language_example":"그는 심지어 밤에도 일을 계속했다.","native_language_example":"He even continued working at night."}]
["아 진짜",{"thoughts":"The Korean expression '아 진짜' is often used in informal conversations to express frustration, disbelief, or emphasis. It is similar to the English phrases 'Oh, really!' or 'Oh, seriously!'. Beginner learners would encounter it in everyday situations.","target_language_multi_word_term":"아 진짜","meaning":"'Oh, really!' or 'Oh, seriously!'","additional_notes":"Used in informal contexts to convey frustration, disbelief, or emphasis in a situation.","target_language_example":"아 진짜, 왜 이렇게 어려워?","native_language_example":"Oh, seriously, why is this so difficult?"}]
["아까",{"thoughts":"아까 is a Korean adverb that refers to a past time, often relatively recent from the current point in time.","target_language_multi_word_term":"아까","meaning":"a short while ago; earlier.","additional_notes":"It is used to refer to something that happened a little while ago, not as far back as 'earlier today' but more recent than just a moment ago.","target_language_example":"아까 친구를 만났어요.","native_language_example":"I met a friend a little while ago."}]
["아마",{"thoughts":"The term '아마' is often used in Korean to express a sense of uncertainty or probability of a future event. It's similar to saying 'probably' or 'maybe' in English, conveying that something is likely or assumed but not certain.","target_language_multi_word_term":"아마","meaning":"probably or maybe.","additional_notes":"'아마' is used when you want to express uncertainty or speculate about a situation. It's often used in combination with future or present tense verbs to suggest probability.","target_language_example":"아마 비가 올 거예요.","native_language_example":"It will probably rain."}]
["아마도",{"thoughts":"The Korean term '아마도' is commonly used to suggest uncertainty or probability, equivalent to saying 'maybe' or 'perhaps' in English.","target_language_multi_word_term":"아마도","meaning":"'maybe' or 'perhaps'.","additional_notes":"Used to indicate uncertainty or when something is likely but not certain. Common in everyday conversation when expressing speculation or a guess.","target_language_example":"아마도 내일 비가 올 거예요.","native_language_example":"Maybe it will rain tomorrow."}]
["아무것도",{"thoughts":"The Korean term '아무것도' is a common expression used to denote 'nothing' or the absence of anything. It's typically used in negative sentences.","target_language_multi_word_term":"아무것도","meaning":"'nothing'.","additional_notes":"Often used with negation to emphasize that there is not even one thing or no particular thing at all. It can be used in various contexts where you want to emphasize emptiness or absence.","target_language_example":"그는 아무것도 먹지 않았어요.","native_language_example":"He didn't eat anything."}]
["아무것도 없다",{"thoughts":"This Korean phrase translates to 'there is nothing' or 'there is nothing at all'. It's commonly used to describe the absence of something or when nothing is present in the context. It's a negative form and can be used in various situations where you want to express emptiness or the lack of something.","target_language_multi_word_term":"아무것도 없다","meaning":"'there is nothing'.","additional_notes":"Often used to indicate that something does not exist or is absent. It can be used in everyday conversation to describe lack or emptiness in a situation.","target_language_example":"방에 아무것도 없다.","native_language_example":"There is nothing in the room."}]
["아무도",{"thoughts":"The word '아무도' in Korean is a pronoun that means 'nobody' or 'anybody' when used in negative sentences. It is useful for expressing absence of action or involvement by anyone. This is a common term used in everyday Korean speech to describe scenarios without a particular doer or when emphasizing that no person is involved.","target_language_multi_word_term":"아무도","meaning":"'nobody' or 'no one'.","additional_notes":"In Korean, '아무도' is primarily used in negative contexts to indicate that no person is involved in the action or situation. It often pairs with negative verbs or phrases like '없다' (not exist) or '못하다' (cannot do).","target_language_example":"아무도 없어요.","native_language_example":"There's nobody here."}]
["아무런",{"thoughts":"The multi-word term '아무런' in Korean is often used to indicate 'any,' 'anything,' or 'whatever' in a negative context. It emphasizes the absence of something.","target_language_multi_word_term":"아무런","meaning":"'any' or 'of any kind' (in a negative context).","additional_notes":"It is often used to emphasize the lack or absence of something in Korean, combining with negative expressions. Commonly seen in phrases like '아무런 느낌도 없다' (I don't feel anything) or '아무런 반응이 없다' (no reaction).","target_language_example":"그는 아무런 말을 하지 않았다.","native_language_example":"He didn't say anything."}]
["아무리",{"thoughts":"'아무리' is used to express 'no matter how' or 'however' in Korean. It is used in sentences to emphasize a condition or degree of something that does not change the outcome or situation.","target_language_multi_word_term":"아무리","meaning":"'no matter how', 'however'.","additional_notes":"Often used in conjunction with a verb or adjective to express that despite the condition mentioned, the result is unchanged. It sets up a contrast or emphasizes resilience, difficulty, or other strong conditions.","target_language_example":"아무리 노력해도 실패할 수 있다.","native_language_example":"No matter how much you try, you can still fail."}]
["아서",{"thoughts":"'아서' or '어서' is a grammatical ending in Korean used to connect actions or indicate reasons.","target_language_multi_word_term":"아서","meaning":"'and then' or 'so'.","additional_notes":"Used to show sequential actions or causal relationships between two actions. The choice between '아서' and '어서' depends on the verb stem; '아서' follows verb stems ending in '아' or '오', while '어서' follows others.","target_language_example":"집에 가서 좀 쉴게요.","native_language_example":"I will go home and then rest a bit."}]
["아주",{"thoughts":"The Korean term '아주' is a commonly used adverb that has a simple yet effective role in expressing intensity. It's comparable to English words that enhance or magnify the adjectives or verbs they modify. This term is quite useful for beginners to know, as it can be used in a variety of contexts to convey emphasis.","target_language_multi_word_term":"아주","meaning":"'very' or 'quite'.","additional_notes":"'아주' is used to intensify adjectives or verbs. It's commonly used in everyday speech to express a strong degree of something. It's akin to saying 'really' in English when trying to stress how good, bad, etc., something is.","target_language_example":"이 영화는 아주 재미있어요.","native_language_example":"This movie is very interesting."}]
["아직",{"thoughts":"The word '아직' is a basic Korean adverb that is used to express the sense of 'still' or 'yet', indicating a continuation of an action or state from the past into the present.","target_language_multi_word_term":"아직","meaning":"'still' or 'not yet'.","additional_notes":"Used to describe a situation or condition that has not yet changed or been completed. It can imply that something has remained the same over a period of time or that a condition or event is expected to occur in the future.","target_language_example":"아직 숙제를 안 했어요.","native_language_example":"I haven't done my homework yet."}]
["아직도",{"thoughts":"'아직도' is a Korean adverb used frequently in conversations to indicate that a certain condition or action continues to exist or occur, despite expectations it would change by now.","target_language_multi_word_term":"아직도","meaning":"still, yet","additional_notes":"Used to express surprise or incredulity that something is continuing longer than expected, or when asking if something is still the case.","target_language_example":"너 아직도 일하고 있어?","native_language_example":"Are you still working?"}]
["안 돼",{"thoughts":"The phrase '안 돼' in Korean is commonly used to express disagreement or refusal. It is one of the first phrases learners encounter due to its frequent usage in everyday conversation, especially in informal and casual contexts. It is an important phrase for learners to recognize and understand, enabling them to navigate basic interactions and responses.","target_language_multi_word_term":"안 돼","meaning":"'No', 'it doesn't work', or 'don't do it'.","additional_notes":"This phrase can be used as a standalone expression to indicate that something is not permissible or possible. It's often used in informal settings. It can express disapproval, denial, or rejection.","target_language_example":"안 돼! 그거 하지 마!","native_language_example":"No! Don't do that!"}]
["알고 있어",{"thoughts":"The Korean phrase '알고 있어' is an informal expression used in casual settings. It is derived from the verb '알다' meaning 'to know' and is often used in conversations among friends or close acquaintances to indicate that the speaker is aware of or has understood something.","target_language_multi_word_term":"알고 있어","meaning":"'I know' or 'I'm aware'.","additional_notes":"This phrase is informal and commonly used with friends or people of the same age group. It conveys understanding or acknowledgment in response to information or a situation. It should not be used in formal situations, where '압니다' might be more appropriate.","target_language_example":"그 영화 너무 재밌었어!","native_language_example":"I already know."}]
["약간",{"thoughts":"'약간' is a Korean term commonly used in conversation indicating a small or limited degree of something, similar to 'a bit' or 'slightly' in English.","target_language_multi_word_term":"약간","meaning":"a little bit; slightly.","additional_notes":"Used when expressing a small quantity or minor extent of something. It's often used to soften statements or describe slight degrees of difference or feelings.","target_language_example":"날씨가 약간 추워요.","native_language_example":"The weather is a little bit cold."}]
["어느",{"thoughts":"'어느' is a common Korean determiner used to ask questions about choices or specify an item from a set.","target_language_multi_word_term":"어느","meaning":"'which' or 'which one'.","additional_notes":"This term is used to ask about a choice or selection among different options. It's often used in a question format to inquire about a specific item or group.","target_language_example":"어느 책을 읽고 싶어요?","native_language_example":"Which book do you want to read?"}]
["어디",{"thoughts":"The Korean word '어디' is a basic term used in questions to ask about location, meaning 'where'. Beginner learners often encounter it along with various verbs to form questions related to location.","target_language_multi_word_term":"어디","meaning":"'where'.","additional_notes":"Often used in questions to inquire about place or position. Commonly used with location-related verbs such as 가다 (to go), 있다 (to be), etc.","target_language_example":"당신은 어디에 있습니까?","native_language_example":"Where are you?"}]
["어디로",{"thoughts":"The term '어디로' is made up of '어디' meaning 'where' and the particle '로', which indicates direction or method, often translated as 'to' or 'towards'. It's commonly used when asking about destinations or directions.","target_language_multi_word_term":"어디로","meaning":"'to where' or 'towards where'.","additional_notes":"Used when asking for or giving directions, or when determining the destination someone or something is headed to.","target_language_example":"이 버스는 어디로 가나요?","native_language_example":"Where is this bus going to?"}]
["어디서",{"thoughts":"The term '어디서' is a question word used to ask about locations. It's a fundamental part of learning how to form questions about place or origin in Korean.","target_language_multi_word_term":"어디서","meaning":"'where'.","additional_notes":"Used when asking for the location where an action takes place or the origin of something.","target_language_example":"이 책을 어디서 샀어요?","native_language_example":"Where did you buy this book?"}]
["어디에",{"thoughts":"'어디에' is a Korean phrase used to ask or talk about the location of something or someone. It is a combination of '어디' meaning 'where' and the particle '에' which denotes location or direction.","target_language_multi_word_term":"어디에","meaning":"'where'.","additional_notes":"It is often used to ask about someone's location or to specify where an event is happening.","target_language_example":"당신은 지금 어디에 있습니까?","native_language_example":"Where are you now?"}]
["어떤",{"thoughts":"'어떤' is an interrogative word used in Korean. It functions as an adjective to inquire about the nature or kind of something.","target_language_multi_word_term":"어떤","meaning":"'what kind of' or 'which'.","additional_notes":"'어떤' is often used to ask about the characteristics or types of things, focusing on the identity or quality rather than amounts or numbers.","target_language_example":"어떤 책을 좋아하세요?","native_language_example":"What kind of books do you like?"}]
["어떻게",{"thoughts":"The Korean term '어떻게' is used to ask 'how' or inquire about the manner in which something is done.","target_language_multi_word_term":"어떻게","meaning":"'how'.","additional_notes":"It is often used in questions to ask about methods or ways of doing something. It's a common and versatile term in everyday conversation.","target_language_example":"이걸 어떻게 해요?","native_language_example":"How do you do this?"}]
["어떻게 해야",{"thoughts":"The phrase '어떻게 해야' is often used in Korean to inquire about the method or manner in which something should be done. It is a common phrase used when seeking advice or directions.","target_language_multi_word_term":"어떻게 해야","meaning":"'how to do' or 'what should I do'.","additional_notes":"This phrase is typically used to ask for instructions or guidance on accomplishing a task. It can be part of a larger question, asking for advice or clarification on how to proceed in a particular situation.","target_language_example":"이 문제를 어떻게 해야 할까요?","native_language_example":"How should I solve this problem?"}]
["어떻게든",{"thoughts":"The Korean term '어떻게든' is used to convey a determination or effort to accomplish something, often despite difficulties. It's relevant to beginner learners as it's an expression commonly used in motivational or optimistic contexts, and can be helpful in expressing determination in conversations.","target_language_multi_word_term":"어떻게든","meaning":"'somehow' or 'by any means'.","additional_notes":"Used to express trying to achieve a goal by all possible means, often implying overcoming obstacles or challenges.","target_language_example":"그는 이번 프로젝트를 어떻게든 성공시킬 것이다.","native_language_example":"He will make this project a success somehow."}]
["어서",{"thoughts":"The Korean term '어서' is an adverb used to express haste or urgency in an action, akin to 'quickly' or 'hurry' in English. It is often used in everyday conversation, especially when encouraging someone to do something promptly.","target_language_multi_word_term":"어서","meaning":"'quickly' or 'hurry'.","additional_notes":"Commonly used in situations where time is of the essence or when prompting someone to do something fast. It can be used both politely and informally.","target_language_example":"어서 가세요!","native_language_example":"Hurry, go!"}]
["어서 빨리",{"thoughts":"The Korean phrase '어서 빨리' combines two adverbs that emphasize urgency in action or speech. '어서' can mean 'quickly' or 'soon,' often used as an imperative, and '빨리' directly means 'quickly.' Together, this phrase is used to prompt someone to hurry or do something promptly.","target_language_multi_word_term":"어서 빨리","meaning":"hurry up or do it quickly.","additional_notes":"'어서 빨리' is often used in imperative sentences to urge someone to act swiftly. It's commonly heard in casual or semi-formal contexts.","target_language_example":"어서 빨리 가자!","native_language_example":"Let's go quickly!"}]
["어제",{"thoughts":"The term '어제' is commonly used in everyday Korean conversation to refer to the day before today. It's essential for learners to grasp basic temporal markers to help them communicate about events happening relative to the present day.","target_language_multi_word_term":"어제","meaning":"'yesterday'.","additional_notes":"'어제' is used to talk about events, actions, or plans that occurred or were relevant the day before today. It is used much like its English counterpart in sentences.","target_language_example":"어제 친구랑 영화를 봤어요.","native_language_example":"I watched a movie with a friend yesterday."}]
["어쨌거나",{"thoughts":"The Korean term '어쨌거나' is a conjunction used to indicate that something is true or remains unchanged regardless of the circumstances. It's similar to the English phrase 'anyway' or 'in any case'.","target_language_multi_word_term":"어쨌거나","meaning":"'anyway' or 'in any case'.","additional_notes":"This term can be used to redirect or bring a conversation back to a main point, or to acknowledge something and move on with the conversation.","target_language_example":"어쨌거나, 우리 계속 합시다.","native_language_example":"Anyway, let's continue."}]
["어쨌건",{"thoughts":"The term '어쨌건' is often used to continue a conversation or argument by reaffirming a previous point, without delving into details or regardless of what happened. It can be compared to the English expression 'anyway' or 'in any case'.","target_language_multi_word_term":"어쨌건","meaning":"'anyway' or 'in any case'","additional_notes":"It is used to steer the conversation or narrative back on track, often shifting focus away from a subject by underscoring the speaker's main point.","target_language_example":"어쨌건 우리는 이 문제를 해결해야 해요.","native_language_example":"Anyway, we need to solve this problem."}]
["어쨌든",{"thoughts":"The Korean term '어쨌든' is an adverb commonly used to emphasize certainty or resolution, similar to saying 'anyway' or 'in any case' in English. This word is often used in conversations to express that regardless of other factors, a certain point or conclusion remains valid. It helps the speaker transition to the main point or to return to the original topic after a digression.","target_language_multi_word_term":"어쨌든","meaning":"'anyway' or 'in any case'.","additional_notes":"Used to emphasize a return to the main point or to ignore previous diversions. It helps to conclude a discussion or indicate a decision has been made.","target_language_example":"어쨌든, 오늘 일을 끝내야 해요.","native_language_example":"Anyway, I need to finish today's work."}]
["어쩌면",{"thoughts":"The word '어쩌면' is an adverb in Korean that is used to express uncertainty or speculation. It can often be translated as 'maybe', 'perhaps', or 'possibly' in English. This term is useful for beginners because it helps express uncertainty or give a sense of probability.","target_language_multi_word_term":"어쩌면","meaning":"'maybe' or 'perhaps'.","additional_notes":"어쩌면 is used to suggest something that might occur or a possibility. It is often used in conversation to express uncertainty.","target_language_example":"어쩌면 내일 비가 올 거예요.","native_language_example":"Maybe it will rain tomorrow."}]
["어찌나",{"thoughts":"어찌나 is a Korean adverb often used to emphasize the degree or intensity of an action or situation, similar to 'so' or 'how' in English.","target_language_multi_word_term":"어찌나","meaning":"'so' or 'how'.","additional_notes":"This term is often used to express a strong feeling about the degree of an action or state. It's commonly followed by \"-는지\" to form expressions like 어찌나 ... -는지, which convey emphasis or intensity.","target_language_example":"어찌나 맛있던지 계속 먹었어요.","native_language_example":"It was so delicious that I kept eating it."}]
["언제",{"thoughts":"The Korean word '언제' is used in questions related to time. Beginner learners might frequently encounter it when learning to ask about when something occurs.","target_language_multi_word_term":"언제","meaning":"'when'.","additional_notes":"It is used to ask about the time or date something happens or happened. It can appear at the beginning, middle, or end of a question sentence, depending on the structure.","target_language_example":"언제 시간이 있나요?","native_language_example":"When do you have time?"}]
["언제나",{"thoughts":"'언제나' is a Korean adverb meaning 'always' or 'at any time'. It is often used to express consistency or reliability over time.","target_language_multi_word_term":"언제나","meaning":"'always' or 'all the time'.","additional_notes":"Used to emphasize constancy or habitual actions, it can be used interchangeably with '항상'.","target_language_example":"그녀는 언제나 웃고 있다.","native_language_example":"She is always smiling."}]
["언제든",{"thoughts":"'언제든' is a frequently used Korean adverb meaning 'anytime' or 'whenever' and suggests flexibility or lack of restrictions in timing.","target_language_multi_word_term":"언제든","meaning":"'anytime' or 'whenever'.","additional_notes":"Can be used to suggest flexibility in timing. It conveys that something can be done at any time without restriction.","target_language_example":"언제든지 연락해 주세요.","native_language_example":"Please contact me anytime."}]
["언제든지",{"thoughts":"The Korean adverb '언제든지' is used to express an unrestricted timeframe, equivalent to \"anytime\" in English. It's helpful for learners because it can be used to make agreements or offers more flexible in conversations.","target_language_multi_word_term":"언제든지","meaning":"'anytime'.","additional_notes":"Can be used in various contexts to indicate flexibility with time, often when making plans, offers, or expressing availability.","target_language_example":"언제든지 연락하세요.","native_language_example":"Contact me anytime."}]
["얼른",{"thoughts":"'얼른' is a Korean adverb used to express the idea of doing something quickly or immediately. It's often used in casual contexts and implies urgency or haste.","target_language_multi_word_term":"얼른","meaning":"'quickly', 'immediately'.","additional_notes":"Used to urge someone to hurry or to emphasize the need to do something without delay. Common in spoken Korean and conveys a sense of urgency.","target_language_example":"얼른 와!","native_language_example":"Come quickly!"}]
["얼마나",{"thoughts":"'얼마나' is used to ask about the degree or extent of something and can translate to 'how much', 'how many', or 'how'. It's common in questions asking about quantity, frequency, or extent.","target_language_multi_word_term":"얼마나","meaning":"'how much', 'how many', or 'how'.","additional_notes":"Used to inquire about the degree, quantity, or extent of something. Commonly used in questions to ask for additional details about a situation or object.","target_language_example":"이 케이크가 얼마나 커요?","native_language_example":"How big is this cake?"}]
["여기저기",{"thoughts":"'여기저기' is a Korean phrase that means 'here and there', used to describe something scattered across different places or occurring in multiple locations.","target_language_multi_word_term":"여기저기","meaning":"'here and there' or 'everywhere'.","additional_notes":"It's often used to describe something happening or being found in multiple places, indicating a lack of order or organization.","target_language_example":"그녀는 여기저기 여행을 다니고 있어요.","native_language_example":"She is traveling here and there."}]
["여전히",{"thoughts":"'여전히' is a Korean adverb used frequently to express the idea that a situation or state remains the same as it was before, similar to the English 'still'. This term is useful for learners when describing persistence or continuity in states or actions.","target_language_multi_word_term":"여전히","meaning":"'still' or 'as before'.","additional_notes":"It is commonly used to indicate that something or someone continues to be in the same state or situation as previously mentioned. This adverb is often used in both written and spoken Korean.","target_language_example":"그 사람은 여전히 그곳에 있다.","native_language_example":"That person is still there."}]
["오 이런",{"thoughts":"The Korean expression '오 이런' is an exclamatory phrase often used to express mild surprise or frustration, similar to saying 'oh dear' or 'oh my' in English. It's usually used in informal contexts and might be heard when someone faces an unexpected situation, either amusing or slightly problematic.","target_language_multi_word_term":"오 이런","meaning":"'oh dear', 'oh my'","additional_notes":"Used to express mild surprise, disbelief, or minor frustration. It is an informal phrase often used in everyday conversations.","target_language_example":"오 이런, 나 잊어버렸어.","native_language_example":"Oh dear, I forgot."}]
["오히려",{"thoughts":"오히려 is an adverb in Korean that is used to contrast two situations, often implying that the opposite of what was expected happened or would be better.","target_language_multi_word_term":"오히려","meaning":"'rather' or 'on the contrary'.","additional_notes":"Used when expressing a preference for a surprising or unexpected result. It often highlights an unexpected opinion or perspective.","target_language_example":"기다리기보다 오히려 먼저 가는 게 좋을 것 같아.","native_language_example":"Instead of waiting, I think it's better to go first."}]
["온갖",{"thoughts":"'온갖' is a Korean term used to express a variety or diversity of things. It often conveys the meaning of 'all sorts of' or 'all kinds of.' Its usage is suitable for emphasizing a range of items or categories.","target_language_multi_word_term":"온갖","meaning":"'all sorts of' or 'all kinds of'.","additional_notes":"This term is used to emphasize the variety in a group of items or categories. It can be applied to both tangible and intangible things.","target_language_example":"온갖 종류의 과일이 시장에 있다.","native_language_example":"There are all sorts of fruits in the market."}]
["왜",{"thoughts":"The Korean word '왜' means 'why'. It is commonly used in questions to ask for reasons or explanations.","target_language_multi_word_term":"왜","meaning":"'why'","additional_notes":"Used to inquire about reasons or causes behind an action or situation. It's commonly used in spoken and written Korean to start a question.","target_language_example":"왜 그렇게 말했어요?","native_language_example":"Why did you say that?"}]
["왜 그래",{"thoughts":"'왜 그래' is a casual Korean phrase used to express concern or confusion about another person's behavior or situation. It is often used in informal settings among friends or family.","target_language_multi_word_term":"왜 그래","meaning":"'What's wrong?' or 'Why are you acting like that?'.","additional_notes":"It is a casual phrase used to inquire about someone's state or actions. The phrase combines '왜' (why) and '그래' (like that), and it's commonly used in informal conversations.","target_language_example":"너 왜 그래?","native_language_example":"What's wrong with you?"}]
["왜 이래",{"thoughts":"'왜 이래' is a casual Korean expression used to ask why someone is acting a certain way or why something is happening. It's colloquial in tone.","target_language_multi_word_term":"왜 이래","meaning":"\"What's wrong?\" or \"Why are you like this?\"","additional_notes":"Commonly used to express confusion or concern about someone's behavior. It can also be used in a light-hearted way among friends. The expression is informal and might not be appropriate for formal situations.","target_language_example":"너 왜 이래? 오늘 좀 이상해!","native_language_example":"What's wrong with you? You're acting strange today!"}]
["왜냐면",{"thoughts":"'왜냐면' is a Korean word used to introduce a reason or explanation, similar to saying 'because' in English. This expression is helpful for beginners to understand causal relationships in sentences.","target_language_multi_word_term":"왜냐면","meaning":"'because'.","additional_notes":"Used to introduce an explanation or reason for something. It typically appears at the beginning of a sentence.","target_language_example":"나는 집에 가야 돼. 왜냐면 피곤하거든.","native_language_example":"I have to go home because I'm tired."}]
["왜냐하면",{"thoughts":"'왜냐하면' is a common Korean conjunction used to provide reasons or explanations.","target_language_multi_word_term":"왜냐하면","meaning":"'because' or 'since'.","additional_notes":"Often used to introduce the reason behind a statement or action, equivalent to 'because' in English. It usually follows a statement and precedes the explanation.","target_language_example":"나는 집에 일찍 가야 해. 왜냐하면 내일 중요한 시험이 있거든.","native_language_example":"I have to go home early because I have an important exam tomorrow."}]
["우선",{"thoughts":"우선 is a common adverb in Korean used to indicate priority or sequence in an action or thought process. It can mean 'first of all' or 'to begin with'. This is relevant for beginners as it appears in everyday conversation, instructions, and storytelling.","target_language_multi_word_term":"우선","meaning":"'firstly' or 'to begin with'.","additional_notes":"Often used to introduce the first action or point in a list or sequence. It can also imply that other things will follow after something is done or considered.","target_language_example":"우선, 이 일을 먼저 끝냅시다.","native_language_example":"First, let's finish this task."}]
["우연히",{"thoughts":"우연히 is an adverb in Korean that is used to express that something occurred by chance or accidentally. This is a useful term for beginners to know as it can help them describe events that were not planned or expected. It can be related to unexpected happenings in everyday conversation.","target_language_multi_word_term":"우연히","meaning":"by chance; accidentally.","additional_notes":"Used to describe occurrences or encounters that happen unexpectedly without prior planning or intention.","target_language_example":"우연히 친구를 만났다.","native_language_example":"I met a friend by chance."}]
["원래",{"thoughts":"The term '원래' is often used to describe an original state or condition, or to indicate something that was meant to be or naturally occurred that way. It's common and useful in everyday conversation. Beginner learners frequently encounter it when discussing habits, routines, or the original intention of actions or objects.","target_language_multi_word_term":"원래","meaning":"originally, by nature","additional_notes":"'원래' is often used to explain what something was like before or what is expected to be the default state. It can imply what should be normal or how something is supposed to work or function. It's a helpful word for expressing natural states or original plans.","target_language_example":"이 책은 원래 영어로 쓰여졌어.","native_language_example":"This book was originally written in English."}]
["위한",{"thoughts":"'위한' is a Korean preposition that broadly translates to 'for' in English, denoting purpose or intent. It's a common term used in various contexts to indicate that an action is done for the benefit or purpose of someone or something.","target_language_multi_word_term":"위한","meaning":"'for' or 'to'; indicating purpose or intent.","additional_notes":"It is often used in contexts where you are talking about doing something for someone else or for a specific purpose. It comes before nouns.","target_language_example":"이 책은 어린이를 위한 선물입니다.","native_language_example":"This book is a gift for children."}]
["위해",{"thoughts":"The term '위해' is commonly used in various contexts in Korean to mean 'for' or 'in order to'. It is often seen in sentences indicating purpose or reason.","target_language_multi_word_term":"위해","meaning":"'for' or 'in order to'.","additional_notes":"Used to express purpose, intention, or aim in a sentence. Often followed by a verb or a phrase indicating the intended outcome.","target_language_example":"그녀는 건강을 위해 운동을 해요.","native_language_example":"She exercises for her health."}]
["위해서",{"thoughts":"\"위해서\" is a Korean phrase often used to express purpose or intent. It typically translates to 'for' or 'in order to'.","target_language_multi_word_term":"위해서","meaning":"'for' or 'in order to'.","additional_notes":"Used to indicate the purpose or reason for an action. Typically followed by verb clauses.","target_language_example":"건강을 위해서 매일 운동해요.","native_language_example":"I exercise every day for my health."}]
["을 수 없다",{"thoughts":"The term '을 수 없다' is a common construction in Korean used to express impossibility or inability to do something. It combines the verb in its base form with '을' and '수 없다,' which means 'cannot.' This is similar to saying 'cannot do [verb]' in English. It's a fundamental construct that beginner learners of Korean will frequently encounter and should understand to express inability.","target_language_multi_word_term":"을 수 없다","meaning":"'cannot' or 'is unable to'.","additional_notes":"Used to indicate the inability or impossibility to perform an action. It is attached to a verb stem, often requiring some familiarity with Korean verb conjugation. Make sure to add the appropriate particle '을' or 'ㄹ' depending on the last consonant or vowel of the verb stem.","target_language_example":"나는 그 일을 할 수 없다.","native_language_example":"I cannot do that task."}]
["을 수 있다",{"thoughts":"The phrase '을 수 있다' is a grammatical construction in Korean that indicates the ability or possibility of performing an action. It is used after a verb stem. Understanding this concept is crucial for beginners to express abilities and probabilities in Korean.","target_language_multi_word_term":"을 수 있다","meaning":"'can' or 'to be able to'.","additional_notes":"This phrase is attached to verb stems to express that someone is capable of doing something or that something is possible. The form changes slightly depending on whether the verb stem ends in a consonant or a vowel, becoming ‘ㄹ 수 있다’ for vowel endings.","target_language_example":"저는 피아노를 칠 수 있어요.","native_language_example":"I can play the piano."}]
["이거나",{"thoughts":"The Korean term '이거나' is often used in making choices and is equivalent to the English word 'or'. It is a casual way to indicate an option or alternatives among nouns.","target_language_multi_word_term":"이거나","meaning":"'or' (used between choices).","additional_notes":"Used to offer a choice between two or more options, typically at the end of each option except the last. Commonly used in informal speech.","target_language_example":"저녁에 피자 이거나 파스타 먹자.","native_language_example":"Let's eat pizza or pasta for dinner."}]
["이건 아니야",{"thoughts":"The phrase '이건 아니야' is often used in casual conversation to express disagreement or rejection, similar to saying 'It's not this' or 'This isn't right/correct.' The structure '이거' means 'this' and '아니야' means 'is not.' It is informal and may not be suitable for formal situations.","target_language_multi_word_term":"이건 아니야","meaning":"'This is not it.'","additional_notes":"This phrase is used to deny or contradict something previously mentioned or assumed. It's informal and more suitable for casual settings. '이거' means 'this,' and '아니야' means 'is not,' combining to convey a sense that something is incorrect or not the one being referred to.","target_language_example":"이건 아니야, 다시 확인해 봐.","native_language_example":"This is not it, check again."}]
["이게 무슨",{"thoughts":"'이게 무슨' is a Korean expression used to express surprise or to question a situation or an object.","target_language_multi_word_term":"이게 무슨","meaning":"'what is this' or 'what kind of'.","additional_notes":"Used to question or express disbelief about something unexpected or incomprehensible, often with a tone of confusion or surprise.","target_language_example":"이게 무슨 소리야?","native_language_example":"What kind of noise is this?"}]
["이런",{"thoughts":"The Korean term '이런' is often used as a determiner and translates to 'such' or 'like this'. It describes something in a similar manner to what has just been mentioned or is nearby. It is a useful word when pointing out something specific.","target_language_multi_word_term":"이런","meaning":"'such', 'like this'.","additional_notes":"It is used to describe objects, situations, or actions that are similar to what is currently being discussed or pointed out. It often sets a context or example for what is being talked about.","target_language_example":"이런 나쁜 날씨엔 집에 있는 게 좋아요.","native_language_example":"It's good to stay home in such bad weather."}]
["이런 세상에",{"thoughts":"The phrase '이런 세상에' is an expression used when reacting to something astonishing or unexpected. It is similar to saying 'Oh my God' or 'What a world!' in English and conveys surprise, disbelief, or exasperation. This can be useful for beginner Korean learners to express strong emotions in various situations.","target_language_multi_word_term":"이런 세상에","meaning":"'Oh my God' or 'What a world!'","additional_notes":"Used to express surprise, disbelief, or exasperation about a situation. Common in spoken language to react to unexpected or dramatic events.","target_language_example":"이런 세상에! 그가 진짜 그렇게 했어?","native_language_example":"Oh my God! Did he really do that?"}]
["이런 일이",{"thoughts":"The phrase '이런 일이' in Korean is used to refer to occurrences or situations. It can be broken down into '이런' meaning 'this kind of' and '일이' meaning 'event' or 'thing happening'. It often reflects the speaker's emotion regarding an unexpected or significant event.","target_language_multi_word_term":"이런 일이","meaning":"'a thing like this' or 'something like this'.","additional_notes":"It typically refers to an occurrence that is surprising, unusual, or remarkable. Often used in contexts to express disbelief or reflection on a situation.","target_language_example":"나는 이런 일이 일어날 줄 몰랐어.","native_language_example":"I didn't know something like this would happen."}]
["이런 젠장",{"thoughts":"'이런 젠장' is a Korean expression used to convey frustration or disappointment, similar to 'damn' or 'shoot' in English. It combines '이런' meaning 'such' or 'like this' with '젠장', an expletive that expresses annoyance.","target_language_multi_word_term":"이런 젠장","meaning":"'Damn it!' or 'Shoot!'","additional_notes":"This term is often used when something bad or unexpected happens, and is considered informal. It reflects a mild level of frustration without being excessively strong or offensive.","target_language_example":"이런 젠장, 내 지갑을 잃어버렸어!","native_language_example":"Damn it, I lost my wallet!"}]
["이렇게",{"thoughts":"'이렇게' is a Korean adverb often used to describe the manner or state of something, meaning 'like this,' 'this way,' or 'in this manner.' It's commonly used in both spoken and written Korean to refer to actions or things that are done or presented in a similar manner to what is currently happening or being demonstrated.","target_language_multi_word_term":"이렇게","meaning":"'like this' or 'this way'.","additional_notes":"Often used to describe or illustrate the manner in which an action is carried out. It can also be used to show similarity or to ask or wonder why something is done in a particular way.","target_language_example":"이렇게 하면 더 좋아요.","native_language_example":"It's better if you do it like this."}]
["이미",{"thoughts":"'이미' is a common adverb in Korean meaning 'already'. It's used to indicate an action or state that has occurred before the present time.","target_language_multi_word_term":"이미","meaning":"'already'.","additional_notes":"Typically used to emphasize that something has been done or completed before now or before a specified point in time. It can be used in various tenses, usually conveying a sense that the speaker expected something to occur earlier.","target_language_example":"그 영화는 이미 봤어요.","native_language_example":"I have already seen that movie."}]
["이제 막",{"thoughts":"The phrase '이제 막' is used to convey a sense of immediacy or recentness about an action or event that has just occurred. It emphasizes the freshness or recent completion of an activity.","target_language_multi_word_term":"이제 막","meaning":"'just now' or 'just'.","additional_notes":"This phrase is used to indicate something has very recently happened or about to start happening. It emphasizes the present moment or a recent change of state.","target_language_example":"그는 이제 막 집에 도착했어요.","native_language_example":"He just arrived home."}]
["이제는",{"thoughts":"The phrase '이제는' is used to indicate a change of state or condition happening now compared to the past. It is often translated as 'now' or 'these days'. It adds emphasis to the change that has taken place.","target_language_multi_word_term":"이제는","meaning":"'now' or 'these days', indicating a change.","additional_notes":"이제는 is used to emphasize that something has changed or is different from the past. It highlights the contrast between past and present states or situations, making it clear that the current state is different from before.","target_language_example":"이제는 매일 운동을 하고 있어요.","native_language_example":"Now I'm exercising every day."}]
["이제부터",{"thoughts":"'이제부터' is a combination of '이제' meaning 'now' and '부터' meaning 'from'. It is used to indicate the start of an action or a time period, from now onward.","target_language_multi_word_term":"이제부터","meaning":"from now on","additional_notes":"This phrase is used to indicate a starting point in time, often to emphasize a change or the beginning of new actions.","target_language_example":"이제부터 열심히 공부할 거예요.","native_language_example":"From now on, I will study hard."}]
["일단",{"thoughts":"The term '일단' is often used at the beginning of a sentence to indicate that an action is taken first or as an initial step before other actions. This is useful in Korean to sequence events or actions logically.","target_language_multi_word_term":"일단","meaning":"firstly, for now, or to begin with.","additional_notes":"'일단' is commonly used when someone wants to express that they will do something as a preliminary step or as a temporary measure before considering other options. It's helpful in everyday conversation to communicate order or priority of actions.","target_language_example":"일단 이 문제를 해결해 봅시다.","native_language_example":"Let's try to solve this problem first."}]
["일부",{"thoughts":"The term '일부' is a Korean noun meaning 'part' or 'some'. This term is useful for beginners to quantify and express a portion of something larger. It's important for learners to recognize how to use it in daily communication.","target_language_multi_word_term":"일부","meaning":"'part' or 'some'.","additional_notes":"'일부' is used to refer to a portion or fraction of a whole, whether it's a group of people, a piece of something, or a segment of time. This term can be used alone or to modify another noun.","target_language_example":"나는 일부 케이크만 먹었다.","native_language_example":"I only ate part of the cake."}]
["일부는",{"thoughts":"The term \"일부는\" consists of \"일부\" meaning 'a part', and the topic marker \"는\" which is used to specify that portion being discussed. This structure is useful for statements that make a distinction between parts of a whole or an entire group and introduce that portion as the subject of the sentence.","target_language_multi_word_term":"일부는","meaning":"'some of', 'a portion of', 'part of'.","additional_notes":"Used to distinguish or refer to a part or subset of a larger whole, commonly appears in sentences discussing division, selections, or subsets within a group.","target_language_example":"일부는 집에 가고 싶어합니다.","native_language_example":"Some want to go home."}]
["일부러",{"thoughts":"The Korean term '일부러' is an adverb used to indicate intent or deliberate action, which is useful for expressing when someone does something on purpose. This would be relevant for beginner learners who are starting to understand expressions of intent and action.","target_language_multi_word_term":"일부러","meaning":"'on purpose' or 'intentionally'.","additional_notes":"This term is commonly used to describe actions that are done knowingly or with a specific intention. It often appears in contrast with actions done by accident.","target_language_example":"그는 일부러 나를 보지 않았다.","native_language_example":"He intentionally did not look at me."}]
["자고",{"thoughts":"The term '자고' is commonly used in Korean to indicate a suggestion or proposal to do something together, often as part of a direct or indirect speech construction. It is a form of the verb '자다' which means 'to sleep,' but the auxiliary ending has a broader use in conversational contexts. It is also used to suggest indirect quotations that align with this intent.","target_language_multi_word_term":"자고","meaning":"'let's' or 'suggested to'.","additional_notes":"'자고' is often used in sentences to convey a suggestion or proposal, such as sleeping or resting together, or can be part of reported speech indicating what someone suggested.","target_language_example":"우리 집에 가서 같이 자고 해.","native_language_example":"Let's go to my house and sleep together."}]
["자꾸",{"thoughts":"The word '자꾸' is frequently used in Korean to indicate repetition or persistence of an action or situation, similar to 'repeatedly' or 'over and over' in English. Beginners would benefit from understanding its common use in everyday language to describe actions that happen frequently, often with a slightly negative or annoying connotation.","target_language_multi_word_term":"자꾸","meaning":"repeatedly, over and over.","additional_notes":"Used to describe actions or situations that occur frequently, often in a somewhat negative or bothersome way. Common in informal spoken Korean.","target_language_example":"그는 자꾸 전화를 해.","native_language_example":"He keeps calling over and over."}]
["자세히",{"thoughts":"The term '자세히' is commonly used in everyday language to indicate a detailed or precise manner of doing something.","target_language_multi_word_term":"자세히","meaning":"'in detail' or 'thoroughly'.","additional_notes":"It is often used when asking someone to explain something more clearly or when describing an action that requires attention to detail.","target_language_example":"그는 사건을 자세히 설명했다.","native_language_example":"He explained the incident in detail."}]
["자주",{"thoughts":"The word '자주' is frequently used in everyday Korean conversation and is relevant for learners to express frequency.","target_language_multi_word_term":"자주","meaning":"often, frequently","additional_notes":"'자주' is used to describe actions that happen regularly or with high frequency. It is an adverb that typically precedes a verb in a sentence.","target_language_example":"저는 주말에 자주 산책해요.","native_language_example":"I often go for a walk on the weekend."}]
["잠깐",{"thoughts":"'잠깐' is a common Korean word used to indicate a very short period of time. It's relevant for beginners to understand as it can be used in daily conversations to ask for a brief pause or attention.","target_language_multi_word_term":"잠깐","meaning":"'a moment' or 'just a second'.","additional_notes":"Used to indicate a brief amount of time. Commonly used when asking someone to wait or when you need a short interruption.","target_language_example":"잠깐 기다려 주세요.","native_language_example":"Please wait a moment."}]
["잠시",{"thoughts":"The Korean term '잠시' is often used to denote a short amount of time, similar to 'a moment' or 'briefly' in English.","target_language_multi_word_term":"잠시","meaning":"'a moment' or 'briefly'.","additional_notes":"It is often used to indicate that something will happen soon or that a pause will be brief. It's commonly heard in everyday conversation, as well as in announcements or when asking someone to wait.","target_language_example":"잠시만 기다려 주세요.","native_language_example":"Please wait a moment."}]
["저런",{"thoughts":"The term '저런' is often used in Korean to express surprise, disappointment, or sympathy when reacting to something that has just happened. It's a more colloquial expression and is generally used in everyday conversation.","target_language_multi_word_term":"저런","meaning":"'such a thing', 'oh dear', or 'look at that'.","additional_notes":"Used to express mild surprise or regret, often in reaction to someone else's misfortune or unexpected event. It can convey emotions such as sympathy, regret, or simply drawing attention to the situation.","target_language_example":"저런, 비가 오네요.","native_language_example":"Oh dear, it's raining."}]
["저렇게",{"thoughts":"The Korean word '저렇게' is a compound of 저 (that) and 그렇게 (like that). It is an adverb used to describe a manner, way, or degree that is observable in the context. It's used to indicate actions or states that are seen or understood from a distance, both physically and emotionally.","target_language_multi_word_term":"저렇게","meaning":"'like that' or 'in that way'.","additional_notes":"Used to describe actions or behaviors that are noticeable from a distance, typically referencing something or someone far from both the speaker and the listener.","target_language_example":"저 아이가 저렇게 잘 뛸 줄 몰랐어.","native_language_example":"I didn't know that kid could run like that."}]
["적어도",{"thoughts":"'적어도' is a Korean phrase used to express the minimum amount or the least necessary requirement. It is equivalent to saying 'at least' in English and helps to soften statements or provide a minimum standard or expectation.","target_language_multi_word_term":"적어도","meaning":"'at least'.","additional_notes":"Used to set a minimum threshold or to qualify that even the smallest extent mentioned is sufficient. Commonly used to make suggestions, provide reassurance, or highlight that something meets a basic requirement.","target_language_example":"적어도 하루에 물을 2리터 마셔야 해요.","native_language_example":"You should drink at least 2 liters of water a day."}]
["전부",{"thoughts":"The term '전부' in Korean is commonly used to refer to the entirety or the whole of something. It's a basic term that can be beneficial for beginners when expressing concepts of all-inclusive or completeness in Korean.","target_language_multi_word_term":"전부","meaning":"'all' or 'everything'.","additional_notes":"'전부' is used to talk about something in its entirety. It can be used to describe complete amounts or groups and is often synonymous with '모두', which also means 'all'.","target_language_example":"전부 먹었어요.","native_language_example":"I ate everything."}]
["전부 다",{"thoughts":"전부 다 is a Korean phrase used to indicate entirety or the whole of something, similar to saying 'all of it', 'everything', or 'the whole thing' in English. It's useful for beginners as it can help in expressions where you are talking about completing or including everything.","target_language_multi_word_term":"전부 다","meaning":"'all' or 'everything'.","additional_notes":"Can be used to emphasize that nothing is left out or to agree that something encompasses everything.","target_language_example":"나는 전부 다 먹었어요.","native_language_example":"I ate all of it."}]
["전혀",{"thoughts":"'전혀' is an adverb that typically appears in negative sentences, emphasizing the nonexistence or complete absence of something. It is used to amplify the extent of negation, similar to how 'at all' or 'completely' is used in English in negative contexts.","target_language_multi_word_term":"전혀","meaning":"'not at all' or 'completely not'.","additional_notes":"Used mainly in negative sentences to emphasize the lack of something. It's often followed by a negative form of the verb, like 없다 (do not have) or 못하다 (cannot do).","target_language_example":"그 영화는 전혀 재미없었어.","native_language_example":"That movie was not fun at all."}]
["절대",{"thoughts":"The Korean word '절대' is an adverb that means 'absolutely' or 'never'. It's often used for strong negative sentences to emphasize a prohibition or something that must not happen.","target_language_multi_word_term":"절대","meaning":"'never' or 'absolutely'.","additional_notes":"'절대' is typically used in negative sentences to strongly assert that something will not or should not happen. It can also convey a sense of certainty when discussing things that are absolute.","target_language_example":"절대 늦지 마세요.","native_language_example":"Never be late."}]
["절대 안",{"thoughts":"'절대 안' is a common Korean phrase used to express strong negation, roughly equivalent to 'never' or 'absolutely not' in English. It's useful for beginners to learn for making negative statements emphatic, which adds clarity in conversation.","target_language_multi_word_term":"절대 안","meaning":"'never' or 'absolutely not'.","additional_notes":"This phrase is used to strongly assert that something will not happen or is not allowed. It adds emphasis to negative statements and is often followed by a verb.","target_language_example":"나는 절대 안 갈 거야.","native_language_example":"I will never go."}]
["절대로",{"thoughts":"The Korean term '절대로' is an adverb often used to emphasize that something will never happen or should never be done. It's important for beginners to understand its use since it's common in both spoken and written Korean to firmly indicate negation.","target_language_multi_word_term":"절대로","meaning":"'never' or 'absolutely not'.","additional_notes":"'절대로' is typically followed by a verb and often used with negative verbs to express a strong prohibition or certainty that something will not occur.","target_language_example":"저는 절대로 늦지 않을 거예요.","native_language_example":"I will never be late."}]
["점점",{"thoughts":"The Korean term '점점' is frequently used to describe gradual or continuous change. It's akin to the English word 'gradually' or 'little by little.' This term is useful when talking about progressive actions or developments.","target_language_multi_word_term":"점점","meaning":"'gradually' or 'little by little'.","additional_notes":"A versatile adverb used to indicate that something is happening slowly over time. It is often used to describe a situation or condition that becomes more pronounced or changes progressively.","target_language_example":"날씨가 점점 따뜻해지고 있어요.","native_language_example":"The weather is gradually getting warmer."}]
["점점 더",{"thoughts":"The Korean phrase '점점 더' is used to describe progressive changes and is often equivalent to the English phrase 'increasingly' or 'more and more'. It's commonly used to express a gradual intensification of an adjective or a state.","target_language_multi_word_term":"점점 더","meaning":"'increasingly' or 'more and more'.","additional_notes":"It is used to describe something that is progressively becoming more intense over time, often modifying adjectives or verbs to indicate a change in degree.","target_language_example":"날씨가 점점 더 추워지고 있어요.","native_language_example":"The weather is getting increasingly colder."}]
["정도",{"thoughts":"The word '정도' is frequently used in Korean to indicate a degree or an extent to which something occurs. It's useful for beginners to understand how to express various degrees of intensity or quantify something in Korean.","target_language_multi_word_term":"정도","meaning":"'degree', 'extent', or 'level'.","additional_notes":"'정도' is used to describe the level or intensity of something. It is similar to using 'about' or 'approximately' when talking about quantity or frequency.","target_language_example":"하루에 두 시간 정도 운동해요.","native_language_example":"I exercise about two hours a day."}]
["정도로",{"thoughts":"The Korean term '정도로' is often used to express a degree or extent of comparison or condition. This terminology is often used when discussing the level of something or to indicate 'to the extent that' or 'to the degree of'. This is a useful phrase for learners to understand comparison and conditionals in Korean.","target_language_multi_word_term":"정도로","meaning":"'to the extent that' or 'to the degree of'.","additional_notes":"Used to indicate a level or extent, often in comparisons, descriptions, or conditions. It helps in explaining how much or how far something goes in relation to something else.","target_language_example":"그는 숨을 쉴 수 없을 정도로 웃었다.","native_language_example":"He laughed to the extent that he couldn't breathe."}]
["정말",{"thoughts":"\"정말\" is a very common adverb in Korean meaning \"really/truly.\" Beginners often meet it early because it reinforces adjectives or forms emphatic questions.","target_language_multi_word_term":"정말","meaning":"really; truly","additional_notes":"Placed before verbs/adjectives to intensify, or used alone/in questions to seek confirmation (\"Really?\").","target_language_example":"이 영화 정말 재미있어요.","native_language_example":"This movie is really fun."}]
["정말로",{"thoughts":"The Korean term '정말로' is used for emphasis and is often added to questions or statements to assert sincerity or truthfulness.","target_language_multi_word_term":"정말로","meaning":"truly; really.","additional_notes":"'정말로' is used for emphasis and can be placed at the beginning or end of a sentence. It adds weight or seriousness to the statement, indicating that the speaker is sincere or truly interested.","target_language_example":"정말로 이 영화를 이미 봤어요?","native_language_example":"Have you really already seen this movie?"}]
["정확하게",{"thoughts":"The term '정확하게' is an adverb in Korean that enhances understanding of precision or correctness. This could be quite useful for learners attempting to describe actions or statements accurately.","target_language_multi_word_term":"정확하게","meaning":"precisely or exactly.","additional_notes":"It is often used to indicate the precision or accuracy of an action, statement, or measurement. It can often be seen in contexts where clarity and correctness are emphasized.","target_language_example":"시간을 정확하게 측정하세요.","native_language_example":"Measure the time precisely."}]
["정확히",{"thoughts":"The term '정확히' is an adverb in Korean that is useful for describing precision or accuracy. It can be applied in various scenarios requiring exactness.","target_language_multi_word_term":"정확히","meaning":"exactly or precisely.","additional_notes":"'정확히' is used to emphasize precision in statements or questions. It can specify exactness in amounts, times, or details.","target_language_example":"그는 정확히 3시에 도착할 거예요.","native_language_example":"He will arrive precisely at 3 o'clock."}]
["제 말은",{"thoughts":"The Korean phrase '제 말은' literally translates to 'my words' or 'what I mean is'. It is often used to clarify one's point of view or to restate something in a conversation.","target_language_multi_word_term":"제 말은","meaning":"'what I mean is'.","additional_notes":"Used to clarify or reiterate a point during a conversation. It usually precedes an explanation or a restatement.","target_language_example":"제 말은 우리가 더 준비해야 한다는 것입니다.","native_language_example":"What I mean is that we need to prepare more."}]
["제대로",{"thoughts":"The Korean term '제대로' is often used to express that something is done correctly, properly, or appropriately. It is a useful term for beginners to know as it can apply in various contexts, from everyday activities to more complex tasks. Understanding and using '제대로' can help learners articulate the need for or description of things being done as intended.","target_language_multi_word_term":"제대로","meaning":"'properly' or 'correctly'.","additional_notes":"Use '제대로' when you want to emphasize that something is being done or needs to be done in the right way or according to standard expectations.","target_language_example":"그 일을 제대로 해야 해요.","native_language_example":"You need to do that work properly."}]
["조금",{"thoughts":"The word '조금' is used to indicate a small amount or degree of something, similar to 'a little' or 'a bit' in English.","target_language_multi_word_term":"조금","meaning":"'a little', 'a bit', or 'slightly'.","additional_notes":"Often used to describe small quantities or slight degrees in situations like expressing quantity, mild emotions, or making polite requests. It modifies verbs or adjectives to soften them.","target_language_example":"저는 매운 음식을 조금 먹을 수 있어요.","native_language_example":"I can eat spicy food a little."}]
["조금만",{"thoughts":"The Korean phrase '조금만' is used to express a small amount or to indicate that only a little of something is being referred to. It's a combination of '조금' meaning 'a little' and '만' meaning 'only'.","target_language_multi_word_term":"조금만","meaning":"'only a little' or 'just a little'.","additional_notes":"Commonly used when asking for a small quantity of something, in both tangible and intangible contexts, such as food, time, or adjustments.","target_language_example":"설탕을 조금만 넣어 주세요.","native_language_example":"Please put in only a little sugar."}]
["좀",{"thoughts":"\"좀\" literally means \"a little\" but is very commonly placed before a verb or adjective to soften a request or statement, sounding more polite or less direct. Important for beginners because it appears everywhere in everyday speech.","target_language_multi_word_term":"좀","meaning":"a little; please (softening word)","additional_notes":"Used before verbs/adjectives to indicate a small amount or to make a request sound polite. Comparable to adding \"a bit\" or \"please\" in English.","target_language_example":"문 좀 닫아 주세요.","native_language_example":"Please close the door."}]
["좀 더",{"thoughts":"The term '좀 더' is a Korean phrase used to request or suggest 'a little more' of something, often used to ask for something additional or to do something more.","target_language_multi_word_term":"좀 더","meaning":"A little more.","additional_notes":"This phrase is commonly used when requesting more of something, whether it's more food, time, or effort. It's a polite way of asking for extra.","target_language_example":"물을 좀 더 주세요.","native_language_example":"Please give me a little more water."}]
["종종",{"thoughts":"The term '종종' is used in Korean to convey frequency. Beginners may encounter it when discussing how often they do something.","target_language_multi_word_term":"종종","meaning":"Often or frequently.","additional_notes":"Used to describe something that happens fairly often but not all the time. It's less frequent than \"항상\" (always) but more frequent than \"가끔\" (sometimes).","target_language_example":"나는 종종 그 카페에 가요.","native_language_example":"I often go to that cafe."}]
["즉",{"thoughts":"The term '즉' in Korean is a conjunctive adverb that is used to give clarification or definition, similar to 'that is', 'in other words', or 'namely' in English. It's useful for learners to understand this as it helps in building complex sentences by adding clarifying points.","target_language_multi_word_term":"즉","meaning":"'that is', 'namely', 'in other words'.","additional_notes":"Used to clarify or specify something that's just been mentioned. It's commonly used in both spoken and written Korean to make a statement clearer.","target_language_example":"모두가 집에 갔습니다. 즉, 파티가 끝났습니다.","native_language_example":"Everyone went home. That is, the party is over."}]
["즉시",{"thoughts":"'즉시' is a commonly used Korean word that means 'immediately' or 'instantly'. It's useful for beginner learners as it can be used in various everyday contexts to express urgency or promptness.","target_language_multi_word_term":"즉시","meaning":"'immediately' or 'instantly'.","additional_notes":"'즉시' is often used in situations where immediate action is required or something happens without delay.","target_language_example":"즉시 병원에 가세요.","native_language_example":"Go to the hospital immediately."}]
["지금 당장",{"thoughts":"The phrase '지금 당장' is commonly used to emphasize urgency or immediacy, equivalent to saying 'right now' or 'immediately' in English. It's an important phrase for learners to know as it often appears in requests, demands, or commands to express that something needs to be done without delay.","target_language_multi_word_term":"지금 당장","meaning":"right now; immediately.","additional_notes":"This phrase is used to stress the importance of completing an action without any delay or hesitation. Often found in contexts where urgency is required, such as instructions or commands.","target_language_example":"지금 당장 와 주세요.","native_language_example":"Please come right now."}]
["지금 바로",{"thoughts":"The Korean phrase '지금 바로' is often used to indicate the immediate doing of an action or starting something right away. It emphasizes urgency or immediacy in a situation.","target_language_multi_word_term":"지금 바로","meaning":"'right now' or 'immediately'.","additional_notes":"Used to stress that the action should take place without delay, often employed in situations where promptness is necessary or expected.","target_language_example":"지금 바로 시작하세요.","native_language_example":"Start right now."}]
["지금부터",{"thoughts":"The Korean term '지금부터' essentially translates to 'from now' or 'starting now' in English. It's a common phrase used to indicate the beginning of an action or event from the current moment onward.","target_language_multi_word_term":"지금부터","meaning":"'from now' or 'starting now'.","additional_notes":"This phrase is used to mark the start of actions or events from the present moment. It often appears in schedules, instructions, or when announcing the commencement of something.","target_language_example":"지금부터 공부를 시작하겠습니다.","native_language_example":"I will start studying from now."}]
["지도",{"thoughts":"The term '지도' in Korean can mean both 'map' and 'leadership'. This might confuse beginner learners, but usually context determines which meaning applies. Maps are common in travel contexts or when giving directions. Leadership, on the other hand, might appear in organisational or political discussions.","target_language_multi_word_term":"지도","meaning":"'map' or 'leadership'.","additional_notes":"Context determines the meaning of '지도'. If discussing navigation, travel, or directions, it likely means 'map'. In a social or organizational context, it can mean 'leadership'.","target_language_example":"이 지도에서 한국을 찾을 수 있어요?","native_language_example":"Can you find Korea on this map?"}]
["진짜",{"thoughts":"'진짜' is a versatile Korean adverb and adjective used frequently in informal settings. It can mean 'really' or 'real', adding emphasis to a statement or question.","target_language_multi_word_term":"진짜","meaning":"'really' or 'real'.","additional_notes":"It is often used to express surprise, disbelief, or to emphasize sincerity. It's commonly heard in casual conversations.","target_language_example":"이거 진짜 맛있어!","native_language_example":"This is really delicious!"}]
["진짜로",{"thoughts":"The term '진짜로' is often used in spoken Korean to emphasize sincerity or truth, akin to saying 'really' or 'truly' in English. It's an intensifier that adds emphasis to the statement it accompanies. Beginner learners are likely to encounter this in casual conversations.","target_language_multi_word_term":"진짜로","meaning":"'really' or 'truly'.","additional_notes":"Used to emphasize sincerity or truthfulness. Often appears in informal contexts and is commonly used for emphasis.","target_language_example":"진짜로 맛있어요!","native_language_example":"It's really delicious!"}]
["차라리",{"thoughts":"'차라리' is an adverb used to express preference for a less unfavorable option when compared to others.","target_language_multi_word_term":"차라리","meaning":"'rather' or 'preferably'.","additional_notes":"Used when indicating that one would prefer one option over another, especially when both choices aren't ideal.","target_language_example":"그냥 혼자 가는 게 차라리 낫겠어.","native_language_example":"I'd rather just go alone."}]
["처럼",{"thoughts":"The Korean postposition '처럼' is often used to indicate similarity, similar to the English phrase 'like' or 'as if'. It is used to compare one thing to another, highlighting resemblance. This is a common term beginners might encounter due to its usage in everyday comparisons.","target_language_multi_word_term":"처럼","meaning":"'like' or 'as if'.","additional_notes":"It's used to compare two things or describe something as being similar to something else. Placed after a noun to make a comparison.","target_language_example":"그 사람은 진짜 모델처럼 걷는다.","native_language_example":"He walks like a real model."}]
["처음부터",{"thoughts":"The term '처음부터' is a useful phrase for beginners as it signifies starting something from the beginning or something happening from the very start. Understanding its use will help learners describe sequences or origins of events.","target_language_multi_word_term":"처음부터","meaning":"'from the beginning'.","additional_notes":"Used to describe actions or events starting from the initial point or the onset.","target_language_example":"그는 처음부터 다시 시작했다.","native_language_example":"He started again from the beginning."}]
["처음에는",{"thoughts":"The Korean term '처음에는' is often used to indicate the initial stage or the beginning of an event or process. It is important for beginners to understand such expressions to describe sequences and changes over time.","target_language_multi_word_term":"처음에는","meaning":"'at first' or 'initially'.","additional_notes":"Used to describe how something was at the beginning, often followed by something that indicates a change.","target_language_example":"처음에는 어렵지만 나중에는 쉬워집니다.","native_language_example":"At first, it's difficult, but later it becomes easy."}]
["최소한",{"thoughts":"'최소한' is a Korean phrase used to indicate the minimum requirement or the least amount of something, often adding emphasis in a sentence.","target_language_multi_word_term":"최소한","meaning":"At least.","additional_notes":"This term is often used to specify the minimum level, quantity, or standard necessary for a certain situation or condition. It can add a hedging tone to a statement, suggesting that while something better might exist, this specific level is the minimum that is still acceptable.","target_language_example":"최소한 두 시간을 공부해야 해.","native_language_example":"You need to study for at least two hours."}]
["큰일",{"thoughts":"The term '큰일' is made up of two words: '큰' meaning 'big' or 'great', and '일' meaning 'work' or 'task'. Together, it's often used to express a significant event or trouble. For beginners, understanding its use in different contexts will be beneficial as it's frequently employed in conversations.","target_language_multi_word_term":"큰일","meaning":"a big event or trouble.","additional_notes":"'큰일' can refer to an important task or responsibility, often with significant consequences, or to a serious problem or trouble that needs attention. It can convey urgency and seriousness.","target_language_example":"오늘 큰일이 생겼어요.","native_language_example":"Something big happened today."}]
["통해",{"thoughts":"'통해' is a Korean postposition that is often used to indicate a means, method, or process through which something is done. It is equivalent to the English preposition 'through' or 'via'.","target_language_multi_word_term":"통해","meaning":"'through' or 'via'.","additional_notes":"Used to describe the medium or method by which an action is performed or an object is communicated. Often follows nouns.","target_language_example":"우리는 인터넷을 통해 정보를 얻습니다.","native_language_example":"We get information through the internet."}]
["통해서",{"thoughts":"'통해서' is a Korean term that means 'through', 'via', or 'by way of'. It is used to indicate a medium or method by which something happens. This term is useful for expressing the means through which an action is accomplished or an outcome is achieved, which is common in forming sentences.","target_language_multi_word_term":"통해서","meaning":"through, via, by way of.","additional_notes":"Typically used to describe a means or method. It can connect phrases to show how something is done or obtained.","target_language_example":"이 책을 친구를 통해서 받았어요.","native_language_example":"I received this book through a friend."}]
["특별히",{"thoughts":"The Korean term '특별히' is an adverb that means \"especially\" or \"particularly\". It is used to add emphasis to a noun, verb, or phrase, indicating that something has a special quality or is of special importance compared to others. Beginner learners will encounter this term when they want to emphasize or highlight a particular element in a sentence.","target_language_multi_word_term":"특별히","meaning":"'especially' or 'particularly'","additional_notes":"Used to emphasize something that is noteworthy or different from others. Commonly used to highlight importance or special characteristics.","target_language_example":"저는 특별히 매운 음식을 좋아해요.","native_language_example":"I especially like spicy food."}]
["특히",{"thoughts":"The Korean term '특히' is often used to emphasize a particular word or phrase, similar to 'especially' in English. It is useful in both spoken and written communication for highlighting a specific detail or item within a broader context.","target_language_multi_word_term":"특히","meaning":"especially","additional_notes":"This term is used to put emphasis on a certain aspect of what is being discussed, similar to the English word 'especially'. It's commonly used to single out something important or noteworthy within a list or category.","target_language_example":"저는 과일을 좋아해요, 특히 사과를 좋아해요.","native_language_example":"I like fruits, especially apples."}]
["특히나",{"thoughts":"The Korean term '특히나' is an adverb meaning 'especially' or 'particularly', used for emphasis. Beginner learners often encounter this in sentences where a specific point is being highlighted for its importance or relevance.","target_language_multi_word_term":"특히나","meaning":"'especially', 'particularly'.","additional_notes":"Used to emphasize or highlight a specific aspect or detail in a sentence. Commonly used in both spoken and written Korean to denote something that stands out or is of particular importance.","target_language_example":"그녀는 모든 음식을 잘 먹지만, 특히나 매운 것을 좋아해요.","native_language_example":"She eats all kinds of food well, but she particularly likes spicy ones."}]
["필요하다",{"thoughts":"The Korean term '필요하다' is an adjective meaning needed, necessary, or required. It often appears in contexts where someone is talking about needing something or someone, or when indicating necessity. Understanding '필요하다' helps with forming simple necessity statements and asking about needs, which are common in everyday conversation.","target_language_multi_word_term":"필요하다","meaning":"'to be necessary' or 'to need'.","additional_notes":"This term is used to express a requirement or necessity. It's often used in everyday situations to express what you need or what is necessary for you or others.","target_language_example":"이것이 필요하다.","native_language_example":"This is necessary."}]
["하지만",{"thoughts":"'하지만' is a Korean conjunction used to introduce contrasting or opposing ideas, similar to 'but' or 'however' in English. This would be relevant for beginner learners as it's commonly used in everyday conversation to express contrast or exception.","target_language_multi_word_term":"하지만","meaning":"'but', 'however'.","additional_notes":"It is used to contrast two sentences or clauses, indicating a shift or difference in expectation or thought.","target_language_example":"비가 많이 오고 있어요. 하지만 우리는 나가야 해요.","native_language_example":"It's raining heavily. But we have to go out."}]
["한 가지",{"thoughts":"The Korean term '한 가지' is used to denote one thing, one type, or one way, emphasizing singularity or focusing on one aspect of something. Beginners learning Korean might find it useful when needing to describe a singular choice or item among many. It's commonly used for listing or explaining items, especially in a sequence.","target_language_multi_word_term":"한 가지","meaning":"'one thing' or 'one way'.","additional_notes":"It is used frequently to single out one item or idea from multiple possibilities. It can also be used to indicate that a single option or characteristic is being highlighted in a discussion or description.","target_language_example":"우리가 해결해야 할 한 가지 문제가 있다.","native_language_example":"We have one problem that we need to solve."}]
["한 번 더",{"thoughts":"The expression '한 번 더' is commonly used in Korean to ask for something to be repeated or done again, similar to saying 'one more time' in English.","target_language_multi_word_term":"한 번 더","meaning":"'one more time' or 'once more'.","additional_notes":"Frequently used in various contexts when requesting repeats, such as asking someone to repeat what they said, to play a song again, or to redo an action.","target_language_example":"그 노래 한 번 더 틀어주세요.","native_language_example":"Please play that song once more."}]
["한 번에",{"thoughts":"The expression '한 번에' is commonly used in Korean to express the idea of doing something at a single effort or all at once.","target_language_multi_word_term":"한 번에","meaning":"'at once' or 'in one go'.","additional_notes":"Used to describe completing a task in a single attempt rather than multiple tries. It's often used to emphasize efficiency or the ease of accomplishing something.","target_language_example":"그는 그 책을 한 번에 읽었다.","native_language_example":"He read the book in one go."}]
["한번 더",{"thoughts":"\"한번 더\" is a simple Korean phrase that is used to request a repetition of an action or statement. It can be seen as equivalent to saying \"one more time\" or \"again\" in English. This phrase is quite handy for beginners who might need clarification or repetition as they are learning Korean.","target_language_multi_word_term":"한번 더","meaning":"one more time or again.","additional_notes":"It is often used to ask for repetition in various contexts, such as in a classroom when a learner wants a teacher to repeat something or in daily life situations like asking to repeat an action.","target_language_example":"이 노래를 한번 더 들려주세요.","native_language_example":"Please play this song one more time."}]
["한번에",{"thoughts":"The Korean term '한번에' is commonly used to express the idea of doing something in one go or at once.","target_language_multi_word_term":"한번에","meaning":"'at once' or 'in one go'.","additional_notes":"It implies that an action is completed in a single attempt or quickly without repetitions. It is often used when discussing efficiency or simplicity.","target_language_example":"모든 일을 한번에 끝냈어요.","native_language_example":"I finished all the work at once."}]
["한테",{"thoughts":"The Korean postposition '한테' is often used to indicate the indirect object of a verb, commonly used when something is given or directed toward a person or an animal. It is similar in use to the English prepositions 'to' or 'from'.","target_language_multi_word_term":"한테","meaning":"'to' or 'from' (a person/animal).","additional_notes":"Used as a postposition with people or animals to mark the indirect object in phrases like giving or receiving something. It also can imply from whom something is received if used with verbs of receiving.","target_language_example":"나는 친구한테 편지를 보냈어요.","native_language_example":"I sent a letter to my friend."}]
["함께",{"thoughts":"The Korean term '함께' is commonly used to indicate doing something together with one or more people. It's akin to the English words 'together' or 'with'. For a beginner, understanding its usage is key to forming sentences about joint activities.","target_language_multi_word_term":"함께","meaning":"Together or with.","additional_notes":"Used to describe an action done in the company of others. Often interchangeable with '같이', although '함께' can sound a bit more formal or written than '같이'.","target_language_example":"우리 함께 영화를 보러 가자.","native_language_example":"Let's go watch a movie together."}]
["항상",{"thoughts":"항상 is an adverb in Korean that means 'always'. It is used to describe actions or states that occur all the time, without change. This is useful for beginner learners as it's helpful in talking about routines or habitual actions.","target_language_multi_word_term":"항상","meaning":"always","additional_notes":"This term is used to describe actions or states that are consistently repeated over time. It can be used with various verb forms to indicate habitual or continual action.","target_language_example":"그녀는 항상 웃고 있어요.","native_language_example":"She is always smiling."}]
["혹시",{"thoughts":"'혹시' is a versatile Korean word often used to gently introduce questions, show uncertainty, or ask for information.","target_language_multi_word_term":"혹시","meaning":"'by any chance' or 'perhaps'.","additional_notes":"Commonly used to politely start a question or show hesitation when asking for information. It helps soften requests or questions, making them less direct.","target_language_example":"혹시, 오늘 저녁에 시간 있어요?","native_language_example":"By any chance, are you free this evening?"}]
["확실하게",{"thoughts":"'확실하게' is an adverb commonly used in Korean to express certainty or assurance. It's derived from the word '확실하다' which means 'to be certain' or 'to be sure'. This term is useful for learners when they want to emphasize their certainty about a decision, fact, or action.","target_language_multi_word_term":"확실하게","meaning":"certainly or surely","additional_notes":"This term is often used to assert the certainty of an action or statement. It can be combined with verbs to emphasize that something will be done with certainty.","target_language_example":"그 문제를 확실하게 해결하겠습니다.","native_language_example":"I will certainly solve that problem."}]
["확실히",{"thoughts":"'확실히' is a common Korean adverb used to express certainty or emphasis. It is useful when affirming or highlighting the truth of a statement.","target_language_multi_word_term":"확실히","meaning":"'certainly' or 'definitely'.","additional_notes":"Used to emphasize that something is true or that the speaker is sure about the statement.","target_language_example":"그는 확실히 이 일을 할 수 있습니다.","native_language_example":"He can definitely do this job."}]
["훨씬",{"thoughts":"The Korean term '훨씬' is often used to emphasize a large difference or extent, generally meaning 'much more' or 'far more'. This phrase commonly appears in comparisons to indicate a significant contrast in degree or amount.","target_language_multi_word_term":"훨씬","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize a great difference or degree in comparisons. It often enhances adjectives or adverbs to indicate something is much more of a certain quality than something else.","target_language_example":"이 책이 저 책보다 훨씬 재미있어요.","native_language_example":"This book is much more interesting than that book."}]
["훨씬 더",{"thoughts":"'훨씬 더' is used in Korean to express a much greater degree or amount, similar to \"much more\" or \"far more\" in English. It is commonly used to emphasize differences or to compare two things where one exceeds the other significantly.","target_language_multi_word_term":"훨씬 더","meaning":"'much more' or 'far more'.","additional_notes":"Used to emphasize greater amounts, degrees, or intensities between comparative entities.","target_language_example":"올해는 작년보다 훨씬 더 춥다.","native_language_example":"This year is much colder than last year."}]
