["가끔",{"thoughts":"The Korean word '가끔' is an adverb that means 'sometimes'. It's commonly used to express infrequent or occasional occurrences. For a beginner Korean learner, understanding adverbs related to frequency is crucial for describing routines or habits.","target_language_multi_word_term":"가끔","meaning":"'sometimes'.","additional_notes":"Used to indicate actions or events that occur occasionally or infrequently.","target_language_example":"저는 가끔 산책해요.","native_language_example":"I sometimes go for a walk."}]
["가끔씩",{"thoughts":"The Korean term '가끔씩' is used to express frequency, similar to saying 'occasionally' or 'from time to time' in English. It's useful for beginners to express how often they do something without being too specific.","target_language_multi_word_term":"가끔씩","meaning":"'occasionally'","additional_notes":"가끔씩 is used to indicate that something happens once in a while, not regularly but rather infrequently.","target_language_example":"저는 가끔씩 산책을 가요.","native_language_example":"I go for a walk occasionally."}]
["간신히",{"thoughts":"'간신히' is an adverb in Korean used to describe an action done with great difficulty, often implying barely achieving something. It is useful for beginners to express situations where they almost did not complete an action.","target_language_multi_word_term":"간신히","meaning":"barely, narrowly, with difficulty","additional_notes":"Used to describe actions or achievements that happen with minimal success or barely happen at all. It often highlights the effort and struggle involved.","target_language_example":"비가 오기 전에 간신히 집에 도착했어요.","native_language_example":"I barely got home before it started raining."}]
["같은",{"thoughts":"The term '같은' is a versatile Korean adjective that can be used in various contexts to indicate similarity. It is commonly used to express similarity, likeness, or equivalence, and is often followed by a noun to complete the comparison.","target_language_multi_word_term":"같은","meaning":"'like', 'similar to', or 'such as'.","additional_notes":"This term is used when comparing things or expressing that something is like another in form, nature, or quality.","target_language_example":"우리는 같은 음식을 좋아해요.","native_language_example":"We like the same food."}]
["같은 것",{"thoughts":"같은 것 is a Korean phrase that is used to refer to something similar or the same as something else. Beginners may find it useful to talk about comparisons or similarities.","target_language_multi_word_term":"같은 것","meaning":"'something like' or 'the same as'.","additional_notes":"This phrase is used to express similarity between objects, concepts, or situations. It functions as a noun in sentences and helps convey likeness.","target_language_example":"저는 딸기 같은 과일을 좋아해요.","native_language_example":"I like fruits such as strawberries."}]
["같이",{"thoughts":"The Korean term '같이' is often used to mean 'together' or 'like.' It can describe doing something in companionship or similarity to something else.","target_language_multi_word_term":"같이","meaning":"'together' or 'like'.","additional_notes":"When used to mean 'together', it refers to performing actions with someone else. When used to mean 'like', it expresses similarity or comparison to something else.","target_language_example":"우리 같이 영화 보자.","native_language_example":"Let's watch a movie together."}]
["개인적으로",{"thoughts":"'개인적으로' is an adverb in Korean used to express a personal opinion or perspective. It is likely derived from the word '개인' meaning 'individual' or 'personal', followed by '적으로', a suffix that transforms nouns into adverbs. Beginner learners might encounter this term when expressing personal opinions in everyday conversation.","target_language_multi_word_term":"개인적으로","meaning":"Personally.","additional_notes":"Used to express a personal opinion or viewpoint. Often found at the beginning of a sentence to indicate that what follows is the speaker's personal take.","target_language_example":"개인적으로, 나는 그 영화를 별로 좋아하지 않았어.","native_language_example":"Personally, I didn't really like the movie."}]
["거의",{"thoughts":"'거의' is an adverb meaning 'almost' or 'nearly,' and it is commonly used to express approximation or a high degree of possibility.","target_language_multi_word_term":"거의","meaning":"almost","additional_notes":"Used to indicate something is true to a large extent or near completion.","target_language_example":"저는 거의 다 왔어요.","native_language_example":"I am almost there."}]
["거의 다",{"thoughts":"The term '거의 다' is used in Korean to indicate that something is almost completely done or almost all. It's a phrase that beginner learners can use in daily conversation to express near completion or extent.","target_language_multi_word_term":"거의 다","meaning":"almost all; nearly done.","additional_notes":"This expression is used to describe situations where a task is almost finished or to convey that most of something is completed.","target_language_example":"숙제를 거의 다 했어요.","native_language_example":"I almost finished my homework."}]
["거친",{"thoughts":"The Korean term '거친' is an adjective that describes something as rough or coarse. It's useful for beginners as it's commonly used to describe textures and surfaces, as well as metaphorically to describe personalities or situations.","target_language_multi_word_term":"거친","meaning":"rough or coarse.","additional_notes":"Used to describe something that is physically rough like a surface, or metaphorically to describe someone with a rough personality or a harsh situation.","target_language_example":"이 바위는 정말 거친 표면을 가지고 있습니다.","native_language_example":"This rock has a really rough surface."}]
["게다가",{"thoughts":"'게다가' is used in Korean to add extra information to a sentence, similar to 'furthermore,' 'in addition,' or 'besides' in English. It's useful for beginners to expand their vocabulary and sentence structuring skills by connecting ideas.","target_language_multi_word_term":"게다가","meaning":"'in addition' or 'moreover'.","additional_notes":"Typically used to introduce an additional point or argument that strengthens the speaker's case.","target_language_example":"이 음식은 싸고 맛있어요. 게다가 양도 많아요.","native_language_example":"This food is cheap and delicious. Besides, the portion is large."}]
["겨우",{"thoughts":"The term '겨우' is an adverb commonly used in Korean to indicate a sense of something barely happening, only just happening, or with much difficulty.","target_language_multi_word_term":"겨우","meaning":"barely; only just.","additional_notes":"'겨우' implies that something happened with difficulty or narrowly, often used to emphasize the minimal effort required or the small margin by which something succeeded.","target_language_example":"시험에 겨우 합격했어요.","native_language_example":"I barely passed the exam."}]
["결국",{"thoughts":"결국 is a frequently used Korean term that conveys a conclusion or result, which is important for learners to understand to follow conversations about events or stories.","target_language_multi_word_term":"결국","meaning":"'in the end' or 'after all'.","additional_notes":"Used to denote the final outcome or result of a situation after a series of events.","target_language_example":"그는 결국 성공했다.","native_language_example":"In the end, he succeeded."}]
["결국은",{"thoughts":"The Korean phrase '결국은' is often used to signify the final outcome or conclusion of a situation. It's similar to the expression 'in the end' in English, indicating a summary of events leading to a final result. This phrase would be relevant for learners to understand how to conclude statements or stories in Korean.","target_language_multi_word_term":"결국은","meaning":"'in the end'","additional_notes":"Used to indicate the final result or conclusion of a series of events or actions.","target_language_example":"결국은 우리가 승리했다.","native_language_example":"In the end, we won."}]
["결코",{"thoughts":"`결코` is a Korean adverb used for emphasis in negative sentences, often to ensure the negation is absolute or categorical.","target_language_multi_word_term":"결코","meaning":"'never' or 'by no means'.","additional_notes":"Typically used in negative sentences to emphasize the impossibility or denial of the action or state being described.","target_language_example":"그는 결코 그런 일을 하지 않을 것이다.","native_language_example":"He would never do such a thing."}]
["계속",{"thoughts":"The term '계속' is a commonly used Korean word signifying continuity or persistence. It will be useful for beginner learners to express the concept of ongoing action or state.","target_language_multi_word_term":"계속","meaning":"continuously, constantly, or keep on.","additional_notes":"'계속' is often used to indicate that something is happening without interruption or that an action should continue. It can be used both as an adverb to modify verbs and as part of phrases to express continuity.","target_language_example":"비가 계속 내리고 있어요.","native_language_example":"It's continuing to rain."}]
["계속해서",{"thoughts":"'계속해서' is an adverb in Korean that is used to describe an action that is done continuously or repeatedly.","target_language_multi_word_term":"계속해서","meaning":"continuously, repeatedly","additional_notes":"This term is frequently used in everyday conversation to emphasize that an action or event is ongoing or persistent. It can be used in various contexts, including about jobs, studying, or any activity that is being done without interruption.","target_language_example":"그는 계속해서 공부하고 있어요.","native_language_example":"He is studying continuously."}]
["곧",{"thoughts":"'곧' is an adverb in Korean that denotes something happening in the near future or shortly. It expresses anticipation or the imminence of an event, making it useful for everyday conversation when talking about time.","target_language_multi_word_term":"곧","meaning":"'soon' or 'shortly'.","additional_notes":"Often used to indicate that something is expected to happen in the near future. It can be used both in formal and informal contexts.","target_language_example":"비가 곧 올 거예요.","native_language_example":"It will rain soon."}]
["공식적으로",{"thoughts":"The term '공식적으로' is an adverb in Korean that translates to 'officially' in English. It is used to describe actions or statements that are conducted in a formal or sanctioned manner, often following proper procedures or recognized standards.","target_language_multi_word_term":"공식적으로","meaning":"officially","additional_notes":"Commonly used to refer to actions, announcements, or communications that are done in formal contexts as recognized or authorized by a governing body or authority.","target_language_example":"그 발표는 공식적으로 확인되었습니다.","native_language_example":"The announcement has been officially confirmed."}]
["관한",{"thoughts":"'관한' is a Korean postposition that means 'about' or 'regarding'. It is commonly used to talk about the subject or topic of conversation, discussion, or writing. Typically, it follows a noun or pronoun.","target_language_multi_word_term":"관한","meaning":"'about', 'regarding'.","additional_notes":"Used to indicate the subject or topic in discussions or descriptions. It typically follows a noun or noun phrase indicating the item or matter being discussed.","target_language_example":"그 책은 여행에 관한 이야기입니다.","native_language_example":"That book is a story about traveling."}]
["관해",{"thoughts":"The term '관해' is often used in Korean to indicate that something is 'about' or 'concerning' a particular topic. It is frequently used in formal contexts, such as when discussing topics, giving presentations, or writing essays. This term is derived from the verb '관하다', which means 'to be about' something.","target_language_multi_word_term":"관해","meaning":"'about' or 'regarding'.","additional_notes":"Typically used in formal contexts to specify the subject matter being discussed or referred to.","target_language_example":"이 책은 환경문제에 관해 썼어요.","native_language_example":"This book was written about environmental issues."}]
["관해서",{"thoughts":"The term '관해서' is derived from the verb '관하다,' meaning 'to be related to' or 'to be about.' It is often used to transition or introduce a topic in a conversation.","target_language_multi_word_term":"관해서","meaning":"'concerning' or 'regarding'.","additional_notes":"Used to introduce or specify the topic of discussion. It can be followed by a noun or a clause describing what the topic is about.","target_language_example":"이 문제에 관해서 더 이야기해 보겠습니다.","native_language_example":"Let's talk more about this issue."}]
["굉장히",{"thoughts":"'굉장히' is a Korean adverb often used to express a high degree or level of something. It can be translated to mean 'very much' or 'extremely', and it is often used for emphasis in everyday conversation by native speakers.","target_language_multi_word_term":"굉장히","meaning":"'very' or 'extremely'.","additional_notes":"Commonly used to intensify adjectives or verbs, making it a versatile term in spoken and written Korean. It can be used in both formal and informal contexts.","target_language_example":"이 영화는 굉장히 재미있어요.","native_language_example":"This movie is very interesting."}]
["그 누구도",{"thoughts":"'그 누구도' is a Korean phrase used to emphasize that no one at all is included. It's similar to 'nobody' but stronger, often used to underscore a point.","target_language_multi_word_term":"그 누구도","meaning":"'no one', 'nobody at all'.","additional_notes":"Used often to emphasize the absence of any person or the impossibility that anyone could be involved or present. It's more emphatic than a simple 'nobody.'","target_language_example":"그 누구도 그 비밀을 알지 못한다.","native_language_example":"Nobody at all knows that secret."}]
["그 전에",{"thoughts":"`그 전에` is a temporal phrase in Korean commonly used to refer to an action or event that takes place before another action or time. It's useful for learners to understand this phrase as it helps structure sentences in a time-related context.","target_language_multi_word_term":"그 전에","meaning":"before that","additional_notes":"Used when referring to a time or event prior to what is currently being discussed or mentioned.","target_language_example":"수업이 끝나기 전에, 저는 숙제를 할 거예요.","native_language_example":"Before class ends, I will do my homework."}]
["그것도",{"thoughts":"The Korean term '그것도' is a combination of '그것', meaning 'that,' and '도', meaning 'also,' 'too' or 'as well.' It's used to add additional information or to agree with something previously mentioned.","target_language_multi_word_term":"그것도","meaning":"'that too' or 'as well'.","additional_notes":"Used to add or agree with something mentioned earlier, showing inclusion or agreement with additional items or facts.","target_language_example":"나도 그것도 하고 싶어요.","native_language_example":"I want to do that too."}]
["그때까지",{"thoughts":"The term '그때까지' is often used to indicate a point in time, similar to 'until then' or 'by that time' in English. It's useful for expressing deadlines or scheduled times.","target_language_multi_word_term":"그때까지","meaning":"'until then' or 'by that time'.","additional_notes":"Commonly used in conversational contexts to specify a deadline or the time until something is expected to happen or be completed.","target_language_example":"우리는 그때까지 준비를 끝낼 거예요.","native_language_example":"We will finish the preparations by that time."}]
["그래도",{"thoughts":"'그래도' is a Korean adverb used to express a concession, similar to saying 'nevertheless' or 'still' in English. It's often used when talking about a situation where one thing is true despite something else that might suggest otherwise.","target_language_multi_word_term":"그래도","meaning":"'nevertheless' or 'still'.","additional_notes":"Used to indicate that something is true or will happen in spite of other factors or circumstances.","target_language_example":"날씨가 춥지만 그래도 밖에 나가야 해요.","native_language_example":"It's cold, but I still have to go outside."}]
["그래서",{"thoughts":"\"그래서\" is a conjunction in Korean that translates to 'so', 'therefore', or 'and so'. It is commonly used in conversational Korean to connect two related ideas, where the first part explains the cause or reason and the second shows the result or conclusion.","target_language_multi_word_term":"그래서","meaning":"'so', 'therefore'.","additional_notes":"Used to show cause and effect between two statements. It links a reason to a result or conclusion in a sentence.","target_language_example":"비가 왔어요. 그래서 우산을 가져왔어요.","native_language_example":"It rained. So, I brought an umbrella."}]
["그러나",{"thoughts":"'그러나' is a conjunction in Korean often used to contrast statements, similar to 'but' or 'however' in English. It's essential in creating complex sentences by linking contrasting ideas.","target_language_multi_word_term":"그러나","meaning":"'but' or 'however'.","additional_notes":"It is typically used at the beginning of a sentence or clause to introduce a contrast or an exception to what has been previously stated.","target_language_example":"저는 고기를 좋아해요. 그러나 생선은 싫어해요.","native_language_example":"I like meat. However, I dislike fish."}]
["그러니까",{"thoughts":"'그러니까' is a Korean conjunctive adverb used to provide explanation or emphasis. It can translate to 'so', 'therefore', or 'that is to say', depending on the context. This word is often used to summarize or emphasize the speaker's point or reasoning.","target_language_multi_word_term":"그러니까","meaning":"'so', 'therefore', or 'that is to say'.","additional_notes":"It is used to present a conclusion or to emphasize a point in casual conversation. Often shows causation or a logical connection between statements.","target_language_example":"그러니까 우리 함께 가는 게 어때?","native_language_example":"So, how about we go together?"}]
["그러면",{"thoughts":"'그러면' is a Korean compound word derived from '그렇게 하면,' commonly used to indicate a conditional conjunction in everyday conversation.","target_language_multi_word_term":"그러면","meaning":"'then' or 'in that case'.","additional_notes":"Often used to transition between thoughts or actions based on a condition being met.","target_language_example":"지금 비가 와요. 그러면 우산을 가져가세요.","native_language_example":"It's raining now. Then, take an umbrella."}]
["그런",{"thoughts":"The term '그런' is often used in Korean to describe a state, characteristic, or manner of something being 'like that' or 'such'. It is frequently combined with a noun to form a descriptive phrase.","target_language_multi_word_term":"그런","meaning":"'like that' or 'such'.","additional_notes":"This term is descriptive and is used to compare something to a previously mentioned situation or characteristic. It often precedes a noun in a sentence.","target_language_example":"그런 경우에는 조심해야 해요.","native_language_example":"In such cases, you should be careful."}]
["그런 거",{"thoughts":"\"그런 거\" can be translated to mean \"such a thing\" or \"things like that\" in English. It is often used to refer to objects, situations, or abstract concepts that have been previously mentioned or are understood in context. It can also convey a dismissive tone when referring to something trivial or unimportant.","target_language_multi_word_term":"그런 거","meaning":"'such a thing' or 'things like that'.","additional_notes":"This phrase can reflect a sense of familiarity or common understanding, as well as dismissal depending on context. It is often used in informal spoken Korean.","target_language_example":"그런 거 신경 쓰지 마.","native_language_example":"Don't worry about things like that."}]
["그런 것",{"thoughts":"The term '그런 것' is a Korean expression used to refer to something of a similar type or such a thing. It is useful in conversations to refer back to something previously discussed or to speak in general terms.","target_language_multi_word_term":"그런 것","meaning":"'such a thing' or 'something like that'.","additional_notes":"Frequently used to refer to objects, situations, or abstract ideas that are similar to what has been previously mentioned.","target_language_example":"나는 그런 것을 좋아하지 않아.","native_language_example":"I don't like things like that."}]
["그런 말을",{"thoughts":"The phrase '그런 말을' is used to refer to 'such words' or 'such a statement' and is often used to express a reaction or response to something someone has said.","target_language_multi_word_term":"그런 말을","meaning":"'such words' or 'such a statement'.","additional_notes":"This phrase is often used in responses or reactions to emphasize the nature or impact of what has been said. It's common in conversational Korean, particularly when expressing disbelief, disagreement, or concern regarding what was spoken.","target_language_example":"왜 그런 말을 했어요?","native_language_example":"Why did you say such a thing?"}]
["그런 식으로",{"thoughts":"The Korean phrase '그런 식으로' is used to describe doing something in a particular way or manner.","target_language_multi_word_term":"그런 식으로","meaning":"'in such a way' or 'like that'.","additional_notes":"Typically used to describe how something is done or to suggest that someone continue doing something in a similar manner. It can often imply approval or disapproval based on context.","target_language_example":"그런 식으로 계속하세요.","native_language_example":"Continue doing it like that."}]
["그런 짓을",{"thoughts":"'그런 짓을' is a Korean phrase implying actions or behaviors that are undesirable or inappropriate in context, often reflecting criticism. The word \"짓\" means \"act\" or \"deed\" with a negative connotation depending on context.","target_language_multi_word_term":"그런 짓을","meaning":"'such behavior' or 'such an act'.","additional_notes":"Commonly used to express disapproval or reprimand, often emphasizing that the action is inappropriate or socially unacceptable.","target_language_example":"그런 짓을 하지 마세요.","native_language_example":"Don't do such things."}]
["그런데",{"thoughts":"The term '그런데' is commonly used in conversation to connect sentences or introduce contrasting or interesting information. It's akin to 'but', 'however', or 'by the way' in English, often indicating a shift in topic or adding additional information.","target_language_multi_word_term":"그런데","meaning":"'but', 'however', or 'by the way'.","additional_notes":"'그런데' is a versatile connector used commonly in daily conversation to transition between ideas, often indicating a shift in topic or presenting a contrast.","target_language_example":"날씨가 추워요. 그런데, 내일은 따뜻할 거예요.","native_language_example":"The weather is cold. However, it will be warm tomorrow."}]
["그렇게",{"thoughts":"The term '그렇게' in Korean is used to refer to something that was mentioned previously or in that manner or way. It is versatile and can adapt to various contexts depending on what is being described.","target_language_multi_word_term":"그렇게","meaning":"'like that', 'in that way', or 'so'.","additional_notes":"'그렇게' is used to describe an action or situation in a manner similar to what has been previously mentioned. It is often used in conversation when recalling or relating to a previously described manner, action, or situation.","target_language_example":"그렇게 하면 안 돼요.","native_language_example":"You shouldn't do it like that."}]
["그렇다면",{"thoughts":"'그렇다면' is a conditional or transitional phrase. It combines '그렇다', meaning 'to be so', with '면', which implies a condition ('if'). It's used to infer or conclude something based on a previous situation or statement.","target_language_multi_word_term":"그렇다면","meaning":"\"if that's the case\" or \"in that case\"","additional_notes":"It's often used to introduce a conclusion or decision drawn from preceding information.","target_language_example":"그렇다면 우리는 내일 만날까요?","native_language_example":"If that's the case, should we meet tomorrow?"}]
["그렇지만",{"thoughts":"'그렇지만' is a conjunction used in Korean to express contrast or opposition, similar to 'but' or 'however' in English. This is useful for beginners when they want to connect contrasting ideas or statements.","target_language_multi_word_term":"그렇지만","meaning":"'but' or 'however'.","additional_notes":"It's often used at the beginning of a sentence to indicate a contrast to a previous statement. Similar to '그러나', but less formal and more commonly used in spoken Korean.","target_language_example":"저는 피자를 좋아해요. 그렇지만 매일 먹지는 않아요.","native_language_example":"I like pizza. However, I don't eat it every day."}]
["그리",{"thoughts":"'그리' is a Korean adverb meaning 'so' or 'that kind of'. It is often used to express a state or degree to which something is the case. It's useful for beginners who are learning to express details about the extent or degree of a subject.","target_language_multi_word_term":"그리","meaning":"'so' or 'to that extent'.","additional_notes":"Typically used to express the degree to which something happens or is the case. It helps in forming phrases that specify the manner or extent of an action or trait.","target_language_example":"그리 어렵지 않아요.","native_language_example":"It's not that difficult."}]
["그리고 나서",{"thoughts":"The term '그리고 나서' is used in Korean to indicate a sequence of actions, similar to 'and then' or 'after that' in English. It connects two actions or sentences, showing that one event follows another. This is useful for storytelling or describing chronological sequences, which is likely relevant for beginners trying to form sentences longer than one clause.","target_language_multi_word_term":"그리고 나서","meaning":"'and then' or 'after that'.","additional_notes":"Used to indicate a sequence, often in narrative contexts or procedural instructions to show the next step or action.","target_language_example":"저녁을 먹고 그리고 나서 영화를 봤어요.","native_language_example":"I had dinner and then watched a movie."}]
["그보다",{"thoughts":"The Korean phrase '그보다' is often used in conversational language to shift the topic or bring more focus or importance to something compared to what was previously discussed.","target_language_multi_word_term":"그보다","meaning":"'more than that' or 'besides that'.","additional_notes":"It's used to introduce a new topic or a point of comparison that is considered more significant.","target_language_example":"그보다 중요한 이야기가 있어요.","native_language_example":"Besides that, there is something more important to talk about."}]
["금방",{"thoughts":"'금방' is a Korean adverb that can mean either something happening very soon or just happened, depending on the context. It's a term frequently used in daily conversations.","target_language_multi_word_term":"금방","meaning":"'soon' or 'just now'.","additional_notes":"The meaning of '금방' depends on the verb tense used. In future contexts, it means 'soon.' In past contexts, it means 'just now.'","target_language_example":"그는 금방 올 거야.","native_language_example":"He will come soon."}]
["기도",{"thoughts":"'기도' in Korean refers to 'prayer' or 'to pray', often used in religious or spiritual contexts.","target_language_multi_word_term":"기도","meaning":"'prayer' or 'to pray'.","additional_notes":"Commonly used in religious practices or when expressing hope or making wishes. It can refer to the act of praying or a specific prayer.","target_language_example":"그녀는 가족을 위해 매일 기도합니다.","native_language_example":"She prays for her family every day."}]
["까지",{"thoughts":"'까지' is a Korean postposition commonly used to indicate a temporal or spatial endpoint, similar to the English word 'until' or 'to'.","target_language_multi_word_term":"까지","meaning":"'until', 'to', or 'as far as'.","additional_notes":"Used to express a limit or a point in time or space until which an action or condition continues.","target_language_example":"저는 오후 5시까지 일해요.","native_language_example":"I work until 5 PM."}]
["꼭",{"thoughts":"'꼭' is a versatile Korean adverb often used to stress necessity or certainty. It's frequently used in everyday conversations, making it a useful term for beginners to learn.","target_language_multi_word_term":"꼭","meaning":"'surely', 'certainly', or 'definitely'.","additional_notes":"Used to express necessity or certainty, often in requests, promises, or instructions. It can also mean 'exactly', enhancing expressions of precision.","target_language_example":"내일 꼭 와.","native_language_example":"Definitely come tomorrow."}]
["꽤",{"thoughts":"The term '꽤' in Korean is often used as an adverb to intensify or quantify a statement, similar to 'quite', 'fairly', or 'rather' in English. It's a useful word for describing something with more emphasis or for indicating a moderate degree of intensity. Beginners learning Korean may find this term particularly helpful for adding nuance to their sentences.","target_language_multi_word_term":"꽤","meaning":"'quite', 'fairly', or 'rather'.","additional_notes":"Used to intensify or indicate the degree of something. It often precedes adjectives or verbs to give them a moderate or considerable emphasis.","target_language_example":"그녀는 꽤 유명해요.","native_language_example":"She is quite famous."}]
["꽤나",{"thoughts":"'꽤나' is a Korean adverb used to emphasize a significant amount or degree, similar to 'quite', 'fairly', or 'pretty' in English. Beginner learners might encounter it in conversational contexts.","target_language_multi_word_term":"꽤나","meaning":"'quite', 'fairly', or 'pretty'.","additional_notes":"Use this adverb to emphasize the extent or degree of something, often in a positive manner.","target_language_example":"그 영화는 꽤나 재미있었어요.","native_language_example":"The movie was quite interesting."}]
["끝내",{"thoughts":"The term '끝내' is an adverb in Korean that signifies the idea of something being finalized or eventually reaching a conclusion. It emphasizes completion or the finality of an action.","target_language_multi_word_term":"끝내","meaning":"'in the end' or 'finally'.","additional_notes":"Used to indicate the fruition of a prolonged process or outcome, often after overcoming difficulties or delays.","target_language_example":"그는 끝내 목표를 달성했다.","native_language_example":"He finally achieved his goal."}]
["나면",{"thoughts":"The Korean word '나면' is derived from '나' meaning 'if' and the conditional ending '면'. It is used to express conditions or hypothetical situations in Korean.","target_language_multi_word_term":"나면","meaning":"'if' or 'when'.","additional_notes":"'나면' is used to talk about a condition that, if fulfilled, will lead to a certain result. It is generally used in the form of a conditional sentence.","target_language_example":"비가 오면 우산을 써요.","native_language_example":"If it rains, use an umbrella."}]
["나요",{"thoughts":"'나요' is a Korean verb ending often used to ask questions gently or politely, especially in informal settings.","target_language_multi_word_term":"나요","meaning":"'Do/Does...' or 'Is/Are...?' in questions.","additional_notes":"'나요' is typically attached to verb stems to form questions that are softer, more polite, and sometimes indicate a sense of curiosity or surprise. It's commonly used in casual conversation.","target_language_example":"밥 먹었나요?","native_language_example":"Did you eat?"}]
["나중에",{"thoughts":"The Korean term '나중에' is an adverb used to refer to something that will happen later or at a future time. It's common in everyday conversation, especially when making informal plans or promising to do something later.","target_language_multi_word_term":"나중에","meaning":"later","additional_notes":"'나중에' is often used in casual conversations to suggest doing something at a later time. It's informal, perfect for making future plans with friends or family.","target_language_example":"나중에 보자.","native_language_example":"See you later."}]
["내일",{"thoughts":"The Korean term '내일' is a commonly used word meaning 'tomorrow'. It is a straightforward temporal term which beginners would often encounter as they learn to talk about future plans or events.","target_language_multi_word_term":"내일","meaning":"tomorrow.","additional_notes":"Used to refer to the day after today. Commonly appears in conversation when discussing future activities or plans.","target_language_example":"내일 학교에 갈 거예요.","native_language_example":"I will go to school tomorrow."}]
["너무",{"thoughts":"'너무' is a Korean adverb that is primarily used to express an excessive degree or quantity, often in a negative connotation but can also be used in a positive way in casual speech.","target_language_multi_word_term":"너무","meaning":"'too' or 'very'.","additional_notes":"In formal contexts, '너무' usually means 'too much' with a negative implication. However, in colloquial Korean, it can be used to mean 'very', which might not indicate negativity. It is often used to amplify statements.","target_language_example":"이 음식이 너무 맛있어요.","native_language_example":"This food is very delicious."}]
["너무나",{"thoughts":"'너무나' is an intensifier in Korean, similar to 'too' or 'very' in English, often used to emphasize the degree of an adjective or feeling.","target_language_multi_word_term":"너무나","meaning":"'so', 'too', or 'very'.","additional_notes":"Used to intensify the adjective or verb it precedes, conveying strong emotions or impressions.","target_language_example":"너무나 아름다운 날씨예요.","native_language_example":"The weather is so beautiful."}]
["누구",{"thoughts":"'누구' is a basic Korean interrogative pronoun used in questions to ask about people. It's essential for forming questions about identity and is one of the first pronouns students learn due to its frequency and simplicity.","target_language_multi_word_term":"누구","meaning":"'who'.","additional_notes":"Used to ask about the identity of a person. It is commonly paired with verbs or other sentence structures to ask questions.","target_language_example":"이 사람은 누구예요?","native_language_example":"Who is this person?"}]
["누구나",{"thoughts":"The term '누구나' is a common Korean phrase that refers to people generally or universally, applicable to everyone in some context. It's often used to express that something applies to every individual.","target_language_multi_word_term":"누구나","meaning":"anyone or everyone","additional_notes":"It's used to make statements or assertions that apply to all people without exception. Commonly found in sentences where a general truth or inclusive statement is being made.","target_language_example":"이 도전은 누구나 할 수 있어요.","native_language_example":"Anyone can do this challenge."}]
["누구든",{"thoughts":"The Korean term '누구든' is used to express inclusiveness or universality, similar to 'anyone' or 'whoever' in English. This is relevant for beginner learners to understand how to refer to any person in general contexts.","target_language_multi_word_term":"누구든","meaning":"'anyone' or 'whoever'.","additional_notes":"It indicates that the statement applies to all people or that any person can be involved. It is often used to emphasize the universality of a statement.","target_language_example":"누구든 할 수 있어요.","native_language_example":"Anyone can do it."}]
["누구라도",{"thoughts":"The Korean term '누구라도' can be translated as 'anyone', often used to refer to an unspecified person. For beginner learners, it's relevant to note that '누구' means 'who' and combining it with '라도' offers the meaning of an indefinite person or any person.","target_language_multi_word_term":"누구라도","meaning":"'anyone' or 'whoever'.","additional_notes":"It is used to refer to any person regardless of who they are or any unknown individual. It implies that the statement applies to any and all people indiscriminately.","target_language_example":"누구라도 할 수 있어요.","native_language_example":"Anyone can do it."}]
["는 것 같다",{"thoughts":"The Korean phrase '는 것 같다' is often used to express conjecture or opinion about something, similar to saying 'it seems that' or 'I think that' in English.","target_language_multi_word_term":"는 것 같다","meaning":"'seems like' or 'it appears that'.","additional_notes":"Used to express uncertainty or to soften a statement. It's often followed by a verb or adjective stem to indicate what it seems like or appears to be the case.","target_language_example":"비가 오는 것 같아요.","native_language_example":"It seems like it's raining."}]
["늘",{"thoughts":"The term '늘' in Korean is an adverb that is commonly used to indicate frequency or consistency. It's relevant for beginners to recognize this word as it appears in everyday conversation and texts to describe habitual actions or routines.","target_language_multi_word_term":"늘","meaning":"'always' or 'constantly'.","additional_notes":"This adverb is often used to describe actions or situations that occur all the time or are continuously happening. It's a useful word for expressing routine actions or ongoing states.","target_language_example":"그는 늘 같은 시간에 운동한다.","native_language_example":"He always exercises at the same time."}]
["다",{"thoughts":"\"다\" is a very common Korean word that usually means \"all\" or \"everything.\" It can function as an adverb or pronoun, placed before verbs or adjectives to show totality. (It also has a separate use as a formal sentence ending, but beginners typically first meet it in the meaning of \"all/every.\")","target_language_multi_word_term":"다","meaning":"'all; everything'.","additional_notes":"Placed before verbs, adjectives, or nouns with particles to indicate the entirety of something.\n• 다 + verb/adjective: shows something is done/true for everything (“다 먹다” = eat it all).\n• 다 + noun+particle: can emphasize the whole group (“다 학생이에요” = They are all students).","target_language_example":"나는 다 먹었어요.","native_language_example":"I ate it all."}]
["다가",{"thoughts":"\"다가\" is a multi-functional Korean particle often used as a suffix in various grammatical constructions. It is commonly used to indicate that one action was interrupted by another, marking a change in state or condition. It can also be used to express proximity or progression towards something in both physical and abstract contexts.","target_language_multi_word_term":"다가","meaning":"while doing","additional_notes":"Used to indicate a transition or interruption in action. Often follows verbs to show an action that was in progress when it was interrupted by another action.","target_language_example":"길을 걷다가 친구를 만났어요.","native_language_example":"I met a friend while walking on the street."}]
["다르게",{"thoughts":"The term '다르게' translates to 'differently' or 'in a different way'. It's an adverb used to indicate something is not the same as was previously mentioned or generally different.","target_language_multi_word_term":"다르게","meaning":"'differently'.","additional_notes":"Used to describe when something is done in a different manner or way compared to another thing or usual method.","target_language_example":"저 사람은 다르게 생각해요.","native_language_example":"That person thinks differently."}]
["다른",{"thoughts":"The Korean term '다른' is an adjective meaning 'different' or 'other'. It's often used to compare things or indicate an alternative.","target_language_multi_word_term":"다른","meaning":"'different' or 'other'.","additional_notes":"Used to describe something that is not the same as something else, it commonly appears before nouns to modify them.","target_language_example":"다른 영화 보고 싶어요.","native_language_example":"I want to watch a different movie."}]
["다른 거",{"thoughts":"The Korean term '다른 거' is often used in conversation to refer to something different or another thing. It combines '다른', meaning 'different', with '거', a form of '것', meaning 'thing'. This phrase is versatile in everyday speech, especially when making choices or comparisons.","target_language_multi_word_term":"다른 거","meaning":"'another thing' or 'something different'.","additional_notes":"Often used when talking about alternatives or preferences. Can be used in both formal and informal contexts, but the ending of the sentence should adjust accordingly to maintain the appropriate level of politeness.","target_language_example":"다른 거 먹고 싶어요?","native_language_example":"Do you want to eat something else?"}]
["다른 사람",{"thoughts":"\"다른 사람\" is a useful phrase for beginners to describe other people or someone else in contrast to themselves or a specific person. It can be used in various contexts such as social interactions or when describing people indirectly.","target_language_multi_word_term":"다른 사람","meaning":"'another person' or 'someone else'.","additional_notes":"This term is used to refer to people other than the person being discussed, or oneself. It is often used to draw a contrast between two or more people.","target_language_example":"다른 사람은 어떻게 생각하나요?","native_language_example":"What do other people think?"}]
["다시",{"thoughts":"'다시' is a Korean adverb commonly used to mean 'again' or 'once more'. It indicates the repetition of an action or event.","target_language_multi_word_term":"다시","meaning":"'again' or 'once more'.","additional_notes":"Commonly used to express doing something another time, or to emphasize repetition of actions or events. Often used in daily conversation.","target_language_example":"다시 한 번 해 볼까요?","native_language_example":"Shall we try again?"}]
["다시 한 번",{"thoughts":"The phrase '다시 한 번' is commonly used to ask for something to be repeated or done again. It's a basic expression useful in everyday conversations, especially for learners who might need to hear something more than once.","target_language_multi_word_term":"다시 한 번","meaning":"once again or one more time","additional_notes":"Used to politely request a repetition. It can be used in various contexts, such as asking someone to repeat what they said or to try something again.","target_language_example":"말씀해 주신 내용을 다시 한 번 설명해 주시겠어요?","native_language_example":"Could you explain what you said once again?"}]
["다시 한번",{"thoughts":"The Korean term '다시 한번' means 'once again' or 'one more time'. It is often used when repeating an action or asking someone to repeat something. This is relevant to beginners who might need to ask for repetition in conversations for better understanding.","target_language_multi_word_term":"다시 한번","meaning":"'once again' or 'one more time'.","additional_notes":"Commonly used to request repetition of an action or statement.","target_language_example":"다시 한번 말해 주세요.","native_language_example":"Please say it one more time."}]
["당장",{"thoughts":"'당장' is a Korean adverb used frequently in everyday conversation, often to convey urgency or immediacy. It can imply both positive and negative connotations depending on the context.","target_language_multi_word_term":"당장","meaning":"'immediately' or 'right now'.","additional_notes":"This term is used to express urgency and can contextualize actions that need to be done without delay. It can sometimes convey a sense of command or urgency in situations that need immediate attention.","target_language_example":"당장 나가세요.","native_language_example":"Leave immediately."}]
["대단히",{"thoughts":"대단히 is an adverb commonly used to express a high degree of something, often implying intensity or emphasization.","target_language_multi_word_term":"대단히","meaning":"'extremely', 'very', or 'greatly'.","additional_notes":"It's typically used to enhance the intensity of adjectives or verbs, often in formal or polite contexts. Commonly used in customer service or formal speeches.","target_language_example":"대단히 감사합니다.","native_language_example":"Thank you very much."}]
["대부분",{"thoughts":"대부분 is often used to describe the majority or main part of something. It's a useful term for expressing generalizations or dominant trends, which can be very helpful for beginner language learners to understand and use in conversations.","target_language_multi_word_term":"대부분","meaning":"'most' or 'the majority'.","additional_notes":"대부분 is used to talk about the larger part of a group or quantity, such as most people, most of the time, etc.","target_language_example":"대부분의 사람들이 그 영화를 좋아했어요.","native_language_example":"Most people liked the movie."}]
["대부분은",{"thoughts":"The term '대부분은' is a Korean expression typically used to refer to the majority or most of something. It is useful for beginner learners as it helps in describing commonalities or general trends, which are basic needs in everyday conversation.","target_language_multi_word_term":"대부분은","meaning":"most of it; mostly.","additional_notes":"This term is often used to describe general trends or common occurrences. It can be useful when talking about preferences, habits, or general facts.","target_language_example":"대부분은 사람들이 여름을 좋아해요.","native_language_example":"Most people like summer."}]
["대부분의",{"thoughts":"‘대부분의’ is a Korean expression that means 'most of' and it's used to describe a large proportion of something. This is useful for beginner learners when they want to talk about quantities or generalize about groups of things or people.","target_language_multi_word_term":"대부분의","meaning":"'most of'.","additional_notes":"Used to refer to a significant portion of a group or collection. It can apply to countable and uncountable nouns.","target_language_example":"대부분의 사람들이 이 영화를 좋아해요.","native_language_example":"Most of the people like this movie."}]
["대신에",{"thoughts":"The Korean term '대신에' is commonly used to express the concept of 'instead' or 'in place of.' It is versatile and can be applied in various contexts to indicate a substitution or alternative. For beginners, it's useful to know how to use it when talking about choices or preferences.","target_language_multi_word_term":"대신에","meaning":"'instead' or 'in place of'.","additional_notes":"It is used to indicate substituting one thing for another or choosing a different option. Often used when discussing decisions or alternatives.","target_language_example":"우리는 피자 대신에 파스타를 먹을 거예요.","native_language_example":"We will eat pasta instead of pizza."}]
["대한",{"thoughts":"\"대한\" is a Korean term commonly used to mean \"regarding\" or \"about,\" often found in contexts discussing a subject or topic in detail. It's a formal term that often appears in written or official Korean language settings.","target_language_multi_word_term":"대한","meaning":"'regarding', 'about'.","additional_notes":"Typically used in formal contexts to discuss a specific subject or topic. It can be found in official documents, news articles, or formal communications.","target_language_example":"이 책은 환경문제에 대한 정보가 많습니다.","native_language_example":"This book has a lot of information about environmental issues."}]
["대해",{"thoughts":"The term '대해' is used in Korean to mean 'about', often used when discussing or explaining a subject. It's a preposition used to indicate the topic of conversation or consideration.","target_language_multi_word_term":"대해","meaning":"'about' or 'concerning'.","additional_notes":"Used to specify the subject being discussed or considered. Common in formal and written contexts.","target_language_example":"저는 한국 역사에 대해 공부하고 있습니다.","native_language_example":"I am studying about Korean history."}]
["대해서",{"thoughts":"'대해서' is a Korean postposition used to indicate a subject of discussion or consideration, similar to 'about' or 'regarding' in English. It's often used when giving explanations or opinions.","target_language_multi_word_term":"대해서","meaning":"'about' or 'regarding'.","additional_notes":"Used to indicate the topic or subject of what is being discussed or considered. Common in conversations and writings where opinions, explanations, or discussions are presented.","target_language_example":"그 책에 대해서 어떻게 생각해요?","native_language_example":"What do you think about that book?"}]
["더",{"thoughts":"\"더\" is an adverb meaning \"more\"; beginners will meet it often with adjectives, adverbs, verbs to ask for a greater degree or additional amount.","target_language_multi_word_term":"더","meaning":"more; to a greater extent","additional_notes":"Placed before adjectives, adverbs, or verbs to intensify or request an additional amount.","target_language_example":"물을 더 주세요.","native_language_example":"Please give me more water."}]
["더 가까이",{"thoughts":"The Korean phrase '더 가까이' translates to 'closer' in English, often used to request or describe moving nearer. This phrase can be useful for expressing a desire to physically reduce the distance between objects, people, or images. It is practical in various everyday situations where proximity is important.","target_language_multi_word_term":"더 가까이","meaning":"'closer'.","additional_notes":"Used to indicate a desire or instruction for proximity or reduced distance.","target_language_example":"더 가까이 와 주세요.","native_language_example":"Please come closer."}]
["더 높이",{"thoughts":"The term '더 높이' consists of '더' meaning 'more' and '높이' meaning 'high' or 'higher.' It's often used when describing actions that require more height or elevation, such as jumping or reaching.","target_language_multi_word_term":"더 높이","meaning":"'higher' or 'more elevated'.","additional_notes":"Often used in contexts requiring increased height or elevation, such as sports or reaching tasks.","target_language_example":"공을 더 높이 던져 주세요.","native_language_example":"Please throw the ball higher."}]
["더 많이",{"thoughts":"The phrase '더 많이' means 'more' and is often used when indicating a larger amount or extent of something. It's an intensifier in comparative contexts.","target_language_multi_word_term":"더 많이","meaning":"'more'.","additional_notes":"Used to express an increase in quantity or degree. It can modify verbs and adjectives to emphasize a greater amount or extent.","target_language_example":"저는 더 많이 운동하고 싶어요.","native_language_example":"I want to exercise more."}]
["더 빨리",{"thoughts":"The term '더 빨리' is commonly used in Korean to express the desire for something to be done or happen faster.","target_language_multi_word_term":"더 빨리","meaning":"'faster' or 'more quickly'.","additional_notes":"'더' means 'more' and '빨리' means 'quickly', so together they express increasing speed or urgency in an action.","target_language_example":"좀 더 빨리 달려주세요.","native_language_example":"Please run a bit faster."}]
["더 이상",{"thoughts":"The Korean phrase '더 이상' is commonly used to mean 'no longer' or 'anymore'. It's often used to express that something has ceased or is not in effect from a certain point onward.","target_language_multi_word_term":"더 이상","meaning":"'no longer' or 'anymore'.","additional_notes":"Used to indicate that a previous state, condition, or action has stopped or changed. Often followed by verbs denoting an action.","target_language_example":"나는 더 이상 그 영화를 보고 싶지 않아.","native_language_example":"I no longer want to watch that movie."}]
["더 이상은",{"thoughts":"'더 이상은' is a Korean phrase used to express a limit or a cessation of something, typically indicating that one cannot or will not continue any further.","target_language_multi_word_term":"더 이상은","meaning":"'no more' or 'no longer'.","additional_notes":"It is used to indicate that something is at its limit, either in quantity or duration, and cannot be extended or tolerated further.","target_language_example":"더 이상은 참을 수 없어.","native_language_example":"I can't endure it any longer."}]
["더는",{"thoughts":"The term '더는' is used to indicate something is 'no longer' or 'not anymore' in Korean. This is a relevant concept for beginner learners as it helps in communicating changes in states or conditions, such as stopping an activity or drawing a line on past actions.","target_language_multi_word_term":"더는","meaning":"'no longer' or 'not anymore'.","additional_notes":"This term emphasizes the discontinuation of an action. It often appears in negative sentences to highlight a change in state.","target_language_example":"나는 더는 그를 기다리지 않아요.","native_language_example":"I am no longer waiting for him."}]
["더욱",{"thoughts":"'더욱' is a Korean adverb used to intensify adjectives or verbs, often meaning 'even more' or 'more so'. It's a common term beginners might encounter when increasing their understanding of comparative states.","target_language_multi_word_term":"더욱","meaning":"'more' or 'even more'.","additional_notes":"Used to enhance or intensify the degree of an adjective or verb, indicating a higher level of an action or quality.","target_language_example":"이번 여름은 더욱 더웠다.","native_language_example":"This summer was even hotter."}]
["덕분에",{"thoughts":"덕분에 is a phrase used to express gratitude for someone's help or contribution to a situation. It highlights the cause of a positive outcome due to someone's support or action.","target_language_multi_word_term":"덕분에","meaning":"'thanks to' or 'because of'.","additional_notes":"덕분에 is commonly used to express gratitude or acknowledge someone's positive influence or help in achieving a desired result. It's a polite way to show appreciation.","target_language_example":"당신 덕분에 제가 성공했어요.","native_language_example":"Thanks to you, I succeeded."}]
["동시에",{"thoughts":"The phrase '동시에' is useful for beginner learners since it commonly appears in conversations and texts to indicate concurrent actions or events. It's a practical term for describing multitasking or simultaneous occurrences.","target_language_multi_word_term":"동시에","meaning":"at the same time","additional_notes":"Used to describe actions or events that are occurring simultaneously. It is often used to express multitasking or when multiple things happen together.","target_language_example":"우리 동시에 시작할까요?","native_language_example":"Shall we start at the same time?"}]
["두 번째",{"thoughts":"The Korean phrase '두 번째' means 'second' and is used to denote order or sequence. It is a basic structural term that beginners can find useful for describing position or rank in a sequence.","target_language_multi_word_term":"두 번째","meaning":"'second'.","additional_notes":"Used to indicate the ordinal position of an item in a sequence, such as time, place, or rank. It combines the native Korean ordinal prefix '두' (second) with '번째', a suffix used for ordinals.","target_language_example":"두 번째 줄에서 책을 찾았어요.","native_language_example":"I found the book on the second shelf."}]
["뒤에",{"thoughts":"'뒤에' is a Korean expression used to indicate time or physical position meaning 'after' or 'behind'. It is useful for learners to understand sequences in time or spatial arrangements.","target_language_multi_word_term":"뒤에","meaning":"after, behind","additional_notes":"Can refer to time, as in 'after an event', or spatially, as in 'behind something'. Often used to describe sequences or physical positions.","target_language_example":"회의가 끝난 뒤에 저녁을 먹을 거야.","native_language_example":"We will eat dinner after the meeting."}]
["드디어",{"thoughts":"드디어 is a Korean adverb often used to express relief or the resolution of a long-awaited event. It's similar to saying 'finally' in English when describing something that has taken a long time or effort to achieve.","target_language_multi_word_term":"드디어","meaning":"finally, at last.","additional_notes":"Used to convey that a desired or expected event has occurred after a delay or a lengthy wait.","target_language_example":"드디어 시험이 끝났어요.","native_language_example":"The exam is finally over."}]
["따라",{"thoughts":"In Korean, '따라' is used to indicate 'according to' or 'following'. It is often used in contexts where events, actions, or opinions depend on something else.","target_language_multi_word_term":"따라","meaning":"'according to' or 'following'.","additional_notes":"Used to express dependency or variations based on different factors. It can also indicate that something is being followed or emulated.","target_language_example":"그의 말에 따라 우리는 계획을 바꿨다.","native_language_example":"According to his words, we changed our plans."}]
["따라서",{"thoughts":"'따라서' is commonly used in Korean to express causality or reasoning, similar to 'therefore' or 'thus' in English.","target_language_multi_word_term":"따라서","meaning":"'therefore' or 'thus'.","additional_notes":"It is used to indicate a logical conclusion from previously stated information.","target_language_example":"그는 열심히 공부했다. 따라서 시험에 합격했다.","native_language_example":"He studied hard. Therefore, he passed the exam."}]
["딱",{"thoughts":"'Ddakk' is an onomatopoeic Korean adverb that conveys something done precisely, sharply, or accurately. It's used quite flexibly, often in expressions that indicate exactness or hitting a point perfectly.","target_language_multi_word_term":"딱","meaning":"'exactly' or 'precisely'.","additional_notes":"Can be used to express doing something at the right time or in the exact amount, or figuratively to describe hitting the nail on the head.","target_language_example":"딱 맞아요!","native_language_example":"It fits perfectly!"}]
["때때로",{"thoughts":"The Korean term '때때로' means 'sometimes' and is used to describe actions or events that occur infrequently or occasionally.","target_language_multi_word_term":"때때로","meaning":"sometimes","additional_notes":"'때때로' is an adverb used to describe actions or occurrences that happen occasionally or not consistently.","target_language_example":"나는 때때로 공원에서 산책을 해요.","native_language_example":"I sometimes take a walk in the park."}]
["때로는",{"thoughts":"때로는 is a Korean adverb usually interpreted as 'sometimes'. This word can be used to express the concept of occasionally or every now and then, and it offers variety in expressing frequency of actions or events.","target_language_multi_word_term":"때로는","meaning":"'sometimes'.","additional_notes":"때로는 can be used to express the idea of something happening occasionally or sporadically. It's a versatile word often found in both spoken and written Korean.","target_language_example":"저는 때로는 혼자 걷는 것을 좋아해요.","native_language_example":"I sometimes like walking alone."}]
["때문에",{"thoughts":"The Korean term '때문에' is used to indicate cause or reason. It is equivalent to 'because of' or 'due to' in English. It often comes after a noun or phrase indicating the reason for something.","target_language_multi_word_term":"때문에","meaning":"'because of' or 'due to'.","additional_notes":"It follows a noun or noun phrase to explain the reason or cause of an action or situation. Useful in both written and spoken Korean when explaining causation.","target_language_example":"비가 많이 와서 길이 막혔어요. 그래서 늦었어요. 비 때문에 늦었어요.","native_language_example":"It rained a lot, so the road was blocked. That's why I was late. I was late because of the rain."}]
["또 다른",{"thoughts":"The term '또 다른' is often used in Korean to indicate another or an additional item, similar to saying 'another' or 'yet another' in English. It can be used when talking about additional instances, examples, or items within a certain context.","target_language_multi_word_term":"또 다른","meaning":"'another' or 'yet another'.","additional_notes":"Used to refer to a new, additional instance or example of something previously mentioned or understood from context.","target_language_example":"또 다른 질문이 있습니까?","native_language_example":"Do you have another question?"}]
["또다시",{"thoughts":"The term '또다시' is commonly used in Korean to refer to something happening again or once more. It emphasizes repetition.","target_language_multi_word_term":"또다시","meaning":"'again' or 'once more'.","additional_notes":"Used to indicate that an action or event is occurring again. It adds emphasis to the repetition or recurrence of the action.","target_language_example":"그들은 또다시 만났다.","native_language_example":"They met again."}]
["똑같은",{"thoughts":"The term '똑같은' is an adjective used to indicate exact similarity between objects or situations. This concept is relatively straightforward and useful for beginners when making comparisons or expressing sameness.","target_language_multi_word_term":"똑같은","meaning":"'the same' or 'exactly the same'.","additional_notes":"Used to describe two or more things that are identical or indistinguishable in nature.","target_language_example":"우리는 똑같은 옷을 샀어요.","native_language_example":"We bought the same clothes."}]
["똑같이",{"thoughts":"똑같이 is an adverb that means equally or in the same manner. It is commonly used to express the idea that things should be done or treated in an identical or similar way.","target_language_multi_word_term":"똑같이","meaning":"equally or in the same way.","additional_notes":"Often used when comparing actions or treatments to ensure fairness or uniformity.","target_language_example":"모든 학생들은 똑같이 대우받아야 합니다.","native_language_example":"All students should be treated equally."}]
["똑똑히",{"thoughts":"The Korean term '똑똑히' is an adverb derived from '똑똑하다,' which means smart or clever. It is used to describe doing something clearly, correctly, or accurately. This could be useful to learners in contexts involving clarity or correctness.","target_language_multi_word_term":"똑똑히","meaning":"clearly or correctly.","additional_notes":"This adverb is often used to emphasize the clarity or correctness of an action or perception. It can be applied to various situations where precision or clear understanding is important, such as in communication, hearing, or seeing.","target_language_example":"그녀는 문제를 똑똑히 이해했다.","native_language_example":"She understood the problem clearly."}]
["똑바로",{"thoughts":"The Korean term '똑바로' is commonly used to convey the idea of doing something precisely, accurately, or straight. It is often used in instructions or to describe physical orientation or moral correctness, which is relevant for beginners to understand essential commands or directions.","target_language_multi_word_term":"똑바로","meaning":"'straight' or 'correctly'.","additional_notes":"Used to describe both physical directions (like walking or arranging objects) and actions performed in a precise or proper manner.","target_language_example":"똑바로 앉으세요.","native_language_example":"Please sit up straight."}]
["라고",{"thoughts":"'라고' is a Korean term used as a particle to mark direct speech or quotations. It is used to say 'that' or 'as'. It is often paired with verbs of saying such as 말하다 (to say) or 생각하다 (to think).","target_language_multi_word_term":"라고","meaning":"Used to indicate direct speech or quotation.","additional_notes":"'라고' is part of reported speech in Korean. It often comes after a noun or phrase and is usually followed by verbs like 말하다 ('to say'), 생각하다 ('to think'), etc. It functions similarly to 'quote' in English, marking what someone said or thought.","target_language_example":"그는 나에게 안녕이라고 말했다.","native_language_example":"He said 'hello' to me."}]
["마저",{"thoughts":"The term '마저' in Korean is an adverb that can be used to indicate continuation or completion, similar to 'even' or 'all' in certain contexts. It adds emphasis to the extent or totality of an action or state. This use can highlight unexpected or noteworthy situations.","target_language_multi_word_term":"마저","meaning":"'even' or 'all'.","additional_notes":"Used to emphasize the extent or totality of an action or situation, often indicating the inclusion of the last or least expected item in a series.","target_language_example":"그는 숙제를 다 하고 마저 책을 읽었다.","native_language_example":"He finished all his homework and even read a book."}]
["마찬가지",{"thoughts":"'마찬가지' is a Korean phrase indicating equality or sameness, often used to compare or indicate similar conditions or situations.","target_language_multi_word_term":"마찬가지","meaning":"'the same', 'likewise', or 'similarly'.","additional_notes":"Used when expressing that two things, situations, or conditions are alike or equivalent. Common in everyday conversation to acknowledge similarity.","target_language_example":"저도 마찬가지예요.","native_language_example":"I'm the same way too."}]
["마침내",{"thoughts":"'마침내' is a Korean adverb used to convey the idea of 'finally' or 'at last'. This phrase is useful for expressing the culmination of a process or event after some duration or effort.","target_language_multi_word_term":"마침내","meaning":"'finally', 'at last'.","additional_notes":"Used to express that something anticipated has occurred after waiting or effort, often indicating relief or satisfaction.","target_language_example":"마침내 비가 그쳤다.","native_language_example":"The rain finally stopped."}]
["막",{"thoughts":"The term '막' is a versatile Korean word used in various contexts to convey actions done roughly, just now, at random, or carelessly. It is often used as an adverb.","target_language_multi_word_term":"막","meaning":"'just' or 'just now'; 'carelessly'.","additional_notes":"This word can indicate actions done without particular care or thought, or refer to something that happened very recently. It's commonly used in casual speech.","target_language_example":"그는 막 도착했어요.","native_language_example":"He just arrived."}]
["만",{"thoughts":"The term '만' is a particle in Korean used to indicate exclusivity, commonly meaning 'only' or 'just'. It attaches to nouns or pronouns to highlight that they are the exclusive focus of the sentence.","target_language_multi_word_term":"만","meaning":"'only' or 'just'.","additional_notes":"Use '만' to emphasize exclusivity in a sentence. It can be attached directly to nouns without any space.","target_language_example":"저는 물만 마셔요.","native_language_example":"I only drink water."}]
["만약에",{"thoughts":"'만약에' is a common Korean conjunction used to introduce hypothetical or conditional situations. It's equivalent to 'if' or 'in case' in English.","target_language_multi_word_term":"만약에","meaning":"'if' or 'in case'.","additional_notes":"It is often used to start a sentence or clause that presents a condition, emphasizing hypothetical situations.","target_language_example":"만약에 비가 오면 우리는 집에 있을 거예요.","native_language_example":"If it rains, we will stay at home."}]
["만큼",{"thoughts":"The term '만큼' is used in Korean to indicate a degree or quantity, similar to how 'as much as' or 'to the extent' is used in English.","target_language_multi_word_term":"만큼","meaning":"'as much as' or 'to the extent'.","additional_notes":"Often used to compare two things of similar degree or quantity. It follows the noun or clause it is comparing, similar to 'like'.","target_language_example":"그는 나만큼 높이 점프할 수 있다.","native_language_example":"He can jump as high as I can."}]
["말고",{"thoughts":"The term '말고' is commonly used in Korean to indicate exclusion or preference for someone/something over another. It's often used in negative constructions to mean 'not A, but B'.","target_language_multi_word_term":"말고","meaning":"'instead of' or 'rather than'.","additional_notes":"Used to offer an alternative or indicate preference, often in the structure 'A 말고 B', meaning 'not A, but B'.","target_language_example":"사과 말고 바나나 주세요.","native_language_example":"Please give me a banana instead of an apple."}]
["말하자면",{"thoughts":"The Korean term '말하자면' is often used to start a sentence where someone wants to explain or clarify something in more detail, similar to saying 'to put it another way' or 'that is to say' in English.","target_language_multi_word_term":"말하자면","meaning":"'to put it another way'.","additional_notes":"Used to clarify or provide further details on a previous statement, often to make the intended meaning more clear to the listener.","target_language_example":"그는 참 친절한 사람이에요, 말하자면 항상 남을 먼저 생각해요.","native_language_example":"He is a very kind person, that is to say, he always thinks of others first."}]
["매년",{"thoughts":"The Korean term '매년' is used to describe something that happens annually, or every year. For beginners, it's useful to know because it can help them discuss or understand topics related to yearly events, routines, or occurrences.","target_language_multi_word_term":"매년","meaning":"every year","additional_notes":"Commonly used to refer to repeated actions or events that occur on a yearly basis, such as celebrations, events, or personal routines.","target_language_example":"매년 크리스마스에 가족과 함께 모여요.","native_language_example":"Every year, we gather with family for Christmas."}]
["매우",{"thoughts":"'매우' is a Korean adverb commonly used to intensify an adjective or verb, similar to 'very' in English. It is often employed for emphasis.","target_language_multi_word_term":"매우","meaning":"'very' or 'extremely'.","additional_notes":"Used to intensify the degree of an adjective or verb. Can be replaced with similar adverbs like '정말' or '아주'.","target_language_example":"이 케이크는 매우 맛있어요.","native_language_example":"This cake is very delicious."}]
["매일",{"thoughts":"The term '매일' is a common Korean phrase used to refer to something that happens daily or each day. This is straightforward and commonly used in everyday conversation, making it very useful for beginners learning Korean.","target_language_multi_word_term":"매일","meaning":"every day","additional_notes":"Often used to describe routines or habitual actions. Can be combined with verbs to express daily activities.","target_language_example":"저는 매일 운동해요.","native_language_example":"I exercise every day."}]
["먼저",{"thoughts":"'먼저' is commonly used to denote sequence, indicating an action happening before another or prioritizing an action or person.","target_language_multi_word_term":"먼저","meaning":"first; before others.","additional_notes":"Often used when mentioning the first step in a sequence of actions or when giving someone precedence.","target_language_example":"제가 먼저 할게요.","native_language_example":"I'll go first."}]
["명확하게",{"thoughts":"The Korean term '명확하게' is an adverb used to describe doing something clearly or distinctly. It is useful for expressing the need for precision or clear understanding in communication.","target_language_multi_word_term":"명확하게","meaning":"'clearly' or 'distinctly'.","additional_notes":"Used when specifying that something should be done in a way that is easy to see or understand. Often used in communication contexts or when giving instructions.","target_language_example":"그 문제를 명확하게 설명해 주세요.","native_language_example":"Please explain the problem clearly."}]
["몇",{"thoughts":"The Korean term '몇' is a question word often used to ask about quantities or numbers, similar to asking 'how many?' or 'how much?' in English. It's a useful term for beginners to learn as it frequently appears in everyday conversations to inquire about numbers or amounts.","target_language_multi_word_term":"몇","meaning":"'how many?' or 'how much?'.","additional_notes":"Used to ask about the number or quantity of something. Often used in questions involving counting or amounts.","target_language_example":"몇 명이 왔어요?","native_language_example":"How many people came?"}]
["몇 가지",{"thoughts":"The term '몇 가지' is commonly used in Korean to indicate an unspecified number of items or types. It combines '몇' (how many) and '가지' (kinds, types), making it useful for expressing 'a few things' in various contexts.","target_language_multi_word_term":"몇 가지","meaning":"'a few things' or 'several types'.","additional_notes":"Commonly used to describe a non-specific number of items, often when the exact number is not important or unknown.","target_language_example":"저는 몇 가지 질문이 있어요.","native_language_example":"I have a few questions."}]
["몇 년",{"thoughts":"The phrase '몇 년' is used in Korean to ask about the number of years, often inquiring about age, duration, or passing time. This is a basic question structure that beginners can frequently encounter.","target_language_multi_word_term":"몇 년","meaning":"'how many years'.","additional_notes":"Used to ask about the quantity of years in questions, such as how old someone is or how long something has lasted.","target_language_example":"그 일은 몇 년 동안 계속됐어요?","native_language_example":"How many years did that job last?"}]
["몇 달",{"thoughts":"The term '몇 달' is a common way to ask or refer to a few months in Korean. It combines '몇', meaning 'how many' or 'several/some', with '달', meaning 'month'. This is useful for beginners when asking about durations of time.","target_language_multi_word_term":"몇 달","meaning":"'how many months' or 'a few months'.","additional_notes":"Used when asking or talking about a span of time measured in months. Can also imply an indefinite amount of months if used in conversation without a specific number following it.","target_language_example":"그는 몇 달 동안 한국에 있었어요.","native_language_example":"He was in Korea for a few months."}]
["몇 주",{"thoughts":"The term '몇 주' is commonly used in Korean to ask about or refer to a number of weeks. It's useful for discussing timeframes and schedules, which are common in everyday conversations.","target_language_multi_word_term":"몇 주","meaning":"'how many weeks'.","additional_notes":"Used to inquire about the duration in weeks. '몇' is a questioning word that asks for a number, and '주' means week.","target_language_example":"이번 프로젝트는 몇 주 동안 진행되나요?","native_language_example":"How many weeks will this project take?"}]
["모든",{"thoughts":"The term '모든' is a frequently used Korean word that beginners should know. It is a determiner that means 'all' or 'every' and is used to refer to the entirety of something. Understanding this term helps learners form sentences about inclusivity or generality.","target_language_multi_word_term":"모든","meaning":"all; every.","additional_notes":"Used to indicate the entirety of objects, concepts, or people without exception. Often followed by a noun to specify the subject that is being referred to collectively.","target_language_example":"모든 사람이 모였어요.","native_language_example":"Everyone has gathered."}]
["모든 걸",{"thoughts":"The Korean term '모든 걸' is a fixed expression commonly seen in everyday language, especially in music and books. It is the casual, shortened form of '모든 것을', meaning 'everything' or 'all things'.","target_language_multi_word_term":"모든 걸","meaning":"'everything'","additional_notes":"'모든 걸' is used in informal contexts and is often followed by actions or verbs that one might do with 'everything'. This term is usually spoken rather than written and is a more colloquial form of '모든 것을'.","target_language_example":"나는 모든 걸 줄 수 있어.","native_language_example":"I can give everything."}]
["무슨",{"thoughts":"'무슨' is a Korean determiner used to ask about something unknown or unspecified, similar to asking 'what kind of'.","target_language_multi_word_term":"무슨","meaning":"'what kind of'.","additional_notes":"Used to inquire about the kind or type of something, often before nouns.","target_language_example":"무슨 음악을 좋아하세요?","native_language_example":"What kind of music do you like?"}]
["무슨 말을",{"thoughts":"The phrase '무슨 말을' is typically used to ask about, clarify or refer to something specific that was said. It is often used with verbs like '하다' (to say/speak) to form sentences asking about the speech or statement involved.","target_language_multi_word_term":"무슨 말을","meaning":"'what words' or 'what being said'.","additional_notes":"Commonly used in questions to ask about specific statements or details of what was said.","target_language_example":"그가 무슨 말을 했니?","native_language_example":"What did he say?"}]
["무슨 일이",{"thoughts":"The phrase '무슨 일이' is commonly used to ask about what is going on or what has happened. It is often used in questions to seek information about events, circumstances, or situations. Relevant for beginners to learn as it appears frequently in conversations.","target_language_multi_word_term":"무슨 일이","meaning":"'what's going on' or 'what happened'.","additional_notes":"Used to ask about events or situations. Often followed by a verb like '있어요?' (is there/are there) or '생겼어요?' (happened).","target_language_example":"무슨 일이 있었어요?","native_language_example":"What happened?"}]
["무슨 일이 있어도",{"thoughts":"The phrase '무슨 일이 있어도' is often used to convey a strong intention or determination to accomplish something, no matter what obstacles might arise.","target_language_multi_word_term":"무슨 일이 있어도","meaning":"'no matter what happens' or 'at all costs'.","additional_notes":"This phrase emphasizes determination and can be used when someone is resolute about achieving a goal regardless of potential challenges.","target_language_example":"무슨 일이 있어도 그 일을 끝내겠어요.","native_language_example":"I'll finish that work no matter what happens."}]
["무엇을",{"thoughts":"\"무엇을\" is often used in Korean to ask about an object or thing, functioning as an object form of 'what' in questions.","target_language_multi_word_term":"무엇을","meaning":"'what' (object form).","additional_notes":"Used to ask about the object of a verb, typically in questions. Often shortened to '뭘' in casual speech.","target_language_example":"무엇을 먹고 싶어요?","native_language_example":"What do you want to eat?"}]
["무엇이",{"thoughts":"'무엇이' is a Korean interrogative pronoun often used to ask questions about objects or things. It is similar to 'what' in English and is often followed by a verb to form questions.","target_language_multi_word_term":"무엇이","meaning":"'what' (subject form).","additional_notes":"Often used to ask about the subject of the sentence, typically leading questions that inquire about identity or nature of an object or situation.","target_language_example":"무엇이 그렇게 중요한가요?","native_language_example":"What is so important?"}]
["무엇이든",{"thoughts":"The term '무엇이든' is a useful phrase in Korean, which translates to 'anything'. It's a combination of '무엇' meaning 'what' and '이든' indicating 'regardless' or 'any'. Beginners should understand its utility in expressing openness or indifference about the specifics of the subject being referred to.","target_language_multi_word_term":"무엇이든","meaning":"'anything'.","additional_notes":"This expression is used to convey a sense of flexibility or open choice, indicating that any option or possibility is acceptable. It's often used when you don't mind which specific item or action is chosen.","target_language_example":"무엇이든 먹어도 돼요.","native_language_example":"You can eat anything."}]
["무엇인지",{"thoughts":"'무엇인지' is a Korean phrase often used in declarative sentences to express what something is. It is formed by combining '무엇' meaning 'what' with '인지', a dependent noun used for expressing indirect questions or statements.","target_language_multi_word_term":"무엇인지","meaning":"'what it is'.","additional_notes":"The phrase '무엇인지' is typically used to express curiosity or seek confirmation about the identity or nature of something in a sentence. It often appears in indirect speech or embedded questions.","target_language_example":"그것이 무엇인지 알아요?","native_language_example":"Do you know what it is?"}]
["무조건",{"thoughts":"The Korean term '무조건' is often used to express something that is done without any need for reason or condition.","target_language_multi_word_term":"무조건","meaning":"'unconditionally' or 'without condition or reservation'.","additional_notes":"'무조건' is used to emphasize doing something without any prerequisites, reasons, or reservations. It suggests a sense of absolute commitment or necessity.","target_language_example":"무조건 다 받아들일게요.","native_language_example":"I will accept everything unconditionally."}]
["무척",{"thoughts":"무척 is an adverb in Korean used to express intensity, similar to 'very' or 'extremely' in English.","target_language_multi_word_term":"무척","meaning":"Very, extremely.","additional_notes":"Often used to emphasize the degree or intensity of an adjective or verb.","target_language_example":"무척 행복해요.","native_language_example":"I'm very happy."}]
["뭐",{"thoughts":"The term '뭐' is commonly used in Korean as an informal question word to mean 'what'. It is frequently used in everyday casual conversations.","target_language_multi_word_term":"뭐","meaning":"'what'.","additional_notes":"Used in casual speech to ask about something in a relaxed or informal setting. Often appears in questions or wondered thoughts.","target_language_example":"너 뭐 해?","native_language_example":"What are you doing?"}]
["뭐가",{"thoughts":"'뭐가' is a contraction in Korean often used to ask 'what is' or 'which is + subject' depending on the context. It's a familiar way of starting questions relating to objects and subjects.","target_language_multi_word_term":"뭐가","meaning":"'what is' or 'which is'.","additional_notes":"Used in informal settings, '뭐가' helps ask about a specific subject in question. It's a contraction of '무엇이', and commonly used in spoken Korean.","target_language_example":"뭐가 제일 좋아?","native_language_example":"What is the best one?"}]
["뭐고",{"thoughts":"The term '뭐고' is a colloquial Korean expression commonly used in informal situations, primarily in parts of South Korea including Busan and other parts of the Gyeongsang dialect area. It translates to 'what is it?' or 'what's that?' in English and is a contracted form of more standard expressions like '뭐야?' or '뭐냐?'. It's typically used when something unexpected happens, or when asking for clarification.","target_language_multi_word_term":"뭐고","meaning":"'what is it' (dialectal; informal).","additional_notes":"This term is regional and informal, often used in spoken language rather than in formal writing. It's prevalent in Gyeongsang province dialects.","target_language_example":"이게 뭐고?","native_language_example":"What is this?"}]
["뭐든",{"thoughts":"The Korean term '뭐든' means 'anything' or 'whatever'. It's a combination of '뭐', meaning 'what', and '든', which adds the meaning of 'any'. This expression is prevalent in daily conversations and can be used when flexibility or openness to any option is indicated.","target_language_multi_word_term":"뭐든","meaning":"'anything' or 'whatever'.","additional_notes":"Used to indicate flexibility or openness to any option. It is a casual term used in everyday conversation.","target_language_example":"뭐든 먹고 싶은 거 말해.","native_language_example":"Tell me whatever you want to eat."}]
["뭐든지",{"thoughts":"The Korean multi-word term \"뭐든지\" is an indefinite pronoun that can be translated to 'anything' or 'whatever.' It's commonly used to refer to any item or action without specifying a particular one, showing inclusivity or openness to any choice.","target_language_multi_word_term":"뭐든지","meaning":"'anything' or 'whatever'.","additional_notes":"Used to indicate any possible option or choice, often implying that the speaker is flexible or indifferent about the specifics.","target_language_example":"뭐든지 물어보세요.","native_language_example":"Ask anything."}]
["뭐라고",{"thoughts":"The Korean phrase '뭐라고' is commonly used in conversation to ask 'What did you say?' or 'What?' when someone didn't hear or understand something properly.","target_language_multi_word_term":"뭐라고","meaning":"'What?' or 'What did you say?'.","additional_notes":"Often used in informal settings to request someone to repeat themselves or clarify what they said.","target_language_example":"A: 거기서 뭐라고 했어? B: 다시 말해줄게.","native_language_example":"A: What did you say there? B: I'll tell you again."}]
["뭐라도",{"thoughts":"The Korean term '뭐라도' is derived from '뭐' meaning 'what' and the particle '라도' which implies 'even if' or 'at least'. It is used to mean 'anything' or 'whatever', often in circumstances where the speaker is suggesting any option is acceptable or better than nothing.","target_language_multi_word_term":"뭐라도","meaning":"'anything' or 'whatever'.","additional_notes":"Used when offering or accepting any suggestion or option, often implying that any choice is better than none or any option is acceptable.","target_language_example":"배고프면 뭐라도 먹어요.","native_language_example":"If you're hungry, eat anything."}]
["뭐야",{"thoughts":"뭐야 (mwoya) is an informal way to ask 'What is it?' or 'What's that?' in Korean. It's a contraction often used in everyday speech and conveys curiosity, confusion, or surprise. Beginners will encounter it frequently in conversations, TV shows, and movies due to its colloquial nature.","target_language_multi_word_term":"뭐야","meaning":"'What is it?'","additional_notes":"Often used in informal settings among friends or peers. It expresses a mix of curiosity, surprise, or confusion about something that has been observed or mentioned.","target_language_example":"저게 다 뭐야?","native_language_example":"What is all that?"}]
["뭘",{"thoughts":"The word '뭘' is a contracted form of '무엇을', which is often used in informal spoken Korean. It is important for beginner learners to recognize contractions in everyday conversation.","target_language_multi_word_term":"뭘","meaning":"'what' (casual, used for asking questions or making offers)","additional_notes":"'뭘' is a contraction of '무엇을', the object form of 'what'. It is typically used in conversational Korean. It often appears in questions or when making casual offers or requests.","target_language_example":"뭘 먹고 싶어?","native_language_example":"What do you want to eat?"}]
["바로",{"thoughts":"The Korean term '바로' is commonly used to express immediacy or correctness. It's a versatile adverb that frequently appears in everyday conversation.","target_language_multi_word_term":"바로","meaning":"'immediately' or 'right (in terms of correctness)'.","additional_notes":"'바로' can refer to doing something right away or can indicate that something is correct or in the right place. It's context-dependent and can emphasize urgency or precision.","target_language_example":"그녀는 바로 대답했어요.","native_language_example":"She answered immediately."}]
["바로 그",{"thoughts":"The Korean term '바로 그' is used for emphasis, pointing out a specific thing or idea among others. It's often used to stress that something is the exact one being referred to.","target_language_multi_word_term":"바로 그","meaning":"'exactly that' or 'precisely that'.","additional_notes":"This phrase is used to clarify that something is precisely the one being discussed or referenced, often for emphasis or confirmation.","target_language_example":"\"바로 그 책이 내가 찾던 거야.\"","native_language_example":"\"That's exactly the book I was looking for.\""}]
["바로 이",{"thoughts":"\"바로 이\" is a Korean phrase used to specify and emphasize a particular subject or object that is being mentioned.","target_language_multi_word_term":"바로 이","meaning":"\"just this\" or \"exactly this\".","additional_notes":"It is used to point out or highlight a specific item or detail, often to emphasize or clarify.","target_language_example":"바로 이 책이 제가 찾던 것입니다.","native_language_example":"This is exactly the book I was looking for."}]
["바로 저",{"thoughts":"The phrase '바로 저' in Korean is used to point something out or indicate a specific thing or person. It combines '바로,' meaning 'right' or 'exactly,' with '저,' a demonstrative used for things that are distant from both the speaker and listener. It's similar to saying 'right there' or 'that one over there' in English, emphasizing precision and location.","target_language_multi_word_term":"바로 저","meaning":"'right there' or 'exactly that one'.","additional_notes":"'바로 저' is used to specify and emphasize a particular item or person in a distant context. It's often used when pointing something out physically present in the environment but relatively distant from the speaker and listener.","target_language_example":"바로 저 건물이 우리가 찾는 곳이에요.","native_language_example":"Right there is the building we are looking for."}]
["바로 지금",{"thoughts":"'바로 지금' is a phrase used to express immediacy, similar to the English expression 'right now'. It emphasizes the urgency or immediateness of a situation or action.","target_language_multi_word_term":"바로 지금","meaning":"'right now'.","additional_notes":"Used to indicate that something should happen immediately or is happening at the present moment. It adds a sense of urgency or immediacy to the statement.","target_language_example":"바로 지금 시작하세요.","native_language_example":"Start right now."}]
["밖에",{"thoughts":"The Korean term '밖에' is a particle used to mean 'only' as in there is no other option or to express exclusivity. It is typically used with a negative verb to indicate limitation or exclusion.","target_language_multi_word_term":"밖에","meaning":"'only' or 'nothing but'.","additional_notes":"Often used with a negative verb to express limitation. For example, '한국 음식밖에 못 먹어요.' translates to 'I can only eat Korean food.' indicating an inability to eat other types of food.","target_language_example":"우유밖에 없어요.","native_language_example":"There's only milk."}]
["반대로",{"thoughts":"'반대로' is a common Korean term used in everyday conversation. It signifies the idea of opposition or reversal, which is important for expressing contrast or unexpected outcomes. Understanding this term can help beginner learners distinguish between different viewpoints or situations.","target_language_multi_word_term":"반대로","meaning":"'on the contrary' or 'conversely'.","additional_notes":"It is used to indicate that something occurs or is stated in opposition to what has been mentioned before.","target_language_example":"그는 춥다고 했는데, 반대로 나는 더웠어요.","native_language_example":"He said it was cold, but on the contrary, I was hot."}]
["반면에",{"thoughts":"'반면에' is commonly used in Korean to contrast two statements or ideas. This phrase is similar to 'on the other hand' in English, providing a way to present a counterpoint or alternative view. It's a useful term for discussions or when making comparisons.","target_language_multi_word_term":"반면에","meaning":"on the other hand.","additional_notes":"Used when contrasting two different ideas or pointing out the difference between them. It can set up the following statement as a counterpoint to the previous one, making it useful in both conversation and written Korean.","target_language_example":"그 사람은 친절하다. 반면에, 그는 때때로 무례하다.","native_language_example":"That person is kind. On the other hand, he can be rude at times."}]
["방금",{"thoughts":"The Korean term '방금' is a commonly used adverb to describe an action that occurred very recently. A beginner learner might encounter this in conversations about something that just happened or immediate past events.","target_language_multi_word_term":"방금","meaning":"just now, a moment ago.","additional_notes":"Used to indicate that something has very recently happened, typically less than an hour ago.","target_language_example":"방금 전화 받았어요.","native_language_example":"I just received a call."}]
["벌써",{"thoughts":"The word '벌써' is commonly used in Korean to describe something that has happened or been realized earlier than expected. It can be translated to 'already' in English, indicating surprise or emphasis on the timing. It's important for learners to know as it frequently appears in conversation.","target_language_multi_word_term":"벌써","meaning":"'already'.","additional_notes":"It is often used to show surprise at the speed of an action or event. Typically, it precedes verbs or phrases denoting an action or state that has occurred sooner than anticipated.","target_language_example":"벌써 끝났어요?","native_language_example":"Is it already over?"}]
["별로",{"thoughts":"`별로` is often used to express a negative impression or a sense of 'not really' about something. Beginners should know how it's typically paired with negative sentences to convey dislike or indifference.","target_language_multi_word_term":"별로","meaning":"'not really' or 'not particularly'.","additional_notes":"Used in negative sentences to describe something as being 'not very' or 'not really' liked or noteworthy. It emphasizes a less than satisfactory view or feeling about something.","target_language_example":"이 영화는 별로 재미없어요.","native_language_example":"This movie is not really interesting."}]
["보다",{"thoughts":"The Korean term '보다' is a versatile verb that can mean 'to see', 'to look', or 'to watch' depending on context. It's one of the essential verbs for beginners to learn due to its frequent usage in everyday conversations.","target_language_multi_word_term":"보다","meaning":"'to see', 'to look', or 'to watch'.","additional_notes":"It's commonly used in a variety of contexts related to visual perception. In some cases, '보다' is also used when referring to trying or experiencing something. For instance, adding it to another verb indicates trying to do that action.","target_language_example":"영화를 보다.","native_language_example":"To watch a movie."}]
["보다 더",{"thoughts":"'보다 더' is often used in comparative sentences to indicate 'more than' or to show a higher degree of something when comparing entities or qualities.","target_language_multi_word_term":"보다 더","meaning":"'more than' / 'to a greater extent'","additional_notes":"Often used when making comparisons to indicate that something has a greater degree or extent than something else. It can be used with adjectives or adverbs.","target_language_example":"이 케이크는 다른 케이크보다 더 맛있어요.","native_language_example":"This cake is more delicious than the other cake."}]
["분명히",{"thoughts":"The term '분명히' is an adverb in Korean that expresses certainty. It often conveys the speaker's strong belief or assurance about a statement or situation. This is useful for learners when they want to make confident statements or assertions.","target_language_multi_word_term":"분명히","meaning":"clearly, certainly, definitely.","additional_notes":"Used to emphasize the speaker's confidence or certainty in what they're stating. It's similar to saying 'surely' or 'undoubtedly' in English.","target_language_example":"그는 분명히 올 거예요.","native_language_example":"He will definitely come."}]
["비록",{"thoughts":"'비록' is an adverb used to highlight contrast situations, implying 'even though' or 'although'. It is often used to start sentences or clauses to highlight contrast between two different or opposing ideas.","target_language_multi_word_term":"비록","meaning":"'although' or 'even though'.","additional_notes":"Typically used in sentences to contrast different statements or emphasize the truth of a certain fact despite a condition or obstacle. Often followed by '-지만' (지만) to complete the clause.","target_language_example":"비록 어렵지만 해낼 수 있어요.","native_language_example":"Although it's difficult, you can achieve it."}]
["비슷한",{"thoughts":"'비슷한' is an attributive adjective in Korean derived from the verb '비슷하다', which means 'to be similar'. It's often used to describe nouns that share similar characteristics or likeness with another object or concept.","target_language_multi_word_term":"비슷한","meaning":"'similar' or 'alike'.","additional_notes":"Use '비슷한' before a noun to describe something that resembles or has likeness to another thing.","target_language_example":"두 사람의 성격이 비슷한 것 같아요.","native_language_example":"It seems like the personalities of the two people are similar."}]
["빨리",{"thoughts":"'빨리' is an adverb that beginners often encounter because it is commonly used in everyday conversation to express urgency or promptness.","target_language_multi_word_term":"빨리","meaning":"quickly, fast","additional_notes":"Often used in commands or requests to hurry up or do something quickly.","target_language_example":"빨리 가자!","native_language_example":"Let's go quickly!"}]
["빨리빨리",{"thoughts":"\"빨리빨리\" is a commonly used Korean phrase that emphasizes urgency and speed. It can be translated into 'quickly, quickly' or 'hurry, hurry'. It's often used in everyday conversation in Korea, reflecting the fast-paced nature of Korean society.","target_language_multi_word_term":"빨리빨리","meaning":"\"quickly, quickly\" or \"hurry, hurry\".","additional_notes":"This term is used to express a desire for speed or urgency, whether it be to make someone hurry up or to describe the quick pace of something. It reflects the Korean culture's emphasis on efficiency and swift action.","target_language_example":"빨리빨리 가자!","native_language_example":"Let's go quickly!"}]
["뿐",{"thoughts":"'뿐' is a Korean particle that adds the meaning of 'only' or 'just' to the noun or phrase it follows. It is often used to emphasize limitation or exclusivity in Korean sentences.","target_language_multi_word_term":"뿐","meaning":"'only' or 'just'.","additional_notes":"Used to emphasize that a particular amount or type is limited to what is mentioned. Usually follows a noun or verb to indicate that nothing beyond it applies.","target_language_example":"나는 그것을 들었을 뿐이다.","native_language_example":"I only heard about it."}]
["뿐이다",{"thoughts":"The term '뿐이다' is often used to express limitation or exclusivity, similar to the English phrase 'only' or 'just.' It indicates that something is the sole thing, condition, or person relevant in a particular context.","target_language_multi_word_term":"뿐이다","meaning":"'only' or 'just'.","additional_notes":"Typically used to highlight that there is no other option, entity, or choice except for what is mentioned. It emphasizes singularity or restriction.","target_language_example":"그녀는 공부할 뿐이다.","native_language_example":"She is only studying."}]
["뿐이야",{"thoughts":"The term '뿐이야' is derived from the Korean word '뿐' which means 'only'. It is often used to indicate that only one thing is true or relevant, often in contrast to what someone else thinks or suggests. This nuance might be integral to understanding everyday Korean conversation.","target_language_multi_word_term":"뿐이야","meaning":"'only' or 'just'.","additional_notes":"Used to emphasize that something is the only case or option In informal conversation, it highlights directness or exclusivity.","target_language_example":"나는 너뿐이야.","native_language_example":"You're the only one for me."}]
["뿐이지",{"thoughts":"The term '뿐이지' is a conjunctive expression that combines '뿐' which means 'only' or 'just' with '이' and the emotive ending '지'. It often appears in sentences to imply limitation or narrow scope of something.","target_language_multi_word_term":"뿐이지","meaning":"just, only that.","additional_notes":"Often used when downplaying the significance or extent of something. It can convey a sense of modesty or understatement.","target_language_example":"그냥 친구일 뿐이지.","native_language_example":"Just a friend."}]
["사방에",{"thoughts":"The term '사방에' is used to describe a location or space being surrounded or enveloped from all sides. It's important for beginners to grasp common spatial terms in Korean, as they often appear in descriptive contexts involving directions or locations.","target_language_multi_word_term":"사방에","meaning":"'everywhere' or 'on all sides'.","additional_notes":"Used to describe something being present or happening in all directions or places simultaneously.","target_language_example":"그녀는 사방에 꽃을 심었다.","native_language_example":"She planted flowers everywhere."}]
["상당히",{"thoughts":"상당히 is an adverb in Korean that is commonly used to describe a degree to which something is intense or significant.","target_language_multi_word_term":"상당히","meaning":"'quite', 'considerably', or 'fairly'.","additional_notes":"This term is often used to emphasize the degree or extent of something. It reflects a high degree, but not the maximum extent. It is a versatile word that can be used with adjectives and verbs.","target_language_example":"그 집은 상당히 크다.","native_language_example":"That house is quite large."}]
["서둘러",{"thoughts":"The Korean term '서둘러' is an imperative form asking someone to hurry up. It's often used in situations where speed or urgency is needed.","target_language_multi_word_term":"서둘러","meaning":"'hurry' or 'quickly'.","additional_notes":"It is a command often used to urge someone to be faster or to remind them that time is of the essence.","target_language_example":"지금 바로 서둘러 와!","native_language_example":"Come here quickly right now!"}]
["설마",{"thoughts":"설마 is often used in Korean to express disbelief or doubt about something unlikely or unexpected happening. It conveys a sense of 'surely not' or 'no way'.","target_language_multi_word_term":"설마","meaning":"'surely not'","additional_notes":"This term is used when the speaker finds something hard to believe or is expressing doubt. It's often used in conversational contexts when reacting to surprising news or improbable events.","target_language_example":"설마 그가 그 일을 했다고?","native_language_example":"Surely he didn't do that?"}]
["순식간에",{"thoughts":"'순식간에' is a Korean adverbial phrase used to describe events happening very quickly or in an instant.","target_language_multi_word_term":"순식간에","meaning":"'in an instant' or 'in the blink of an eye'.","additional_notes":"Often used to emphasize the quickness or suddenness of an action or event. It can be used in a wide variety of contexts to highlight how fast something occurs.","target_language_example":"순식간에 일이 다 끝났어요.","native_language_example":"The work was done in an instant."}]
["신속하게",{"thoughts":"The word '신속하게' is a Korean adverb that means doing something quickly or swiftly. It is often used in contexts where speed or promptness is important. Beginner learners might encounter this in situations where quick actions or responses are emphasized.","target_language_multi_word_term":"신속하게","meaning":"quickly or swiftly","additional_notes":"The term is used to describe actions or processes carried out with speed. It's often used in instructions or when emphasizing the need for promptness.","target_language_example":"우리는 이 문제를 신속하게 해결해야 합니다.","native_language_example":"We need to solve this problem quickly."}]
["심지어",{"thoughts":"The Korean term '심지어' is an adverb used to emphasize an extreme state or situation, often translated as 'even' in English. It highlights an unexpected or surprising element in the context, making it very useful for learners to express emphasis or surprise.","target_language_multi_word_term":"심지어","meaning":"'even'.","additional_notes":"Used to add emphasis, especially when mentioning something unexpected or extreme. It can come at the beginning of a clause in Korean, similar to its usage in English.","target_language_example":"그는 심지어 주말에도 일을 해요.","native_language_example":"He even works on weekends."}]
["아까",{"thoughts":"The Korean term '아까' is used to refer to a short time ago or earlier today. It's a casual word used commonly in conversation.","target_language_multi_word_term":"아까","meaning":"A while ago.","additional_notes":"Used to refer to something that happened earlier on the same day, but generally not too far back in time.","target_language_example":"아까 친구를 만났어요.","native_language_example":"I met a friend a while ago."}]
["아마",{"thoughts":"The Korean term '아마' is a common adverb meaning 'probably' or 'perhaps', which is used to express a degree of uncertainty or likelihood of an event happening.","target_language_multi_word_term":"아마","meaning":"'probably' or 'perhaps'.","additional_notes":"Typically used before verbs or adjectives to indicate a guess or assumption about a situation or outcome. It adds a nuance of uncertainty or tentative estimation.","target_language_example":"그는 아마 집에 있을 거야.","native_language_example":"He is probably at home."}]
["아마도",{"thoughts":"The term '아마도' is often used to express uncertainty or possibility, conveying the meaning of 'maybe' or 'perhaps'. It's a useful word for learners to express unsure statements or indicate that something might be possible, but is not confirmed.","target_language_multi_word_term":"아마도","meaning":"'maybe' or 'perhaps'.","additional_notes":"Used to express uncertainty or possibility about an event or situation. Often found in everyday conversations when the speaker is unsure about something.","target_language_example":"아마도 내일 비가 올 거예요.","native_language_example":"Maybe it will rain tomorrow."}]
["아무것도",{"thoughts":"아무것도 is used to express 'nothing' or 'not anything', often in the context of a negative sentence. It's important for beginners to understand its use because it commonly appears in negative constructions in Korean.","target_language_multi_word_term":"아무것도","meaning":"nothing, not anything","additional_notes":"Used in negative sentences to emphasize the absence of anything. It is not used in affirmative sentences.","target_language_example":"저는 아무것도 몰라요.","native_language_example":"I know nothing."}]
["아무도",{"thoughts":"The term '아무도' is used to refer to the absence of people, indicating 'nobody' or 'no one'.","target_language_multi_word_term":"아무도","meaning":"'nobody' or 'no one'.","additional_notes":"Used when stating that no person performs an action or is present. Often used with negative verbs to emphasize absence or lack of action.","target_language_example":"아무도 나를 믿지 않는다.","native_language_example":"Nobody believes me."}]
["아무런",{"thoughts":"The Korean word '아무런' is often used to indicate the absence of something or the lack thereof, usually emphasizing that there is nothing of a certain type or kind.","target_language_multi_word_term":"아무런","meaning":"'any' or 'none'.","additional_notes":"It is used before nouns to emphasize the lack or non-existence of a particular thing, often found with negative expressions such as '없다' (does not exist/there is none).","target_language_example":"아무런 소리도 들리지 않았다.","native_language_example":"I didn't hear any sound."}]
["아무리",{"thoughts":"The Korean adverb '아무리' is used to convey the idea of 'no matter how' or 'however much', and is often used to express situations where an effort does not change an outcome.","target_language_multi_word_term":"아무리","meaning":"'no matter how' or 'however much'.","additional_notes":"It is typically used to emphasize the degree or intensity of an action or situation, usually followed by verbs that denote action or effort.","target_language_example":"아무리 노력해도 결과는 변하지 않았어요.","native_language_example":"No matter how much I tried, the result didn't change."}]
["아서",{"thoughts":"'아서' is a Korean connective ending used to indicate causation or sequence of actions. It follows verbs or adjectives ending in a vowel when conveying the reason for something or linking two actions.","target_language_multi_word_term":"아서","meaning":"'because' or 'and then'.","additional_notes":"Used after verbs or adjectives ending in a vowel to show cause or to connect actions in a sequence. It varies depending on the vowel or consonant at the end of the preceding verb or adjective.","target_language_example":"배가 고파서 밥을 먹었어요.","native_language_example":"I was hungry, so I ate rice."}]
["아주",{"thoughts":"'아주' is a versatile Korean adverb that's frequently used to emphasize the degree of an adjective or adverb it accompanies. It is important for beginners to recognize as it commonly appears in conversation.","target_language_multi_word_term":"아주","meaning":"Very or extremely.","additional_notes":"It is similar to 'very' in English and is used to strengthen the meaning of the word it modifies. Often used in both formal and informal contexts.","target_language_example":"이 음식은 아주 맛있어요.","native_language_example":"This food is very delicious."}]
["아직",{"thoughts":"'아직' is a Korean adverb used to express the concept of 'still' or 'yet', often indicating an action or condition that is ongoing or incomplete.","target_language_multi_word_term":"아직","meaning":"'still' or 'yet'.","additional_notes":"Used when referring to something that continues to exist or a condition that is not yet fulfilled by the time of speaking.","target_language_example":"그는 아직 자고 있어요.","native_language_example":"He is still sleeping."}]
["아직도",{"thoughts":"'아직도' is a Korean adverb that refers to something continuing from the past into the present, indicating persistence or ongoing status of a situation.","target_language_multi_word_term":"아직도","meaning":"'still' or 'yet'.","additional_notes":"Used to express that a situation or condition remains unchanged over a period of time. Often found in sentences where the speaker is remarking on the persistence of a state or action.","target_language_example":"그는 아직도 집에 있어요.","native_language_example":"He is still at home."}]
["약간",{"thoughts":"The Korean term '약간' is used to express a small amount or degree of something, similar to 'a little' or 'somewhat' in English. It's commonly used to quantify or slightly modify adjectives or verbs, making it relevant for beginner learners who are starting to form more nuanced sentences in Korean.","target_language_multi_word_term":"약간","meaning":"'a little' or 'slightly'.","additional_notes":"Adding '약간' before adjectives or verbs can slightly change the meaning to indicate a lesser degree or intensity. It's similar to using 'slightly', 'a bit', or 'somewhat' for moderation in English.","target_language_example":"이 음식은 약간 매워요.","native_language_example":"This food is a little spicy."}]
["어느",{"thoughts":"'어느' is a Korean determinative word often used to ask for a specific choice or preference between items of the same type.","target_language_multi_word_term":"어느","meaning":"'which' or 'which one'.","additional_notes":"Used to ask about one specific option from a group. Commonly appears in questions seeking clarification or preference among multiple possible choices.","target_language_example":"어느 색을 좋아해요?","native_language_example":"Which color do you like?"}]
["어디",{"thoughts":"The term '어디' is an interrogative word in Korean used for asking about a place or location, something a beginner learning Korean would frequently need to use and understand.","target_language_multi_word_term":"어디","meaning":"'where'.","additional_notes":"Used in questions to ask about the location or place of someone or something. Can be used independently or in combination with verbs.","target_language_example":"지금 어디에 있어요?","native_language_example":"Where are you now?"}]
["어디든",{"thoughts":"어디든 combines '어디' (where) and the particle '든', meaning 'anywhere'. It's used to express a non-specific location in the context of a statement.","target_language_multi_word_term":"어디든","meaning":"'anywhere'.","additional_notes":"Used to indicate that an action can take place at any location without restriction. Often used to convey flexibility in choice of location.","target_language_example":"어디든 가고 싶은 곳으로 가세요.","native_language_example":"Go anywhere you want to go."}]
["어디든지",{"thoughts":"'어디든지' is a Korean phrase used to express the idea of 'everywhere' or 'anywhere.' This concept is frequently used to convey flexibility or encompass all possible locations, which can be handy for beginners to comprehend expressions of location and flexibility.","target_language_multi_word_term":"어디든지","meaning":"'everywhere' or 'anywhere'.","additional_notes":"The term is built from '어디' (where) and '든지' (a particle meaning 'any' or 'every'). It's used when indicating no constraint on location.","target_language_example":"나는 어디든지 갈 수 있어.","native_language_example":"I can go anywhere."}]
["어디로",{"thoughts":"'어디로' is a common Korean phrase that asks for a direction or destination. It is typically used when inquiring where someone is going or directing something.","target_language_multi_word_term":"어디로","meaning":"'to where'.","additional_notes":"Used in questions asking about the direction or destination someone or something is going or being sent to. Commonly used with verbs of movement such as 가다 (to go) or 보내다 (to send).","target_language_example":"어디로 가요?","native_language_example":"Where are you going?"}]
["어디서",{"thoughts":"'어디서' is a Korean term used to form questions about locations, often translated as 'where'. It combines '어디' (where) with '서', a particle indicating location.","target_language_multi_word_term":"어디서","meaning":"'where at' or 'from where'.","additional_notes":"Used to ask about or specify the location where an action takes place.","target_language_example":"너 어디서 왔어?","native_language_example":"Where are you from?"}]
["어디에",{"thoughts":"The term '어디에' is a question word used to inquire about location, equivalent to asking 'where' something is or takes place. It is important for beginners who are learning how to ask for directions or information about locations in Korean.","target_language_multi_word_term":"어디에","meaning":"'where at' or 'at where'.","additional_notes":"Used in questions to ask for the specific location of something. Often combined with verbs like 있다 (to be), 가다 (to go), or 오다 (to come).","target_language_example":"도서관이 어디에 있어요?","native_language_example":"Where is the library?"}]
["어떤",{"thoughts":"'어떤' is a Korean determiner used to ask questions about the characteristics or to specify which one among a group. It's similar to 'what' or 'which' in English.","target_language_multi_word_term":"어떤","meaning":"'what kind of' or 'which'.","additional_notes":"Used to inquire about the nature or type of something. Commonly seen at the beginning of questions asking for clarification or specifics.","target_language_example":"어떤 음식을 좋아하세요?","native_language_example":"What kind of food do you like?"}]
["어떻게",{"thoughts":"어떻게 is a Korean adverb meaning 'how.' It is commonly used in questions related to the manner or method of something. Beginners should note how it initiates questions.","target_language_multi_word_term":"어떻게","meaning":"'how'.","additional_notes":"Used to inquire about the manner or method of doing something. It is frequently found at the beginning of questions.","target_language_example":"이 일을 어떻게 할 거예요?","native_language_example":"How are you going to do this work?"}]
["어떻게 해야",{"thoughts":"The term '어떻게 해야' is a common phrase that means 'how should (I/we/they) do it?' in Korean. It's often used to ask for advice or instructions on proceeding with a task or decision.","target_language_multi_word_term":"어떻게 해야","meaning":"'How should (one) do it?'","additional_notes":"Used to inquire about the procedure or method for completing a task. It is often part of a larger question that specifies the action or problem to solve.","target_language_example":"이 문제를 어떻게 해야 해결할 수 있을까요?","native_language_example":"How should I solve this problem?"}]
["어떻게든",{"thoughts":"The Korean term '어떻게든' is commonly used to express a determination to do something by any means possible. It implies overcoming obstacles or difficulties to achieve a goal.","target_language_multi_word_term":"어떻게든","meaning":"'somehow' or 'no matter what'.","additional_notes":"It conveys a strong sense of determination or resolution to achieving an outcome, often used when discussing plans or actions in difficult situations.","target_language_example":"어떻게든 일을 마치겠습니다.","native_language_example":"I will finish the work somehow."}]
["어서",{"thoughts":"'어서' is an adverb often used as an imperative verb ending in Korean to prompt someone to act quickly or immediately. It is frequently used in requests or when urging someone to do something.","target_language_multi_word_term":"어서","meaning":"hurry up; quickly.","additional_notes":"Commonly used in situations where immediate action is desired, such as urging someone to come in quickly or start doing something without delay.","target_language_example":"어서 학교에 가세요!","native_language_example":"Hurry up and go to school!"}]
["어서 빨리",{"thoughts":"The term '어서 빨리' is often used to encourage someone to hurry or do something quickly. It's a combination of '어서' (quickly) and '빨리' (fast), emphasizing urgency.","target_language_multi_word_term":"어서 빨리","meaning":"'quickly' or 'hurry up'.","additional_notes":"Used to prompt promptness or urgency, often in situations requiring immediate action.","target_language_example":"어서 빨리 와!","native_language_example":"Hurry up and come!"}]
["어제",{"thoughts":"'어제' is a basic Korean term used to refer to a time in the past, making it relevant for beginners learning to discuss time and events in Korean.","target_language_multi_word_term":"어제","meaning":"'yesterday'.","additional_notes":"Used to describe the day before today, often accompanied by verbs to discuss past events.","target_language_example":"어제 학교에 갔어요.","native_language_example":"I went to school yesterday."}]
["어쨌거나",{"thoughts":"The Korean term '어쨌거나' is an informal expression often used to convey a dismissive or anyhow attitude. It is similar to the English phrase 'anyway,' which redirects or concludes a conversation or point, often dismissing other conflicting ideas or interruptions.","target_language_multi_word_term":"어쨌거나","meaning":"'anyway' or 'in any case'.","additional_notes":"Used when the speaker wants to return to or emphasize their original point, despite previous discourse. It can change the direction of a conversation, signaling a casual conclusion or transition.","target_language_example":"어쨌거나 우리는 출발해야 해요.","native_language_example":"Anyway, we need to leave."}]
["어쨌건",{"thoughts":"The Korean term '어쨌건' is a casual conversational phrase that means 'anyway' or 'in any case'. It's used to indicate that the speaker is moving past previous statements and getting to the main point.","target_language_multi_word_term":"어쨌건","meaning":"'anyway' or 'in any case'.","additional_notes":"This term is often used in informal conversations to shift focus, dismiss previous concerns, or emphasize the main point.","target_language_example":"어쨌건, 우리가 해야 할 일을 끝내야 해요.","native_language_example":"Anyway, we have to finish what we need to do."}]
["어쨌든",{"thoughts":"The term '어쨌든' is commonly used to express a transition or indicate a resolution to move past previous discussions or concerns, similar to how 'anyway' or 'in any case' is used in English.","target_language_multi_word_term":"어쨌든","meaning":"'anyway' or 'in any case'.","additional_notes":"Used to indicate a transition or to refocus on the primary point. Commonly appears in both casual conversation and written text as a way to redirect or conclude a topic.","target_language_example":"어쨌든 우리는 내일 출발할게요.","native_language_example":"Anyway, we'll leave tomorrow."}]
["어쩌면",{"thoughts":"The Korean word '어쩌면' is often used to express uncertainty or possibility, similar to 'maybe' or 'perhaps' in English. It's commonly used when someone is considering multiple possibilities or expressing a guess about a situation.","target_language_multi_word_term":"어쩌면","meaning":"'maybe' or 'perhaps'.","additional_notes":"Used to express uncertainty or to suggest that something might be the case. It can introduce a sentence or follow a subject to indicate possibility or speculation.","target_language_example":"어쩌면 그가 올지도 몰라요.","native_language_example":"Maybe he will come."}]
["어찌나",{"thoughts":"The Korean term '어찌나' is often used as a degree modifier in exclamatory sentences to express how intensely or to what extent something happens.","target_language_multi_word_term":"어찌나","meaning":"'so' or 'how (much)'","additional_notes":"It is typically used to intensify the statement that follows in an exclamatory way, often reflecting surprise or emphasis.","target_language_example":"어찌나 맛있는지 몰라!","native_language_example":"It was so delicious!"}]
["언제",{"thoughts":"The term '언제' in Korean is often used to ask about time, similar to the English term 'when.' It is a basic question word that beginner learners will frequently encounter.","target_language_multi_word_term":"언제","meaning":"'when'.","additional_notes":"Used to inquire about the timing of an event. Can precede both verbs and nouns when forming questions.","target_language_example":"너 언제 일어나니?","native_language_example":"When do you wake up?"}]
["언제나",{"thoughts":"언제나 is a Korean adverb typically used to express consistency or permanence. It refers to something that happens all the time or at any time without change.","target_language_multi_word_term":"언제나","meaning":"always, all the time","additional_notes":"Used to indicate that something happens consistently or continuously without exception.","target_language_example":"그는 언제나 행복해 보인다.","native_language_example":"He always looks happy."}]
["언제든",{"thoughts":"'언제든' is a Korean expression that translates to 'anytime' or 'whenever'. It's often used to indicate flexibility in scheduling or the willingness to do something at any time.","target_language_multi_word_term":"언제든","meaning":"'anytime' or 'whenever'.","additional_notes":"Used to express flexibility or willingness to accommodate any time that is convenient for the other person.","target_language_example":"언제든 연락해 주세요.","native_language_example":"Contact me anytime."}]
["언제든지",{"thoughts":"The term '언제든지' is an adverb in Korean that translates to 'whenever' or 'anytime,' indicating flexibility or availability. It is commonly used in casual and formal conversations when implying one's willingness or openness to do something at any time.","target_language_multi_word_term":"언제든지","meaning":"'whenever' or 'anytime'.","additional_notes":"This phrase is used to express that there is no specific time restriction, and something can happen at any given time. It's often used for offers or assurances.","target_language_example":"언제든지 전화해 주세요.","native_language_example":"Call me anytime."}]
["얼른",{"thoughts":"The word '얼른' is an adverb in Korean expressing a sense of working quickly or asking someone to do something without delay. It's crucial for beginners to understand for everyday conversation when time is of the essence.","target_language_multi_word_term":"얼른","meaning":"quickly, promptly","additional_notes":"Used to urge someone to do something at once or without hesitation. Common in casual conversations.","target_language_example":"얼른 오세요!","native_language_example":"Come quickly!"}]
["얼마나",{"thoughts":"\"얼마나\" is a common Korean term used to ask about the degree or extent of something. It is often used in questions to inquire about quantity, frequency, or intensity.","target_language_multi_word_term":"얼마나","meaning":"'how much' or 'how many'.","additional_notes":"This term is used when asking about the amount or degree of something in both literal and abstract senses. It's similar to how 'how much' or 'how many' are used in English.","target_language_example":"얼마나 자주 운동해요?","native_language_example":"How often do you exercise?"}]
["여기저기",{"thoughts":"'여기저기' translates to 'here and there' in English, and is used to describe things or actions occurring in various places. This is a useful term for beginner learners to describe scattered locations or sporadic actions.","target_language_multi_word_term":"여기저기","meaning":"'here and there'.","additional_notes":"Use it to describe things, actions, or people being spread out or happening in different places.","target_language_example":"그는 여기저기 여행을 다녔다.","native_language_example":"He traveled here and there."}]
["여전히",{"thoughts":" '여전히' is a Korean adverb meaning 'still' or 'as always'. It is used to describe a situation or condition that remains unchanged over time. It's useful for describing ongoing actions or states and is often used in both spoken and written Korean.","target_language_multi_word_term":"여전히","meaning":"'still' or 'as always'.","additional_notes":"Used to indicate that a situation has not changed over time. It can describe both physical states and emotional or mental conditions.","target_language_example":"그는 여전히 바빠요.","native_language_example":"He is still busy."}]
["오히려",{"thoughts":"'오히려' is an adverb in Korean typically used to contrast expectations or emphasize a surprising or opposite outcome.","target_language_multi_word_term":"오히려","meaning":"'rather', 'on the contrary', or 'instead'.","additional_notes":"Used when something happens that's contrary to previous thoughts or expectations, providing a twist in the statement.","target_language_example":"비가 와서 오히려 기분이 좋아졌다.","native_language_example":"It rained, but rather, I felt better."}]
["온갖",{"thoughts":"'온갖' is a Korean phrase used to express 'all kinds of' or 'a variety of'. It often precedes nouns to indicate a diverse range within a category.","target_language_multi_word_term":"온갖","meaning":"'all kinds of' or 'a variety of'.","additional_notes":"Typically used before a noun to describe a diverse range or variety of that noun, regardless of whether the context is positive or negative.","target_language_example":"그는 온갖 문제들을 해결해야 했다.","native_language_example":"He had to solve all kinds of problems."}]
["왜",{"thoughts":"The Korean term '왜' is an interrogative frequently used to ask about reasons, similar to 'why' in English. Beginners should understand its basic usage in questions.","target_language_multi_word_term":"왜","meaning":"'why'.","additional_notes":"Used to inquire about the reason or cause of something. It is typically used at the beginning of a question.","target_language_example":"왜 그렇게 말했어요?","native_language_example":"Why did you say that?"}]
["왜 그래",{"thoughts":"The phrase '왜 그래' is a common informal way to ask someone 'what's wrong?' or 'why are you acting this way?' It is often used among friends or people who are familiar with each other and is useful in situations where someone seems upset or is behaving unusually.","target_language_multi_word_term":"왜 그래","meaning":"Why are you acting like that?","additional_notes":"Used to inquire about someone's behavior or to show concern over someone's unusual actions. It is informal and can be used to express concern or curiosity.","target_language_example":"너 오늘 왜 그래?","native_language_example":"Why are you acting this way today?"}]
["왜 이래",{"thoughts":"The Korean phrase '왜 이래' is an informal way of expressing surprise or confusion about someone's behavior or a situation. It is commonly used in everyday conversations and is equivalent to asking 'What's wrong?' or 'What's going on?' in English.","target_language_multi_word_term":"왜 이래","meaning":"'What's wrong?' or 'What's going on?'.","additional_notes":"Used informally to express surprise, confusion, or annoyance about someone's unusual behavior or an unexpected situation.","target_language_example":"왜 이래? 무슨 일 있어?","native_language_example":"What's going on? Is there something wrong?"}]
["왜냐면",{"thoughts":"'왜냐면' is a common conjunction in Korean that is used to provide a reason or explanation for something previously mentioned. It is often used to link sentences in a cause-and-effect manner.","target_language_multi_word_term":"왜냐면","meaning":"because, the reason is","additional_notes":"Used to introduce the reason or explanation in a sentence. Often followed by 'because' in English to indicate causality.","target_language_example":"왜냐면 오늘은 비가 와서 기분이 좀 우울해요.","native_language_example":"Because it's raining today, I feel a bit gloomy."}]
["왜냐하면",{"thoughts":"'왜냐하면' is a common conjunction in Korean used to introduce a reason or explanation for a statement or question. It is often used like 'because' in English.","target_language_multi_word_term":"왜냐하면","meaning":"'because' or 'since'.","additional_notes":"Used to provide a reason or explanation in sentences, linking cause and effect.","target_language_example":"저는 점심을 먹었어요, 왜냐하면 배가 고팠어요.","native_language_example":"I ate lunch because I was hungry."}]
["우선",{"thoughts":"'우선' is a commonly used Korean term that can be translated to 'first' or 'in advance'. It is often used to indicate that something should be done as a priority or before other actions.","target_language_multi_word_term":"우선","meaning":"'first' or 'in advance'.","additional_notes":"Typically used to prioritize actions or decide the order in which things will be done.","target_language_example":"우선 밥부터 먹자는 게 어때요?","native_language_example":"How about we eat first?"}]
["우연히",{"thoughts":"‘우연히’ is an adverb commonly used in Korean to describe events that happen by chance or unexpectedly, without a specific plan or intention. Beginners often encounter this term in casual conversation when discussing random occurrences.","target_language_multi_word_term":"우연히","meaning":"by chance, accidentally.","additional_notes":"It's used to describe situations or actions that occur without any prior planning or are unexpected. Often found in storytelling or recounting past events.","target_language_example":"우연히 친구를 만났어요.","native_language_example":"I met a friend by chance."}]
["원래",{"thoughts":"The Korean term '원래' is used to refer to an original state or habitual circumstance. It's often used in everyday conversation to point out how something usually is or was intended to be.","target_language_multi_word_term":"원래","meaning":"originally, by nature, usually.","additional_notes":"'원래' is commonly used to describe situations or traits that are natural, expected, or habitual. It often precedes a statement about a current or past norm.","target_language_example":"이 장소는 원래 아주 조용했어요.","native_language_example":"This place was originally very quiet."}]
["위한",{"thoughts":"The Korean term '위한' is often used to indicate purpose or benefit, similar to the English term 'for'. It's a derived form from the verb '위하다'.","target_language_multi_word_term":"위한","meaning":"'for' or 'for the sake of'.","additional_notes":"Used to express the purpose or intention behind an action. Typically appears in phrases like '를 위한', '을 위한', which precede nouns they modify.","target_language_example":"이것은 당신을 위한 선물이에요.","native_language_example":"This is a gift for you."}]
["위해",{"thoughts":"'위해' is a Korean term typically used to mean 'for' or 'in order to'. It is often used to express purposes or reasons behind actions and comes after a noun or a noun phrase.","target_language_multi_word_term":"위해","meaning":"'for' or 'in order to'.","additional_notes":"Often used to indicate the purpose or benefit of an action. It typically follows a noun phrase and is used in formal and written Korean.","target_language_example":"나는 한국어를 배우기 위해 공부해요.","native_language_example":"I study in order to learn Korean."}]
["위해서",{"thoughts":"The Korean phrase '위해서' is often used to express purpose or intention, similar to saying 'in order to' or 'for the sake of' in English. It is a grammatical construction that connects actions or states to their purposes.","target_language_multi_word_term":"위해서","meaning":"'in order to' or 'for the purpose of'.","additional_notes":"Used to indicate the reason or purpose of an action. It is usually followed by a verb or noun, and can be used with '-기 위해서' to specify an action or '-을/를 위해서' to specify a noun.","target_language_example":"저는 건강을 위해서 매일 운동해요.","native_language_example":"I exercise every day for my health."}]
["은 것 같다",{"thoughts":"'은 것 같다' is a Korean grammatical pattern used to express conjecture or assumption based on observation or evidence. It is often similar to saying 'it looks like' or 'it seems that' in English.","target_language_multi_word_term":"은 것 같다","meaning":"'it seems' or 'it looks like'.","additional_notes":"This expression is used to indicate a personal observation or deduction. It implies that the speaker is making a guess or assumption about a situation based on available evidence. The expression is versatile and can be adjusted based on the tense you're speaking in (e.g., past or future).","target_language_example":"비가 올 것 같아요.","native_language_example":"It seems like it's going to rain."}]
["을 것 같다",{"thoughts":"The Korean expression '을 것 같다' is used to express assumptions, guesses, or predictions about something based on some evidence or reasoning. It is an essential expression for learners who want to express uncertainty or likelihood.","target_language_multi_word_term":"을 것 같다","meaning":"'it seems like' or 'I think it might'.","additional_notes":"This expression is widely used to express assumptions or predictions. It is attached to the verb stem and conveys a conjectural meaning.","target_language_example":"내일 비가 올 것 같아요.","native_language_example":"It seems like it might rain tomorrow."}]
["을 뿐이다",{"thoughts":"'을 뿐이다' is a grammatical expression used to indicate that something is \"only\" or \"just\" in Korean, emphasizing limitation or restricting the meaning to a single point.","target_language_multi_word_term":"을 뿐이다","meaning":"'only' or 'just'.","additional_notes":"It's often used to express a limitation or minimization by stating that something is merely or just what follows in the sentence. Typically used with verb stems.","target_language_example":"그것은 단지 오해였을 뿐이다.","native_language_example":"It was only a misunderstanding."}]
["을 수 없다",{"thoughts":"The phrase '을 수 없다' is used to express the impossibility or inability to do something in Korean.","target_language_multi_word_term":"을 수 없다","meaning":"cannot (do something)","additional_notes":"The phrase follows a verb stem and indicates inability or impossibility to perform the action described by the verb. It is the negative counterpart to '을 수 있다', which means 'can (do something)'.","target_language_example":"나는 그것을 믿을 수 없다.","native_language_example":"I cannot believe that."}]
["을 수 있다",{"thoughts":"The term '을 수 있다' is a grammatical construction in Korean used to express ability or possibility.","target_language_multi_word_term":"을 수 있다","meaning":"'can' or 'be able to'.","additional_notes":"It is used to indicate that someone has the ability or possibility to do something. It's often added to the base form of a verb.","target_language_example":"나는 피아노를 칠 수 있다.","native_language_example":"I can play the piano."}]
["이거나",{"thoughts":"이거나 is a connective ending in Korean that is used to present choices to someone, similar to 'either... or...' or 'or'. It's useful when you want to give someone options.","target_language_multi_word_term":"이거나","meaning":"'or'.","additional_notes":"This phrase is often used in a context where two or more options are provided. It's an informal way to present choices. In conversation, participants frequently use this construction to discuss possibilities. In formal or written contexts, '또는' might be more appropriate.","target_language_example":"커피 이거나 차를 마실래요?","native_language_example":"Do you want to drink coffee or tea?"}]
["이런",{"thoughts":"The term '이런' in Korean is an adjective used to describe something with an unexpected, unusual, or particular quality. It is often used to express astonishment or surprise.","target_language_multi_word_term":"이런","meaning":"'this kind of,' 'such,' or 'like this'.","additional_notes":"Commonly used in everyday speech to comment on or react to situations, often conveying surprise or disbelief. It can also be followed by a noun to modify it directly.","target_language_example":"이런 날씨에는 외출하기 싫어.","native_language_example":"I don't want to go out in weather like this."}]
["이런 일이",{"thoughts":"The term '이런 일이' combines the demonstrative '이런' which means 'this kind of' with '일이', the subject form of '일' meaning 'work' or 'situation'. It is often used to refer to a situation or event that is happening or has happened.","target_language_multi_word_term":"이런 일이","meaning":"'this kind of thing' or 'such an event'.","additional_notes":"Often used in sentences to express concern or surprise about a situation or event that is being discussed or has occurred.","target_language_example":"이런 일이 어떻게 일어났는지 이해할 수 없어요.","native_language_example":"I can't understand how such a thing happened."}]
["이렇게",{"thoughts":"'이렇게' is a Korean adverb used to describe the manner or way in which something is done, often translated as 'like this' or 'this way'.","target_language_multi_word_term":"이렇게","meaning":"'like this' or 'this way'.","additional_notes":"Used to indicate a specific manner or condition when explaining or showing something. Often used in instructional, explanatory contexts, or to describe something happening in a particular way.","target_language_example":"이렇게 하면 돼요.","native_language_example":"You can do it like this."}]
["이미",{"thoughts":"The Korean word '이미' is often used to express that something has already occurred. It is placed before the verb or sentence predicate to indicate the action has been completed prematurely or in advance of some contextual time. This word is useful for beginners to understand as it commonly appears in daily conversations to discuss past actions or previously established states.","target_language_multi_word_term":"이미","meaning":"'already'.","additional_notes":"Commonly used to convey actions or states that have taken place or been completed earlier than expected within a timeline.","target_language_example":"그는 이미 집에 갔어요.","native_language_example":"He has already gone home."}]
["이제 막",{"thoughts":"The Korean term '이제 막' is often used to express something that has just happened or has only recently started.","target_language_multi_word_term":"이제 막","meaning":"just now, just about, just.","additional_notes":"Used when referring to actions or events that have occurred only a moment ago or are on the verge of starting.","target_language_example":"그는 이제 막 도착했어요.","native_language_example":"He just arrived now."}]
["이제는",{"thoughts":"The term '이제는' is commonly used in Korean to convey a transition in time from the past to the present, indicating a change in condition or situation. It's like saying 'now' in a way that implies a contrast with the past.","target_language_multi_word_term":"이제는","meaning":"now (as opposed to before).","additional_notes":"'이제는' emphasizes a shift or transition, often used when the current situation is different from what it was before. It can add focus to the passage of time or change.","target_language_example":"이제는 더 이상 술을 마시지 않아요.","native_language_example":"I no longer drink alcohol now."}]
["이제부터",{"thoughts":"The term '이제부터' is a commonly used phrase in Korean, indicating the starting point of an action or event from the current moment onwards. This is particularly useful in both spoken and written contexts where one is setting a new stage, intention, or plan. Understanding this concept is key for conversations about time and plans.","target_language_multi_word_term":"이제부터","meaning":"from now on","additional_notes":"Used to express that something will begin or continue starting at this moment. It is often used to signify a change or a new phase.","target_language_example":"이제부터 열심히 공부하겠습니다.","native_language_example":"From now on, I will study diligently."}]
["일단",{"thoughts":"일단 is a Korean phrase that typically means 'first' or 'first of all' and is often used to indicate the first step in a series of actions or decisions, or to establish a situation before something else happens.","target_language_multi_word_term":"일단","meaning":"'first', 'first of all', 'for now'.","additional_notes":"Commonly used to indicate the first thing to tackle or consider, or as a placeholder action before figuring out more permanent solutions. Often seen in conversational contexts when someone wants to prepare or start preliminarily.","target_language_example":"일단 이 문제부터 해결하자.","native_language_example":"First, let's solve this problem."}]
["일부",{"thoughts":"The term '일부' in Korean is commonly used to indicate 'a part of' or 'a portion of' something. It's relevant for beginners as it might appear in various contexts like dividing tasks, describing parts of a meal, or splitting bills. Understanding this can help learners grasp how Koreans talk about incomplete quantities or portions of larger wholes.","target_language_multi_word_term":"일부","meaning":"'part' or 'portion'.","additional_notes":"Used to describe a specific part or portion of a whole. It can be used in various contexts, such as time, objects, or groups.","target_language_example":"그는 일부만 이해하고 있었다.","native_language_example":"He only understood part of it."}]
["일부는",{"thoughts":"The term '일부는' is a compound of '일부', meaning 'some' or 'part', and the particle '는', which is used to indicate the topic of a sentence or emphasize the subject in Korean. It may be useful for beginners learning to describe quantities or discuss portions of a whole.","target_language_multi_word_term":"일부는","meaning":"'some' or 'part of them'.","additional_notes":"This term is commonly used to describe a portion or segment of a larger group or category in discussions and statements.","target_language_example":"일부는 일찍 집에 갔다.","native_language_example":"Some of them went home early."}]
["일부러",{"thoughts":"\"일부러\" is a Korean adverb meaning 'on purpose' or 'intentionally.' It's used to indicate that an action was done deliberately, not by accident. This would be a useful term for beginner learners wanting to express intentional actions.","target_language_multi_word_term":"일부러","meaning":"'on purpose' or 'intentionally'.","additional_notes":"Used to describe an action done deliberately, often highlighting the intention behind it.","target_language_example":"그는 일부러 나를 놀리려고 했다.","native_language_example":"He teased me on purpose."}]
["자고",{"thoughts":"The term '자고' is derived from the verb '자다' (to sleep) with the conjunctive ending '-고'. It is often used in colloquial Korean to suggest going to sleep, either implying resting or initiating the act of sleep. Beginner learners might encounter this in everyday conversations.","target_language_multi_word_term":"자고","meaning":"'let's sleep' or 'going to sleep'.","additional_notes":"Used when suggesting or indicating the action of going to sleep. Provides a soft or casual command or proposal regarding sleeping.","target_language_example":"피곤한데, 이제 자고 싶어요.","native_language_example":"I'm tired, so I want to go to sleep now."}]
["자꾸",{"thoughts":"The term '자꾸' is used as an adverb in Korean to indicate something repetitive or frequently occurring. For beginner learners, it's useful to understand this as it relates to actions or situations that happen over and over again, often with a slightly bothersome or persistent connotation.","target_language_multi_word_term":"자꾸","meaning":"'repeatedly' or 'frequently'.","additional_notes":"It suggests an action or situation happening continuously, often with a nuance of annoyance or persistence. Commonly used in everyday speech.","target_language_example":"그는 자꾸 웃는다.","native_language_example":"He keeps laughing."}]
["자세히",{"thoughts":"The term '자세히' is an adverb in Korean used to describe seeing, examining, or expressing something in detail or thoroughly. It is relevant for beginners to understand this term to enhance their ability to describe the depth of their understanding or observations.","target_language_multi_word_term":"자세히","meaning":"in detail or thoroughly.","additional_notes":"This term is often used when asking for or giving detailed explanations or descriptions.","target_language_example":"그 책을 자세히 읽어보세요.","native_language_example":"Read the book in detail."}]
["자주",{"thoughts":"The term '자주' is used as an adverb in Korean to mean 'frequently' or 'often'. It describes an action that happens many times or regularly.","target_language_multi_word_term":"자주","meaning":"often, frequently","additional_notes":"It is commonly used in daily conversation to indicate frequency. It's similar to the English adverbs 'often' or 'frequently', showing something that happens many times or regularly.","target_language_example":"나는 자주 산책을 해요.","native_language_example":"I often take walks."}]
["잠깐",{"thoughts":"잠깐 is a common Korean word used to express shortness of time and is often used to indicate a brief period. It's relevant for learners as it frequently appears in everyday conversations.","target_language_multi_word_term":"잠깐","meaning":"'a moment' or 'just a moment'.","additional_notes":"Used when asking someone to wait for a short period or indicating a brief pause. Often interchangeable with '잠시'.","target_language_example":"잠깐 기다려 주세요.","native_language_example":"Please wait a moment."}]
["잠시",{"thoughts":"'잠시' is a Korean adverb used to indicate a short period of time, similar to 'for a moment' in English. It's often used in everyday conversations when asking someone to wait briefly.","target_language_multi_word_term":"잠시","meaning":"'for a moment' or 'briefly'.","additional_notes":"Commonly used when asking someone to wait or pause momentarily. Less formal than explicitly stating a specific amount of time, it provides a polite yet casual implication of a short waiting time.","target_language_example":"잠시만 기다려 주세요.","native_language_example":"Please wait a moment."}]
["저런",{"thoughts":"The Korean term '저런' is an exclamatory expression used to show disappointment, pity, or sympathy. It can be likened to saying 'oh dear', 'alas', or 'what a shame' in English, and is often used in reaction to bad news or unfortunate situations.","target_language_multi_word_term":"저런","meaning":"'oh dear' or 'alas'.","additional_notes":"Used to express sympathy, regret, or disappointment about something that has happened or is happening.","target_language_example":"저런, 비가 오네요.","native_language_example":"Oh dear, it's raining."}]
["저렇게",{"thoughts":"'저렇게' is a demonstrative adverb used in Korean to refer to the manner or way something is done, much like 'in that way' or 'like that' in English.","target_language_multi_word_term":"저렇게","meaning":"'in that manner' or 'like that'.","additional_notes":"It's often used to describe a way of doing something that is being pointed out, either physically or in conversation, and is often accompanied by gestures when speaking.","target_language_example":"저렇게 하면 안 돼요.","native_language_example":"You shouldn't do it like that."}]
["적어도",{"thoughts":"The Korean term '적어도' is used commonly to imply a minimum requirement or extent. It's often used in everyday conversation to indicate that something might not be sufficient but is necessary as a lower boundary.","target_language_multi_word_term":"적어도","meaning":"at least.","additional_notes":"Used to express a minimum quantity, time, or level necessary for a situation.","target_language_example":"적어도 하루에 물을 8잔 마셔야 해요.","native_language_example":"You should drink at least 8 glasses of water a day."}]
["전부",{"thoughts":"This Korean term is quite common and means 'everything' or 'all'. It is used to refer to the entirety of something, either tangible or abstract.","target_language_multi_word_term":"전부","meaning":"'all' or 'everything'.","additional_notes":"It's typically used to indicate completeness or the whole of something. It can be used with subjects related to groups, amounts, or concepts.","target_language_example":"나는 그들을 전부 믿어.","native_language_example":"I trust them all."}]
["전부 다",{"thoughts":"'전부 다' is a Korean phrase that translates to 'all of it' or 'everything'. It's often used to emphasize the completeness or entirety of something.","target_language_multi_word_term":"전부 다","meaning":"'all of it' or 'everything'.","additional_notes":"This expression is used to indicate the totality or completeness of an action, event, or quantity. It can be employed to emphasize that nothing is left out.","target_language_example":"저는 전부 다 먹었어요.","native_language_example":"I ate all of it."}]
["전혀",{"thoughts":"'전혀' is an adverb commonly used in negative contexts to mean 'not at all'. It intensifies the negation and is often used to emphasize the absence of something.","target_language_multi_word_term":"전혀","meaning":"'not at all'.","additional_notes":"It is typically used with negative forms to express complete negation. It cannot stand alone and must be paired with verbs, adjectives, or other expressions indicating negation.","target_language_example":"그 영화는 전혀 재미없었어요.","native_language_example":"That movie was not interesting at all."}]
["절대",{"thoughts":"'절대' is often used in Korean to stress emphatic prohibitions or strong assertions, translating to 'absolutely' or 'never'.","target_language_multi_word_term":"절대","meaning":"'absolutely' or 'never'.","additional_notes":"When used in a negative sentence, it implies strong negation, such as 'never'. In positive contexts, it emphasizes certainty.","target_language_example":"절대 포기하지 마세요.","native_language_example":"Never give up."}]
["절대 안",{"thoughts":"'절대 안' is a phrase used to express strong negation, essentially meaning 'never' or 'not at all.' It conveys a strong refusal or prohibition.","target_language_multi_word_term":"절대 안","meaning":"'never' or 'absolutely not'.","additional_notes":"Commonly used to emphasize that something will not happen under any circumstances.","target_language_example":"그 사람과 절대 안 만날 거야.","native_language_example":"I will never meet that person."}]
["절대로",{"thoughts":"The term '절대로' combines with verbs to express strong prohibitions or absolutes, such as 'never' or 'absolutely not'.","target_language_multi_word_term":"절대로","meaning":"'never', 'absolutely not'.","additional_notes":"Commonly used to emphasize a negative command or statement, especially when combined with negative verbs like 안 하다 (to not do), or 못 하다 (cannot do).","target_language_example":"절대로 거짓말하지 마세요.","native_language_example":"Never tell a lie."}]
["점점",{"thoughts":"The phrase '점점' is commonly used in Korean to denote a gradual change or progression, often translated as 'more and more' or 'gradually'. It's a useful phrase for beginners to understand how to discuss changes over time.","target_language_multi_word_term":"점점","meaning":"'gradually' or 'more and more'.","additional_notes":"It emphasizes a continuous or increasing process or state. It can be used with both adjectives and verbs to describe something that is happening progressively.","target_language_example":"날씨가 점점 더워지고 있어요.","native_language_example":"The weather is getting hotter and hotter."}]
["점점 더",{"thoughts":"The Korean term '점점 더' is an adverbial phrase typically used to express that something is increasing in intensity, frequency, or degree. It's a useful term for beginners to understand as it helps describe changes over time.","target_language_multi_word_term":"점점 더","meaning":"'more and more' or 'increasingly'.","additional_notes":"Commonly used to describe gradual changes or trends, especially when something is becoming more significant or noticeable over time.","target_language_example":"날씨가 점점 더 추워지고 있어요.","native_language_example":"The weather is getting colder and colder."}]
["정도",{"thoughts":"The term '정도' is often used to express an approximation, level, or degree of something in Korean. It's a versatile term applicable in contexts involving measurement, estimation, or comparison.","target_language_multi_word_term":"정도","meaning":"approximate, degree, level, or about.","additional_notes":"Usually used to convey a sense of approximation or extent. It can be used in contexts to indicate how much, how many, or to express an approximate time, quantity, or level.","target_language_example":"한 시간 정도 걸려요.","native_language_example":"It takes about one hour."}]
["정도로",{"thoughts":"'정도로' is a phrase that's often used to express a degree or extent, usually translated to 'to the extent that' or 'to a degree.' It is derived from the noun '정도' meaning 'degree' or 'extent' and is commonly used in comparative sentences or when explaining the level of something.","target_language_multi_word_term":"정도로","meaning":"'to the extent that' or 'to a degree'.","additional_notes":"Used to indicate the extent or degree of something, often in comparisons or explanations.","target_language_example":"너무 배가 불러서 움직일 수 없을 정도로 먹었어.","native_language_example":"I ate so much that I can't move."}]
["정말",{"thoughts":"‘정말’ is an adverb frequently used in everyday Korean to mean ‘really/truly.’ Learners will meet it early because it’s a common intensifier and question word. It’s polite-neutral and works both in statements and yes/no questions to check truth or add emphasis.","target_language_multi_word_term":"정말","meaning":"really; truly","additional_notes":"Used to intensify a statement (정말 좋아요 ‘I really like it’) or ask for confirmation (정말? ‘Really?’). Similar to 진짜, but slightly more neutral/polite.","target_language_example":"이 영화 정말 재미있어요.","native_language_example":"This movie is really fun."}]
["정말로",{"thoughts":"The Korean adverb '정말로' is used for emphasis and is equivalent to saying 'really' or 'truly' in English. It is often used to stress the truth or intensity of a statement, similar to how 'really' can be used in English for emphasis.","target_language_multi_word_term":"정말로","meaning":"'really' or 'truly'.","additional_notes":"Used for emphasis to affirm the truth or intensity of a statement. Often seen in both spoken and written Korean when trying to highlight sincerity or strong feelings.","target_language_example":"정말로 이 영화가 재미있어요.","native_language_example":"This movie is really interesting."}]
["정확하게",{"thoughts":"The term '정확하게' translates to 'accurately' or 'precisely' in English. It is an adverb used to describe the manner of performing an action with exactness.","target_language_multi_word_term":"정확하게","meaning":"'accurately', 'precisely'","additional_notes":"Often used to describe the manner of doing something with precision or exactness. Common in both everyday speech and more formal contexts.","target_language_example":"지도에서 정확하게 위치를 찾아보세요.","native_language_example":"Try to find the exact location on the map."}]
["정확히",{"thoughts":"The term '정확히' is an adverb in Korean that modifies verbs to express that an action is done in a precise or accurate manner. Beginner learners can find it useful to describe the exactness or correctness of an action or information.","target_language_multi_word_term":"정확히","meaning":"'exactly' or 'accurately'.","additional_notes":"Used to describe the precision or correctness of an action or statement. Common in everyday conversation to confirm or clarify details.","target_language_example":"그는 정확히 3시에 도착할 것이다.","native_language_example":"He will arrive exactly at 3 o'clock."}]
["제대로",{"thoughts":"The term '제대로' conveys a sense of doing something properly or according to the correct manner. It is often used when expressing a desire or need for accuracy, completeness, or correctness in an action or assessment.","target_language_multi_word_term":"제대로","meaning":"'properly' or 'correctly'.","additional_notes":"Used to emphasize doing something in the right or appropriate way.","target_language_example":"그 문제를 제대로 풀어야 해요.","native_language_example":"You must solve that problem properly."}]
["조금",{"thoughts":"조금 is a commonly used Korean adverb. It can be useful for learners to express quantity and frequency in basic conversations.","target_language_multi_word_term":"조금","meaning":"a little, slightly, or somewhat.","additional_notes":"Often used to describe a small amount or degree of something. It can modify verbs, adjectives, and other adverbs. Informally, it may be shortened to '좀' in conversation.","target_language_example":"매운 음식을 조금 먹었어요.","native_language_example":"I ate a little spicy food."}]
["조금만",{"thoughts":"The phrase '조금만' is often used in Korean to suggest doing just a small amount of something or having a little of something. It's useful in everyday conversation when asking for or offering a limited quantity or small from something.","target_language_multi_word_term":"조금만","meaning":"'just a little' or 'only a bit'.","additional_notes":"It is commonly used when you want to limit the amount or intensity of something, often in requests or offers. Similar to saying 'just a bit' or 'just a little' in English.","target_language_example":"물을 조금만 주세요.","native_language_example":"Please give me just a little bit of water."}]
["좀",{"thoughts":"\"좀\" literally means \"a little\", but in spoken Korean it is constantly used before verbs to soften a request, acting like \"please\" or \"just a sec\". Beginners should know both senses.","target_language_multi_word_term":"좀","meaning":"'a little; please (softening particle)'","additional_notes":"Adds politeness or minimizes the magnitude of the request. Placed before verbs or adjectives: 좀 기다려 주세요 (please wait a bit).","target_language_example":"문 좀 열어 주시겠어요?","native_language_example":"Could you open the door, please?"}]
["좀 더",{"thoughts":"The phrase '좀 더' is commonly used in Korean to express the idea of 'a bit more' or 'some more'. It is useful for beginner learners to know when asking for more of something or when describing the need for more of something.","target_language_multi_word_term":"좀 더","meaning":"a bit more","additional_notes":"'좀' is a contraction of '조금', which means 'a little', and '더' means 'more'. It's often used in requests or when describing a quantity or degree increase.","target_language_example":"물 좀 더 주세요.","native_language_example":"Please give me a bit more water."}]
["종종",{"thoughts":"The term '종종' is an adverb used in Korean to indicate frequency, similar to 'often' or 'frequently' in English. It's a useful word for beginners to express how often they do certain actions.","target_language_multi_word_term":"종종","meaning":"'often', 'frequently'.","additional_notes":"It describes actions that occur regularly or are repeated over time. Can be used in various contexts like activities or events.","target_language_example":"나는 종종 공원에 간다.","native_language_example":"I often go to the park."}]
["즉",{"thoughts":"'즉' is a Korean adverb used to indicate an explanation or clarification, similar to 'that is to say' or 'in other words' in English. It's a useful term to help rephrase or elaborate on a point.","target_language_multi_word_term":"즉","meaning":"'that is', 'in other words'.","additional_notes":"Typically used to restate something for clarity or provide more detail, it helps connect ideas logically.","target_language_example":"저는 소설가입니다. 즉, 책을 씁니다.","native_language_example":"I am a novelist. That is, I write books."}]
["즉시",{"thoughts":"The term '즉시' is frequently used in conversations to describe doing something immediately or without any delay, which is a concept that beginner Korean learners would encounter early on in everyday interactions.","target_language_multi_word_term":"즉시","meaning":"'immediately' or 'at once'.","additional_notes":"Used to express prompt action or response. Common in both spoken and written forms, suitable for requests and commands.","target_language_example":"그는 즉시 출발했다.","native_language_example":"He left immediately."}]
["지금 당장",{"thoughts":"The phrase '지금 당장' is commonly used to express urgency or immediacy of an action, similar to saying 'right now' or 'immediately' in English.","target_language_multi_word_term":"지금 당장","meaning":"right now or immediately.","additional_notes":"This phrase emphasizes the importance of doing something without delay. It combines 지금 (now) with 당장 (immediately) to create a sense of urgency.","target_language_example":"지금 당장 시작하세요.","native_language_example":"Start right now."}]
["지금 바로",{"thoughts":"The phrase '지금 바로' is commonly used in Korean to emphasize immediate action or urgency. This is essential for beginners wanting to express the need to do something right away.","target_language_multi_word_term":"지금 바로","meaning":"right now; immediately.","additional_notes":"This phrase is used to express urgency or immediate action towards something and works well when you need to convey a sense of immediacy in everyday situations.","target_language_example":"지금 바로 시작하세요.","native_language_example":"Start right now."}]
["지금부터",{"thoughts":"'지금부터' is a common phrase in Korean used to indicate the starting point of an action or event from now onwards. It's useful for beginners to understand how to express time-related actions.","target_language_multi_word_term":"지금부터","meaning":"from now on, starting now.","additional_notes":"This phrase is useful when expressing the start of an action or situation that begins at the current moment. It's often used to signify a change or the commencement of something.","target_language_example":"지금부터 공부할 거예요.","native_language_example":"I will start studying from now on."}]
["지도",{"thoughts":"The Korean term '지도' is commonly used to refer to a map, which is a basic item often needed when giving or asking for directions. A beginner learner might encounter this term when asking for or needing to use a map.","target_language_multi_word_term":"지도","meaning":"'map'.","additional_notes":"Used in contexts involving navigation, directions, or geography. It can refer to both physical and digital maps.","target_language_example":"지도를 보고 길을 찾았어요.","native_language_example":"I looked at the map to find the way."}]
["진짜",{"thoughts":"The word '진짜' is frequently used in Korean to express authenticity or emphasis, similar to saying 'really' in English. It's both a noun, as in 'the real thing,' and an adverb to add emphasis to statements or questions.","target_language_multi_word_term":"진짜","meaning":"'really' or 'truly'.","additional_notes":"Commonly used in informal speech to express surprise, disbelief, or to emphasize sincerity or truth. It can also strengthen adjectives and verbs.","target_language_example":"진짜 맛있어!","native_language_example":"It's really delicious!"}]
["진짜로",{"thoughts":"'진짜로' is a Korean adverb used to emphasize the truth or authenticity of something, similar to how 'really' or 'truly' is used in English.","target_language_multi_word_term":"진짜로","meaning":"really; truly.","additional_notes":"This term is often used to stress sincerity or to express disbelief or surprise.","target_language_example":"진짜로 좋아해요.","native_language_example":"I really like it."}]
["차라리",{"thoughts":"‘차라리’ is an adverb in Korean used to express a preference for one option over a less desirable one. It's similar to choosing the lesser of two evils or indicating that one action or outcome is more favorable than another, despite neither being ideal.","target_language_multi_word_term":"차라리","meaning":"'rather' or 'preferably'.","additional_notes":"This word is often used when comparing two situations, actions, or outcomes, where the speaker suggests that one is more tolerable or preferable than the other. It is frequently used in informal situations.","target_language_example":"비가 오는 날에 차라리 집에 있을게요.","native_language_example":"On rainy days, I would rather stay at home."}]
["처럼",{"thoughts":"The phrase '처럼' is used in Korean to mean 'like' or 'as if', often to compare one thing to another. It's a useful term for beginners to express similarities.","target_language_multi_word_term":"처럼","meaning":"'like' or 'as if'.","additional_notes":"Used to compare or show similarities between two things or situations.","target_language_example":"그녀는 천사처럼 친절하다.","native_language_example":"She is kind like an angel."}]
["처음부터",{"thoughts":"In Korean, '처음부터' is commonly used to indicate a starting point or beginning of an action, event, or timeframe. It's relevant for learners as it forms part of many daily expressions, especially when explaining processes or recounting sequences of events.","target_language_multi_word_term":"처음부터","meaning":"'from the beginning' or 'since the start'.","additional_notes":"It is used when speaking about doing something from the very beginning or describes an action that was intended or planned from the start.","target_language_example":"처음부터 다시 시작하자.","native_language_example":"Let's start over from the beginning."}]
["처음에는",{"thoughts":"The term '처음에는' translates to 'at first' or 'initially'. It is used to describe the initial stage or first instance of an event or process.","target_language_multi_word_term":"처음에는","meaning":"'at first' or 'initially'.","additional_notes":"This phrase is commonly used to describe the initial conditions or perspectives that may change over time. It sets a temporal context for the narrative that follows.","target_language_example":"처음에는 한국어가 정말 어려웠어요.","native_language_example":"At first, Korean was really difficult."}]
["최소한",{"thoughts":"The term '최소한' is used in Korean to express the idea of 'at least' or setting a minimum standard or expectation. It's useful for learners to know as it can apply to both quantitative and qualitative contexts, like expectations or amounts.","target_language_multi_word_term":"최소한","meaning":"'at least'.","additional_notes":"Used to indicate a minimum requirement, amount, or standard. It often precedes a specific number, quantity, or condition.","target_language_example":"최소한 두 시간은 걸립니다.","native_language_example":"It takes at least two hours."}]
["통해",{"thoughts":"The Korean term '통해' is frequently used in the context of expressing how something is done or indicating the medium or method used to achieve something, translating to 'through' or 'via' in English. It's a prepositional phrase integral to forming complex sentences in Korean.","target_language_multi_word_term":"통해","meaning":"'through' or 'via'.","additional_notes":"'통해' can be used to indicate the method or medium, often followed by nouns to express 'by way of' or 'by means of'. It helps connect actions or events with the means through which they occur.","target_language_example":"인터넷을 통해 정보를 얻었어요.","native_language_example":"I got the information through the Internet."}]
["통해서",{"thoughts":"The term '통해서' is commonly used in Korean to indicate a means or method, often translated as 'through' or 'via'. It is used to describe doing something by way or means of something else.","target_language_multi_word_term":"통해서","meaning":"'through' or 'via'.","additional_notes":"It is commonly used to show that one action is accomplished by means of another action or instrument. This term helps in connecting clauses and explaining processes or means.","target_language_example":"그는 친구를 통해서 소식을 들었어요.","native_language_example":"He heard the news through a friend."}]
["특별히",{"thoughts":"The term '특별히' is used in Korean to mean 'especially' or 'particularly'. It's used to emphasize a distinction or highlight something as being notable compared to other things.","target_language_multi_word_term":"특별히","meaning":"'especially' or 'particularly'.","additional_notes":"Used to stress something that stands out, to highlight the importance or uniqueness of something in a given context.","target_language_example":"특별히 준비한 선물이 있습니다.","native_language_example":"I have a gift that I prepared especially for you."}]
["특히",{"thoughts":"The Korean term '특히' is a useful adverb for learners to understand emphasis or specification within sentences. It is frequently used to highlight something in particular.","target_language_multi_word_term":"특히","meaning":"'especially' or 'particularly'.","additional_notes":"Used to emphasize a particular aspect of something compared to others.","target_language_example":"저는 특히 매운 음식을 좋아해요.","native_language_example":"I especially like spicy food."}]
["특히나",{"thoughts":"The term '특히나' is often used in Korean to add emphasis, similar to saying 'especially' in English. It's often used when you want to highlight something as being more significant or noteworthy than usual.","target_language_multi_word_term":"특히나","meaning":"'especially' or 'particularly'.","additional_notes":"Used to emphasize a specific point or thing that stands out more than others. It's a more emphatic version of '특히'.","target_language_example":"그녀는 특히나 아이들을 좋아해요.","native_language_example":"She especially likes children."}]
["하지만",{"thoughts":"The Korean word '하지만' is a conjunction often used to contrast two different ideas or statements, similar to 'but' or 'however' in English. It's important for beginner learners to understand this as it's commonly used in everyday conversation to express contrast between two thoughts.","target_language_multi_word_term":"하지만","meaning":"'but' or 'however'.","additional_notes":"Used to introduce a contrasting statement or idea in a sentence. It often links two independent clauses.","target_language_example":"나는 배가 고프다. 하지만 아무것도 먹고 싶지 않다.","native_language_example":"I am hungry. However, I don't want to eat anything."}]
["한 가지",{"thoughts":"The Korean term '한 가지' is used to refer to 'one thing' or 'one kind.' It is often utilized in conversations to specify a single item, type, or form of something.","target_language_multi_word_term":"한 가지","meaning":"'one thing' or 'one type'.","additional_notes":"Often used to specify or single out something among a group or category. Useful for distinguishing individual items or concepts.","target_language_example":"제가 좋아하는 음식이 한 가지 있습니다.","native_language_example":"There is one type of food that I like."}]
["한 번 더",{"thoughts":"The term '한 번 더' is a simple but useful phrase that beginners should learn, especially for everyday interactions. It is used when you want someone to repeat something or do it again.","target_language_multi_word_term":"한 번 더","meaning":"once more or one more time.","additional_notes":"Commonly used to request repetition of an action or to emphasize doing something again.","target_language_example":"한 번 더 말해 주세요.","native_language_example":"Please say it one more time."}]
["한 번에",{"thoughts":"The Korean term '한 번에' is frequently used in sentences to describe doing something in one go, or all at once. It can be useful in everyday conversation when talking about completing tasks or actions efficiently.","target_language_multi_word_term":"한 번에","meaning":"all at once; in one go.","additional_notes":"Often used when discussing the efficiency of completing tasks or achieving something without breaks or interruptions.","target_language_example":"모든 일을 한 번에 끝냈어.","native_language_example":"I finished everything all at once."}]
["한번 더",{"thoughts":"The Korean phrase '한번 더' is used to ask for something to be done once more, often used in repeat requests or when asking someone to demonstrate or perform an action again.","target_language_multi_word_term":"한번 더","meaning":"'once more' or 'one more time'.","additional_notes":"Commonly used in casual speech to ask someone to repeat an action or statement. It conveys an informal tone, suitable among friends or peers.","target_language_example":"그 노래 한번 더 들려줘.","native_language_example":"Play that song one more time."}]
["한번에",{"thoughts":"The Korean term '한번에' is often used to describe doing something all at once or in one go. It implies completion or achieving something in a single attempt.","target_language_multi_word_term":"한번에","meaning":"'all at once' or 'in one go'.","additional_notes":"It is commonly used when referring to completing tasks or understanding something in a singular effort. This term can emphasize efficiency or thoroughness.","target_language_example":"그는 문제를 한번에 해결했다.","native_language_example":"He solved the problem in one go."}]
["한테",{"thoughts":"'한테' is a Korean particle often used to indicate direction towards a person, or it can mean 'from' when talking about receiving something from someone. It's commonly used in informal contexts and can be compared to 'to' in English when implying 'giving something to someone'.","target_language_multi_word_term":"한테","meaning":"'to' or 'from' (a person).","additional_notes":"Used to indicate the person to whom something is given or from whom something is received. It's an informal version of the more formal particle '께'.","target_language_example":"나는 친구한테 선물을 줬어요.","native_language_example":"I gave a gift to my friend."}]
["함께",{"thoughts":"The term '함께' is often used in Korean to indicate doing something together with someone else. It's a versatile term that underscores collaboration or joint action.","target_language_multi_word_term":"함께","meaning":"'together.'","additional_notes":"Often used when describing activities performed with someone else, indicating a sense of companionship or collective action.","target_language_example":"우리는 함께 영화를 봤어요.","native_language_example":"We watched a movie together."}]
["항상",{"thoughts":"The Korean word '항상' is an adverb commonly used to express the concept of 'always' or 'constantly'. It is often used to describe habitual actions or states and is particularly useful for beginners learning to form sentences about daily routines or frequent activities.","target_language_multi_word_term":"항상","meaning":"'always' or 'constantly'.","additional_notes":"Used to indicate something that occurs all the time or habitually. Commonly used in daily conversation.","target_language_example":"그녀는 항상 아침에 조깅을 해요.","native_language_example":"She always jogs in the morning."}]
["혹시",{"thoughts":"The Korean term '혹시' is often used to express uncertainty or to gently introduce a question or request. It's similar to saying 'by any chance,' 'perhaps,' or expressing something tentatively. It's frequently used at the beginning of sentences to soften the approach in Korean conversations.","target_language_multi_word_term":"혹시","meaning":"'by any chance' or 'perhaps'.","additional_notes":"Often used to introduce polite questions or requests, expressing a sense of uncertainty or potential possibility.","target_language_example":"혹시 시간이 있으면 잠깐 만날 수 있어요?","native_language_example":"By any chance, if you have time, could we meet for a moment?"}]
["확실하게",{"thoughts":"The term '확실하게' is an adverb form used often to convey the sense of certainty or assurance in an action or statement. Beginners might often want to confirm or affirm things when learning a new language.","target_language_multi_word_term":"확실하게","meaning":"certainly or surely","additional_notes":"Used to express that something is done with certainty or in a definitive way. It is related to the adjective '확실하다,' meaning something is certain or sure.","target_language_example":"그 일을 확실하게 끝냈어요.","native_language_example":"I certainly finished that work."}]
["확실히",{"thoughts":"'확실히' is an adverb in Korean that is used to convey certainty or assurance, often used for emphasis or to confirm something previously mentioned or understood.","target_language_multi_word_term":"확실히","meaning":"certainly or definitely.","additional_notes":"Used to affirm a statement or indicate strong confidence in the truth of a situation. Common in spoken and written communication to emphasize certainty.","target_language_example":"이 제품은 확실히 좋습니다.","native_language_example":"This product is certainly good."}]
["훨씬",{"thoughts":"The Korean word '훨씬' is an adverb used to indicate a degree of comparison, similar to the English terms 'much', 'far', or 'considerably'. It enhances the characteristics of adjectives or adverbs that follow it, making them more extreme or intense in comparison.","target_language_multi_word_term":"훨씬","meaning":"much, far, considerably","additional_notes":"Used to emphasize how much more one thing is than another. Commonly used with comparative adjectives.","target_language_example":"이 영화가 훨씬 재미있어요.","native_language_example":"This movie is much more interesting."}]
["훨씬 더",{"thoughts":"The phrase '훨씬 더' is used in Korean to indicate a greater degree or extent of something. It's similar to how we use 'much more' or 'far more' in English to intensify the degree of an adjective or verb. It's a useful adverbial phrase for beginners to learn, as it helps in expressing comparisons and emphasis.","target_language_multi_word_term":"훨씬 더","meaning":"'much more' or 'far more'.","additional_notes":"Used to intensify or emphasize a comparison, often placed before an adjective or adverb.","target_language_example":"이 책은 훨씬 더 재미있어요.","native_language_example":"This book is much more interesting."}]
