["ㄱ",{"thoughts":"ㄱ sounds like the English k/g family, so the general mouth movement is already familiar. What trips learners up is WHEN it acts more like a soft, un-aspirated “k” (word-initial), a clear “g” (between vowels), or a clipped, unreleased “k” (syllable-final). The sound can show up anywhere in a Korean word, so learners must notice its three context-driven flavors.","pattern":"ㄱ","position":"Anywhere","description":"Unaspirated velar stop. At the very start of a word it’s a soft, voiceless “k” (less puff of air than in English ‘kite’). Between vowels or after sonorants it’s voiced, like a mild English “g” in ‘go’. At the end of a syllable it closes the throat and stops abruptly—an unreleased “k” (imagine saying ‘sick’ but cutting the airflow right at the end).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"김치","native":"kimchi","position":"Beginning","cultural_context":"Staple Korean fermented cabbage dish that appears on menus worldwide"},{"target":"불고기","native":"bulgogi","position":"Middle","cultural_context":"Well-known marinated Korean BBQ beef"},{"target":"떡","native":"tteok (rice cake)","position":"End","cultural_context":"Korean rice cake mentioned in street-food videos and recipes"}]}]
["ㄲ",{"thoughts":"English has no true ‘tense’ consonants, so ㄲ can feel unfamiliar. It’s a fortis (tense) version of ㄱ: the tongue is in the same place as for an unaspirated English “k” (as in “ski”), but the airflow is squeezed and released abruptly with extra throat tension and no audible puff of air. When ㄲ is the final consonant of a syllable it is held briefly without any release.","pattern":"ㄲ","position":"Anywhere","description":"A very tight, un-aspirated “k/g” sound made with strong throat tension. Think of saying the k in “ski,” but clamp your vocal cords and let no burst of air escape.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"깍두기","native":"깍두기","position":"Beginning","cultural_context":"Cubed radish kimchi side dish seen in Korean BBQ restaurants"},{"target":"떡볶이","native":"떡볶이","position":"Middle","cultural_context":"Popular spicy rice-cake street food featured in K-dramas and food videos"}]}]
["ㅋ",{"thoughts":"ㅋ is basically an aspirated K-sound—very similar to the burst of air in English “k” as in “kite,” only a bit stronger. English already has aspiration on initial /k/, so the beginning-of-syllable version feels familiar. The tricky bits are (1) keeping the extra-strong puff of air when Koreans want it, and (2) clipping the sound off with no audible release when it ends a syllable (spelled ㅋ but rarely seen in everyday words). Because the sound matches something English speakers already use, it’s not hard, but the finer details take a little attention.","pattern":"ㅋ","position":"Anywhere","description":"Pronounced as an aspirated velar stop [kʰ]. At the start of a syllable it is like the \"k\" in English “keep,” but with an even sharper burst of air—try holding a tissue in front of your mouth; it should flutter. Between vowels it keeps that same aspirated K. If it ever appears as a final consonant, the tongue stays in the K position but you cut the airflow—no release, like stopping halfway through the word “back.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"케이팝","native":"케이팝","position":"Beginning","cultural_context":"The term \"K-pop\"—global Korean pop music genre"},{"target":"코카콜라","native":"코카콜라","position":"Multiple","cultural_context":"Brand name Coca-Cola written in Hangul"},{"target":"치킨","native":"치킨","position":"Middle","cultural_context":"Loan-word for fried chicken found on many Korean menus"},{"target":"ㅋㅋ","native":"ㅋㅋ","position":"Multiple","cultural_context":"Text-message laughter (like \"haha\") seen by K-drama or K-pop fans"}]}]
["ㄴ",{"thoughts":"English already has the exact same /n/ sound, so learners mainly need to remember that the symbol ㄴ always represents that sound, whether it starts or ends a syllable.","pattern":"ㄴ","position":"Anywhere","description":"ㄴ is the regular \"n\" sound—all voiced air through the nose with the tongue touching the ridge just behind the upper teeth. At the beginning of a syllable it matches the English n in “no.” At the end of a syllable (batchim) it is still /n/, but you stop the sound cleanly without adding an extra vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"나이키","native":"나이키","position":"Beginning","cultural_context":"Brand name Nike—global sportswear company"},{"target":"인천","native":"인천","position":"Middle","cultural_context":"Incheon—major Korean city with an international airport"},{"target":"부산","native":"부산","position":"End","cultural_context":"Busan—well-known port city often mentioned in travel shows and movies"}]}]
["ㄷ",{"thoughts":"ㄷ alternates between a soft, un-aspirated “d/t” at the start of a syllable and an unreleased “t” when it closes a syllable. English speakers know a similar ‘d’ sound but must remember not to aspirate it and to cut it short when syllable-final.","pattern":"ㄷ","position":"Anywhere","description":"Syllable-initial ㄷ sounds like a light, un-aspirated “d,” somewhere between the English d in “dog” and an un-aspirated t. You start with your tongue on the ridge just behind your upper teeth, release gently with almost no burst of air. When ㄷ ends a syllable it becomes an unreleased, voiceless “t” (hold the tongue and don’t let air pop).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"대구","native":"Daegu (large city)","position":"Beginning","cultural_context":"Often mentioned in K-pop tours and Korean travel shows"},{"target":"만두","native":"mandu – Korean dumplings","position":"Middle","cultural_context":"Common Korean food found in many Asian restaurants"},{"target":"태권도","native":"taekwondo – Korean martial art","position":"End","cultural_context":"Olympic sport and popular self-defense class worldwide"},{"target":"디즈니","native":"Disney","position":"Beginning","cultural_context":"Famous entertainment company, spelled this way in Korean media"}]}]
["ㄸ",{"thoughts":"English has no direct equivalent to ㄸ, a tense unaspirated T sound. Learners must keep the vocal cords relaxed (voiceless), the tongue tip on the same spot as an English T, but squeeze the tongue and throat muscles to make it extra-tight, releasing with no burst of air.","pattern":"ㄸ","position":"Anywhere","description":"ㄸ is a tense, voiceless, unaspirated T. Think of the T in “stop,” then add extra tongue and throat tension and be sure no puff of air escapes. It is sharper than the English D/T but still voiceless.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"떡볶이","native":"tteokbokki","position":"Beginning","cultural_context":"Spicy Korean rice-cake dish popular in K-dramas and many Korean restaurants"},{"target":"오뚜기","native":"Ottogi","position":"Middle","cultural_context":"Major Korean food brand seen on instant ramen and sauces in Asian grocery stores"},{"target":"뚜레쥬르","native":"Tous Les Jours","position":"Beginning","cultural_context":"Korean bakery chain with branches in many U.S. cities"}]}]
["ㅌ",{"thoughts":"English already has an aspirated T at the start of stressed words, so the initial Korean ㅌ should feel familiar. The trickier part is that in final position it is a very short, completely un-released stop, not the puff of air an English speaker might give. Overall, most learners get the onset easily and just have to remember to \"cut off\" the sound when ㅌ ends a syllable.","pattern":"ㅌ","position":"Anywhere","description":"ㅌ is an aspirated ‘t’. At the start of a syllable it sounds like the strong T in the English word “top” – tongue on the upper teeth ridge, a burst of air. When ㅌ closes a syllable (받침) it becomes a very brief, unreleased [t̚] – the tongue touches but you do NOT let the air out, similar to the cut-off T many Americans use at the end of “cat” in fast speech.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"토마토","native":"tomato","position":"Beginning","cultural_context":"Loan-word for the fruit/vegetable; appears on menus and in K-pop lyrics"},{"target":"테니스","native":"tennis","position":"Beginning","cultural_context":"Same sport name, often seen when following Korean sports coverage"},{"target":"핫","native":"hot (trendy)","position":"End","cultural_context":"Used in ads and social media to label something as fashionable, e.g., “핫 아이템”"}]}]
["ㄹ",{"thoughts":"English speakers usually map both R and L to one tongue position, but Korean ㄹ changes depending on where it sits: it’s a quick flap between vowels and a light L at the end of a syllable. That contrast and the very fast tongue movement make it tricky.","pattern":"ㄹ","position":"Anywhere","description":"Between vowels (syllable-initial) ㄹ is a single quick tongue flap, like the Spanish single “r” or the very fast D in “beTTer” in many American accents. At the end of a syllable it settles into a light L sound with the tongue touching just behind the upper teeth, softer than the English dark-L in “ball.” Double ㄹ (ㄹㄹ) or two ㄹ in a row is held slightly longer but still basically an L. Avoid pronouncing it as a hard English R.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"라면","native":"ramyeon (instant noodles)","position":"Beginning","cultural_context":"K-food staple found in supermarkets and featured in pop culture"},{"target":"갈비","native":"galbi (Korean BBQ ribs)","position":"Middle","cultural_context":"Popular Korean barbecue dish ordered at restaurants"},{"target":"서울","native":"Seoul (capital city of Korea)","position":"End","cultural_context":"World-famous city, host of 1988 Olympics & K-pop hub"}]}]
["ㅁ",{"thoughts":"ㅁ is essentially the same bilabial nasal English speakers already use for the letter “m,” so it should feel immediately familiar. The only minor surprise is that in Korean it remains clearly nasal even when it closes a syllable, whereas English sometimes lets final-m turn into a faint stop (as in “ham‿burger”).","pattern":"ㅁ","position":"Anywhere","description":"Pronounce it like the English “m” in “mom” – lips together, voicing through the nose. At the end of a syllable or word, keep the air flowing through the nose; don’t release it with a puff or turn it into an “n.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"미나리","native":"Minari","position":"Beginning","cultural_context":"Oscar-winning Korean film widely shown in English-speaking countries"},{"target":"삼성","native":"Samsung","position":"Middle","cultural_context":"Global electronics company whose name appears on phones & TVs"},{"target":"비빔밥","native":"bibimbap","position":"Multiple","cultural_context":"Popular Korean mixed-rice dish on many restaurant menus"},{"target":"강남","native":"Gangnam","position":"End","cultural_context":"Seoul district popularized by the hit song “Gangnam Style”"}]}]
["ㅂ",{"thoughts":"ㅂ is roughly the Korean “b/p” consonant. English speakers have both /b/ (voiced) and /p/ (aspirated voiceless), but Korean ㅂ sits in-between: at the start of a word it is a lightly-aspirated voiceless sound, closer to a soft English p without a big puff of air; between vowels it often sounds like a relaxed English b; at the end of a syllable it is an unreleased stop, like the cut-off p in the casual English ‘stop’ said very quickly.","pattern":"ㅂ","position":"Anywhere","description":"Think of a cross between English “b” and a gentle, almost voiceless “p.”\n• Word-initial: light, almost voiceless p (no big burst of air).\n• Between vowels or after nasals: voiced like a soft English b.\n• Syllable-final (batchim): lips close but don’t pop open—an unreleased p.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"부산","native":"Busan","position":"Beginning","cultural_context":"Famous port city often mentioned in travel and K-pop news"},{"target":"불고기","native":"bulgogi","position":"Beginning","cultural_context":"Popular Korean marinated BBQ beef dish found in many restaurants"},{"target":"김밥","native":"gimbap","position":"Multiple","cultural_context":"Seaweed rice roll frequently called “Korean sushi” in food blogs"},{"target":"밥","native":"bap","position":"End","cultural_context":"Means plain cooked rice; the word appears in many K-drama subtitles"}]}]
["ㅃ",{"thoughts":"English speakers already hear something similar in the un-aspirated p of the English word “spa,” but they rarely hold the lips so tensely. List familiar K-culture words that really contain ㅃ and flag common trouble: no burst of air, no voicing.","pattern":"ㅃ","position":"Anywhere","description":"ㅃ is a tense, un-aspirated double-consonant. Start as if saying the English p in “spa,” but squeeze your lips and vocal-tract muscles a bit harder and release with almost zero puff of air. Do not voice it like English b, and do not let air explode the way it does in English p of “pie.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"빵","native":"빵","position":"Beginning","cultural_context":"Common word for bread; often mentioned in K-dramas and Korean bakeries abroad"},{"target":"오빠","native":"오빠","position":"Middle","cultural_context":"Famous K-pop/K-drama term for older brother or male idol"},{"target":"빼빼로","native":"빼빼로","position":"Multiple","cultural_context":"Pepero chocolate biscuit sticks—well-known Korean snack and “Pepero Day” on 11/11"},{"target":"뽀로로","native":"뽀로로","position":"Beginning","cultural_context":"Title character of popular kids’ cartoon “Pororo the Little Penguin,” exported worldwide"}]}]
["ㅍ",{"thoughts":"ㅍ is the Korean aspirated P. English speakers already make an aspirated P at the start of words like “pot,” so the main new thing to notice is that in Korean it is ALWAYS strong when it begins a syllable, and it becomes a very short, unreleased stop when it ends one.","pattern":"ㅍ","position":"Anywhere","description":"At the start of a syllable ㅍ is an aspirated [pʰ]—like the puff of air in English “pie,” just a bit stronger and without any following breathy ‘h’ sound. When ㅍ is the final consonant (batchim) it closes the mouth firmly and stops the airflow with no release, similar to the clipped ending of the English word “cap” when you stop suddenly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"핑크","native":"pink","position":"Beginning","cultural_context":"Loan word for the color pink, often seen in K-pop and fashion"},{"target":"커피","native":"coffee","position":"Middle","cultural_context":"Word on virtually every café menu in Korea"},{"target":"앞","native":"front; in front of","position":"End","cultural_context":"Common subtitle and sign word in K-dramas and on streets"}]}]
["ㅅ",{"thoughts":"English speakers already know an /s/ sound, so the basic version of ㅅ feels familiar. The surprises are (1) it turns into a soft “sh” [ɕ] before the ‘i/ya/ye/yo/yu-type’ vowels and (2) it is pronounced as an unreleased /t/ when it is the final consonant of a syllable. Those two twists add some learning load, but the mouth position itself is not hard.","pattern":"ㅅ","position":"Anywhere","description":"Usually like the English “s” in “see.” Before the high front/‐y vowels (ㅣ, ㅑ, ㅕ, ㅛ, ㅠ, ㅖ, ㅒ) it softens to a quick, light “sh” sound [ɕ] — think of saying “sh” with the tongue a bit flatter. When ㅅ is the final consonant of a syllable (받침) it is pronounced as a tight, unreleased “t.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"삼성","native":"Samsung","position":"Multiple","cultural_context":"Global electronics brand most people know"},{"target":"소주","native":"soju","position":"Beginning","cultural_context":"Famous Korean distilled drink served in K-BBQ restaurants"},{"target":"신라면","native":"Shin Ramyun","position":"Beginning","cultural_context":"Instant noodle brand found in many grocery stores"},{"target":"맛","native":"mat (taste)","position":"End","cultural_context":"Shows up in food phrases like “맛있어요” (‘delicious’) seen on K-food blogs"}]}]
["ㅆ",{"thoughts":"English speakers already know an /s/ sound, so ㅆ won’t feel totally alien. The challenge is keeping the tongue tense and the airflow slightly constricted so the sound is sharper than a normal English /s/, and remembering that at the very end of a syllable it turns into a quick, unreleased /t̚/ sound. Most learners figure it out after a bit of listening and drilling.","pattern":"ㅆ","position":"Anywhere","description":"ㅆ is a “tense” or “fortis” S. At the start or between vowels it sounds like a very crisp, hiss-free /s/—imagine saying the first /s/ in “sun” while clenching the tongue muscles and letting out a little less air. Keep the vocal cords completely voiceless. When ㅆ ends a syllable (batchim) it stops abruptly, more like the cut-off /t/ at the end of “cat,” with no audible release.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ssamjang","native":"쌈장","position":"Beginning","cultural_context":"Popular Korean BBQ dipping sauce you spread on lettuce wraps"},{"target":"SsangYong","native":"쌍용","position":"Beginning","cultural_context":"Korean automobile brand name often seen on SUVs"},{"target":"issda","native":"있다","position":"End","cultural_context":"Basic verb meaning “to exist / have,” common in beginner phrases like “있어요?”"}]}]
["ㅇ",{"thoughts":"English speakers already know the /ŋ/ sound (the “ng” in “sing”), so half of what ㅇ does is familiar. What is new is that, when ㅇ comes at the very front of a syllable before a vowel, it is completely silent—just a placeholder. That concept (a letter that makes no sound in certain spots) can surprise learners, but physically the sound is not hard.","pattern":"ㅇ","position":"Anywhere","description":"Two jobs: (1) At the front of any syllable that starts with a vowel, ㅇ is silent—your mouth just begins straight on the vowel. (2) At the end of a syllable it is pronounced like the English final “ng” in “sing,” never like the hard “g.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"아이돌","native":"idol / K-pop star","position":"Multiple","cultural_context":"Common K-pop term English speakers see when following Korean music"},{"target":"삼성","native":"Samsung","position":"End","cultural_context":"Global electronics brand (phones, TVs, etc.)"},{"target":"강남","native":"Gangnam (district)","position":"Middle","cultural_context":"Famous from the 2012 hit song “Gangnam Style”"}]}]
["ㅈ",{"thoughts":"Korean ㅈ is an unaspirated alveolo-palatal affricate. It sounds somewhere between the English “j” in “jam” and the “ch” in “cheer,” but without the strong burst of air that English “ch” has. Word-medially it keeps the same soft affricate quality; word-finally it is unreleased, coming out like a very short, clipped “t.” English speakers may recognize the sound from loanwords such as “soju.” It is fairly familiar but the exact tongue position and lack of aspiration take practice.","pattern":"ㅈ","position":"Anywhere","description":"Start with your tongue touching the area just behind your upper front teeth (like the start of “d”). Release it while letting friction hiss slightly (like “sh”)—you get a quick blended “j/ch” sound. Do NOT puff extra air the way you might for English “ch.” At the very end of a word, simply stop the airflow abruptly, similar to an unreleased “t.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"제주","native":"Jeju (island)","position":"Multiple","cultural_context":"South Korea’s famous resort island often shown in travel programs and K-dramas"},{"target":"소주","native":"soju","position":"Middle","cultural_context":"Well-known Korean distilled liquor found in many Korean restaurants worldwide"},{"target":"진","native":"Jin (given name)","position":"Beginning","cultural_context":"Stage name of a BTS member, familiar to K-pop fans"}]}]
["ㅉ",{"thoughts":"‘ㅉ’ is the tense (double) version of the Korean ‘ㅈ’ sound. It only occurs as the initial consonant of a syllable, so within a word it can show up at the very start, somewhere in the middle, or in the last syllable, but never as a final consonant. It has one stable pronunciation, no positional variations.","pattern":"ㅉ","position":"Anywhere","description":"Pronounce it like the ‘j’ in “jump,” but with the tongue tensed and a stronger, crisper release—almost as if you are saying two quick ‘j’ sounds at once while holding your breath. The vocal cords stay voiceless (no vibration), and there is a noticeable ‘pop’ to it. Do NOT add a vowel before it; go straight into the following vowel.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"짜장면","native":"짜장면","position":"Beginning","cultural_context":"Famous Korean‐Chinese black-bean noodles often featured in dramas and food shows"},{"target":"김치찌개","native":"김치찌개","position":"Middle","cultural_context":"Classic kimchi stew that appears in many Korean recipes and restaurant menus"},{"target":"있지","native":"있지","position":"End","cultural_context":"Official Korean spelling of ITZY, a well‐known K-pop girl group"}]}]
["ㅊ",{"thoughts":"English has a very similar “ch” sound, so learners recognize it, but Korean ㅊ is a bit more strongly aspirated at the start of a syllable and turns into a final-stop /t̚/ at the end. Need to highlight the extra breath and the coda change.","pattern":"ㅊ","position":"Anywhere","description":"At the start of a syllable ㅊ is an aspirated “ch” (like the first sound in English “chew” but with a stronger puff of air, almost “tʃʰ”). When it ends a syllable it loses the ‘sh’ quality and closes abruptly like an unreleased “t”.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"치킨","native":"치킨","position":"Beginning","cultural_context":"Korean fried chicken; the word looks and sounds like English “chicken” so many visitors know it"},{"target":"김치","native":"김치","position":"End","cultural_context":"Famous Korean fermented cabbage side dish, commonly mentioned in English"}]}]
["ㅎ",{"thoughts":"English already has an /h/ sound, so the basic noise is familiar; what trips learners up is that Korean ㅎ weakens or disappears in the syllable-coda position and can ‘jump’ to the next syllable or aspirate a following consonant.","pattern":"ㅎ","position":"Anywhere","description":"Usually like the English “h” in “hat” when it starts a syllable. In the final (batchim) position it is a soft, almost silent breath; if the next syllable begins with a vowel the breath moves forward (e.g., 좋+아 → [조하]). If the next syllable begins with ㄱ, ㄷ, ㅂ, or ㅈ it makes them pop into their aspirated versions (ㅋ, ㅌ, ㅍ, ㅊ).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"한복","native":"한복","position":"Beginning","cultural_context":"Traditional Korean clothing often shown in tourism ads and K-dramas"},{"target":"한글","native":"한글","position":"Beginning","cultural_context":"Name of the Korean alphabet, mentioned whenever people talk about learning Korean"},{"target":"좋아","native":"좋아","position":"Middle","cultural_context":"Common K-pop lyric meaning “I like it,” often written as ‘joa’ in subtitles"},{"target":"좋다","native":"좋다","position":"Middle","cultural_context":"Phrase meaning “(it’s) good” that appears in dramas and variety-show subtitles"}]}]
["ㅏ",{"thoughts":"English already has a very similar open ‘ah’ sound (as in “father”), so learners mainly need to avoid turning it into a diphthong (“a-uh”). It can show up anywhere in a Korean word.","pattern":"ㅏ","position":"Anywhere","description":"Almost identical to the “a” in “father” or “spa.” Open your mouth wide, drop your jaw, keep lips relaxed and un-rounded, and sustain one pure vowel—no glide.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"강남","native":"Gangnam","position":"Multiple","cultural_context":"District made famous by the 2012 hit song “Gangnam Style”"},{"target":"비빔밥","native":"bibimbap","position":"End","cultural_context":"Signature Korean mixed-rice dish found on many international menus"},{"target":"삼겹살","native":"samgyeopsal","position":"Multiple","cultural_context":"Popular Korean BBQ pork belly ordered in grill-at-the-table restaurants"},{"target":"아리랑","native":"Arirang","position":"Beginning","cultural_context":"Well-known Korean folk song often performed on world stages"}]}]
["ㅐ",{"thoughts":"Korean vowel ㅐ is essentially the same open-mid front vowel /ɛ/ that English speakers use in “bed.” Because the sound already exists in English, the chief task for learners is to link it to the Hangul symbol ㅐ and to keep it distinct from the slightly closer vowel ㅔ, which many Koreans now pronounce almost the same.","pattern":"ㅐ","position":"Anywhere","description":"Pronounce ㅐ like the “e” in English “bet” or “red”: mouth open a bit wider than for the long A in “bake,” tongue forward and slightly lowered. Avoid rounding the lips.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"태권도","native":"taekwondo","position":"Beginning","cultural_context":"Korean martial art practiced worldwide"},{"target":"대박","native":"daebak","position":"Beginning","cultural_context":"Slang for “awesome”; often heard in K-pop and K-dramas"},{"target":"대구","native":"Daegu","position":"Beginning","cultural_context":"Major South Korean city mentioned in news and travel shows"},{"target":"김치찌개","native":"kimchi jjigae","position":"End","cultural_context":"Well-known kimchi stew served in Korean restaurants"}]}]
["ㅑ",{"thoughts":"English speakers already use the sound /ja/ at the start of words like “yacht,” so the Korean vowel ㅑ should feel familiar. The only trick is remembering that in Korean it is a single, pure vowel written as one symbol rather than the English two-letter sequence “ya.” It can sit at the start of a word or inside a syllable.","pattern":"ㅑ","position":"Anywhere","description":"Pronounce ㅑ as a quick “ya,” similar to the first sound in the English word “yacht.” Start with a brief /y/ glide, then open straight into the broad “ah” vowel; do not slide toward “ee” or “eh.” The tongue stays low and front, lips relaxed.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"야마하","native":"Yamaha (brand)","position":"Beginning","cultural_context":"Global company that makes motorcycles and musical instruments"},{"target":"야쿠르트","native":"Yakult (probiotic drink)","position":"Beginning","cultural_context":"Widely sold yogurt-style drink often seen in supermarkets"},{"target":"고양이","native":"cat","position":"Middle","cultural_context":"Common Korean word you’ll hear in K-dramas or K-pop content"},{"target":"양","native":"yang (from yin and yang)","position":"Beginning","cultural_context":"Familiar philosophical term paired with yin"}]}]
["ㅒ",{"thoughts":"English speakers rarely meet the Hangul vowel ㅒ. It is basically the sound you get if you start to say the English word “yeah” but stop after the first two letters – a quick y- plus short e as in “bed.” Because it is written with ㅣ + ㅐ stacked, learners sometimes try to stretch it to two syllables (yi-eh), but it is just one, smooth vowel.","pattern":"ㅒ","position":"Anywhere","description":"One quick syllable, pronounced “yae.” Start with the y- glide of “yes,” immediately open to the short e of “bed,” and you’re done. Keep it crisp and short, not drawn-out like “yay.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"얘기","native":"story, talk","position":"Beginning","cultural_context":"Very common word in K-dramas; characters say “얘기해” (“tell me”)."},{"target":"걔","native":"that kid / that person","position":"Beginning","cultural_context":"Casual pronoun you often hear in variety shows and dramas."},{"target":"얘들아","native":"hey guys (kids)","position":"Beginning","cultural_context":"Informal call-out used in many school or family scenes in Korean media."}]}]
["ㅓ",{"thoughts":"ㅓ is the Korean vowel closest to the English “uh” in “sun /sʌn/.” It is a mid-to-low, back, unrounded vowel. English has a near-match, but many speakers round their lips or keep the tongue too high, so it can still feel a bit foreign.","pattern":"ㅓ","position":"Anywhere","description":"Say a relaxed “uh” as in the American English word “sun,” but drop the jaw a little lower and keep the lips unrounded. Do NOT round the lips the way you might for the British “o” in “lot,” and don’t let it drift toward the schwa (ə). The tongue sits low-mid in the back of the mouth.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"서울","native":"서울","position":"Beginning","cultural_context":"Capital city of South Korea, often seen written as “Seoul.”"},{"target":"삼성","native":"삼성","position":"Middle","cultural_context":"Global electronics brand “Samsung.”"},{"target":"떡","native":"떡","position":"Beginning","cultural_context":"Rice cake in dishes like “tteokbokki,” common Korean street food."}]}]
["ㅔ",{"thoughts":"The vowel ㅔ is almost the same as the short “e” in English “bed,” so most English speakers can hear and produce it without much trouble. The only real challenge is telling it apart from the very similar Korean vowel ㅐ, not in making the sound itself.","pattern":"ㅔ","position":"Anywhere","description":"A mid-front vowel, very close to the English short “e” in “bed.” Keep the tongue forward and mid-high, lips relaxed. It is slightly tenser and a bit higher than an English schwa, but English speakers generally hit it naturally when they say “e” in “bet.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"제주","native":"Jeju (island)","position":"Beginning","cultural_context":"Famous resort island and UNESCO site that many tourists know"},{"target":"네이버","native":"Naver","position":"Beginning","cultural_context":"Korea’s biggest search engine—often mentioned alongside Google"},{"target":"스파게티","native":"spaghetti","position":"Middle","cultural_context":"Common pasta dish; Korean spelling of the same word"},{"target":"라멘","native":"ramen","position":"End","cultural_context":"Popular Japanese noodle soup, widely eaten in Korea and abroad"}]}]
["ㅕ",{"thoughts":"English speakers have heard the sound in brand-names like “Hyun-dai” and place-names like “Pyeong-chang,” but they rarely say it themselves. It is basically an \"ee\" + \"uh\" glide made very quickly, a bit like the first half of the English word “young.”","pattern":"ㅕ","position":"Anywhere","description":"ㅕ is a quick glide that starts with the English consonant-like “y” and immediately lands on a short, relaxed “uh” (as in “sun”). Imagine saying “yuh” but keep it brief and with lips more spread than rounded. Do NOT round the lips like the English “yo.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"현대","native":"현대","position":"Beginning","cultural_context":"Global car brand Hyundai"},{"target":"안녕하세요","native":"안녕하세요","position":"Middle","cultural_context":"The most common Korean greeting meaning “hello”"},{"target":"평창","native":"평창","position":"Beginning","cultural_context":"Pyeongchang, host city of the 2018 Winter Olympics"}]}]
["ㅖ",{"thoughts":"ㅖ is basically the vowel sound “yeh.”  English speakers already have the glide-plus-vowel /je/ at the start of the word “yes,” so the sound is not foreign, but learners must remember that it is a single Hangul vowel, not two separate letters, and not confuse it with ㅔ (plain “eh”).","pattern":"ㅖ","position":"Anywhere","description":"Pronounce ㅖ as one quick syllable that starts with a light “y” glide and lands on a short, crisp “eh,” like the first part of the English word “yes” but ending a little sooner: /je/.  Keep the tongue forward (as for English “e” in “bed”) and avoid turning it into a longer diphthong.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"예쁜","native":"pretty","position":"Beginning","cultural_context":"Common adjective heard in K-dramas meaning “pretty” or “cute”"},{"target":"계란","native":"egg","position":"Beginning","cultural_context":"Word you see on Korean menus (e.g., gyeran-mari, gyeran-jjim)"},{"target":"소개팅","native":"blind date","position":"Middle","cultural_context":"Term for a blind date often used in variety shows and dramas"},{"target":"혜리","native":"Hyeri","position":"Beginning","cultural_context":"Famous K-pop idol/actress (Girl’s Day member)"}]}]
["ㅗ",{"thoughts":"The vowel ㅗ is almost the same “o” sound English speakers make in “go,” but without sliding into a slight /ʊ/ at the end. It’s a pure, single-position mid-to-high back rounded vowel. Keep the lips rounded, tongue raised toward the back, and hold the sound steady.","pattern":"ㅗ","position":"Anywhere","description":"Pronounce it like the first half of English “oh,” but stop before it glides. Lips stay rounded the whole time. It’s shorter and more stable than the English diphthong in “go.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"소주","native":"soju","position":"Beginning","cultural_context":"Popular Korean distilled liquor found in many bars worldwide"},{"target":"불고기","native":"bulgogi","position":"Middle","cultural_context":"Famous Korean marinated beef dish on many restaurant menus"},{"target":"카카오","native":"Kakao","position":"End","cultural_context":"Major Korean tech company best known for the KakaoTalk messaging app"}]}]
["ㅘ",{"thoughts":"ㅘ is simply the glide ㅗ (o) sliding quickly into ㅏ (a) – it sounds like the English \"wa\" in \"water.\" Because English already has this sequence, most learners recognize it immediately and only need to remember to start with rounded lips, then open wider.","pattern":"ㅘ","position":"Anywhere","description":"Pronounced “wa.” Start with lips rounded as if saying the short English \"o\" in \"pot,\" then quickly open to the \"a\" in \"father\" while letting the lips relax. It is identical to the English \"wa\" in words like \"wander\" or \"wallet.\"","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"와인","native":"wine","position":"Beginning","cultural_context":"Loan-word for the alcoholic drink; appears on menus and in supermarkets"},{"target":"괌","native":"Guam","position":"Beginning","cultural_context":"Name of the well-known U.S. Pacific territory, used in travel ads"},{"target":"화이팅","native":"“Fighting!” (cheer up)","position":"Beginning","cultural_context":"Common rallying chant seen in K-dramas and K-pop culture"},{"target":"사과","native":"apple","position":"End","cultural_context":"Basic vocabulary word often taught early in Korean lessons"}]}]
["ㅙ",{"thoughts":"/wɛ/ exists in English (‘wet’ without the t), so the mouth movements are familiar, but Korean writes it with a single composite vowel ㅙ, which learners must not mix up with ㅚ or ㅞ.","pattern":"ㅙ","position":"Anywhere","description":"Sounds like the “we” in “wedding,” but end it with the short “eh” in “bet”: start with rounded lips for w, then open to a mid-front \"eh\"—/wɛ/. Avoid turning it into the long “way” or plain “weh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"왜","native":"왜","position":"Beginning","cultural_context":"Means “why” – a basic question word heard in K-dramas and beginner Korean lessons"},{"target":"돼지","native":"돼지","position":"Beginning","cultural_context":"Means “pig”; shows up on Korean BBQ menus as ‘dwaeji’ for pork dishes"},{"target":"괜찮아","native":"괜찮아","position":"Beginning","cultural_context":"Common K-drama phrase meaning “It’s okay/No problem”"}]}]
["ㅚ",{"thoughts":"The vowel ㅚ is usually realized as the quick glide [we]—lips start rounded as for “o” and immediately move toward the “e” in “bed.”  English lacks this exact rounded-front vowel, but the closest impression is saying “way” with more lip rounding.  Some speakers keep it as a single rounded vowel similar to German “ö.”  Because it moves toward a sound English already has, most learners can pick it up after a little practice, though the tight lip rounding makes it feel new.","pattern":"ㅚ","position":"Anywhere","description":"Start with lips rounded as if saying the English “o,” then quickly glide to the “e” in “bed”: [we].  Think “weh,” but keep the lips tighter and more forward than in English.  In careful or older pronunciation you may hear a single rounded vowel like German “ö,” but modern Seoul speech almost always sounds like “weh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Choi","native":"최","position":"Beginning","cultural_context":"Very common Korean family name seen in celebrities such as actor Choi Min-sik or singer Choi Si-won"},{"target":"hoe (raw fish)","native":"회","position":"Beginning","cultural_context":"Korean sashimi-style dish frequently shown on food and travel programs"},{"target":"oeguk","native":"외국","position":"Beginning","cultural_context":"Means “foreign country”; appears constantly in K-dramas and beginner Korean lessons"}]}]
["ㅛ",{"thoughts":"ㅛ is simply the Korean vowel “yo,” very close to the English interjection “yo!” Because English already has this off-glide sound, most learners recognize and reproduce it easily.","pattern":"ㅛ","position":"Anywhere","description":"Pronounced like the English syllable “yo” in “yo-yo,” starting with a brief “y” glide and sliding into the long O sound. Keep the lips rounded throughout and avoid inserting a break between the consonant (if any) and the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"요가","native":"요가","position":"Beginning","cultural_context":"Korean word for the exercise yoga—same concept known worldwide"},{"target":"쇼핑","native":"쇼핑","position":"Beginning","cultural_context":"Loan word for “shopping,” seen on Korean store signs and in K-dramas"},{"target":"비욘세","native":"비욘세","position":"Middle","cultural_context":"Korean spelling of the global pop star Beyoncé"},{"target":"도쿄","native":"도쿄","position":"End","cultural_context":"Korean spelling of Tokyo, capital of Japan, a city name most people know"}]}]
["ㅜ",{"thoughts":"Korean ㅜ is a back, rounded vowel [u]. English speakers know a very similar sound in the word “boo.” The main difference is that the Korean vowel is shorter and kept pure—no glide toward /w/ or /ʊ/. As long as learners round their lips and keep the tongue pulled back, it comes out correctly.","pattern":"ㅜ","position":"Anywhere","description":"Pronounce it like the vowel in English “food” but a bit shorter and without letting it slide. Lips stay rounded throughout, tongue high and back.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"불고기","native":"bulgogi","position":"Beginning","cultural_context":"Famous Korean BBQ beef dish seen on menus worldwide"},{"target":"소주","native":"soju","position":"End","cultural_context":"Well-known Korean distilled liquor sold in many bars"},{"target":"부산","native":"Busan","position":"Beginning","cultural_context":"Large Korean port city that hosts an international film festival"}]}]
["ㅝ",{"thoughts":"ㅝ is a blended vowel that sounds like English “wuh/wo” in “wonder.” The lips start rounded as for “oo,” then immediately relax toward the open-back “uh” in “sun.” English has similar glide + vowel sequences, so the sound is not totally foreign, but the rapid, single-syllable merge is new.","pattern":"ㅝ","position":"Anywhere","description":"Say a quick “w” followed by the short \"uh\" sound: start with lips rounded as for “oo,” then open slightly as you voice the vowel. It ends more open than the English “woah” and shorter than “whoa.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"원","native":"Korean won (₩)","position":"Beginning","cultural_context":"Name of South Korea’s currency, seen on price tags or news"},{"target":"원더걸스","native":"Wonder Girls (K-pop group)","position":"Beginning","cultural_context":"Famous K-pop girl group that charted internationally"},{"target":"월드컵","native":"World Cup","position":"Beginning","cultural_context":"Korean way to say FIFA World Cup, heard in sports coverage"},{"target":"롯데월드","native":"Lotte World (theme park)","position":"Middle","cultural_context":"Major Seoul amusement park often mentioned in travel guides"}]}]
["ㅞ",{"thoughts":"English already has the glide-plus-vowel sequence /we/ (we, wedding), so the quality is familiar. The only twist is that Korean keeps the vowel short and pure without the diphthong tail some English speakers add.","pattern":"ㅞ","position":"Anywhere","description":"Pronounced /we/ – start with rounded lips as if saying English “w,” then move straight into the short “e” of “bed.” Keep it one quick, even syllable (don’t let it stretch into “way”).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"웨딩","native":"웨딩","position":"Beginning","cultural_context":"Konglish word for an actual “wedding,” often seen on shop signs or event halls"},{"target":"웨이브","native":"웨이브","position":"Beginning","cultural_context":"Loan-word for “wave,” used in K-pop styling (e.g., ‘hair wave’) and tech brand names"},{"target":"스웨터","native":"스웨터","position":"Middle","cultural_context":"Direct loan-word for “sweater,” appears in Korean fashion contexts"}]}]
["ㅟ",{"thoughts":"ㅟ is basically the Korean “wi” sound. English speakers already know the glide /w/ plus the vowel /i/ in words like “week,” but Korean keeps the lips rounded all the way through, so it starts more like the French “u” and glides to “ee.” It can show up anywhere in a word, typically written as the single Hangul vowel ㅟ or after an initial consonant.","pattern":"ㅟ","position":"Anywhere","description":"Say English “wee,” but round your lips tightly (as if whistling) from start to finish. It begins with a brief /w/ glide and lands on a high front vowel /i/. Keep the tongue high and front like the “ee” in “see,” but don’t un-round the lips until the very end.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"위스키","native":"위스키","position":"Beginning","cultural_context":"Loan word for “whisky,” appears on drink menus and bottles"},{"target":"트위터","native":"트위터","position":"Middle","cultural_context":"Korean spelling of the social-media platform Twitter"},{"target":"퀸","native":"퀸","position":"Beginning","cultural_context":"Korean way to write “Queen,” the famous British rock band"}]}]
["ㅠ",{"thoughts":"The vowel ㅠ combines a quick English-style “y” glide with a rounded “oo” sound, close to the word “you.” English already has something similar, so recognition is high, but the tighter lip rounding and shorter length can trip learners up.","pattern":"ㅠ","position":"Anywhere","description":"Pronounce ㅠ like the first part of the English word “you” (/ju/), but make it one crisp syllable: start with the tongue high and forward (as for the consonant y) and immediately round the lips into a short, tense “oo” as in “food.” Do not drag it out or add an extra consonant after it.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"유튜브","native":"YouTube","position":"Multiple","cultural_context":"The video-sharing platform everyone uses"},{"target":"휴대폰","native":"cell phone","position":"Beginning","cultural_context":"Word you often hear in K-dramas for mobile phone"},{"target":"컴퓨터","native":"computer","position":"Middle","cultural_context":"Loan-word for computer, common in tech contexts"},{"target":"뷰티","native":"beauty","position":"Beginning","cultural_context":"Appears in K-beauty product and brand names"}]}]
["ㅡ",{"thoughts":"English has no exact match for the Korean vowel \"ㅡ\", so most learners substitute an \"uh\" or \"oo\" sound; explaining that the tongue is high/back like English \"oo\" in \"good\" but with the lips kept completely relaxed helps. Well-known Korean words that actually contain ㅡ are limited, but a few pop-culture items (Hangul, Seungri, EXO’s “으르렁”) give useful examples.","pattern":"ㅡ","position":"Anywhere","description":"Korean ㅡ is a high-back UN-rounded vowel. Think of the vowel in the British pronunciation of “could,” but open your lips so they are flat, not rounded. The tongue is pulled to the back and raised, but the lips stay neutral. Do NOT round them like in English “oo.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"Hangul","native":"한글","position":"Middle","cultural_context":"Word for the Korean writing system—mentioned in language and culture articles"},{"target":"Seungri","native":"승리","position":"Beginning","cultural_context":"Former BIGBANG member whose name appeared widely in international entertainment news"},{"target":"Eureureong","native":"으르렁","position":"Multiple","cultural_context":"Original Korean title of EXO’s hit song “Growl,” known to many K-pop fans"}]}]
["ㅢ",{"thoughts":"ㅢ is a tricky Korean vowel sequence that behaves differently depending on where it sits and whether it follows a consonant. It can be pronounced as [ɰi] (a quick \"eu\" glide into \"ee\"), as a plain [i] (\"ee\"), or, when it marks possession, even like the short Korean \"e\" ([e]). None of these match an English vowel exactly, so learners often confuse it with \"ee\" or \"uh\".","pattern":"ㅢ","position":"Anywhere","description":"1. At the very start of a word or after ㅇ: say a tight, back-of-the-throat \"eu\" (like the \"u\" in French \"tu\") then glide quickly into \"ee\": [ɰi]. 2. After most consonants: it usually simplifies to just \"ee\" ([i]). 3. When used as the possessive particle (의), many speakers say it like the short \"e\" in “bed.” Keep your lips unrounded and your tongue toward the center/back before gliding or staying on \"ee.\"","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"의사","native":"doctor","position":"Beginning","cultural_context":"Common K-drama word for a medical doctor"},{"target":"의자","native":"chair","position":"Beginning","cultural_context":"Basic noun that appears in many beginner Korean lessons and subtitles"},{"target":"의정부","native":"Uijeongbu (city)","position":"Beginning","cultural_context":"City north of Seoul known to many U.S. servicemembers stationed in Korea"}]}]
["ㅣ",{"thoughts":"ㅣ is the simple high front vowel /i/, comparable to the “ee” in English “see,” but it is shorter and has no off-glide. English speakers already have this vowel, so recognition is easy; main reminder is to keep it pure, not diphthongized into /ij/.","pattern":"ㅣ","position":"Anywhere","description":"Pronounce it like the vowel in English “see” or “machine,” but keep it short and steady—no trailing y-sound. Lips are spread, tongue is high and toward the front.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"김치","native":"kimchi","position":"Multiple","cultural_context":"Famous Korean fermented cabbage side dish"},{"target":"비빔밥","native":"bibimbap","position":"Multiple","cultural_context":"Well-known mixed-rice Korean dish often found on international menus"},{"target":"이태원","native":"Itaewon","position":"Beginning","cultural_context":"Popular Seoul neighborhood featured in travel shows and the drama “Itaewon Class”"}]}]
["ㅇ",{"thoughts":"When ㅇ sits at the very front of a Korean syllable, it is not voiced at all—it is simply a silent placeholder that lets the following vowel start the syllable. For an English speaker this means you do nothing for the consonant and jump straight into the vowel, so it feels familiar because it is literally ‘no sound.’","pattern":"ㅇ","position":"Beginning","description":"At the start of a word or syllable, ㅇ is silent. You just pronounce the vowel that follows, as if the word began with that vowel in English. (When ㅇ is at the end of a syllable it sounds like the ‘ng’ in “ring,” but that’s not relevant here.)","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"오빠","native":"oppa","position":"Beginning","cultural_context":"Common term in K-pop songs and Korean dramas meaning older brother/boyfriend"},{"target":"아이돌","native":"idol","position":"Beginning","cultural_context":"English loan-word used constantly for K-pop stars"},{"target":"아리랑","native":"Arirang","position":"Beginning","cultural_context":"Traditional Korean folk song known internationally"},{"target":"아시아","native":"Asia","position":"Beginning","cultural_context":"Same word as the continent name, just in Korean"}]}]
["ㅇ",{"thoughts":"ㅇ in the final (batchim) position is pronounced as the single nasal sound [ŋ] – the same \"ng\" you hear at the end of English words like “sing.” English speakers already have this sound, so the only new idea is that it’s represented by the single consonant letter ㅇ in Hangul. Because it never releases a following /g/ or /k/ in Korean, you should keep the tongue high in the back of the mouth and stop the airflow cleanly.","pattern":"ㅇ","position":"End","description":"When ㅇ appears at the very end of a syllable or word, it is pronounced like the final “ng” in English “sing.” It does NOT add an extra hard /g/ sound—just a nasal stop made with the back of the tongue against the soft palate.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"삼성","native":"Samsung","position":"End","cultural_context":"Global electronics brand everyone sees on phones and TVs"},{"target":"홍콩","native":"Hong Kong","position":"End","cultural_context":"Famous Asian city often mentioned in travel and news"},{"target":"강남","native":"Gangnam","position":"Middle","cultural_context":"District made world-famous by the song “Gangnam Style”"}]}]
["ㄹ",{"thoughts":"English speakers meet ㄹ mostly through Korean loan-words like “ramyeon.” In word-initial position it is pronounced as a single, very quick flap—somewhere between the Spanish single-r and a very light English d/l. It is NOT the strong English R nor the clear L, so it can feel slippery and ambiguous.","pattern":"ㄹ","position":"Beginning","description":"At the start of a word, ㄹ is a very quick tongue-tip flap [ɾ]: tap the tip once against the ridge right behind your upper teeth, then release immediately. Think of the Spanish single r in “pero,” or the fast d-sound when Americans say “water” quickly (wa-ɾer). Don’t curl the tongue like English R, and don’t hold it like an L.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"라면","native":"ramyeon (Korean instant ramen noodles)","position":"Beginning","cultural_context":"K-dramas, convenience-store snack familiar worldwide"},{"target":"런던","native":"London","position":"Beginning","cultural_context":"Capital of the UK, often written this way on Korean maps/tickets"},{"target":"라디오","native":"radio","position":"Beginning","cultural_context":"Same everyday device; common Korean loan-word"},{"target":"레고","native":"LEGO","position":"Beginning","cultural_context":"Global toy brick brand, written this way in Korean"}]}]
["ㄹ",{"thoughts":"For English speakers the batchim ㄹ is closest to the “dark-L” that ends words like “ball.” It never sounds like an English R here, so stressing that distinction and the tight tongue placement will help.","pattern":"ㄹ","position":"End","description":"When ㄹ is the final consonant, it sounds like the English L at the end of “ball” or “feel.” Touch the tip of your tongue to the ridge just behind the upper front teeth and stop the air—no extra vowel or flap. It is NOT an R sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"서울","native":"Seoul","position":"End","cultural_context":"Capital city of South Korea—site of K-pop, 1988 Olympics, tourist hotspot"},{"target":"아이돌","native":"idol (K-pop star)","position":"End","cultural_context":"K-pop industry term adopted directly from English"},{"target":"롤","native":"LOL (League of Legends)","position":"End","cultural_context":"Short Korean name for the globally popular video game \"League of Legends\""}]}]
["ㄱ",{"thoughts":"The basic /k/ sound is familiar to English speakers, but English normally releases the final /k/ with a puff of air, while Korean ㄱ at the end is held (unreleased). Learners must close the back of the tongue and simply stop the sound.","pattern":"ㄱ","position":"End","description":"At the end of a Korean word, ㄱ is a voiceless, unreleased \"k.\" Place the back of your tongue against the soft palate as if you’re about to say the English \"k\" in “back,” but don’t let the air burst out—just cut the sound off abruptly. No vocal-cord vibration.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"대박","native":"대박","position":"End","cultural_context":"Common K-drama slang meaning “awesome” or “jackpot”"},{"target":"한복","native":"한복","position":"End","cultural_context":"Traditional Korean clothing often shown in historical dramas"},{"target":"한국","native":"한국","position":"End","cultural_context":"The Korean word for Korea; heard in travel or language videos"}]}]
["ㄲ",{"thoughts":"Final-position ㄲ is written as the double letter but is pronounced exactly the same as a plain, unreleased /k̚/ – there is no extra “double” length or force.  The only challenge for English speakers is cutting the sound off sharply with no following burst of air.","pattern":"ㄲ","position":"End","description":"When ㄲ is the final (받침) consonant of a word or syllable, it is pronounced as a very short, unreleased k-sound [k̚].  Think of the k at the end of the English word “back,” but stop your tongue and don’t let any extra air escape.  It is identical in sound to a final plain ㄱ; the double letter only shows up in spelling.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"밖","native":"밖","position":"End","cultural_context":"Means “outside”; often heard in K-dramas when someone says, “나가! 밖으로!” (“Go! Outside!”)"},{"target":"깎","native":"깎","position":"End","cultural_context":"Verb root “to cut/peel/trim”; travelers may meet it in the bargaining phrase “깎아 주세요” (“Please give me a discount”)."}]}]
["ㅋ",{"thoughts":"The final ㅋ batchim is quite rare in everyday vocabulary; it mostly shows up in interjections and sound-effects. Acoustically it is the same unreleased “k” you already know from the end of English words like “back,” just with no burst of air. Most learners can articulate it, but they seldom encounter it, so it can feel unfamiliar.","pattern":"ㅋ","position":"End","description":"When ㅋ is the final consonant (batchim) it is pronounced as a tense, unreleased [k̚]—basically the cut-off “k” at the end of English “back,” but without letting any extra air escape. Your tongue touches the soft palate, then you stop the sound abruptly.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"헉","native":"헉","position":"End","cultural_context":"Comic-style “gasp!” seen in K-dramas and webtoons"},{"target":"앜","native":"앜","position":"End","cultural_context":"Online exclamation similar to English “Ack!”"},{"target":"꺅","native":"꺅","position":"End","cultural_context":"Squeal of excitement often written in fan comments or comics"}]}]
["ㄷ",{"thoughts":"Word-final ㄷ is realised as an unreleased, voiceless alveolar stop [t̚]. English has /t/, but speakers normally release it; here the tongue touches the same place as in ‘cat’ but you stop the air completely—no little burst. If another syllable starting with a vowel follows, it surfaces as a light /d/, but when the word truly ends, it stays as the cut-off /t̚/. The concept is familiar, but the ‘no-release’ part feels odd at first.","pattern":"ㄷ","position":"End","description":"At the very end of a word, ㄷ is pronounced like the final t in English ‘cat’, BUT you keep the tongue on the ridge and do not let any air burst out (an unreleased [t̚]). It is never voiced and never aspirated in this position.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"맛","native":"taste / flavor","position":"End","cultural_context":"Seen in K-food phrases like “맛있어요” on restaurant signs and subtitles"},{"target":"곧","native":"soon","position":"End","cultural_context":"Frequent in K-drama subtitles meaning “soon / shortly”"}]}]
["ㅅ",{"thoughts":"English speakers expect ㅅ to sound like an S. In final (batchim) position, however, it turns into an unreleased /t̚/. That clipped stop is unfamiliar, so learners try to hiss or fully release a T. Giving very common one-syllable words that end in ㅅ lets them feel the stop without extra consonants.","pattern":"ㅅ","position":"End","description":"When ㅅ is the final consonant of a syllable or word, it is NOT an “s.” It becomes a short, unreleased “t” sound: put your tongue on the ridge as if to say “t,” cut the air off, and don’t let it burst out. No hissing comes out. (If another vowel follows, ㅅ resumes its normal “s/sh” sound.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"맛","native":"taste / flavor","position":"End","cultural_context":"Heard in the phrase “맛있어요” (“It’s delicious”) on K-food videos"},{"target":"옷","native":"clothes","position":"End","cultural_context":"Seen on store signs and mentioned in fashion segments of K-dramas"},{"target":"꽃","native":"flower","position":"End","cultural_context":"Appears in the hit drama title “꽃보다 남자” (“Boys Over Flowers”)"}]}]
["ㅆ",{"thoughts":"Korean ㅆ in final (batchim) position is tricky because it looks like a doubled “s” but it is actually pronounced as an unreleased, voiceless stop /t̚/. English has the tongue shape for /t/ but speakers usually release it; they must learn to cut the air and stop without a burst.","pattern":"ㅆ","position":"End","description":"When ㅆ appears as the final consonant of a syllable or word, it is NOT a hissing “ss.” Instead, the tongue goes up for an English “t,” but you stop the sound abruptly with no puff of air—like the very end of the word “cat” when said quickly before another word (e.g., “cat food”). There is no clear ‘s’ or ‘t’ release.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"있다","native":"있다","position":"Beginning","cultural_context":"Very common verb meaning “to exist/have”; learners hear it in the phrase “있어요” on K-dramas"},{"target":"있어요","native":"있어요","position":"Beginning","cultural_context":"Polite form often used in everyday speech, like “있어요?” (“Do you have…?”)"},{"target":"있지","native":"있지","position":"Beginning","cultural_context":"Spelling of the well-known K-pop group ITZY"}]}]
["ㅈ",{"thoughts":"English speakers are used to hearing ㅈ as a “j” sound (as in ‘jeon’ or ‘soju’), but when ㅈ sits in final position (batchim) it loses its voice and releases as a very brief, unreleased alveolar stop [t̚]. It never sounds like an English “j” here, and the tongue simply blocks the airflow behind the upper front teeth and stops—no burst.","pattern":"ㅈ","position":"End","description":"Word-final ㅈ is pronounced like the ending of the English word “cat” if you cut the air off abruptly before releasing the ‘t’. Your tongue touches the ridge behind your top teeth, blocks the air, and just holds there; do not let it explode outward. It is voiceless and very short.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"낮","native":"낮 (daytime)","position":"End","cultural_context":"Appears in K-pop song titles/lyrics and subtitles as the opposite of ‘밤’ (night), e.g. ‘낮과 밤’"},{"target":"빚","native":"빚 (debt)","position":"End","cultural_context":"Shows up in Korean news about money or celebrity ‘빚투’ debt scandals"}]}]
["ㅊ",{"thoughts":"Final ㅊ is not a “ch” sound at all. In Korean batchim it shuts down into an unreleased, voiceless alveolar stop – a clipped, breath-less “t.” English speakers do something similar when they say the t in “bat” with the mouth still closed. This makes it fairly familiar in concept, but the lack of audible release and the shorter duration take practice.","pattern":"ㅊ","position":"End","description":"At the end of a syllable or word, ㅊ is pronounced like a very short, unreleased “t.” Touch the tip of your tongue to the ridge just behind your upper front teeth, tense slightly, then stop the sound without letting any air burst out. Do NOT add the puffy “ch” or “tʃ” noise you would hear at the beginning of an English word like “chair.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"꽃","native":"flower","position":"End","cultural_context":"Appears in drama titles such as “꽃보다 남자” (Boys Over Flowers); fans often see the word in K-pop lyrics"},{"target":"빛","native":"light","position":"End","cultural_context":"Song titles like VIXX’s “빛 (Light)” and other K-pop tracks use this word"}]}]
["ㅌ",{"thoughts":"Final ㅌ is comparatively rare, but learners will meet it in words like 돌솥.  In syllable-final (받침) position it loses the strong burst English speakers give to /t/ and becomes a short, unreleased stop.  Because English does have unreleased /t/ (e.g. the t in “cat!” when said quickly), the sound is not completely foreign, but remembering to keep it soft and un-aspirated can be tricky.","pattern":"ㅌ","position":"End","description":"When ㅌ is the final consonant of a word, it is pronounced as an unreleased, voiceless “t” – the tongue touches the same place as in the English /t/, but you do NOT let out a puff of air.  Think of the very clipped t at the end of the English exclamation “cut!” said quickly, then stop the sound abruptly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"돌솥","native":"stone pot (as in 돌솥 비빔밥)","position":"End","cultural_context":"Famous in the dish “dolsot bibimbap,” a Korean meal found in many international Korean restaurants"}]}]
["ㅎ",{"thoughts":"English speakers expect a breathy “h.”  In Korean, final ㅎ is actually realized as a very brief, unreleased stop (like the cut-off /t/ at the end of “cat”), or it simply disappears and aspirates the following consonant when another syllable follows.  The sound itself is easy to make, but the rules for when it is silent or turns the next sound aspirated are unfamiliar.","pattern":"ㅎ","position":"End","description":"When ㅎ is the final consonant (받침) in a syllable or at the very end of a word, you do NOT exhale an audible ‘h.’  Instead, the air is stopped abruptly, much like an unreleased “t” in casual English speech (“cat⟂”).  If the next syllable starts with a vowel or ㅈ, ㄱ, ㄷ, ㅂ, the ㅎ usually vanishes and makes that next consonant aspirated (e.g., ㅋ, ㅌ, ㅍ) or just disappears before a vowel.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"좋다","native":"good","position":"Middle","cultural_context":"Heard in dramas when someone says something is ‘good’ (“johta”)."},{"target":"좋아","native":"(I) like it / sure","position":"Middle","cultural_context":"Common in K-pop lyrics; chorus often repeats “jo-a.”"},{"target":"싫어","native":"(I) don’t want it / hate it","position":"Middle","cultural_context":"Characters in K-dramas shout this when refusing something (‘shiro’)."}]}]
["ㅂ",{"thoughts":"English already has an unreleased final P in casual speech (e.g. the p in “stop”). Korean ㅂ at the end of a syllable behaves almost exactly the same: lips close, no voice, no puff. So the sound itself is familiar; the main challenge is remembering not to turn it into a voiced “b” or to add a little vowel after it.","pattern":"ㅂ","position":"End","description":"When ㅂ is the final consonant (받침), it is pronounced as an unreleased, voiceless “p” [p̚]. Close your lips as if saying the English word-final “p” in “stop,” but freeze there—do not let air burst out and do not add a following vowel. It is never voiced like “b.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"김밥","native":"김밥","position":"End","cultural_context":"Seaweed-wrapped rice roll (Korean “sushi”) on many Korean menus worldwide"},{"target":"비빔밥","native":"비빔밥","position":"End","cultural_context":"Well-known Korean mixed-rice bowl found in global Korean restaurants"}]}]
["ㅍ",{"thoughts":"Final ㅍ is simply an unreleased /p̚/. English has the same unreleased closing gesture at the end of words like “stop” when said casually, so the sound itself is not new—what’s new is noticing that you must NEVER let a little breath or vowel escape after it.","pattern":"ㅍ","position":"End","description":"When ㅍ is the final consonant (받침) it is pronounced like an English p that stops abruptly with no puff of air—an unreleased [p̚]. Think of how many people say “stop” or “cup” without bursting the last consonant. Do not add a tiny schwa (“puh”) after it.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"앞","native":"앞 (front / ahead)","position":"End","cultural_context":"Seen on signs such as ‘정류장 앞’ (in front of the bus stop) by travelers"},{"target":"숲","native":"숲 (forest)","position":"End","cultural_context":"Title word in the Netflix K-drama ‘비밀의 숲’ (‘Stranger’ / ‘Secret Forest’) that many international viewers watched"},{"target":"옆","native":"옆 (side / next to)","position":"End","cultural_context":"Common in phrases like ‘옆집’ (next-door house) heard in K-dramas"}]}]
["ㅁ",{"thoughts":"English already has the same closing-lip /m/ sound, so the only new idea is that Korean keeps it very crisp with no extra vowel sound after it.","pattern":"ㅁ","position":"End","description":"When ㅁ is the final letter of a Korean word or syllable, it is a bilabial nasal—basically the same sound as the English “m” at the end of “team.” Keep your lips closed and let the sound stop cleanly; don’t add an extra little vowel (English speakers sometimes release a faint “-uh” after final m).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"김","native":"Kim / gim","position":"End","cultural_context":"Most common Korean surname; also the dried seaweed sheets served with sushi"},{"target":"쌈","native":"ssam","position":"End","cultural_context":"Lettuce or perilla wrap you order at Korean BBQ"}]}]
["ㄴ",{"thoughts":"Final ㄴ is the same basic /n/ sound English speakers already know. In Korean it is always a clean alveolar nasal, never the velar “ng.” Because English already has /n/ at the ends of words (ten, pen) the sound itself is familiar; the only thing to watch is to keep the tongue right behind the upper front teeth and not lengthen the vowel before it.","pattern":"ㄴ","position":"End","description":"When ㄴ appears as the final consonant (batchim) of a syllable it is pronounced like the English n in “thin” or “plan.” Touch the tip of your tongue to the ridge just behind your upper teeth, release cleanly, and avoid adding an extra vowel after it.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"부산","native":"Busan","position":"End","cultural_context":"South Korea’s second-largest city, mentioned in travel shows and the film “Train to Busan”"},{"target":"북한","native":"North Korea","position":"End","cultural_context":"Country name frequently seen in world news"}]}]
["ㄳ",{"thoughts":"ㄳ only shows up as a final-consonant (batchim) cluster.  Most of the time it is pronounced like an unreleased “k” sound [k̚] (similar to the end of the English word “back” when you stop abruptly).  If the next syllable begins with a vowel, the ㅅ moves over and you get [k̚] + an initial “s/ʃ” in the next syllable (e.g., 값이 → 갑시).  Because English has no silent-release k followed by a possible migrating s sound, the cluster feels unusual to English ears.","pattern":"ㄳ","position":"End","description":"At the end of a word or syllable, ㄳ is normally realised as a tight, unreleased ‘k’ sound (like saying “back” but cutting the airflow before letting the tongue drop).  When a vowel follows, only the first part (ㄱ) stays behind; the ㅅ starts the next syllable as an ‘s’ sound.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"값","native":"값","position":"End","cultural_context":"Everyday Korean word meaning “price,” appears in K-drama subtitles"},{"target":"밥값","native":"밥값","position":"End","cultural_context":"Literally “meal price”; common phrase when characters split the check in Korean shows"},{"target":"집값","native":"집값","position":"End","cultural_context":"“House price”; often mentioned in English-language news about the Korean housing market"}]}]
["ㄵ",{"thoughts":"ㄵ only shows up as a final (batchim) consonant cluster. Koreans actually pronounce it just like an English n when nothing follows, but if the next syllable starts with a vowel, the hidden ㅈ moves over and you hear n-j / n-ch (e.g., 앉아 → an-ja). So the main task for an English speaker is to remember “write ㄴ+ㅈ, pronounce n (or n-j before a vowel).”","pattern":"ㄵ","position":"End","description":"When ㄵ is the final consonant of a syllable, it sounds simply like the n in “no.” If the next syllable begins with a vowel, the ㅈ reappears and you get n-j or n-ch, similar to saying “an-ja.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"앉다","native":"앉다","position":"Middle","cultural_context":"Very common beginner verb meaning “to sit” – seen in textbooks and apps"},{"target":"앉아","native":"앉아","position":"Middle","cultural_context":"Everyday imperative “sit” (you’ll hear it in dramas or when someone tells a pet to sit)"},{"target":"얹다","native":"얹다","position":"Middle","cultural_context":"Verb meaning “to place/put on top”; often appears in beginner vocabulary lists"}]}]
["ㄶ",{"thoughts":"ㄶ is only found as a final consonant cluster. To English ears it mostly sounds like the ordinary final N. The extra ㅎ is usually silent, but it pops out as an H-sound or turns the next consonant into its aspirated version when a vowel or plain consonant follows (e.g., ㄷ → ㅌ). So learners mainly say an unreleased N, then optionally add a faint H before the next syllable.","pattern":"ㄶ","position":"End","description":"Pronounce the final ㄴ in “ban” but stop it abruptly with no puff of air. If the next syllable starts with a vowel/ㅇ, let a light English H slip out before that vowel (n+h). If the next syllable starts with ㄱ, ㄷ, ㅈ they become the aspirated sounds ㅋ, ㅌ, ㅊ.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"괜찮아","native":"괜찮아","position":"Beginning","cultural_context":"K-drama line meaning “It’s okay,” heard constantly in shows and songs"},{"target":"괜찮다","native":"괜찮다","position":"Beginning","cultural_context":"Dictionary form of the same phrase; pops up in subtitles and lyrics"},{"target":"않다","native":"않다","position":"Beginning","cultural_context":"Negative verb ending, common in song lyrics like “사랑하지 않는다”"}]}]
["ㄺ",{"thoughts":"The cluster ㄺ only occurs as a final (batchim) consonant.  English speakers will not know this sound; it changes depending on what follows.  If the syllable ends the word or is followed by another consonant, it is an unreleased k sound, similar to the cut-off k in English “book”.  If a vowel (or ㅇ) follows, only the ㄹ is heard, like a light English l before a vowel.  This switching makes it hard for learners.","pattern":"ㄺ","position":"End","description":"ㄺ is a final consonant cluster made of ㄹ(l) + ㄱ(k).  When the syllable stops there or is followed by a consonant, you pronounce it as a tight, unreleased k [k̚]—close your tongue at the back like in “book” but don’t let any air out.  When the next syllable begins with a vowel, the sound changes to a clear l, linking to the vowel (e.g., [lɡ] becomes [l]).  Think of it as “k when the sound stops, l when the word keeps going.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"닭","native":"닭","position":"End","cultural_context":"Means “chicken”; seen in dishes like Korean fried chicken (양념닭)"},{"target":"읽어","native":"읽어","position":"Middle","cultural_context":"From the basic verb 읽다 (to read); used in beginner textbooks"},{"target":"블랙","native":"블랙","position":"End","cultural_context":"Korean spelling of the English word “black,” as in the K-pop group 블랙핑크 (Blackpink)"}]}]
["ㄻ",{"thoughts":"The consonant cluster ㄻ is only written in the final-consonant (batchim) slot of a syllable. By itself at the very end of a word or before another consonant it is pronounced simply as an English-like “m.” When the next syllable begins with a vowel, the cluster splits: the first consonant ㄹ stays as a light, tapped or held “l” and the second consonant ㅁ moves over to the next syllable as an “m,” giving an “l-m” sequence (sal-mi). English has no direct equivalent to a single letter doing this split, so learners have to remember the two possible outcomes.","pattern":"ㄻ","position":"End","description":"At the end of a syllable ㄻ is usually just [m] (l is silent). If the very next sound is a vowel, pronounce it as [l]+[m] across the syllable break (like saying “al-ma” quickly). Think: word-final “m,” or, before a vowel, a quick light English “l” immediately followed by “m.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"삶","native":"life","position":"End","cultural_context":"Common word that shows up in K-drama or song subtitles meaning “life.”"},{"target":"삶이","native":"life + subject marker (삶이)","position":"Middle","cultural_context":"Appears in simple phrases like “삶이 아름다워” (“Life is beautiful”) seen in subtitles or lyrics."},{"target":"젊다","native":"to be young","position":"Middle","cultural_context":"Occurs in K-pop lyrics and K-drama dialogue talking about being young (e.g., “우리는 아직 젊다” – “We are still young”)."}]}]
["ㄼ",{"thoughts":"� ㄼ is an uncommon final consonant cluster.  For an English ear it almost always just sounds like the final L in “ball,” because the ㅂ half is silent unless a vowel follows in the next syllable, in which case that ㅂ pops out as a light “b/p.”  So learners mainly have to remember “write ㄼ, pronounce L… unless it’s followed by a vowel.”","pattern":"ㄼ","position":"End","description":"When ㄼ sits at the very end of a word or before another consonant, only the ㄹ is heard, giving a dark-L sound like the end of English “ball,” but with the tongue touching the ridge just behind your top teeth.  If a vowel immediately follows (e.g., through a suffix or particle), the ㄹ still closes the first syllable and the ㅂ re-syllabifies, surfacing as a light “b/p.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"여덟","native":"eight","position":"End","cultural_context":"Comes up if you learn basic Korean numbers—“여덟” means eight."},{"target":"짧아","native":"short (informal present)","position":"Middle","cultural_context":"Heard in K-dramas when someone says something is 짧아 (‘it’s short’); shows the ㅂ surfacing before a vowel."}]}]
["ㄽ",{"thoughts":"Double-final ㄽ (rieul-siot) is one of Korean’s rarest 받침 clusters. In modern speech the ㅅ part is silent when the syllable ends a word, so learners only have to make the ordinary final-ㄹ sound. Because that sound is very close to the dark L that ends English words like “ball,” most English speakers find it easy. The hidden ㅅ is only heard if a vowel follows (it jumps forward and you say an “s”). There are no well-known food, place, or brand names that actually contain ㄽ, so useful high-profile examples are basically nonexistent.","pattern":"ㄽ","position":"End","description":"At the end of a syllable, ㄽ is pronounced just like the single final ㄹ: a short, unreleased “l” made with the tongue touching the roof of the mouth just behind the front teeth. The ㅅ is completely silent unless the next syllable starts with a vowel, in which case that ㅅ moves over and is pronounced as an English ‘s’.","familiarity":"ProbablyDoesNotKnow","difficulty":"Easy","example_words":[]}]
["ㄾ",{"thoughts":"ㄾ only shows up as a batchim (final consonant cluster). In isolation it is pronounced just like a held-off final English “l” (the ㅌ is silent). If a vowel comes right after it (because of a grammar ending), the ㅌ moves over and you actually hear an “lt” sequence, much like the border between the syllables in the English word “melt-ed.” English speakers know the /l/ and /lt/ sounds, so the main trick is remembering to drop the audible release of the /t/ when the word truly ends.","pattern":"ㄾ","position":"End","description":"When ㄾ is the final consonant cluster of a syllable and nothing follows, only the ㄹ is pronounced – a clipped, unreleased “l” at the end of the word (similar to the end of English “ball,” but cut off abruptly). If the next syllable begins with a vowel, the ㅌ moves forward and you get an “lt” sequence (e.g., [hal-ta]).","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"핥다","native":"핥다","position":"End","cultural_context":"Verb meaning “to lick”; may show up in K-drama subtitles when someone licks food or a spoon."},{"target":"핥아","native":"핥아","position":"Middle","cultural_context":"Conjugated form of the same verb (“licks/lick”); illustrates the sound becoming ‘lt’ before a vowel."},{"target":"옅다","native":"옅다","position":"End","cultural_context":"Adjective meaning “light/shallow” (e.g., light color); appears in some Korean song lyrics or descriptive phrases."}]}]
["ㄿ",{"thoughts":"The double-final ㄿ (rieul + aspirated p) is rare and mostly found in the verb stem 읊- “to recite/chant.”  English speakers will hardly ever see it, and when they do, it behaves like a normal final p sound except when a vowel follows.","pattern":"ㄿ","position":"End","description":"Spelled with ㄹ+ㅍ but, at the end of a syllable, you only pronounce an unreleased p sound – similar to the final “p” in English “stop,” just cut off even more sharply.  If the next syllable begins with a vowel (e.g., 읊어) the ㅍ moves to that vowel and is pronounced like the strong, breathy p of English “pack,” while the preceding ㄹ closes the first syllable with a light l sound (…l-pʰ…).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"읊다","native":"to recite (poetry)","position":"Middle","cultural_context":"Appears in K-drama subtitles when a character says they will recite a poem"},{"target":"읊어","native":"(you) recite it / 읊다 + 어","position":"Middle","cultural_context":"Can pop up in Korean song lyrics or poetry readings"}]}]
["ㅀ",{"thoughts":"Word-final ㅀ is a rare consonant cluster (ㄹ + ㅎ). English speakers will mostly meet it when they hear Koreans say 싫어! (\"I don’t like it / No!\") in dramas or songs. The sound they actually hear is almost just a clipped “l” because the ㅎ usually drops; the tricky part is knowing that sometimes the following consonant becomes aspirated (싫다 → [실타]). Because the spelling looks harder than what the ear picks up, learners find it confusing.","pattern":"ㅀ","position":"End","description":"At the end of a syllable, ㅀ is pronounced like a quick, held \"l\" sound (similar to the dark L at the end of the English word “ball”). The ㅎ is silent unless the next syllable begins with a plain consonant or vowel, in which case it turns that following consonant into its breathy/aspirated version (e.g., ㄷ → ㅌ). So in isolation it’s just [l]; before vowels you may hear an extra puff of air.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"싫어","native":"싫어","position":"Middle","cultural_context":"Common phrase in K-dramas and K-pop meaning “I don’t like it / No!”"},{"target":"싫다","native":"싫다","position":"End","cultural_context":"Dictionary form of the above verb, shows up in song subtitles and language lessons"}]}]
["ㅄ",{"thoughts":"The cluster ㅄ only shows up as a final (받침) consonant. By default it is realised as an unreleased /p̚/ (“p” with no burst). When the next syllable starts with a vowel, the hidden ㅅ re-emerges and is heard as a tense “ss” sound at the start of that following syllable (e.g. 없어요 → [업써요]). English has a released /p/ but not this clipped version, and it never re-surfaces as an “ss,” so the pattern feels foreign.","pattern":"ㅄ","position":"End","description":"At the very end of a syllable, ㅄ is pronounced like a short, unreleased “p” (close your lips, stop the air, but don’t let it pop). If the next syllable begins with a vowel, the ㅅ moves over and becomes a strong “ss” sound, while the first part still keeps the unreleased “p.” Think of saying “stop ’ss…” without letting the /p/ explode.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"없어요","native":"없어요","position":"Beginning","cultural_context":"Common phrase in K-dramas meaning “there isn’t / I don’t have”"},{"target":"없어","native":"없어","position":"Beginning","cultural_context":"Casual K-pop/drama line for “there isn’t / no way”"},{"target":"값","native":"값","position":"End","cultural_context":"Means “price”; seen on Korean menus or shopping sites"}]}]
