["ㄱ",{"thoughts":"English already has both a hard G and an un-aspirated K sound, but in Korean they are one letter whose exact voice depends on position; the trickiest part is remembering not to puff extra air as with an English ‘k’.","pattern":"ㄱ","position":"Anywhere","description":"A single consonant that floats between English “g” and “k.”\n• At the very start of a word or after a consonant it’s a plain, un-aspirated K: like the “k” in “skate” (no strong burst of air).\n• Between vowels it softens toward a voiced G, like the “g” in “ago.”\n• At the very end of a syllable it snaps shut like a brief, unreleased K (the back of the tongue blocks, but you don’t let the air burst out).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"kimchi","native":"김치","position":"Beginning","cultural_context":"Signature Korean fermented cabbage eaten worldwide"},{"target":"Gangnam","native":"강남","position":"Beginning","cultural_context":"Seoul neighborhood made famous by the song “Gangnam Style”"},{"target":"bulgogi","native":"불고기","position":"Multiple","cultural_context":"Popular Korean barbecue beef dish found in many Korean restaurants"}]}]
["ㄲ",{"thoughts":"English has a plain /k/ that is either aspirated (kill) or unaspirated (skill). Korean ㄲ is like the unaspirated version but with extra muscular tension; the sound category itself doesn’t exist in English, so learners tend to pronounce it as a regular /k/. Need to highlight ‘no puff of air + tighten the throat’. Example words that English speakers hear in K-food contexts give good exposure.","pattern":"ㄲ","position":"Anywhere","description":"A tense, voiceless, UNASPIRATED “k.” Make the tongue and mouth as for an English ‘k,’ but squeeze the throat muscles slightly and release without any burst of air—more like the quick, dry ‘k’ in the middle of “sKILL,” but even crisper.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"Kkakdugi","native":"깍두기","position":"Beginning","cultural_context":"Cubed radish kimchi often served in Korean restaurants"},{"target":"Tteokbokki","native":"떡볶이","position":"Middle","cultural_context":"Spicy Korean street-food rice cakes popular worldwide"}]}]
["ㄴ",{"thoughts":"ㄴ is a straightforward sound for English speakers because it matches the English /n/ almost perfectly. The only minor surprise is that it keeps the same tongue position whether it starts a syllable, ends a syllable, or sits between two vowels.","pattern":"ㄴ","position":"Anywhere","description":"Pronounce it just like the English “n” in “no.” Touch the tip of your tongue to the ridge just behind your upper front teeth and let the air pass through the nose. It does not become an “ng” sound; even at the end of a Korean syllable it stays a clear /n/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Naver","native":"네이버","position":"Beginning","cultural_context":"Korean internet company & search engine often mentioned in tech news"},{"target":"Gangnam","native":"강남","position":"Middle","cultural_context":"Seoul district made famous by the song “Gangnam Style”"},{"target":"Hyundai","native":"현대","position":"Middle","cultural_context":"Global car brand seen in showrooms and commercials"},{"target":"Han","native":"한","position":"End","cultural_context":"Word you may hear in discussions of Korean culture (concept of deep collective feeling)"}]}]
["ㄷ",{"thoughts":"English already has a voiced alveolar stop /d/ and an unaspirated /t/ after /s/ (as in “stap”), so the Korean ㄷ will not feel alien. The main surprises are (a) there is no big puff of air like English word-initial “t,” and (b) when ㄷ closes a syllable it is held and unreleased, more like the abrupt end of the English word “cat” said very quickly.","pattern":"ㄷ","position":"Anywhere","description":"Korean ㄷ is an unaspirated alveolar stop. 1) At the start of a syllable between vowels it sounds halfway between English “d” and a soft, un-aspirated “t” (think of the lightly voiced ‘d’ in “stadium”). 2) When it comes right before ㅎ it becomes strongly aspirated, like the ‘t’ in “top.” 3) At the very end of a syllable (받침) it is a short, unreleased ‘t’—your tongue touches the ridge but you don’t let the air burst out. Keep the tongue tip where you would for an English ‘d/t,’ but use almost no breath.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Dalgona","native":"달고나","position":"Beginning","cultural_context":"The whipped “Dalgona coffee” trend went viral on social media"},{"target":"Hyundai","native":"현대","position":"Middle","cultural_context":"Global Korean car brand seen in commercials and on the road"},{"target":"Taekwondo","native":"태권도","position":"End","cultural_context":"Popular Korean martial art practiced worldwide"}]}]
["ㄸ",{"thoughts":"ㄸ is the Korean “tense t.”  English speakers already know a plain /t/, so the tongue placement is familiar, but the extra muscular tension and lack of released puff of air (no aspiration) are new.  Exposure comes mainly through well-known food and brand names spelled with a doubled “tt.”","pattern":"ㄸ","position":"Anywhere","description":"A tight, tense version of the English T.  Place the tongue where you would for a normal /t/ (just behind the upper front teeth) but press harder, stiffen the tongue, tighten the throat slightly, and release without a burst of air.  It is shorter and crisper than the ordinary Korean ㅌ or the English aspirated T in “top.”  Similar to the very quick T you make after an S in “stop,” but with extra muscular tension.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"tteokbokki","native":"떡볶이","position":"Beginning","cultural_context":"Popular spicy Korean street-food dish seen on menus and food videos"},{"target":"Lotte","native":"롯데","position":"Middle","cultural_context":"Large Korean conglomerate; name appears on candy and baseball stadiums"},{"target":"Ottogi","native":"오뚜기","position":"Middle","cultural_context":"Famous Korean instant-ramen and food brand sold internationally"}]}]
["ㄹ",{"thoughts":"English speakers already know two sounds that together cover most Korean ㄹ cases: the American English flap in “butter” and the light L in “ball.” What trips learners up is remembering WHEN each one is used and avoiding the strong English R.","pattern":"ㄹ","position":"Anywhere","description":"1) Between vowels or at the start of a syllable, ㄹ is a single quick flap of the tongue against the ridge behind your teeth – like the fast D/T in American “butter” or the Spanish single R. 2) At the end of a syllable it becomes a clear light L, similar to the L in “ball,” but with the tongue a bit farther forward. Never curl the tongue the way you might for the English R.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ramyeon","native":"라면","position":"Beginning","cultural_context":"Korean instant noodles sold internationally"},{"target":"galbi","native":"갈비","position":"Middle","cultural_context":"Famous Korean BBQ short-rib dish"},{"target":"idol","native":"아이돌","position":"End","cultural_context":"K-pop ‘idol’ singers known worldwide"}]}]
["ㅁ",{"thoughts":"English already has an almost identical /m/ sound, so learners will instantly recognize it. They only need to remember that Korean ㅁ is always an unaspirated, pure bilabial nasal—never the sloppy \"mm\" that can become a vowel in English (“’m” in “I’m”). Main challenge is remembering to keep the lips closed and voice humming briefly, especially when ㅁ is final.","pattern":"ㅁ","position":"Anywhere","description":"A voiced bilabial nasal—exactly the same sound as the English “m” in “mom.” Close both lips, let the voice resonate through the nose, then release into the next sound. At the end of a syllable or word, simply stop the airflow with the lips while the voice hums (no audible vowel after it).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Myeongdong","native":"명동","position":"Beginning","cultural_context":"Famous Seoul shopping district often visited by tourists"},{"target":"kimchi","native":"김치","position":"Middle","cultural_context":"Korea’s iconic fermented cabbage dish, common in international cuisine"},{"target":"Samsung","native":"삼성","position":"Middle","cultural_context":"Global electronics brand (phones, TVs, etc.)"},{"target":"Gangnam","native":"강남","position":"End","cultural_context":"Upscale Seoul neighborhood made world-famous by the song “Gangnam Style”"}]}]
["ㅂ",{"thoughts":"ㅂ is closest to English /b/ or a lightly-aspirated /p/. English speakers know the basic lip-closing gesture, but they are not used to switching between the three Korean values: unaspirated voiceless [p] (word-initial), fully voiced [b] (between vowels), and unreleased stop [p̚] (word-final). So the concept is familiar but the allophonic rules are new.","pattern":"ㅂ","position":"Anywhere","description":"Close your lips as if saying English “b,” but release the air with almost no puff (less than English “p,” a bit drier than English “b”). In the middle of a word it often sounds like a regular voiced “b.” At the very end of a syllable it closes the lips but does not release—more like cutting the sound off abruptly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"bibimbap","native":"비빔밥","position":"Multiple","cultural_context":"Famous Korean mixed rice bowl found in many Korean restaurants"},{"target":"kimbap","native":"김밥","position":"End","cultural_context":"Korean seaweed rice roll, often compared to sushi"},{"target":"Busan","native":"부산","position":"Beginning","cultural_context":"Major South Korean port city; title of the movie “Train to Busan”"},{"target":"Pepero","native":"빼빼로","position":"Beginning","cultural_context":"Popular Korean cookie stick snack sold worldwide, similar to Pocky"}]}]
["ㅃ",{"thoughts":"ㅃ is the Korean “tense p/b.”  English has voiceless aspirated P (pin) and voiced B (bin), but no tense, un-aspirated, voiceless version.  Listeners might mistake it for an English b or a fast p.  The closest feel is the p in the second syllable of “spa,” but with much more lip tension and a hard, sudden release.","pattern":"ㅃ","position":"Anywhere","description":"Make your lips and vocal cords tighten as if you are about to say a hard P, but let no extra air escape.  Release it quickly, almost like a mini pop.  It is voiceless (no vocal-cord vibration) yet has no puff of air.  Think of the p in “spa,” but crank up the muscular tension.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Oppa","native":"오빠","position":"Middle","cultural_context":"Heard worldwide in the K-pop hit “Oppa Gangnam Style”"},{"target":"Pepero","native":"빼빼로","position":"Multiple","cultural_context":"Popular Korean chocolate biscuit snack sold internationally"},{"target":"Appa","native":"아빠","position":"Middle","cultural_context":"Common word for “Dad” often heard in K-dramas"}]}]
["ㅅ",{"thoughts":"English speakers already know an /s/ sound, but ㅅ has two extra twists: it turns into a soft “sh-” before i-/y-type vowels and it becomes a clipped, unreleased “t” at the end of a syllable. The ‘sh’ allophone is easy to imitate once explained, but the final stopped sound is new for many learners.","pattern":"ㅅ","position":"Anywhere","description":"Usually a clear “s” like in “sit.” Before i, y, or ㅣ-type vowels it softens toward “sh” (technically /ɕ/—tongue touches a bit further back than English sh). When it ends a syllable (batchim), it is NOT an ‘s’—it’s a short, unreleased “t” made by stopping the tongue on the alveolar ridge without letting air escape.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"soju","native":"소주","position":"Beginning","cultural_context":"Famous Korean distilled liquor sold in many bars worldwide"},{"target":"Shin Ramyun","native":"신라면","position":"Beginning","cultural_context":"Popular Korean instant noodle brand found in most Asian grocery stores"},{"target":"dolsot (as in “dolsot bibimbap”)","native":"돌솥","position":"Multiple","cultural_context":"Stone pot used for the sizzling version of bibimbap, common on Korean restaurant menus"}]}]
["ㅆ",{"thoughts":"English speakers already know the basic “s” sound, so the tense ‘ss’ will feel familiar but a bit tighter. The stop-like final sound is new.","pattern":"ㅆ","position":"Anywhere","description":"Initial/medial ㅆ is a tense, fortis version of “s.” Keep the tongue where you would for the English “s” in “see,” but squeeze the tongue and throat slightly so the hiss is sharper and louder—no vocal-cord vibration. When ㅆ ends a syllable it shuts the airflow abruptly and is heard as a short, unreleased “t,” similar to the clipped ending of “bat” in fast speech.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ssam","native":"쌈","position":"Beginning","cultural_context":"Word for the lettuce wrap you make at Korean BBQ"},{"target":"ssamjang","native":"쌈장","position":"Beginning","cultural_context":"The thick dipping sauce served with Korean BBQ wraps"},{"target":"Bossam","native":"보쌈","position":"Middle","cultural_context":"Well-known Korean boiled pork dish found on many restaurant menus"}]}]
["ㅇ",{"thoughts":"English speakers already know the nasal “ng” [ŋ] at the ends of words like “sing.” ㅇ is that exact sound when it closes a syllable, and it is completely silent when it starts one, acting only as a placeholder so the syllable can begin with a vowel. The two roles are straightforward once explained.","pattern":"ㅇ","position":"Anywhere","description":"ㅇ has two jobs:\n1) At the START of a syllable it is silent – the vowel just begins on its own (e.g., ‘In-’ in Incheon).\n2) At the END of a syllable it is the velar nasal [ŋ], the same sound as the “ng” in English “sing.”  Korean never spells this sound with ‘n+g’; it’s one single consonant letter.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Incheon","native":"인천","position":"Beginning","cultural_context":"Major Korean city & international airport many travelers use"},{"target":"Gangnam","native":"강남","position":"Middle","cultural_context":"Famous Seoul district from the hit song “Gangnam Style”"},{"target":"Bangtan","native":"방탄","position":"Multiple","cultural_context":"Part of the full Korean name of K-pop group BTS (Bangtan Sonyeondan)"}]}]
["ㅈ",{"thoughts":"Korean ㅈ is basically an unaspirated affricate that foreigners usually map to English “j”, but it becomes a plain unreleased “t” sound at syllable-final position. Most English speakers have heard it in words like “soju” and “Jeju,” so the sound is not alien, but they may over-aspirate it or forget the final-t rule.","pattern":"ㅈ","position":"Anywhere","description":"At the start of a syllable ㅈ is an unaspirated \"j-ch\" sound—like the “j” in “jar,” but with your tongue a bit further forward toward the hard palate and with almost no burst of air. Between vowels it can soften toward a voiced “j.” When ㅈ closes a syllable it stops cleanly with no puff: it sounds like a very brief, unreleased “t.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Jin","native":"진","position":"Beginning","cultural_context":"Stage name of a well-known member of the global K-pop group BTS"},{"target":"Soju","native":"소주","position":"Middle","cultural_context":"Famous Korean distilled spirit sold worldwide in bars and liquor stores"},{"target":"Jeju","native":"제주","position":"Multiple","cultural_context":"Popular South Korean island vacation spot often mentioned in travel shows"}]}]
["ㅉ",{"thoughts":"‘ㅉ’ is the tense / fortis version of the Korean ㅈ sound.  English has no direct match, so learners tend to pronounce it like a plain English “j.”  They must learn to build up mouth pressure and release it without aspiration.","pattern":"ㅉ","position":"Anywhere","description":"Pronounce it like an un-aspirated, super-tight “j.”  Press the tip of your tongue against the ridge just behind your upper teeth (same place as the English “j”), tense the tongue and vocal folds, build pressure, then release sharply with NO puff of air.  It is crisper and harder than the soft English “j” in “jam,” but unlike the “ch” in “chip,” there is no burst of air.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"Jjajangmyeon","native":"짜장면","position":"Beginning","cultural_context":"Black-bean noodles often featured in K-dramas and Korean restaurants"},{"target":"Jjigae","native":"찌개","position":"Beginning","cultural_context":"Generic word for Korean stews seen on many menus (e.g., kimchi-jjigae)"},{"target":"Jjimjilbang","native":"찜질방","position":"Beginning","cultural_context":"Korean bathhouse / sauna concept shown in travel shows and K-culture media"}]}]
["ㅊ",{"thoughts":"ㅊ is basically the Korean aspirated “ch” sound, so it will feel familiar to English speakers who know the word “chess.”  The only surprise is that when ㅊ sits as a final consonant it loses its strong ‘ch’ release and sounds like an unreleased “t.”  Most high-profile loan-words keep ㅊ before a vowel, so learners usually hear the clear ‘ch’ version.","pattern":"ㅊ","position":"Anywhere","description":"Most of the time ㅊ is pronounced like the first sound in the English word “cheese,” but with a stronger puff of air (aspiration).  Touch the tip of your tongue just behind your top teeth, explode a quick burst of air, and immediately move into the following vowel.  If ㅊ is the very last consonant in a syllable with no vowel after it, Korean reduces it to an unreleased, very short “t.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"kimchi","native":"김치","position":"Middle","cultural_context":"Korean fermented cabbage dish found in many grocery stores & restaurants"},{"target":"Choi","native":"최","position":"Beginning","cultural_context":"Common Korean last name (e.g., chef Roy Choi, actor Choi Woo-shik) seen in news & media"},{"target":"Chuseok","native":"추석","position":"Beginning","cultural_context":"Korean Thanksgiving holiday often mentioned in K-culture articles and shows"},{"target":"gochujang","native":"고추장","position":"Middle","cultural_context":"Spicy red pepper paste listed in many modern recipes and food shows"}]}]
["ㅋ",{"thoughts":"English already has an aspirated K at the start of words, so the initial sound of ㅋ feels familiar. What’s new is noticing that it is always aspirated, even inside a word, and that in final position it is held (unreleased) rather than fully puffed out. The spelling cue helps learners keep the aspiration consistent.","pattern":"ㅋ","position":"Anywhere","description":"Korean ㅋ is an aspirated K. At the beginning (or after another consonant) it’s like the strong puff of air in English “kh” in ‘khaki.’ Between vowels it still keeps that little burst, unlike the softer English medial K in ‘baker.’ At the end of a syllable it stops abruptly with no audible release, like the cut-off K at the end of a quick English ‘back.’","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"케이팝","native":"케이팝","position":"Beginning","cultural_context":"The global term for Korean popular music, written exactly this way in many English articles"},{"target":"오케이","native":"오케이","position":"Middle","cultural_context":"Korean borrowing of the English word “okay,” heard constantly in K-dramas"},{"target":"부엌","native":"부엌","position":"End","cultural_context":"Means “kitchen”; shows up in Korean recipes and language-learning materials"}]}]
["ㅌ",{"thoughts":"English already has an aspirated \"t\" at the start of words (top, time), so the onset version of ㅌ sounds pretty familiar. What’s new is that Korean ㅌ is ALWAYS strongly aspirated in syllable-initial position, and when it sits at the end of a syllable it is held (no puff of air) and the tongue stops firmly, more like the cut-off t in the middle of “cat-nip.” It can also soften to a \"ch\" sound before i/ y-vowels, but learners mainly need to master the big burst of air versus the abrupt stop.","pattern":"ㅌ","position":"Anywhere","description":"ㅌ is an aspirated “t.” At the start of a syllable it’s like the first sound in English “top,” but with an even bigger puff of air—hold the tongue on the ridge behind your teeth, then release with a strong exhale. When ㅌ ends a syllable it is an unreleased stop: touch the tongue, cut the airflow, and don’t let the air burst out (similar to the tense, unfinished t some Americans use at the end of “cat”). Before i or y-like vowels it often palatalizes and is heard more like an English “ch.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"타코","native":"taco","position":"Beginning","cultural_context":"Mexican food “taco,” borrowed directly into Korean"},{"target":"스타벅스","native":"Starbucks","position":"Middle","cultural_context":"Global coffee chain name spelled phonetically in Korean"},{"target":"핫도그","native":"hot dog","position":"End","cultural_context":"Famous snack “hot dog,” written in Korean"}]}]
["ㅍ",{"thoughts":"English already has an aspirated /p/ at the start of words, so the initial sound of ㅍ feels familiar. What may be new is that Korean contrasts it with an unaspirated ㅂ, and that syllable-final ㅍ is an unreleased stop, not the puff of air English speakers expect. Overall, it’s mostly familiar but still needs a small adjustment.","pattern":"ㅍ","position":"Anywhere","description":"ㅍ is an aspirated \"p\". At the start of a syllable it sounds like the first P in “pie” with a noticeable puff of air. Between vowels it is still slightly aspirated but softer than English. At the very end of a syllable it becomes a tight, unreleased “p” (lips close but no burst). The lips come together firmly, and the voice should stay completely voiceless.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"pizza","native":"피자","position":"Beginning","cultural_context":"Korean loan-word for the universally known Italian food"},{"target":"coffee","native":"커피","position":"Middle","cultural_context":"Everyone orders coffee; Korean word sounds like “kuh-pee”"},{"target":"K-pop","native":"케이팝","position":"End","cultural_context":"Global brand name for Korean pop music"}]}]
["ㅎ",{"thoughts":"English already has an /h/ sound, so the basic idea is familiar. The only wrinkle is that final-syllable ㅎ is usually silent and just makes the next consonant aspirated, but most loan-words English speakers meet have ㅎ at the start of a syllable, so it feels natural.","pattern":"ㅎ","position":"Anywhere","description":"Think of the English h in “hot.” Keep the throat relaxed and let a short puff of air pass; no voicing. If ㅎ comes right before k/t/p/ㅈ-like sounds, those consonants become extra-aspirated (kh/th/ph/ch). At the very end of a word you will usually not pronounce a full [h]; you simply cut the vowel short.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Hyundai","native":"현대","position":"Beginning","cultural_context":"Globally known Korean car brand"},{"target":"Hanbok","native":"한복","position":"Beginning","cultural_context":"Traditional Korean dress often shown in tourism ads and K-dramas"},{"target":"annyeonghaseyo","native":"안녕하세요","position":"Middle","cultural_context":"Korean greeting “hello” heard frequently in K-pop and K-dramas"}]}]
["ㅏ",{"thoughts":"The Korean vowel ㅏ is essentially the same open “ah” sound English speakers use in words like “father.” Because the sound already exists in English, learners usually recognize and reproduce it easily.","pattern":"ㅏ","position":"Anywhere","description":"A wide open “ah” sound, like the a in “father” or “spa.” Keep the mouth open and relaxed; tongue is low and toward the front, not pulled back like the British ‘o’ in “lot,” and not stretched forward like the short ‘a’ in “cat.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Samsung","native":"삼성","position":"Beginning","cultural_context":"Global electronics brand—phones, TVs, etc."},{"target":"Gangnam","native":"강남","position":"Multiple","cultural_context":"Seoul district made famous by the song “Gangnam Style”"},{"target":"Bibimbap","native":"비빔밥","position":"End","cultural_context":"Popular Korean mixed-rice dish found in many Asian restaurants"}]}]
["ㅐ",{"thoughts":"English already has a very similar mid-front vowel (the “e” in “bed”), so recognition is not the main issue; the usual trouble spot is confusing ㅐ with the equally common Korean vowel ㅔ. Learners mainly need to hold a steady, open “eh” sound without sliding toward a diphthong.","pattern":"ㅐ","position":"Anywhere","description":"Pronounce ㅐ as a clear, steady “eh” sound—almost exactly like the vowel in English “bed.” Your jaw should drop a bit and the lips stay relaxed (not rounded). Do NOT let it glide toward a long \"ay\" as in “say.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Taekwondo","native":"태권도","position":"Middle","cultural_context":"Famous Korean martial art practiced worldwide"},{"target":"Daewoo","native":"대우","position":"Beginning","cultural_context":"Former global electronics & car brand often seen on TVs and appliances"},{"target":"Bae","native":"배","position":"Beginning","cultural_context":"K-culture surname now popular in English slang meaning “sweetheart”"}]}]
["ㅑ",{"thoughts":"English speakers already know the /jɑ/ glide-plus-vowel sequence from words like “yacht” or the casual “ya.” The Korean ㅑ is the same glide /y/ plus a pure open ‘a’ vowel, without turning into the diphthong or short /æ/ that sometimes happens in English.","pattern":"ㅑ","position":"Anywhere","description":"Pronounce a quick English y-sound followed immediately by the open ‘ah’ in “father:” /ya/. Keep the mouth open and relaxed—don’t compress it into the shorter /æ/ of “cat,” and don’t let it slide toward /ai/ as in “yikes.” One crisp syllable: y-ah.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"야후","native":"Yahoo","position":"Beginning","cultural_context":"Global web portal; same name in English"},{"target":"야마하","native":"Yamaha","position":"Beginning","cultural_context":"Famous Japanese brand of motorcycles & instruments"},{"target":"샴푸","native":"shampoo","position":"Beginning","cultural_context":"Loan-word for the everyday hair-wash product"},{"target":"삼양라면","native":"Samyang ramen","position":"Middle","cultural_context":"Popular spicy Korean instant noodles seen in ‘fire-noodle’ internet challenges"}]}]
["ㅒ",{"thoughts":"/ㅒ/ is the Korean glide-vowel that sounds like the English sequence “y + eh (as in ‘yes’)” compressed into one quick syllable. English already has the exact sound in the first part of ‘yes’, so it is usually easy for learners. The main pitfall is stretching it into the long English diphthong of ‘yay’; keep it short and relaxed.","pattern":"ㅒ","position":"Anywhere","description":"Say a quick English “yeh” (/jɛ/) as in the very start of “yellow,” but end it immediately—don’t let it glide toward /eɪ/. Tongue starts high-front for the ‘y’ glide, then opens slightly to the short ‘eh’ vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"얘기","native":"story; talk","position":"Beginning","cultural_context":"Frequently heard in K-dramas when characters say “tell me” or “let’s talk”"}]}]
["ㅓ",{"thoughts":"English already has a near-equivalent “uh” sound, but the Korean ㅓ is a bit farther back and unrounded, so learners often make it too front (like English ʌ) or too rounded (like ɔ).","pattern":"ㅓ","position":"Anywhere","description":"ㅓ is a mid-back, unrounded vowel—think of the “uh” in English “sun,” but place your tongue slightly farther back and keep the lips completely relaxed (not rounded as in “saw”). It is longer and clearer than the English schwa.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"서울","native":"Seoul","position":"Beginning","cultural_context":"Capital city of South Korea, often mentioned in news and travel guides"},{"target":"삼성","native":"Samsung","position":"End","cultural_context":"Global electronics brand (phones, TVs, etc.)"},{"target":"커피","native":"coffee","position":"Beginning","cultural_context":"Loanword for the universally known beverage"}]}]
["ㅔ",{"thoughts":"ㅔ is basically the plain “eh” sound—very close to the English vowel in “bed.” English already has a near-identical vowel, so recognition is quick. The only subtlety is keeping it a pure vowel (do not let it slide toward a long “ay”).","pattern":"ㅔ","position":"Anywhere","description":"Pronounce ㅔ as a short, clean “eh” sound. It sits in the middle of the mouth, lips relaxed and slightly spread. Think of the vowel in the English word “bet,” but keep it a single, steady sound—no off-glide toward “ee.” (It is slightly higher than English /ɛ/, but native speakers won’t mind as long as it stays “eh.”)","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Jeju","native":"제주","position":"Beginning","cultural_context":"Famous Korean resort island—many tourists, travel shows, and flight ads mention it"},{"target":"Naver","native":"네이버","position":"Beginning","cultural_context":"South Korean search engine and web portal often referenced in tech news"},{"target":"Lotte","native":"롯데","position":"End","cultural_context":"Large Korean brand seen on candy, department stores, and baseball stadiums"}]}]
["ㅕ",{"thoughts":"ㅕ is the Korean ‘y-uh’ vowel. English has a similar neutral ‘uh’ as in “fun,” but rarely puts a clear y-glide in front. English speakers can approximate it by starting with the consonant y in “yes” then immediately opening to the relaxed ‘uh’ in “sun.” The mouth should stay more open than for “yo” and the lips remain unrounded.","pattern":"ㅕ","position":"Anywhere","description":"Pronounced like a quick ‘y’ plus the English short ‘uh’ (y-uh). Start with the tongue high toward the hard palate for the ‘y’ glide, then drop into a relaxed, slightly open-jaw ‘uh’ sound. Do NOT round the lips like in “yo.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"현대","native":"Hyundai","position":"Beginning","cultural_context":"Global automobile brand"},{"target":"평창","native":"Pyeongchang","position":"Beginning","cultural_context":"Host city of the 2018 Winter Olympics"},{"target":"연세","native":"Yonsei University","position":"Beginning","cultural_context":"Well-known Korean university mentioned in international rankings"}]}]
["ㅖ",{"thoughts":"ㅖ is one of the least troublesome Korean vowels for English speakers because it already exists in English as the first sound of “yes.” The only thing to remember is to keep it short and crisp without sliding into a long “ay.”","pattern":"ㅖ","position":"Anywhere","description":"Pronounced /je/ – like the “ye” in the English word “yes,” but shorter. Start with a brief “y” glide then go straight into a pure “eh” sound (as in “met”), ending quickly without turning it into “yay.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Yeji","native":"예지","position":"Beginning","cultural_context":"Well-known member of the K-pop group ITZY"},{"target":"Son Ye-jin","native":"손예진","position":"Middle","cultural_context":"Star actress of hit K-drama “Crash Landing on You”"},{"target":"Hyeri","native":"혜리","position":"Beginning","cultural_context":"Singer-actress famous from K-drama “Reply 1988”"}]}]
["ㅗ",{"thoughts":"ㅗ is one of the simplest Korean vowels. It is close to the English “o” in “go,” but it stays a single pure sound instead of sliding into a ‘w’ or ‘oo.’ English speakers already know the general mouth shape, but must remember to keep it short and steady.","pattern":"ㅗ","position":"Anywhere","description":"A single, rounded back vowel [o]. Lips form a small round opening (as if saying the first half of “oh”), tongue is mid-high and back. Do NOT glide into a second sound (avoid the English diphthong ‘oʊ’).","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"soju","native":"소주","position":"Beginning","cultural_context":"Well-known Korean distilled liquor found in many bars and K-dramas"},{"target":"Kakao","native":"카카오","position":"End","cultural_context":"Brand behind KakaoTalk messaging app that many people hear about when discussing Korean tech"},{"target":"Lotte","native":"롯데","position":"Beginning","cultural_context":"Major Korean brand seen on candy, duty-free shops, and baseball team names"}]}]
["ㅘ",{"thoughts":"ㅘ is just a diphthong that sounds like the English “wa” in “water.” English speakers already use this sound, so recognition is easy; the main hurdle is remembering to keep it short (one syllable, not “wah-uh”).","pattern":"ㅘ","position":"Anywhere","description":"Pronounced /wa/. Start with rounded lips as if saying the English long “o” in “go,” then immediately glide to the open “a” as in “father.” It should be a single, quick syllable — like the ‘wa’ in “wander,” but shorter.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Hwasa","native":"화사","position":"Beginning","cultural_context":"Famous K-pop singer from the group Mamamoo"},{"target":"Gwangju","native":"광주","position":"Beginning","cultural_context":"Large Korean city known for its 1980 democratic uprising, often mentioned in news and travel guides"},{"target":"Hwarang","native":"화랑","position":"Beginning","cultural_context":"Title of a popular K-drama and name of an ancient Korean warrior class"}]}]
["ㅙ",{"thoughts":"English speakers hear ㅙ as something between “we” and the short “e” in “wet.” It is written by combining ㅗ (o) + ㅐ (ae) but is now pronounced /wɛ/ or /we/, nearly the same as the vowel in the English word “wedding” with a light w-glide in front. Because English has the diphthong “we-” in words like “wedge,” the sound is not totally foreign, but the quick glide plus short open-mouth vowel can trip learners up.","pattern":"ㅙ","position":"Anywhere","description":"Start with a very short English “w” sound, then immediately open into the vowel of “wet.” Think “w + eh” said in one smooth syllable: /wɛ/. Keep it short—do not draw it out like the English long “way.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"왜 (wae)","native":"why?","position":"Beginning","cultural_context":"Common one-word question in K-dramas & memes"},{"target":"괜찮아 (gwaen-cha-na)","native":"it’s okay","position":"Beginning","cultural_context":"Frequently heard reassuring phrase in K-pop lyrics and TV shows"},{"target":"돼지고기 (dwae-ji-go-gi)","native":"pork","position":"Beginning","cultural_context":"Listed on Korean BBQ menus popular with food lovers"}]}]
["ㅚ",{"thoughts":"ㅚ is almost always heard as the quick glide /we/ (like the first part of “wedding”).  Some speakers drop the w-glide and it sounds closer to a plain “e” in “bed.”  There’s no exact single English letter for it, so spelling varies (oe, we, e).","pattern":"ㅚ","position":"Anywhere","description":"Say a short, single-syllable “weh.”  Start with a very light w-sound, then go straight into the “e” of “bed,” keeping the whole thing one smooth vowel, not two separate sounds.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Choi","native":"최","position":"Beginning","cultural_context":"Korean last name you may see in movies, K-Pop, or news"},{"target":"doenjang","native":"된장","position":"Beginning","cultural_context":"Fermented soybean paste on Korean restaurant menus"},{"target":"hoe","native":"회","position":"Beginning","cultural_context":"Korean sashimi dish listed at seafood or barbecue spots"}]}]
["ㅛ",{"thoughts":"English speakers already use the \"yo\" sound (e.g., saying \"Yo, what's up?\") so the vowel ㅛ is generally familiar. The only nuance is keeping it a single syllable combining the consonant-y glide with a rounded mid-back vowel, not splitting it into two separate sounds.","pattern":"ㅛ","position":"Anywhere","description":"ㅛ is pronounced like the English interjection “yo” /joʊ/: start with a brief \"y\" glide, immediately round the lips, and move into the long \"o\" sound as in “go.” It’s one smooth syllable, not “ee-oh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"yoga","native":"요가","position":"Beginning","cultural_context":"The exercise/discipline practiced worldwide"},{"target":"Toyota","native":"도요타","position":"Middle","cultural_context":"Famous Japanese car brand seen on roads everywhere"},{"target":"yo-yo","native":"요요","position":"Multiple","cultural_context":"Classic toy that goes up and down on a string"}]}]
["ㅜ",{"thoughts":"ㅜ is the Korean high-back rounded vowel /u/. English has a very similar sound in words like “food,” but English speakers almost always glide it a bit (turning it into something like /uw/). The Korean version must stay short, pure, and without that final w-like off-glide.","pattern":"ㅜ","position":"Anywhere","description":"Round your lips as if saying the “oo” in English “moon,” keep the tongue high and toward the back of the mouth, and hold the sound steady—don’t let it slide into an English-style “oo-w.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"부산","native":"Busan","position":"Beginning","cultural_context":"Major Korean port city, famous film festival—often mentioned in travel shows"},{"target":"소주","native":"soju","position":"End","cultural_context":"Korean distilled liquor that appears on drink menus worldwide"},{"target":"불고기","native":"bulgogi","position":"Beginning","cultural_context":"Popular Korean BBQ dish found in many international restaurants"}]}]
["ㅝ",{"thoughts":"English already has a very similar glide-vowel combination “wo” as in “wonder,” so learners can link the Korean ㅝ to that, but they must keep the vowel closer to the relaxed “uh” in “sun” rather than the round “oh” in “won’t.”","pattern":"ㅝ","position":"Anywhere","description":"Pronounced /wʌ/ – start with an English w-glide, then quickly open into the short “uh” of “sun.” It is NOT the long “oh” in “woah,” and your lips un-round as you move into the vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"won","native":"원","position":"Beginning","cultural_context":"South Korean currency you see mentioned in news and K-dramas"},{"target":"Kwon","native":"권","position":"Beginning","cultural_context":"Common Korean surname; e.g., actor Kwon Sang-woo"}]}]
["ㅞ",{"thoughts":"/we/ is already in English (wet, wedding). Main advice: start with rounded lips like \"oo\" then glide quickly to short \"eh\" without inserting a y-sound. Spelling ㅞ is rare but shows up in many English loanwords, so examples the learner will recognize are easy to find.","pattern":"ㅞ","position":"Anywhere","description":"Pronounced /we/: start with rounded lips as if saying \"oo\" then immediately open to the short \"e\" in \"red.\" It feels like saying the English word “wet” but a bit shorter and without an extra y-glide at the end.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"웨딩","native":"wedding","position":"Beginning","cultural_context":"Direct English loanword for a marriage ceremony"},{"target":"스웨터","native":"sweater","position":"Middle","cultural_context":"Borrowed English word for a knitted top"},{"target":"노르웨이","native":"Norway","position":"Middle","cultural_context":"Well-known European country famous for fjords"},{"target":"웨이브","native":"wave","position":"Beginning","cultural_context":"English word used for a hairstyle or a hand gesture"}]}]
["ㅟ",{"thoughts":"[wi] already exists in English words like “week” or the French loanword “oui,” so the sound is not alien. The main adjustment is to keep the lips rounded for the whole glide and not insert an extra English-style “w” consonant after another consonant.","pattern":"ㅟ","position":"Anywhere","description":"Pronounced as one smooth vowel glide [wi] – start with tightly rounded lips as if saying “oo” in “moon,” then immediately glide to the “ee” in “see,” without pausing. It is very close to the French word “oui.” After s/ㅅ or j/ㅈ it may sound slightly more ‘sh’-like because the consonant palatalizes, but the vowel quality stays the same.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"위스키","native":"whiskey","position":"Beginning","cultural_context":"Loanword for the well-known alcoholic drink"},{"target":"트위터","native":"Twitter","position":"Middle","cultural_context":"Name of the globally popular social media platform"},{"target":"스위치","native":"switch (Nintendo Switch or a light switch)","position":"Middle","cultural_context":"Common English word; also the famous Nintendo gaming console"}]}]
["ㅠ",{"thoughts":"English already has a similar glide-vowel sequence “you,” so learners have an acoustic reference, but they must keep the Korean vowel shorter and more rounded. Finding well-known Korean loanwords that actually contain the letter ㅠ is tricky; “YouTube” (유튜브) is by far the most obvious, and “yuja tea” (유자차) is becoming familiar through cafés and K-food culture.","pattern":"ㅠ","position":"Anywhere","description":"Pronounced like a quick, rounded “yoo.” Start with an English y-sound, immediately glide into the tight, rounded Korean u (ㅜ) as in “food,” but keep it shorter and without the trailing English w-quality many speakers add in “you.” Lips stay rounded throughout.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"YouTube","native":"유튜브","position":"Multiple","cultural_context":"Global video-sharing platform everyone uses"},{"target":"yuja tea","native":"유자차","position":"Beginning","cultural_context":"Korean citrus tea increasingly sold in cafés and Asian supermarkets"}]}]
["ㅡ",{"thoughts":"English has no exact match for the Korean vowel ㅡ, so learners usually substitute it with something between the English “uh” and “oo,” but that still sounds off to Koreans. Explaining its tongue and lip position plus showing well-known words that contain it helps.","pattern":"ㅡ","position":"Anywhere","description":"A high, back, UN-rounded vowel [ɯ]. Start to say the English “oo” in “food,” but keep the lips relaxed and unrounded while the tongue stays high and toward the back of the mouth. It should not sound like “uh” in “sun” (too low) or “ee” in “seen” (too front). Practise by whispering “oo” with loose lips; the muffled sound you hear is close to ㅡ.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"Hangul","native":"한글","position":"Middle","cultural_context":"Name of the Korean alphabet—often mentioned in language articles and apps"},{"target":"Seungri","native":"승리","position":"Beginning","cultural_context":"Stage name of a former BIGBANG K-pop star, seen in music news"},{"target":"Geum","native":"금","position":"Beginning","cultural_context":"Romanised word for “gold,” appears in Korean place or family names like Geum River or actress Kim Tae-hee’s surname written as Geum in older texts"}]}]
["ㅢ",{"thoughts":"English speakers almost never meet the Hangul vowel ㅢ except when looking at Korean names like “Uijeongbu” or “Heechul.” The sound changes depending on where it sits, so learners get confused. We need to point out the three common pronunciations (oo-ee glide, plain ee, and colloquial eh) and give familiar examples that illustrate each.","pattern":"ㅢ","position":"Anywhere","description":"1) At the very start of a syllable with no preceding consonant (의…): say a quick glide from the Korean \"eu\" (unrounded ‘oo’ deep in the throat) into “ee.” It feels like saying “oo-ee” in one syllable. 2) After another consonant (e.g., 희, 귀): most Koreans drop the first part and just say “ee,” similar to the ‘ee’ in “meet.” 3) As the possessive particle 의 in casual speech, it is usually pronounced like “eh” in “bed.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"Uijeongbu","native":"의정부","position":"Beginning","cultural_context":"City near Seoul often mentioned in the TV show M*A*S*H and known for a large U.S. Army base"},{"target":"uisa","native":"의사","position":"Beginning","cultural_context":"Means \"doctor\"; frequently heard in K-dramas when someone calls for a physician"},{"target":"Heechul","native":"희철","position":"Beginning","cultural_context":"Stage name of a well-known member of K-pop group Super Junior; his name begins with this vowel"}]}]
["ㅣ",{"thoughts":"The vowel ㅣ is a simple high front vowel like the “ee” in English “see.” English speakers already have this sound, though they sometimes turn it into a slight diphthong (see-y). They just need to keep it pure and tense.","pattern":"ㅣ","position":"Anywhere","description":"Pronounce it as a pure, steady “ee” sound, lips spread and un-rounded, tongue high and toward the front (similar to English “see” but with no glide).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"김치","native":"kimchi","position":"Middle","cultural_context":"Famous Korean fermented cabbage side-dish found in supermarkets and restaurants"},{"target":"인천","native":"Incheon","position":"Beginning","cultural_context":"Large Korean city/airport often mentioned in travel and news"},{"target":"비빔밥","native":"bibimbap","position":"Multiple","cultural_context":"Well-known Korean mixed rice bowl featured on many menus"}]}]
["ㄳ",{"thoughts":"The cluster ㄳ only shows up as the final consonant (batchim) of a syllable. By default it is pronounced like an unreleased \"k\" (the ㄱ part).  If the next syllable starts with a vowel, the ㅅ moves forward and is pronounced “s-/sh-,” so learners need to know both possibilities.  English has no exact parallel to an unreleased k that can suddenly become an s, so the sound will feel new.  Few internationally famous Korean loan-words contain ㄳ, so the examples have to rely on very common everyday Korean words that K-culture fans will have bumped into.","pattern":"ㄳ","position":"Anywhere","description":"In syllable-final position it sounds like an unreleased k (think the k in “sick” when you stop your breath).  If a vowel follows in the next syllable, the hidden ㅅ pops out and the pronunciation becomes “k + s,” e.g., [mok̚-ssi].  Keep the tongue back for the k, release only a light hiss for the s.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"값","native":"값","position":"End","cultural_context":"Common word for “price” that appears on Korean menus and in subtitles"},{"target":"몫이","native":"몫이","position":"Beginning","cultural_context":"Grammar textbooks use this example to show the “share/portion” noun plus subject marker – often quoted in Korean-learning media"}]}]
["ㄵ",{"thoughts":"Korean ㄵ is a final-consonant cluster of ㄴ+n and ㅈ+j.    • When nothing follows (word or syllable ends), Koreans pronounce only the first half, a plain n sound.    • When the next syllable starts with a vowel (usually written with ㅇ), the hidden ㅈ pops out and you actually say an English-style \"nj\" as in “injure.”    • If the next syllable starts with certain consonants (ㄷ ㅅ ㅈ ㅊ ㅌ), the ㅈ influences them and you hear a stronger \"t\" or \"j\" sound (e.g., ㄷ becomes a tense ㅉ/ㄸ-like burst). English has no direct parallel to these sandhi rules, so the same spelling may sound different in fast speech.","pattern":"ㄵ","position":"Anywhere","description":"Think of ㄵ as two sounds squeezed into one syllable: start with an English n and let the tip of your tongue stay on the ridge as if you were about to begin the word “jump.” If the word stops there, release nothing—just an n. If a vowel follows, let the tongue slide into a quick \"j\" glide, making something like “nj.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"anja","native":"앉아","position":"Middle","cultural_context":"Fans of K-dramas hear this command meaning “sit (down).”"},{"target":"anjda (to sit)","native":"앉다","position":"Middle","cultural_context":"Appears in Korean language textbooks and apps."}]}]
["ㄶ",{"thoughts":"ㄶ only shows up as a final (batchim) consonant cluster. The ㅎ is silent here, so to an English ear it just sounds like a plain “n.” The only wrinkle is that if the next syllable starts with a consonant like ㄷ or ㅅ the ㅎ can make that following consonant aspirated, but learners can safely treat ㄶ itself as an [n]. Because it reduces to a sound English speakers already have, the main challenge is noticing that the written ㅎ does not get its own audible breath.","pattern":"ㄶ","position":"Anywhere","description":"Pronounce it exactly like the ‘n’ in “noon.” The additional ㅎ you see in the spelling is not voiced; it only affects the following consonant (if any). So keep the tongue on the alveolar ridge as for a normal English n, with no extra puff of air.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"gwaenchana","native":"괜찮아","position":"Beginning","cultural_context":"Common phrase in K-dramas meaning “it’s OK” / “I’m fine”"},{"target":"gwaenchantda","native":"괜찮다","position":"Beginning","cultural_context":"Dictionary form of the same word—often appears in subtitles and Korean-learning apps"},{"target":"manhi","native":"많이","position":"Beginning","cultural_context":"Means “a lot”; heard in phrases like “thank you very much” (K-pop lyrics, variety shows)"}]}]
["ㄺ",{"thoughts":"ㄺ only appears as a final consonant cluster, so English speakers rarely notice it. Its sound changes depending on what follows, so it can be confusing: usually an unreleased “k”, but before a vowel it splits into an “l-g”, and before ㄴ it turns into “ng-n”. We can use bulgogi and dakgalbi to show the two most common cases English speakers will meet in restaurants.","pattern":"ㄺ","position":"Anywhere","description":"This is a final consonant cluster made of ㄹ (an “l” sound) plus ㄱ (a “g/k” sound).  • At the end of a word or before most consonants it is pronounced like a tight, unreleased “k” (similar to the very end of the English word “sick”).  • If the next syllable starts with a vowel, you first say an “l” and slide straight into a hard “g”, e.g., 불고기 → “bul-go-gi”.  • When it comes before ㄴ it nasalises to “ng-n” (읽는 → “ing-neun”).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"bulgogi","native":"불고기","position":"Middle","cultural_context":"Well-known Korean BBQ beef dish found on many restaurant menus."},{"target":"dakgalbi","native":"닭갈비","position":"Beginning","cultural_context":"Popular spicy stir-fried chicken dish, often listed at Korean eateries."}]}]
["ㄻ",{"thoughts":"ㄻ is pretty rare and mostly shows up in literary-style words like “삶 (life)” or verb stems such as “젊- (to be young).”  English speakers usually haven’t met it, and the way the sound changes depending on what follows (just [m] vs. split [l]+[m]) is unfamiliar, so it feels tricky.","pattern":"ㄻ","position":"Anywhere","description":"Double-final batchim made of ㄹ (l/r) + ㅁ (m).\n• At the very end of a word OR before another consonant, you only hear an [m] – lips closed, no “l.”  Think of the final sound in the English word “ham.”\n• If the next syllable starts with a vowel, ㄹ moves forward and you get an “l m” sequence across the syllable break, like saying the English cluster in “film,” but spread out: ‘sal-mi.’","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"salm","native":"삶","position":"End","cultural_context":"Literary word for “life”; turns up in drama subtitles and song lyrics"},{"target":"salmi","native":"삶이","position":"Middle","cultural_context":"Phrase such as “삶이 아름다워” (“Life is beautiful”) appears in K-dramas and K-pop lyrics"}]}]
["ㄼ",{"thoughts":"ㄼ never shows up at the start of a Korean syllable; it only sits in the batchim (final-consonant) slot.  It is written as ㄹ+ㅂ, but Korean only lets one consonant be heard at the end of a syllable, so which one you hear depends on what comes next.  If a vowel follows, you hear both sounds split across the syllables (…l.b…).  If a consonant or nothing follows, only the ㅂ survives, pronounced as a tight, unreleased p-sound, while the ㄹ is silent.  The sounds themselves (l, b/p) are familiar to English speakers, but remembering when each appears is new.","pattern":"ㄼ","position":"Anywhere","description":"Spelled as the consonant pair ㄹ(l) + ㅂ(b/p) in the syllable-final position.\n• Before a vowel: pronounce it as “l” ending the first syllable and start the next syllable with a plain “b”.  Think “gal-bi”.\n• Before a consonant or at the very end of a word: the cluster reduces to an unreleased “p” (like the stop at the end of English “lap”), the ㄹ disappears.\nSo the written pair can surface as [l.b] or [p] depending on the following sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"갈비","native":"갈비","position":"Middle","cultural_context":"Korean BBQ short-rib dish (‘galbi’) popular in many US restaurants"},{"target":"갈비탕","native":"갈비탕","position":"Middle","cultural_context":"Beef-rib soup (‘galbitang’) that often appears on Korean menus"}]}]
["ㄽ",{"thoughts":"ㄽ is an extremely rare final-consonant cluster (batchim).  Modern Korean dictionaries list almost no high-frequency words that contain it, and none of those words have reached everyday use among English speakers (unlike kimchi, bulgogi, etc.).  Because of that, there just isn’t a widely recognisable loan-word, brand, food, or place name that can serve as a friendly example here.","pattern":"ㄽ","position":"Anywhere","description":"Appears only at the very end of a syllable.  In isolation it is pronounced exactly like a dark English “l” [l]—the ㅅ is silent.  If the next syllable begins with a vowel, the ㄹ still sounds like [l] and the ㅅ moves over, producing an “s” or “sh” sound at the start of the following syllable (e.g. [l-s]).  So English speakers really only need to think “final L, sometimes followed by an S that starts the next syllable.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[]}]
["ㄾ",{"thoughts":"ㄾ is a rare final-consonant cluster made of /l/ + an aspirated /t/. English speakers almost never meet it unless they study Korean, so we have to give unfamiliar but short verbs as examples.","pattern":"ㄾ","position":"Anywhere","description":"This cluster is written ㄾ but, in speech, only one part is audible at a time:\n• At the very end of a word or before another consonant, you just hold an unreleased dark L, like ending the English word “ball” but stopping there: [l̚].\n• If a vowel follows, you release the next syllable with a strong, puff-of-air T—so it sounds like “l-tʰ” stuck together, similar to saying “halt-ha” quickly.\nKeep the tongue in the L position (behind the upper teeth) and either stop completely or pop immediately into an aspirated T.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"핥다","native":"to lick","position":"Middle","cultural_context":"Simple verb that sometimes shows up in K-drama or lyrics"},{"target":"훑다","native":"to skim / brush over","position":"Middle","cultural_context":"Occurs in cooking shows and subtitles meaning to ‘sweep’ or ‘scan’"}]}]
["ㄿ",{"thoughts":"ㄿ is a special Hangul letter that only occurs in syllable-final (batchim) position. It is written as a single jamo but actually represents the consonant cluster /l/ + /p/. When nothing follows, Korean reduces it to a short, unreleased “p” sound – similar to the way many English speakers stop the /p/ in “stop!” without letting any air out. If the next syllable starts with a vowel, the /l/ is heard at the end of the first syllable and the /p/ re-surfaces at the beginning of the next syllable as an aspirated /pʰ/ (a little puff of air). Because English never writes two consonants with one letter and rarely uses unreleased /p/ in the middle of words, this cluster feels unfamiliar and can be tricky to time correctly.","pattern":"ㄿ","position":"Anywhere","description":"Pronounce ㄿ like an unreleased “p” at the very end of the syllable (tongue relaxed, lips closed, no burst of air). If the next syllable begins with a vowel, finish the first syllable with a clear English-style “l” and then release an aspirated “p” at the start of the next syllable (similar to the first ‘p’ in “paper”).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"읊다","native":"to recite (a poem)","position":"End","cultural_context":"Appears in Korean poetry discussions and occasionally in K-drama subtitles"},{"target":"읊어","native":"(you) recite; present form of 읊다","position":"Middle","cultural_context":"May pop up in K-pop lyrics or K-drama dialogue when someone says “recite it”"}]}]
["ㅀ",{"thoughts":"ㅀ is only ever written in the final-consonant (batchim) slot, so it can show up in the middle or at the very end of a word. To English ears it normally just sounds like a normal Korean final “l/ɭ̚”. The tricky bit is when the next syllable starts with a vowel: the hidden ㅎ re-appears and you get an L followed by a light H burst.","pattern":"ㅀ","position":"Anywhere","description":"Think of ㅀ as the final consonant ㄹ (a dark, unreleased ‘l’ like at the end of “ball”) PLUS a silent or lightly-voiced ‘h’.  • If nothing follows, just hold your tongue in the ‘l’ position and stop the air: [l̚].  • If the next syllable begins with a vowel, the tongue still releases from that ‘l’ but a soft ‘h’ puff comes out right after, almost like saying “l-h” very quickly (e.g., “silh-eo”).","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"싫어","native":"싫어","position":"Middle","cultural_context":"Common K-drama line meaning “I don’t like it!”"},{"target":"싫다","native":"싫다","position":"Middle","cultural_context":"Basic verb “to hate/dislike” that appears in beginner Korean lessons"}]}]
["ㅄ",{"thoughts":"The cluster ㅄ is only written in syllable-final (batchim) position. By itself it sounds like an unreleased p (as in the end of “cap”), but if the next syllable begins with a vowel, the hidden ㅅ reappears as an s sound, so you’ll actually say /ps/ across the syllable break (e.g., ‘eop-seo’). English speakers know p and s, but the unreleased p and the way the s “jumps” forward are less familiar.","pattern":"ㅄ","position":"Anywhere","description":"When ㅄ sits at the very end of a word or before a consonant, pronounce it like a tight, unreleased p – lips close but don’t pop. If the next syllable starts with a vowel, keep that unreleased p, then slide straight into an s sound: /ps/ (like saying “cups of…” very quickly across the syllable boundary).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"없다","native":"없다","position":"End","cultural_context":"Common phrase in K-dramas meaning “there isn’t / doesn’t exist”"},{"target":"없어","native":"없어","position":"Middle","cultural_context":"Heard in many K-pop lyrics as the casual “don’t have / not there”"},{"target":"값","native":"값","position":"End","cultural_context":"Means “price”; tourists see it on Korean menus and price tags"}]}]
["ㅇ",{"thoughts":"ㅇ at the start of a syllable isn’t really a sound at all – it’s just a silent place-holder that lets a syllable begin with a vowel. English already allows words to start with a vowel, so learners only need to remember that no extra consonant is inserted.","pattern":"ㅇ","position":"Beginning","description":"When ㅇ appears at the very start of a Korean syllable, it is silent. You simply pronounce the following vowel, exactly as you would start an English word like “apple” or “ice.” Avoid adding an English-style glottal stop or an “h” sound – just flow straight into the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Arirang","native":"아리랑","position":"Beginning","cultural_context":"Famous Korean folk song often mentioned in films and Olympic ceremonies"},{"target":"IU","native":"아이유","position":"Beginning","cultural_context":"Internationally popular K-pop singer whose stage name is spelled ‘IU’"},{"target":"E-Mart","native":"이마트","position":"Beginning","cultural_context":"Large Korean retail chain you may see in travel or business news"}]}]
["ㅇ",{"thoughts":"Final ㅇ is simply the English “ng” sound. Because English already has this nasal, learners usually recognize and reproduce it without much trouble. Main pitfalls: don’t release a hard /g/—keep it nasal—and be sure air comes out of the nose, not the mouth.","pattern":"ㅇ","position":"End","description":"When ㅇ is the final consonant of a syllable or word, it is pronounced like the English nasal sound at the end of “sing” or “ring.” The back of the tongue touches the soft palate and the sound resonates through the nose; there is NO hard /g/ burst afterwards.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Samsung","native":"삼성","position":"End","cultural_context":"Global electronics brand (phones, TVs, etc.)"},{"target":"Gangnam","native":"강남","position":"Middle","cultural_context":"District made famous by the hit song “Gangnam Style”"},{"target":"Myeong-dong","native":"명동","position":"Multiple","cultural_context":"Popular Seoul shopping street visited by many tourists"}]}]
["ㄹ",{"thoughts":"Initial ㄹ is the one time Korean has something close to an English r-sound. It is a single, quick tap/flap of the tongue, not the long bunched-tongue American “r” and not the clear English “l”. Most learners default to an English r or l; either is understandable, but the real sound is between the two.","pattern":"ㄹ","position":"Beginning","description":"At the very start of a word, ㄹ is pronounced as a quick, light flap similar to the single Spanish r in “pero.” The tongue briefly taps the ridge just behind the upper teeth. Do not curl the tongue (like English r) and don’t hold it against the teeth (like English l); just tap once and release.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"라면","native":"ramyeon (Korean instant noodles)","position":"Beginning","cultural_context":"Cup-noodle snack sold worldwide, often written “ramen” or “ramyun”"},{"target":"롯데","native":"Lotte","position":"Beginning","cultural_context":"Global Korean brand behind Lotte candy and duty-free shops"},{"target":"라디오","native":"radio","position":"Beginning","cultural_context":"The English word “radio” borrowed into Korean, seen in K-pop lyrics and product names"}]}]
["ㄹ",{"thoughts":"When ㄹ comes at the very end of a Korean syllable or word (batchim position) it is held against the tongue-tip ridge like the English dark “l” in “ball,” but it is shorter and never has the extra vowel-color English often adds (“ball-uh”). Because English already has a final /l/, most learners recognise the sound, yet the shorter, crisper Korean version and keeping the tongue relaxed can still trip them up.","pattern":"ㄹ","position":"End","description":"A quick, light final L sound. Place the tongue tip on the ridge just behind the upper teeth, release cleanly without adding a following vowel. Think of the ‘l’ in “feel,” but cut the voicing off immediately.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Seoul","native":"서울","position":"End","cultural_context":"Capital city of South Korea—major travel and news reference"},{"target":"idol (K-pop idol)","native":"아이돌","position":"End","cultural_context":"Pop culture term for Korean singers—seen in music news"},{"target":"Hangeul","native":"한글","position":"End","cultural_context":"Name of the Korean alphabet mentioned in language articles"}]}]
["ㄱ",{"thoughts":"English speakers already know the basic /k/ sound, but in Korean word-final position ㄱ is produced as a very short, unreleased stop. There is no puff of air and it never turns into a voiced /g/. The closest English analogy is the way many speakers clip the /k/ in “back.” Because the basic mouth shape is familiar but the lack of release is new, it feels somewhat different but not alien.","pattern":"ㄱ","position":"End","description":"At the very end of a Korean word, ㄱ is pronounced like a clipped, unreleased “k.” Tighten the back of your tongue against the soft palate as if saying the English “k,” but stop the airflow abruptly and do not let a burst of air escape. Think of cutting off the “k” in “back( )” before any puff comes out.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"tteok","native":"떡","position":"End","cultural_context":"Korean rice cake popular in K-food videos and K-dramas"}]}]
["ㅋ",{"thoughts":"At the end of a syllable ‘ㅋ’ stops the airflow just like the final k in English “back,” but with absolutely no puff of air—almost like you’re about to say k and then hold it in. English speakers know the basic k sound, so the only new thing is remembering not to release it.","pattern":"ㅋ","position":"End","description":"In syllable-final position ‘ㅋ’ is an unreleased voiceless k. Make the back of your tongue touch the soft palate (like a normal k), close off the air, and simply stop—no extra burst of air the way English sometimes lets a little escape.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ㅋㅋ","native":"ㅋㅋ","position":"End","cultural_context":"Seen everywhere online in K-pop or K-drama chats as Korean on-screen laughter"}]}]
["ㄲ",{"thoughts":"Very few loan-words end with the double “ㄲ”, so we have to rely on two culture-related Korean words most English speakers run into: the food name “tteokbokki” (spicy rice-cake dish, huge in K-food culture) and the single-syllable word “밖” (“outside”) that shows up constantly in K-drama subtitles. Both give the learner at least one real-life anchor for this otherwise rare final batchim.","pattern":"ㄲ","position":"End","description":"At the very end of a syllable or word, the double-consonant ㄲ is pronounced as a tense, unreleased [k̚] sound. There is no audible puff of air—close your vocal tract as for a hard “k,” tense the throat a little, then stop the sound sharply without letting it escape. It’s similar to the cut-off “k” you might make if you say “back!” but stop right before releasing the final /k/. In everyday Korean speech the final ㄲ sounds almost identical to final ㄱ, just a bit tenser.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"bak","native":"밖","position":"End","cultural_context":"Means “outside”; appears in subtitles of nearly every K-drama"},{"target":"tteokbokki","native":"떡볶이","position":"Middle","cultural_context":"Extremely popular Korean street food often mentioned on menus and food shows"}]}]
["ㄳ",{"thoughts":"English speakers rarely meet the batchim (final-consonant) cluster ㄳ, and when they do the sound hides inside a single unreleased K-like stop. The cluster never starts a syllable, so learners only have to worry about its word-final behaviour.","pattern":"ㄳ","position":"End","description":"At the end of a syllable, ㄳ is pronounced just like the final consonant ㄱ: an unreleased /k/ sound. Think of the very end of the English word “back,” but cut the little puff of air—stop the sound abruptly in the back of your throat. If the next syllable begins with a vowel, the ㅅ slides forward and is heard as an /s/ (e.g., 몫이 → [목시]).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"몫","native":"share, portion","position":"End","cultural_context":"Shows up in K-dramas or lyrics when talking about someone’s share of work or reward"},{"target":"넋","native":"soul, spirit","position":"End","cultural_context":"Heard in the common phrase ‘넋이 나가다’ (to be spaced out) that often appears in subtitle translations"},{"target":"삯","native":"wage, fare","position":"End","cultural_context":"Appears in historical dramas or songs referring to payment for labor"}]}]
["ㄵ",{"thoughts":"ㄵ is a final-consonant (batchim) cluster made of ㄴ+n and ㅈ+j. In word-final position Korean only keeps the ㄴ sound, so English speakers just need a plain \"n\". If the next syllable starts with a vowel, the hidden ㅈ re-appears (e.g., 앉아 → an-ja), but the core batchim sound itself is still an unreleased n.","pattern":"ㄵ","position":"End","description":"At the very end of a word or syllable, ㄵ is pronounced as a single clean [n]—the same alveolar nasal you hear at the end of English “plan.” Keep the tongue lightly touching the ridge behind your upper teeth and stop the airflow without adding any extra \"j\" or \"t\" sound. (If a following syllable begins with a vowel, the ㅈ moves forward: 앉아 becomes an-ja.)","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"anja","native":"앉아","position":"Middle","cultural_context":"Common command meaning “sit” you’ll often hear in K-dramas or pet-training videos"},{"target":"anjaseyo","native":"앉으세요","position":"Middle","cultural_context":"Polite form of “please sit” frequently used in variety shows and travel vlogs"}]}]
["ㄶ",{"thoughts":"ㄶ only shows up as a final consonant cluster.  In practice the ㄴ part wins: most of the time you just hear an English-style final n.  The ㅎ is silent unless it can ‘reach forward’ and aspirate the very next consonant (changing ㄷ to ㅌ, ㄱ to ㅋ, etc.).  If the next syllable starts with a vowel, the ㅎ simply disappears.  So an English speaker mainly needs a clean final n and, occasionally, a little extra puff of air on the following consonant.","pattern":"ㄶ","position":"End","description":"When ㄶ is the final consonant of a syllable it is almost always pronounced exactly like the English final “n” in “sun.”  If the next syllable begins with a plain stop (ㄱ, ㄷ, ㅈ), that stop becomes aspirated (ㅋ, ㅌ, ㅊ) because of the hidden ㅎ.  If the next syllable begins with a vowel, the ㅎ drops and you still just say an “n.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"gwaenchanha","native":"괜찮아","position":"Middle","cultural_context":"Common K-drama/K-pop line meaning “I’m okay”"},{"target":"mani","native":"많이","position":"Beginning","cultural_context":"Heard in phrases like “mani mani” (eat a lot, etc.) in Korean variety shows"},{"target":"manta","native":"많다","position":"Beginning","cultural_context":"Basic Korean adjective root taught early on, meaning “many/much”"}]}]
["ㄺ",{"thoughts":"ㄺ is a final consonant cluster that English speakers almost never meet.  They will hear it most in the food word family that contains 닭 (dak = chicken).  In isolation or before another consonant it surfaces simply as an unreleased “k”; before a following vowel it splits into an “l” + “g/k”.  The tongue has to finish the light “l” touch, then immediately swing back for a back-of-the-throat “k”, something English never does inside one syllable.","pattern":"ㄺ","position":"End","description":"When ㄺ sits at the bottom of a syllable it is usually pronounced just like a final, unreleased \"k\" (think the clipped stop at the end of the English word “sick,” but with no puff of air).  If the next syllable starts with a vowel, the two letters divide: the first syllable ends with a light ‘l’ sound and the next syllable begins with a soft ‘g/k’ (similar to saying “feel-good” very fast so the ‘g’ attaches to the second word).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"buldak","native":"불닭","position":"End","cultural_context":"Samyang “Fire Chicken” instant noodles that became a viral spicy-food challenge"},{"target":"dakgalbi","native":"닭갈비","position":"Middle","cultural_context":"Well-known Korean stir-fried spicy chicken dish found in K-bbq restaurants"}]}]
["ㄻ",{"thoughts":"English speakers won’t have met this final consonant cluster before. It behaves like a light L that quickly closes into an M, but when nothing follows it just sounds like a plain M. The tongue-to-lip switch is fast and can feel awkward.","pattern":"ㄻ","position":"End","description":"When ㄻ is the final consonant(s) of a syllable, it is usually pronounced simply as an M sound [m] (the L component disappears). If the next syllable starts with a vowel, the L resurfaces: the tongue taps the ridge (light English L) and then the lips close for M, giving [l.m] across the syllable break (e.g., “salm-i” → [sal.mi]). Think of saying the end of “calm” (silent L) for the plain [m], versus saying “Alma” very quickly for the [l.m] version.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"salm","native":"삶","position":"End","cultural_context":"Means “life”; appears in BTS’s song “Life Goes On” and in K-drama subtitles"},{"target":"dalm-da","native":"닮다","position":"Middle","cultural_context":"Verb “to resemble”; often shows up in subtitles like “You look like…”"},{"target":"om-gi-da","native":"옮기다","position":"Beginning","cultural_context":"Verb “to move/transfer”; common in software menus and tutorials"},{"target":"jeolm-eun","native":"젊은","position":"Beginning","cultural_context":"Means “young”; heard in K-pop lyrics such as “Forever Young.”}]}了��� ��� (I included the pattern field; ignore if your parser doesn't expect it) (Ending newline)�� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ��� ���…晥呻 (this is trailing noise from copy).\n"}]}]
["ㄼ",{"thoughts":"The ㄼ final consonant cluster is rare and behaves irregularly: at the very end of a word only the ㄹ is actually heard (a light, unreleased “l”), while the ㅂ is silent—unless a following syllable starts with a vowel, in which case the ㅂ carries over and sounds like a soft “b/p.” English speakers have no direct equivalent and usually try to pronounce both letters, so they need to learn to ‘drop’ the ㅂ or move it forward, depending on context.","pattern":"ㄼ","position":"End","description":"At the end of a word, pronounce ㄼ just as a quick, unreleased English “l” (tongue touches the roof just behind the teeth, no strong vocalization). Do NOT add a “b” sound. If the next syllable begins with a vowel, the hidden ㅂ resurfaces and begins that syllable (밟아 → 발바 = ‘bal-ba’). Think “l” plus optional ‘b’ that only appears when a vowel follows.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"밟다","native":"밟다 (balp-tta)","position":"End","cultural_context":"Shows up in K-dramas as “to step on” or “to tread”"},{"target":"넓다","native":"넓다 (neolp-tta)","position":"End","cultural_context":"Common Korean adjective meaning “wide,” appears in travel and real-estate phrases"},{"target":"짧다","native":"짧다 (jjalp-tta)","position":"End","cultural_context":"Means “short”; featured in the well-known K-pop song title \"짧은 치마\" (“Short Skirt”)"}]}]
["ㄽ",{"thoughts":"The cluster ㄽ only occurs in final (batchim) position and is quite rare, showing up in just a handful of native Korean words. In isolation or before a consonant it is pronounced exactly like the English dark-L in “ball.” If the next syllable begins with a vowel, the ㄹ still sounds like an L and the ㅅ moves over and becomes an initial S in the next syllable.","pattern":"ㄽ","position":"End","description":"Treat ㄽ at the end of a word as a single final L sound – the same tongue position you use for the L in “ball,” with the tip of your tongue touching the roof of the mouth just behind the teeth. If another syllable starting with a vowel follows, you will hear /l/ at the end of the first syllable and an /s/ starting the next ( …-l + s-… ).","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"외곬","native":"외곬 [외골]","position":"End","cultural_context":"Shows up in Korean language materials meaning “single-minded” – one of the few common words with this cluster"},{"target":"외곬이","native":"외곬이 [외골시]","position":"Middle","cultural_context":"Derived form of 외곬; illustrates how the hidden S resurfaces before a vowel"}]}]
["ㄾ",{"thoughts":"The double-final ㄾ (rieul + tieut) is rare, so most English speakers have never noticed it. When the syllable ends the word or is followed by a consonant, only the ㄹ part is voiced, so it sounds like a clean, unreleased English “l.” If the next syllable starts with a vowel, the ㅌ slides over, becoming an aspirated “t” (like the first T in “top”), while the ㄹ still closes the first syllable. Because the sound changes depending on what follows, it can be tricky for learners.","pattern":"ㄾ","position":"End","description":"At the very end of a word, pronounce it just like a dark English “l” with no extra burst of air. When the next syllable begins with a vowel, think “l” + a strong, puff-of-air “t”: [l] + [tʰ].","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"핥다 (halt-da)","native":"핥다","position":"Middle","cultural_context":"Shows up in K-dramas when someone talks about licking ice cream or their lips"},{"target":"훑어 (hul-tŏ)","native":"훑어","position":"Beginning","cultural_context":"Common verb form in K-pop lyrics meaning to sweep or glance over something"}]}]
["ㄿ",{"thoughts":"ㄿ is a very rare final consonant cluster (ㄹ+ㅍ). English speakers have little exposure to it and must learn two different realizations: as an unreleased final P and, before a following vowel, as an L-plus-aspirated-P sequence.","pattern":"ㄿ","position":"End","description":"At the end of a syllable or word, ㄿ is pronounced only as an unreleased \"p\" sound – close your lips as for a normal P but do not let any burst of air escape (similar to the abrupt stop some speakers make at the end of the English word “stop”). The hidden ㄹ is silent in this environment. When the next syllable begins with a vowel, the cluster splits: the ㄹ is heard as a light English-style “l,” while the ㅍ jumps forward and becomes an aspirated \"pʰ\", yielding something like “-lp(h)-.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"읊","native":"to recite a poem","position":"End","cultural_context":"Often shown in Korean textbooks as a classic tongue-twister syllable"},{"target":"읊어요","native":"(I) recite","position":"Middle","cultural_context":"Can appear in K-drama subtitles when someone talks about reading poetry aloud"}]}]
["ㅀ",{"thoughts":"‘ㅀ’ is really a two-letter final cluster (ㄹ + ㅎ).  In practice, English speakers only have to worry about making a clean, light L sound at the end of a syllable; the ㅎ is either silent or just makes the next consonant pop a bit harder.  The sound itself is familiar (L), but its place at the very end of a syllable without a following vowel can trip learners up.","pattern":"ㅀ","position":"End","description":"When ㅀ sits at the end of a syllable it is pronounced simply as an unreleased, light English “l” sound.  The ㅎ does not make its own sound there; instead it either disappears (e.g., 싫어 → [시러 / shi-reo]), or if the very next syllable starts with a plain stop (ㄱ, ㄷ, ㅈ, ㅅ, ㅌ) it makes that next consonant become strongly aspirated (싫다 → [실타 / sil-ta]).  So to an English ear it just sounds like an L, sometimes followed by a stronger-than-usual K/T/CH/S.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"싫어","native":"“I don’t like it / No”","position":"Middle","cultural_context":"A very common exclamation in K-dramas and K-pop lyrics; viewers often hear characters shout “shiro!”"},{"target":"싫다","native":"to dislike","position":"Middle","cultural_context":"Appears in subtitles of K-dramas and songs; basic dictionary form of the verb meaning “to hate/dislike.”"}]}]
["ㅄ",{"thoughts":"English speakers have no direct equivalent of a final Korean consonant cluster that changes its sound depending on what follows. In syllable-final position ㅄ is normally just an unreleased /p̚/ (like the very end of “cap” when you stop the air). When the next syllable starts with a vowel, the ㅅ half re-emerges and you get /ps/ → /p-s/ or, in casual speech, essentially /s/ linking to the vowel. The spelling never changes, only the pronunciation.","pattern":"ㅄ","position":"End","description":"When ㅄ is the final batchim of a syllable, it is usually pronounced as a very short, unreleased “p” sound [p̚]—similar to cutting off the air at the end of the English word “cup.” If the next syllable begins with a vowel, the ㅅ part is released and you’ll hear something like “p-s” or simply an “s” sliding into the vowel (e.g., 없어요 → /업써요/ eop-seo-yo). English has no exact counterpart, so think of it as a mute-stopped ‘p’ that may reveal an ‘s’ when a vowel follows.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"없어","native":"not have / there isn’t","position":"Middle","cultural_context":"Common phrase in K-dramas and K-pop lyrics, often heard as “eop-seo” meaning ‘there isn’t’"},{"target":"없다","native":"to not exist / not have","position":"Middle","cultural_context":"Very common verb in basic Korean courses and subtitles"},{"target":"값","native":"price / cost","position":"End","cultural_context":"Appears on Korean restaurant menus and in travel guides discussing prices"}]}]
["ㄷ",{"thoughts":"English speakers already know the basic tongue position for an alveolar T/D, but the Korean final ㄷ is always voiceless and usually released only minimally (if at all). The concept of an unreleased stop and the way it merges with following sounds is a little unfamiliar, so some extra coaching is helpful.","pattern":"ㄷ","position":"End","description":"When ㄷ is the final consonant of a syllable it is pronounced as an unreleased, voiceless t sound [t̚]. Put the tip of your tongue on the ridge just behind your upper teeth (like the start of English “t”), cut the airflow sharply, but do NOT let a burst of air or voice out. It’s the clipped stop you hear at the end of English “cat,” only a bit tenser and always voiceless.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"곧","native":"soon","position":"End","cultural_context":"Common subtitle word in K-dramas meaning “soon.”"},{"target":"믿","native":"believe (verb stem)","position":"End","cultural_context":"Appears in K-pop lyrics such as the phrase “믿어” (“believe”)."},{"target":"닫","native":"to close (verb stem)","position":"End","cultural_context":"Seen on Korean doors or buttons labeled “닫힘” (close)."}]}]
["ㅅ",{"thoughts":"The letter ㅅ is very familiar as an “s” sound at the start of a syllable, so English speakers are surprised when it occurs at the END of a Korean syllable: there, it changes to an unreleased t-like stop. It feels like you start to say a soft English “t” (tongue on the ridge behind the teeth) but stop the airflow before it escapes – no hissing, no voice, no vowel after it.","pattern":"ㅅ","position":"End","description":"When ㅅ is the final consonant (받침), it is NOT an “s.” It is pronounced as a voiceless, unreleased /t/. Close the tongue to the roof just behind the teeth as for an English “t,” hold it, then let the word end with no burst of air. If the next word begins with a vowel, the ㅅ usually resurfaces as an “s” sound at the start of the next syllable.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"맛","native":"taste / flavor","position":"End","cultural_context":"Heard in the phrase “맛있어요” (‘delicious’) in many K-dramas and food vlogs"},{"target":"옷","native":"clothes","position":"End","cultural_context":"Used in K-fashion shopping; appears on signs and websites that sell Korean clothes"},{"target":"꽃","native":"flower","position":"End","cultural_context":"Title of the 2023 K-pop hit “Flower” (꽃) by Jisoo and common word in subtitles"}]}]
["ㅆ",{"thoughts":"When ㅆ sits in final (batchim) position it does NOT sound like English “ss.”  Korean just closes the tongue as for an English t, then cuts the sound off with no burst of air – a clipped, unreleased [t̚].  If a following syllable starts with a vowel the ㅆ slides forward and is pronounced like a normal sharp “s,” but at true word-end it’s always the stop.  English speakers know the tongue place from words like “cat,” but the lack of release can feel odd.","pattern":"ㅆ","position":"End","description":"At the very end of a word ㅆ is an unreleased “t.”  Put the tongue behind the top front teeth as if to say the t in “cat,” but freeze it there – don’t let any air escape.  There is no hissing sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"됐!","native":"됐!","position":"End","cultural_context":"Exclamation in K-dramas meaning “That’s enough / Fine!”"},{"target":"있어요","native":"있어요","position":"Middle","cultural_context":"Common K-drama phrase for “there is / I have,” so fans often hear the clipped ㅆ before a vowel (pronounced like ‘s’ here)."},{"target":"갔어","native":"갔어","position":"Middle","cultural_context":"Past tense of “go” (‘He/She went’) frequently heard in dramas or lyrics."}]}]
["ㅈ",{"thoughts":"English speakers expect ㅈ to sound like the “j” in “jar,” but when ㅈ sits in final (batchim) position Korean neutralizes it to a plain, unreleased /t/. The tongue touches the same spot as an English /t/ but you stop the sound abruptly with no burst of air.","pattern":"ㅈ","position":"End","description":"When ㅈ is the very last consonant of a word (or syllable not followed by a vowel), it is pronounced as an unreleased “t” sound. Your tongue touches just behind the top front teeth like an English /t/, but you cut the airflow short—almost a silent ‘t’—with no puff or voice. If a vowel follows in the next word, it will resurface as a normal ‘j/ch’ sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"kkot","native":"꽃","position":"End","cultural_context":"Word for “flower”; heard in the hit K-drama title “Boys Over Flowers” and many K-pop lyrics"},{"target":"bit","native":"빛","position":"End","cultural_context":"Means “light”; shows up in K-pop song titles and lyrics, e.g., VIXX’s song “빛 (Light)”"}]}]
["ㅊ",{"thoughts":"Final consonant ㅊ is not loaned into English words, so most learners haven’t noticed it yet. Sound itself is basically an unreleased “t”, something English already has (the silent t-stop at the end of words like “cat”), but learners must remember NOT to release it or add a puff of air/ʧ sound.","pattern":"ㅊ","position":"End","description":"At the very end of a Korean word ㅊ is pronounced as a tight, unreleased [t̚]. Think of saying “cat” but cutting the air off before you let the tongue drop; there is no audible “ch” or “tʃ” burst. It’s the same final sound as 받침 ㅅ, ㅈ or ㄷ.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"kkot","native":"꽃","position":"End","cultural_context":"Shows up in K-drama title ‘꽃보다 남자’ (Boys Over Flowers)"},{"target":"cheot","native":"첫","position":"End","cultural_context":"Heard in the phrase ‘첫사랑’ (first love) common in K-pop lyrics"}]}]
["ㅌ",{"thoughts":"Final ㅌ is really just a clipped, unreleased “t.” English already has this sound at the end of words like “cat” when said quickly, so it feels familiar even though Korean holds it a bit shorter and with no audible puff of air.","pattern":"ㅌ","position":"End","description":"When ㅌ sits at the end of a syllable or word (받침), it is an unreleased ‘t’ sound: place the tongue for a regular /t/ but stop the airflow without letting a burst of air escape. It should be very short, almost like cutting the word off abruptly. Think of the way many English speakers finish the word “cat” in fast speech— tongue touches, but you barely hear a release.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"팥","native":"red bean","position":"End","cultural_context":"Seen in desserts like “pat-bingsu” at Korean cafes"},{"target":"팥빙수","native":"shaved-ice dessert with sweet red beans","position":"Middle","cultural_context":"K-dessert getting popular in Asian dessert shops"},{"target":"숯불","native":"charcoal fire","position":"Beginning","cultural_context":"Used on menus for Korean BBQ (sut-bul galbi)"}]}]
["ㅂ",{"thoughts":"Final ㅂ is basically the English /p/ sound but held and unreleased, so nothing audible bursts out. English speakers know the basic lip posture from words like “stop”, but they usually release the air, so keeping it fully closed may feel strange.","pattern":"ㅂ","position":"End","description":"When ㅂ is the final (batchim) consonant, the lips close as for an English “p”, but you do NOT let the air burst out. It ends abruptly with no puff—almost like you stopped halfway through saying “p”. If the next syllable starts with a vowel, the sound re-opens and it is pronounced like a light English “b”. Before nasal sounds it can soften to an \"m\".","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"밥","native":"rice (밥)","position":"End","cultural_context":"Korean word for cooked rice; heard in dishes like bibimbap"},{"target":"김밥","native":"gimbap (김밥)","position":"End","cultural_context":"Popular Korean seaweed rice rolls, often shown in K-food videos"},{"target":"케이팝","native":"K-pop (케이팝)","position":"End","cultural_context":"Global term for Korean pop music"}]}]
["ㅎ",{"thoughts":"English speakers expect the letter ㅎ to sound like an English “h.”  In syllable-final (batchim) position, however, Korean ㅎ is essentially silent; instead it turns into a light, unreleased “t-like” stop or simply weakens the following consonant.  That mismatch is what trips learners up, but the mouth movement (closing the vocal cords without letting air burst out) is similar to ending the English word “bat” with the tongue still touching the roof of the mouth.","pattern":"ㅎ","position":"End","description":"When ㅎ is the final consonant of the word, you do NOT exhale an audible “h.”  Instead, cut the airflow abruptly—like starting to say a /t/ but stopping before the release.  Think of holding the ‘t’ in the word “bat” if you say it quickly and don’t let the air out.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"좋","native":"good","position":"End","cultural_context":"Root of the very common K-pop phrase “좋아요” meaning “I like it / It’s good”"},{"target":"많","native":"many","position":"End","cultural_context":"Appears in textbook phrase “많이” (‘a lot’); heard in K-dramas about food portions"},{"target":"싫","native":"dislike / hate","position":"End","cultural_context":"Often seen in memes or subtitles as part of “싫어!” meaning “I don’t want (to)!”"}]}]
