["ㄱ",{"thoughts":"English already has both /g/ and /k/, so the core articulation of ㄱ feels familiar. What is new is when and how Korean voices or releases it: (1) word-initial it’s a soft, un-aspirated “k” (imagine the k in “ski”), (2) between vowels it sounds like a light English “g”, and (3) at the end of a syllable it locks into the back of the throat and never fully releases—an unreleased “k”. The variation happens automatically for Koreans but takes practice for English speakers.","pattern":"ㄱ","position":"Anywhere","description":"A back-of-the-mouth stop that shifts between a soft, un-aspirated k and a light g. Word-initial or after a pause it is voiceless like the k in “ski”; between vowels it is lightly voiced like the g in “ego”; at the end of a syllable it closes like a k but the air does not burst out (unreleased). Keep the tongue against the soft palate, don’t puff extra air.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"김치","native":"kimchi","position":"Beginning","cultural_context":"Signature Korean fermented cabbage dish popular worldwide"},{"target":"불고기","native":"bulgogi","position":"Middle","cultural_context":"Sweet–savory Korean BBQ beef found on many menus"},{"target":"강남","native":"Gangnam","position":"Beginning","cultural_context":"District made famous by the viral song “Gangnam Style”"},{"target":"박","native":"Park (surname)","position":"End","cultural_context":"Very common Korean family name seen in athletes and actors"}]}]
["ㄲ",{"thoughts":"English has no exact equivalent for Korean tense consonants like ㄲ, so learners usually confuse it with a regular /k/ or an aspirated /kʰ/. Useful examples have to come from Korean foods that many English speakers already know (e.g., tteokbokki).","pattern":"ㄲ","position":"Anywhere","description":"ㄲ is a tense (fortis) version of /k/. Start with an English hard “k” as in “skin,” but tense up your tongue root and vocal‐folds, producing the sound with almost no burst of air. It is voiceless and unaspirated—think of a very tight, held-back ‘k’ produced deep in the throat.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"떡볶이","native":"tteokbokki","position":"Middle","cultural_context":"Popular Korean street food of spicy rice cakes"},{"target":"깍두기","native":"kkakdugi","position":"Beginning","cultural_context":"Cubed radish kimchi often served with Korean BBQ"}]}]
["ㅋ",{"thoughts":"English speakers already know a /k/ sound, but Korean ㅋ is always strongly aspirated, never voiced, and it can become unreleased in syllable-final position. That difference from English’s voiced/voiceless pair makes it moderately challenging.","pattern":"ㅋ","position":"Anywhere","description":"Korean ㅋ (called “kieuk”) is a strongly aspirated K sound. Say the English word “kick” and feel the puff of air after the /k/—that burst is what Korean ㅋ always has at the start of a syllable. Between vowels it is still aspirated but a bit softer, and at the end of a syllable it becomes an unreleased k (tongue stops the airflow without a pop). It is never pronounced like the English hard G.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"케이팝","native":"K-pop","position":"Beginning","cultural_context":"Global Korean pop music genre"},{"target":"치킨","native":"chicken","position":"Middle","cultural_context":"Korean fried chicken, popular take-out food"},{"target":"코카콜라","native":"Coca-Cola","position":"Multiple","cultural_context":"Famous soda brand written in Hangul"}]}]
["ㄴ",{"thoughts":"Korean ㄴ is essentially the same alveolar nasal sound English speakers say at the start of “no” or the end of “sun.” It does not change quality between word-initial, medial, or final positions, so it is very straightforward for English speakers.","pattern":"ㄴ","position":"Anywhere","description":"ㄴ is pronounced like the English “n.” Place the tip of your tongue against the ridge just behind your upper front teeth and let the sound resonate through your nose. At the end of a syllable it is still the same clear [n]—unlike English, it never turns into the velar “ng” sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"나이키","native":"Nike","position":"Beginning","cultural_context":"Global sportswear brand name written in Hangul"},{"target":"소니","native":"Sony","position":"Middle","cultural_context":"Famous electronics company name written in Hangul"},{"target":"라면","native":"ramyeon (instant noodles)","position":"End","cultural_context":"Well-known Korean instant noodles often seen in K-dramas"},{"target":"냉면","native":"naengmyeon (cold noodles)","position":"Multiple","cultural_context":"Classic Korean cold noodle dish featured in food shows"}]}]
["ㄷ",{"thoughts":"English already has alveolar stops, so ㄷ will sound familiar, but the Korean rules about aspiration and final unreleased position are new. Learners must remember: no strong puff of air at the start, light voicing between vowels, and a completely closed-off ‘t’ sound at the end.","pattern":"ㄷ","position":"Anywhere","description":"Korean ㄷ is an unaspirated alveolar stop. 1) At the beginning of a word or after a pause it sounds like a tight English “t” with almost no burst of air (similar to the t in “stop”). 2) Between vowels it can sound closer to a soft English “d.” 3) At the very end of a syllable it becomes an unreleased “t”—your tongue touches the ridge behind your teeth but you don’t let the air out. Keep the tongue placement the same throughout to keep it consistent.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"디즈니","native":"Disney","position":"Beginning","cultural_context":"Global entertainment company name written in Korean"},{"target":"아디다스","native":"Adidas","position":"Middle","cultural_context":"International sportswear brand; Korean spelling shows ㄷ between vowels"},{"target":"태권도","native":"Taekwondo","position":"End","cultural_context":"Famous Korean martial art practiced worldwide"},{"target":"곧","native":"Soon","position":"End","cultural_context":"Common word meaning “soon,” often appears in K-drama subtitles"}]}]
["ㄸ",{"thoughts":"ㄸ is the tense/doubled version of Korean ㄷ.  English has no direct equivalent, so learners usually release too much air and produce something closer to a regular /t/.  Including well-known food terms like “떡” and “떡볶이” gives an accessible way to hear and practice the sound.","pattern":"ㄸ","position":"Anywhere","description":"ㄸ is a tense, unaspirated T sound.  Place the tongue as if you are going to say an English ‘t’, but press it harder against the ridge behind your upper teeth, build up a bit of internal mouth pressure, and release WITHOUT a burst of air.  It should feel stiff and solid, not soft like the English ‘d’, and not breathy like the English aspirated ‘t’ in “top.”  Think of it as a very crisp, squeezed ‘t’.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"떡","native":"떡","position":"Beginning","cultural_context":"Korean rice cake you see sold in Korean groceries or shown in K-dramas"},{"target":"떡볶이","native":"떡볶이","position":"Beginning","cultural_context":"Famous Korean street-food dish of spicy rice cakes"}]}]
["ㅌ",{"thoughts":"ㅌ is basically an aspirated English-style “t” when it starts a syllable, but it turns into a tight, unreleased stop at the end of a syllable and even changes to a “ch” sound before 이/여 etc. English already has aspirated t’s, yet the unreleased final version and the automatic palatalization can trip learners up.","pattern":"ㅌ","position":"Anywhere","description":"At the start of a syllable ㅌ is an aspirated [tʰ]—think of the strong puff of air in English “Top.”  In syllable-final (batchim) position it is a short, unreleased stop [t̚]; cut the airflow abruptly without letting the tongue drop, like the clipped t in the way some Americans say “cat̚.”  When ㅌ is followed by 이/여/etc. it palatalizes to a “ch” sound [tɕʰ], similar to the first consonant in “chew.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"태권도","native":"태권도","position":"Beginning","cultural_context":"World-famous Korean martial art \"taekwondo\""},{"target":"스타벅스","native":"스타벅스","position":"Middle","cultural_context":"Korean spelling of global coffee chain \"Starbucks\""},{"target":"맛","native":"맛","position":"End","cultural_context":"Means \"taste/flavor\"; seen in food posts and the term \"맛집\" (famous eatery)"},{"target":"같이","native":"같이","position":"Middle","cultural_context":"Common phrase meaning \"together,\" often heard in K-dramas and songs"}]}]
["ㄹ",{"thoughts":"English speakers know an R and an L, but Korean ㄹ switches between a light tapped R (like a very quick single-flap Spanish r) in the beginning / middle of a syllable and a clear L when it closes a syllable. The sound never becomes the long American /r/ or dark \"L\"; keeping it quick and light is the trick.","pattern":"ㄹ","position":"Anywhere","description":"ㄹ is pronounced two ways:\n• When it starts a syllable (ra, ro, ri…) or sits between vowels, tap the tip of your tongue once against the ridge behind your top teeth – a super-short Spanish single-r or the quick D-flap many Americans use in the middle of “buTTer.”\n• When it ends a syllable or word, hold the tongue there a bit longer so it sounds like a clear light L (never the velvety English \"dark L\").\nThink of it as one letter that flips between a fast R-flap and a light L depending on location.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"라면","native":"라면","position":"Beginning","cultural_context":"Korean instant noodles, often written as “ramyeon,” similar to Japanese ramen"},{"target":"불고기","native":"불고기","position":"Middle","cultural_context":"Well-known Korean barbecue dish served in many Korean restaurants abroad"},{"target":"한글","native":"한글","position":"End","cultural_context":"The Korean writing system itself; term appears in language‐learning apps and articles"}]}]
["ㅁ",{"thoughts":"Korean ㅁ is essentially the same bilabial nasal as English “m,” so it will feel very familiar to English speakers. It can occur at the start, middle, or end of a syllable; nothing special happens to the sound—it always stays an “m.” The only minor twist is that when ㅁ closes a syllable (batchim) you stop the sound abruptly with the lips still closed, but English does this too in words like “ham.” Overall, easy for learners.","pattern":"ㅁ","position":"Anywhere","description":"Pronounce ㅁ by closing both lips, voicing, and letting the sound resonate through the nose—just like the English \"m\" in “mom” or “time.” At the end of a syllable keep the lips closed a split-second longer to finish the consonant cleanly.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"마스크","native":"mask","position":"Beginning","cultural_context":"The word for “mask,” frequently mentioned worldwide during COVID-19"},{"target":"라면","native":"ramen","position":"Middle","cultural_context":"Korean instant noodles similar to Japanese ramen, popular snack"},{"target":"김치","native":"kimchi","position":"End","cultural_context":"Iconic spicy fermented cabbage side dish served in Korean cuisine"}]}]
["ㅂ",{"thoughts":"ㅂ is the basic Korean bilabial stop. English speakers hear it sometimes as a B, sometimes as an un-aspirated P, and in final position as a clipped, unreleased P. None of these variants are completely foreign, but learning when each occurs takes a little practice.","pattern":"ㅂ","position":"Anywhere","description":"At the start of a word or syllable, ㅂ is a voiceless, un-aspirated P—think of the P in the English word “spa,” softer than the strong puff of “pop.” Between vowels it tends to voice and sounds like an English B. When it ends a syllable (batchim position) it is held and released without a burst, like stopping a P mid-word (put your lips together and don’t let air out).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"부산","native":"부산","position":"Beginning","cultural_context":"Famous port city often heard in travel shows and K-dramas"},{"target":"김밥","native":"김밥","position":"End","cultural_context":"Popular Korean seaweed rice roll sold in many Korean restaurants abroad"},{"target":"비빔밥","native":"비빔밥","position":"Multiple","cultural_context":"Well-known mixed-rice dish on many Korean menus worldwide"}]}]
["ㅃ",{"thoughts":"ㅃ is a tense (fortis) bilabial stop. English has only the lax/voiced /b/ and the aspirated /p/; it never uses this squeezed, un-aspirated version, so learners won’t have a ready equivalent. They must keep the lips tightly closed, build small pressure, tense the vocal folds, then release with almost no puff of air. It’s shorter and crisper than English /p/ or /b/. Distinguishing it from regular ㅂ (softer) and ㅍ (strong, with a burst) is the main challenge.","pattern":"ㅃ","position":"Anywhere","description":"A very tense, un-aspirated ‘p/b’ sound. Make your lips as for a /p/, tighten the throat, hold the breath for a split second, then release sharply with virtually no air. It should not feel voiced like English /b/ and should not have the little puff you hear in /p/.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"빵","native":"bread","position":"Beginning","cultural_context":"Common word in Korean cafés; heard in travel and food videos"},{"target":"빨리","native":"quickly","position":"Beginning","cultural_context":"Often shouted in K-dramas and variety shows ('Hurry up!')"},{"target":"빼빼로","native":"Pepero (cookie stick snack)","position":"Multiple","cultural_context":"Popular snack similar to Pocky; Pepero Day ads appear every November 11"},{"target":"아빠","native":"dad","position":"Middle","cultural_context":"Basic family word heard in many K-dramas and songs"}]}]
["ㅍ",{"thoughts":"English already has an aspirated p at the start of words, so the initial sound of ㅍ feels natural. The only unfamiliar bit is the unreleased p̚ that happens when ㅍ sits as a final (batchim) consonant, but even that exists at the end of English words like “stop” when said quickly.","pattern":"ㅍ","position":"Anywhere","description":"ㅍ is an aspirated “p.” At the start of a syllable it sounds like the first P in English “pot,” with a noticeable puff of air. When it is the very last consonant of a syllable (batchim) the burst disappears, so it becomes a short, unreleased lip-closure—similar to the cutoff you feel at the end of English “stop” when you don’t let the air out.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"피자","native":"피자","position":"Beginning","cultural_context":"Korean spelling of “pizza,” the worldwide favorite food"},{"target":"카페","native":"카페","position":"Middle","cultural_context":"Korean word for “café,” seen on coffee-shop signs and travel apps"},{"target":"숲","native":"숲","position":"End","cultural_context":"Means “forest”; title of BTS show “In the SOOP,” known to K-pop fans"}]}]
["ㅅ",{"thoughts":"ㅅ is basically the Korean “s” sound, so it feels familiar to English speakers. The twist is that it softens to something like English “sh” before the vowels i / ㅣ or y-type vowels (ㅑ, ㅕ, etc.), and when ㅅ is the final consonant of a syllable (batchim) it is held briefly and released like a very light, unreleased “t.” None of these variants are far from sounds English already has, but switching between them and remembering the silent ‘t’ at the end can trip learners up.","pattern":"ㅅ","position":"Anywhere","description":"At the start of a syllable ㅅ is pronounced like the clear English “s” in “see.” Before the vowel ㅣ (and similar y-type vowels) it becomes a softer, slightly hissing “sh” sound, somewhere between English “she” and “see.” When ㅅ closes a syllable (batchim) it is not voiced; instead the tongue stays in the same place but the sound stops abruptly, like the cut-off “t” at the end of “cat” when said quickly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"서울","native":"Seoul","position":"Beginning","cultural_context":"Capital city of South Korea, often mentioned in travel and world news"},{"target":"신라면","native":"Shin Ramyun","position":"Beginning","cultural_context":"Best-selling Korean instant noodle brand found in many grocery stores"},{"target":"삼성","native":"Samsung","position":"Middle","cultural_context":"Global electronics giant (phones, TVs, etc.)"},{"target":"맛","native":"mat (taste/flavor)","position":"End","cultural_context":"Part of the phrase “맛있어요” (“It’s delicious”) often heard in K-dramas and Korean restaurants"}]}]
["ㅆ",{"thoughts":"English speakers already know the hissy “s” sound, but the Korean double-consonant ㅆ is produced with extra tongue and throat tension and, in syllable-final position, it actually sounds like a short, unreleased “t.” The tense onset is new, but the place of articulation is familiar.","pattern":"ㅆ","position":"Anywhere","description":"At the start of a syllable, ㅆ is a tense, unaspirated ‘s.’ Imagine saying the ‘s’ in “hiss” while clenching your tongue and throat muscles—sharper, crisper, and slightly shorter. When ㅆ occurs as the final consonant of a syllable (받침), it is pronounced like a quick, unreleased ‘t’ sound, not like ‘s.’","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"싸이","native":"Psy (싸이)","position":"Beginning","cultural_context":"K-pop singer world-famous for “Gangnam Style”"},{"target":"보쌈","native":"bossam (보쌈)","position":"Middle","cultural_context":"Popular Korean boiled-pork dish on many BBQ menus"},{"target":"쌈장","native":"ssamjang (쌈장)","position":"Beginning","cultural_context":"Common Korean BBQ dipping sauce sold in Asian grocery stores"},{"target":"있어요","native":"isseoyo (있어요)","position":"End","cultural_context":"Beginner phrase meaning “there is / I have” taught in many Korean-learning videos"}]}]
["ㅇ",{"thoughts":"ㅇ is the only Hangul letter whose pronunciation changes depending on position: silent (or a light glottal onset) at the start of a syllable, but an \"ng\" sound at the end. English already has the final -ng, so learners only have to remember that the symbol is mute up front.","pattern":"ㅇ","position":"Anywhere","description":"At the BEGINNING of a syllable ㅇ is silent; the vowel that follows is what you hear, possibly with a very light throat catch (glottal stop) similar to the break between the two syllables of “uh-oh.” At the END of a syllable it sounds exactly like the -ng in English “sing.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"아이돌","native":"idol (K-pop star)","position":"Multiple","cultural_context":"Word often used in English to refer to K-pop singers"},{"target":"서울","native":"Seoul","position":"Middle","cultural_context":"Capital city of South Korea, frequently mentioned in news and travel"},{"target":"불고기","native":"bulgogi","position":"Middle","cultural_context":"Popular Korean marinated beef dish found on many international menus"},{"target":"삼성","native":"Samsung","position":"End","cultural_context":"Global electronics brand known for smartphones and TVs"}]}]
["ㅈ",{"thoughts":"Need to explain that ㅈ is usually an un-aspirated affricate like a light English “j”, can become more “ch-” like after certain consonants and turns into an unreleased “t” sound at syllable-final (batchim). Supply place/middle/end examples that English speakers are likely to know: Jeju, soju, and 낮 (nat – ‘day’ – appears in many K-pop titles such as “Day and Night”).","pattern":"ㅈ","position":"Anywhere","description":"At the start of a syllable ㅈ sounds like a light, slightly breathy English “j” in “juice,” but with the tongue a bit further forward (touching the ridge right behind your top teeth). It is less voiced than the English J, sitting halfway between “j” and “ch.” After an aspirate (like ㅎ) it can be pronounced more like a clear “ch.” When ㅈ is the final consonant of a syllable it is not released; it becomes a short, crisp stop similar to the very end of the English word “cat.” Don’t add a vowel after it—just stop the air abruptly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"제주","native":"Jeju","position":"Multiple","cultural_context":"Well-known Korean resort island that appears in travel shows and headlines"},{"target":"소주","native":"soju","position":"Middle","cultural_context":"Popular Korean liquor now sold in many bars and liquor stores"},{"target":"낮","native":"nat (day)","position":"End","cultural_context":"The word for “day”; the phrase “낮과 밤 (Day and Night)” shows up in several K-pop song titles"}]}]
["ㅉ",{"thoughts":"Korean ㅉ is a tense, unaspirated “jj/ch” affricate that has no direct equivalent in English, so learners usually substitute the softer English “j” from “judge.” The key is to make the sound voiceless, keep the tongue on the alveolar ridge, and add strong muscular tension with no burst of air. Because English has no truly matching sound, most learners struggle to hear and produce the extra tension.","pattern":"ㅉ","position":"Anywhere","description":"Pronounce ㅉ like saying English “j” (as in “jump”) but clamp your teeth together, tense your tongue, and release with no puff of air. It sits between the normal Korean ㅈ (soft “j”) and the aspirated ㅊ (“ch” with a strong burst). There is no exact English counterpart; think of a very tight, sharp, voiceless “jj.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"짜장면","native":"black-bean noodles","position":"Beginning","cultural_context":"Well-known Korean-Chinese noodle dish often shown in K-dramas"},{"target":"김치찌개","native":"kimchi stew","position":"Middle","cultural_context":"Staple Korean stew; many English speakers know it as “kimchi jjigae”"},{"target":"찜닭","native":"braised chicken","position":"Beginning","cultural_context":"Popular dish called “jjimdak” on Korean restaurant menus"}]}]
["ㅊ",{"thoughts":"English speakers already know a similar “ch” sound, but Korean ㅊ is a bit stronger (more air) and turns into an unreleased “t” at the very end of a syllable. Provide familiar food-related words plus one drama-related word to show final ㅊ.","pattern":"ㅊ","position":"Anywhere","description":"Pronounced like the “ch” in English “chip,” but with a noticeable puff of air (aspiration). Between vowels or at the start of a word it sounds like an aspirated ‘ch’ [t͡ɕʰ]. When ㅊ is the final consonant of a syllable, it loses the burst and is realized as a tight, unreleased ‘t’ sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"치킨","native":"chikin","position":"Beginning","cultural_context":"Korean fried chicken, often featured in K-dramas and restaurants"},{"target":"김치","native":"kimchi","position":"End","cultural_context":"Staple Korean fermented cabbage known worldwide"},{"target":"고추장","native":"gochujang","position":"Middle","cultural_context":"Famous Korean chili paste used in bibimbap and BBQ sauces"},{"target":"꽃","native":"kkot","position":"End","cultural_context":"Word for “flower,” seen in the drama title “Boys Over Flowers”"}]}]
["ㅎ",{"thoughts":"English speakers already know an /h/ sound, so the Korean ㅎ hardly feels foreign at the start of a word. What surprises learners is how weak or even inaudible it can become inside a word and how, at the end of a syllable, it often disappears but still “adds breath” to the following sound. Giving one example for each slot (start, middle, end) should illustrate that.","pattern":"ㅎ","position":"Anywhere","description":"Usually a plain, breathy “h” like the first sound of English “hat.”\n• Beginning of a word/syllable: a clear [h].\n• Between vowels: still [h] but lighter; Korean speakers may let it fade almost away.\n• At the end of a syllable: the puff of air is lost; you may only hear a slight tightening of the throat or it turns the next stop into a strongly-aspirated sound (e.g., 좋다 is pronounced roughly “jot-ta”).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"한글","native":"Hangul (Korean alphabet)","position":"Beginning","cultural_context":"Name of the Korean writing system, often mentioned in language articles and apps"},{"target":"안녕하세요","native":"Hello","position":"Middle","cultural_context":"Most common Korean greeting you hear in K-dramas and K-pop interviews"},{"target":"좋다","native":"to be good","position":"End","cultural_context":"Common word in song titles and subtitles; fans see it rendered as \"jota\""}]}]
["ㅏ",{"thoughts":"ㅏ is one of the easiest Korean vowels for English speakers because it is almost identical to the first vowel in “father.” It is a single, steady sound with no off-glide, so once learners know to keep their mouth open and relaxed they can usually get it right.","pattern":"ㅏ","position":"Anywhere","description":"Pronounce ㅏ as an open, front (slightly central) unrounded vowel—very close to the \"a\" in English “father” or “spa.” Keep the tongue low and the lips relaxed; do NOT close into an \"uh\" or \"ae\" sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"라면","native":"라면","position":"Beginning","cultural_context":"Korean instant noodles often called \"ramen\" or \"ramyeon\""},{"target":"강남","native":"강남","position":"Multiple","cultural_context":"Seoul district from the hit song “Gangnam Style”"},{"target":"카카오","native":"카카오","position":"Multiple","cultural_context":"Tech company behind the KakaoTalk messaging app"},{"target":"한글","native":"한글","position":"Beginning","cultural_context":"The Korean writing system you might read about when learning languages"}]}]
["ㅐ",{"thoughts":"English already has a similar relaxed “e” sound (as in “bed”), but ㅐ sits slightly closer to the “a” in “cat.” The lips stay relaxed and the jaw is a touch more open than for the pure English short-e. It can appear anywhere in a word.","pattern":"ㅐ","position":"Anywhere","description":"Pronounce ㅐ like a blend of the English vowels in “cat” and “bed” – an open, front vowel [ɛ]. Don’t round the lips; keep them neutral and let the jaw drop a bit more than for English short-e. It sounds almost identical to the Korean vowel ㅔ nowadays.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"태권도","native":"태권도","position":"Beginning","cultural_context":"World-famous Korean martial art seen in the Olympics"},{"target":"현대","native":"현대","position":"End","cultural_context":"Hyundai – major Korean automobile brand"},{"target":"블랙핑크","native":"블랙핑크","position":"Middle","cultural_context":"Global K-Pop group BLACKPINK"}]}]
["ㅑ",{"thoughts":"ㅑ is basically the Korean vowel sound “ya,” identical to the first half of the English interjection “ya!” or the start of “yacht.” Because English already has the glide-plus-open-vowel [ja] sequence, most learners recognise and can produce it without much trouble.","pattern":"ㅑ","position":"Anywhere","description":"Pronounced like the English “ya” in “yacht” but a little shorter and cleaner. Start with a quick /y/ glide and open immediately into the ‘ah’ of “father” (/a/). Keep it one smooth syllable: [ja].","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"야쿠르트","native":"Yakult (probiotic drink)","position":"Beginning","cultural_context":"Popular fermented milk drink sold worldwide"},{"target":"삼양라면","native":"Samyang ramen","position":"Middle","cultural_context":"Instant noodle brand famous for the viral spicy \"fire noodles\" challenge"},{"target":"야구","native":"baseball","position":"Beginning","cultural_context":"Word often heard in K-dramas/KBO clips; means the sport baseball"}]}]
["ㅒ",{"thoughts":"ㅒ is a relatively uncommon Korean vowel that sounds like a quick blend of the English “y” in “yes” plus the short “e” in “bed.” English speakers don’t meet it often because few well-known loan-words use it.","pattern":"ㅒ","position":"Anywhere","description":"Start with the tongue high and forward as if saying the English “y,” then immediately glide into a short “eh” (as in “bed”). The result is one tight syllable that sounds like a clipped version of the word “yeah,” but kept short and without the final schwa some English speakers add.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"얘기","native":"story, talk","position":"Beginning","cultural_context":"Common phrase in K-dramas; characters often say “얘기해” (“tell me”)."},{"target":"섀도우","native":"shadow (usually eye shadow)","position":"Beginning","cultural_context":"Loan-word seen on K-beauty products labelled “아이섀도우” (eye shadow)."}]}]
["ㅓ",{"thoughts":"English speakers do not have a single exact match for ㅓ, but they have a close ‘uh’ sound in “sun.” The lip rounding and tongue placement are a bit different, so it usually takes a little practice but is not extremely hard.","pattern":"ㅓ","position":"Anywhere","description":"ㅓ is a mid-back, slightly rounded vowel. Think of the “uh” in English “sun,” but round your lips a little more and keep the tongue a bit farther back. It is NOT the ‘aw’ in “saw” and it is NOT the ‘o’ in “so.” Aim for a quick, relaxed, rounded “uh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"서울","native":"Seoul","position":"Beginning","cultural_context":"Capital city of South Korea, often mentioned in news and travel."},{"target":"떡볶이","native":"tteokbokki","position":"Beginning","cultural_context":"Popular Korean street-food dish featured on food shows and menus worldwide."},{"target":"설날","native":"Seollal","position":"Beginning","cultural_context":"Korean Lunar New Year, referenced in culture articles and K-dramas."},{"target":"버스","native":"beoseu (bus)","position":"Beginning","cultural_context":"The word for “bus” you will see on Korean signs and tickets."}]}]
["ㅔ",{"thoughts":"English already has a very similar short “eh” sound (as in “met”), so most learners recognise it instantly. The only challenge is not confusing it with the Korean vowel ㅐ, which is a slightly more open version. Because ㅔ shows up in every word position, the guide labels its general position as “Anywhere.”","pattern":"ㅔ","position":"Anywhere","description":"ㅔ is pronounced like the short “e” in English “met,” “bed,” or “get.” Keep the tongue toward the front-middle of the mouth, jaw slightly open, and lips relaxed—not rounded. It is a bit tighter (less open) than the English long “ay” in “say,” and slightly closer than the Korean vowel ㅐ.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"펩시","native":"Pepsi","position":"Beginning","cultural_context":"Global cola brand"},{"target":"포켓몬","native":"Pokémon","position":"Middle","cultural_context":"Worldwide video-game and cartoon series"},{"target":"카페","native":"café / coffee shop","position":"End","cultural_context":"Borrowed word you’ll see on coffee shop signs"}]}]
["ㅕ",{"thoughts":"ㅕ is a front-vowel sound followed by a brief y-glide. It is closest to the English “yuh” in “young,” but the Korean version is shorter and crisper, without the schwa-like drawl English speakers often add. You start with your tongue high and forward (as if saying English “ee”), then immediately open toward a short “uh.” The lips stay relaxed, not rounded.","pattern":"ㅕ","position":"Anywhere","description":"Pronounce it as a very short “yuh”: begin with a light English “y” and quickly open to the neutral vowel in “sun,” but keep the whole syllable brisk and one beat long.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"현대","native":"Hyundai (car brand)","position":"Beginning","cultural_context":"Global automobile brand seen in dealerships and commercials"},{"target":"평양","native":"Pyongyang (capital of North Korea)","position":"Beginning","cultural_context":"City name often heard in international news"},{"target":"삼겹살","native":"samgyeopsal (grilled pork belly)","position":"Middle","cultural_context":"Popular Korean BBQ dish found in many Korean restaurants outside Korea"},{"target":"서울역","native":"Seoul Station","position":"End","cultural_context":"Main rail station of Seoul; appears in travel guides and on transit maps"}]}]
["ㅖ",{"thoughts":"ㅖ is basically the vowel sound “yeh.” English already has a very similar glide-plus-vowel in words like “yes,” so the sound itself is familiar, but English speakers must remember to keep it short (one crisp syllable) and not turn it into a diphthong like “yay.” The bigger challenge is hearing the difference between ㅖ (ye) and ㅔ (eh).","pattern":"ㅖ","position":"Anywhere","description":"Pronounce it as one quick syllable that begins with a light “y” and immediately opens into the short “eh” in “bed”: “yeh.” Do not stretch it into “yay.” Compare ㅔ (“eh”)—adding the initial y-glide makes ㅖ.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"예","native":"예 (polite “yes”)","position":"Beginning","cultural_context":"Heard constantly in K-dramas when characters say “yes/okay.”"},{"target":"혜리","native":"혜리 (Hyeri)","position":"Beginning","cultural_context":"K-pop idol and actress from the hit series “Reply 1988.”"},{"target":"삼계탕","native":"삼계탕 (samgyetang)","position":"Middle","cultural_context":"Famous Korean ginseng chicken soup often featured on food shows."}]}]
["ㅗ",{"thoughts":"English already has an /oʊ/ sound, so learners recognise something similar. Main issue: Korean ㅗ is a pure [o] – no glide. They must keep lips rounded and avoid turning it into a diphthong.","pattern":"ㅗ","position":"Anywhere","description":"A rounded, mid-back pure vowel [o]. Think of the first part of the English word “go,” but stop before your tongue glides toward a “w” sound. Keep the lips rounded the whole time, and don’t let the vowel change quality.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"소주","native":"soju","position":"Beginning","cultural_context":"Popular Korean spirit ordered at Korean BBQ"},{"target":"포켓몬","native":"Pokémon","position":"Beginning","cultural_context":"Worldwide video-game and anime franchise"},{"target":"롯데","native":"Lotte","position":"Beginning","cultural_context":"Famous Korean conglomerate known for snacks and Lotte World"}]}]
["ㅘ",{"thoughts":"ㅘ is just the Korean way of writing the English-like \"wa\" sound, so most English speakers already meet it in words like “wa” in “water.” Because it is written as one Hangul vowel, learners only need to remember to glide quickly from rounded lips (ㅗ) to open mouth (ㅏ).","pattern":"ㅘ","position":"Anywhere","description":"Pronounce it like the “wa” in “wander.” Start with lips rounded as if saying a short “o,” then immediately open them to an “ah.” The glide is fast—one syllable, not two separate vowels.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"화이팅","native":"화이팅","position":"Beginning","cultural_context":"Korean cheer you often hear in K-dramas; means “You can do it!”"},{"target":"와이파이","native":"와이파이","position":"Beginning","cultural_context":"The borrowed word for Wi-Fi in Korean signs and menus"},{"target":"트와이스","native":"트와이스","position":"Middle","cultural_context":"Name of the famous K-pop girl group TWICE"},{"target":"괌","native":"괌","position":"End","cultural_context":"The island of Guam, a U.S. territory often mentioned in travel and news"}]}]
["ㅙ",{"thoughts":"ㅙ is one of Korean’s three “wa-family” vowels (ㅘ = wa, ㅙ = wae, ㅚ = we). English has no exact match, but the closest is the beginning of “wedding” said with a slightly wider, more open mouth (somewhere between “we” and “wah”). Learners often slide to a pure “we” (ㅞ) or “weh” (ㅚ); keep the jaw a bit more open so it doesn’t close off into an ee-sound.","pattern":"ㅙ","position":"Anywhere","description":"Pronounce it like an English w + short “e” (as in “red”): “wɛ.” Start with lips rounded for /w/, then quickly open into the short e vowel. It should NOT sound like “way” (ㅚ) or “wah” (ㅘ).","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"괜찮아","native":"It’s okay / I’m fine","position":"Beginning","cultural_context":"Very common phrase in K-dramas and K-pop lyrics meaning “I’m okay”"},{"target":"돼지","native":"pig / pork","position":"Beginning","cultural_context":"Seen on Korean BBQ menus (e.g., “dwaeji bulgogi”) that many food lovers encounter"},{"target":"왜","native":"why?","position":"Beginning","cultural_context":"Simple interjection often heard in K-dramas; fans recognize characters saying “Wae?” when asking “Why?”"}]}]
["ㅚ",{"thoughts":"ㅚ is now almost always realized as the rounded diphthong [we]. English speakers already know the sequence /we/ (as in “wedding”) but are not used to rounding the lips so tightly or spelling it with an “oe.” The sound can sit anywhere in a Korean word, though the examples English speakers bump into most often have it in the first syllable (e.g., the surname Choi, 최).","pattern":"ㅚ","position":"Anywhere","description":"Pronounce it like the English “we” in “wet,” but start with your lips more pursed—as if you were beginning to say the French “eu” in “bleu”—and then glide quickly into the Korean “에 (e)” sound. It is usually romanized as “oe,” “e,” or sometimes “oi” (as in the surname Choi), but you should hear and say it as one quick syllable [we].","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"최","native":"Choi (common Korean surname)","position":"Beginning","cultural_context":"Seen in many K-pop and K-drama celebrity names (e.g., Choi Siwon, Choi Woo-shik)"},{"target":"회","native":"Raw fish dish (hoe)","position":"Beginning","cultural_context":"Korean sashimi served at seafood restaurants and featured on food shows"},{"target":"외국인","native":"Foreigner","position":"Beginning","cultural_context":"Word often heard in K-dramas or variety shows referring to non-Koreans"}]}]
["ㅛ",{"thoughts":"The Hangul vowel ㅛ is essentially the English “yo” sound as in “yoga.”  Because English already has this exact glide-plus-vowel, most learners find it familiar and easy.  The main caution is to keep it short and pure: start with a brief /y/ glide and go straight into the Korean closed-mouth “oh,” without turning it into a diphthong like English “yoh-uh.”","pattern":"ㅛ","position":"Anywhere","description":"Pronounced /yo/ – start with a light English “y” glide, immediately followed by the short Korean “o” as in “go,” but without any trailing “w” or “uh.” It’s the same sound English speakers make when saying “yo!”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"요가","native":"yoga","position":"Beginning","cultural_context":"The exercise practice “yoga” is well known worldwide"},{"target":"교촌치킨","native":"Kyochon Chicken","position":"Middle","cultural_context":"Popular Korean fried-chicken chain often mentioned in K-food shows"},{"target":"도쿄","native":"Tokyo","position":"End","cultural_context":"Capital of Japan; Korean spelling is frequently seen in K-pop lyrics and travel content"}]}]
["ㅜ",{"thoughts":"ㅜ is the pure high-back rounded vowel /u/. English has almost the same sound in “food,” so most learners have heard it; the main adjustment is to avoid turning it into a diphthong (no glide).","pattern":"ㅜ","position":"Anywhere","description":"Pronounce ㅜ like the “oo” in English “food.” Keep your lips rounded and steady; do not let the sound slide toward a “w” or “y.” It is a single, pure vowel, slightly shorter than a long English “oo.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"부산","native":"Busan","position":"Beginning","cultural_context":"Well-known South Korean port city and film-festival host"},{"target":"불고기","native":"bulgogi","position":"Beginning","cultural_context":"Famous Korean marinated beef BBQ dish"},{"target":"순두부","native":"soondubu","position":"Multiple","cultural_context":"Soft-tofu stew commonly listed in Korean restaurants"},{"target":"소주","native":"soju","position":"End","cultural_context":"Popular clear Korean liquor often shown in K-dramas"}]}]
["ㅝ",{"thoughts":"ㅝ is the Korean \"w + uh\" sound. Most English speakers have heard something close to it in the first syllable of the English word “wonder.” The main difference is that Korean keeps the lips more rounded throughout and keeps the vowel very short and crisp.","pattern":"ㅝ","position":"Anywhere","description":"Pronounce it as one quick syllable that begins with a rounded English “w” glide and immediately lands on the Korean “ㅓ” (similar to the “uh” in “sun”). It should sound like a very short, clipped “wuh.” Do not stretch it into the longer English \"woah\" or \"wah.\"","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"원","native":"원","position":"Beginning","cultural_context":"The Korean currency unit “won,” often mentioned alongside dollars or yen"},{"target":"월마트","native":"월마트","position":"Beginning","cultural_context":"Korean spelling of the big-box retailer Walmart"},{"target":"원더우먼","native":"원더우먼","position":"Beginning","cultural_context":"Korean title of the comic-book hero and movie “Wonder Woman”"},{"target":"남산타워","native":"남산타워","position":"End","cultural_context":"N Seoul Tower, a famous tourist landmark often called “Namsan Tower”"}]}]
["ㅞ",{"thoughts":"ㅞ is a blended vowel that already sounds a lot like the beginning of the English word “wedding” (we-) but Koreans keep it as a single syllable nucleus. English speakers usually understand the glide /w/ + “eh” but may forget to round the lips at the very start.","pattern":"ㅞ","position":"Anywhere","description":"Pronounce ㅞ as a quick, single syllable that starts with rounded lips like the “oo” in “food,” then immediately opens to the “e” in “bed.” The result is /we/ said in one smooth motion, without inserting a separate w-consonant sound before it.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"웨딩","native":"wedding","position":"Beginning","cultural_context":"Direct loan-word for the marriage ceremony"},{"target":"스웨터","native":"sweater","position":"Middle","cultural_context":"Korean for the same cold-weather clothing item"},{"target":"웨이팅","native":"waiting / wait-list","position":"Beginning","cultural_context":"K-Pop fans hear this word for standing in line or being on a queue"}]}]
["ㅟ",{"thoughts":"ㅟ is simply the Korean vowel glide that sounds like the English “we” in “week,” so most English speakers have already made this mouth-shape. The only trick is to start with rounded lips (as if saying “oo”) and keep them lightly rounded as you glide toward “ee.”","pattern":"ㅟ","position":"Anywhere","description":"Pronounced [wi] – very close to the English word “we.” Begin with tight, rounded lips (like the vowel in “woo”) and then glide quickly toward the high front vowel “ee” without opening the lips too much.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"위키","native":"wiki","position":"Beginning","cultural_context":"The shortened name for Wikipedia, the well-known online encyclopedia"},{"target":"트위터","native":"Twitter","position":"Middle","cultural_context":"Major social media platform many people use"},{"target":"위스키","native":"whisky","position":"Beginning","cultural_context":"Famous distilled alcoholic drink"},{"target":"스위트","native":"suite/sweet","position":"Middle","cultural_context":"Borrowed word used for hotel “suite” or the English idea of “sweet”"}]}]
["ㅠ",{"thoughts":"English speakers already know the basic glide-plus-vowel (/ju/) combination from words like “you” or “music,” so the sound itself is familiar. The main thing to remember is to keep the vowel short and pure after the initial y-glide, not diphthongized the way many English accents do.","pattern":"ㅠ","position":"Anywhere","description":"The Hangul vowel ㅠ is pronounced /ju/ – a quick y-glide into the tight, rounded “oo” of “food.” Imagine saying the word “you,” but make the vowel shorter and keep your lips rounded throughout. After most consonants it sounds like the “yu” in “cute,” “new,” or “few.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"유튜브","native":"YouTube","position":"Multiple","cultural_context":"Korean spelling of the video platform YouTube – word gamers and K-pop fans see it often"},{"target":"컴퓨터","native":"computer","position":"Middle","cultural_context":"Konglish term for a computer, written on electronics packaging and store signs"},{"target":"뉴욕","native":"New York","position":"Beginning","cultural_context":"Korean spelling of New York – appears in travel content and news"},{"target":"뷰티","native":"beauty","position":"Beginning","cultural_context":"K-beauty industry term seen in cosmetics ads and YouTube channels"}]}]
["ㅡ",{"thoughts":"English has no exact equivalent of the Korean vowel ㅡ, so learners usually substitute something like the “oo” in “good” or the neutral schwa, which still sounds quite different. It shows up anywhere in a word, including syllables that end with a consonant (스, 글, etc.).","pattern":"ㅡ","position":"Anywhere","description":"A close-mid, back-of-the-mouth, UN-rounded vowel [ɯ]. Lips stay relaxed (not rounded like the “oo” in “boot”) while the tongue is raised high and pulled slightly back. A quick way to find it: start saying the vowel in “uh” (schwa) and, without moving the jaw, pull the tongue back and tense it a bit—while keeping the lips flat.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"승리","native":"Seungri (name meaning “victory”)","position":"Beginning","cultural_context":"Former BIGBANG K-pop star often covered in English-language media"},{"target":"한글","native":"Hangul (Korean alphabet)","position":"Middle","cultural_context":"Word you see whenever you read about the Korean writing system"},{"target":"버스","native":"beoseu (loan-word for “bus”)","position":"End","cultural_context":"Printed on Korean city buses; same object as the English word “bus”"},{"target":"드라마","native":"deurama (loan-word for “drama”)","position":"Beginning","cultural_context":"Appears in the phrase “K-drama” for Korean TV series"}]}]
["ㅢ",{"thoughts":"English has no sound that matches ㅢ exactly; most learners find the tongue-rooted ㅡ part strange and often either over-round it (like “oo”) or skip it entirely. Learners also get confused because Koreans pronounce it three different ways depending on position – so the same spelling can sound like “ui,” “ee,” or even “eh.”","pattern":"ㅢ","position":"Anywhere","description":"A glide that starts with the Korean ㅡ ([ɯ] – say the vowel in “book” but with lips spread) and quickly moves to ㅣ ([i] as in “machine”).\n• At the start of a word or after ㅇ: usually pronounced “ui” ([ɰi]).\n• After any other consonant: the ㅡ part drops, so it sounds like plain “ee.”\n• As the possessive particle 의: many Koreans shorten it further to the “eh” sound in “get.”\nTip: keep your lips unrounded for the first part and don’t separate the two vowels – it’s a very quick glide.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"의사","native":"doctor","position":"Beginning","cultural_context":"Common word heard in medical K-dramas and variety shows"},{"target":"희망","native":"hope","position":"Beginning","cultural_context":"Appears in K-pop lyrics and drama titles meaning “hope”"},{"target":"회의","native":"meeting / conference","position":"End","cultural_context":"Business-scene staple word in K-dramas; often shown on office schedules"},{"target":"의정부","native":"Uijeongbu (city)","position":"Beginning","cultural_context":"City north of Seoul mentioned in the classic TV show M*A*S*H"}]}]
["ㅣ",{"thoughts":"Korean ㅣ is essentially the same high-front vowel as the English long “ee” in “see,” so most English speakers already have the sound; they mainly just need to keep it pure (don’t relax it toward the short “i” in “sit”).","pattern":"ㅣ","position":"Anywhere","description":"Pronounce it like the vowel in English “see.” Tongue is high and forward, lips relaxed (not rounded). Avoid the shorter, laxer vowel in “sit.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"피자","native":"pizza","position":"Beginning","cultural_context":"Korean spelling of the globally familiar food \"pizza\""},{"target":"김치","native":"kimchi","position":"Multiple","cultural_context":"Signature Korean fermented cabbage side dish known worldwide"},{"target":"택시","native":"taxi","position":"End","cultural_context":"Same word as English \"taxi,\" used for cab services in Korea"}]}]
["ㅇ",{"thoughts":"At the start of a Korean syllable, ㅇ isn’t a sound at all—it’s just a silent placeholder that lets the following vowel stand on its own. English has silent letters too (think of the silent “k” in “knight”), so the idea isn’t foreign, and nothing new has to happen in the mouth: you simply begin straight on the vowel.","pattern":"ㅇ","position":"Beginning","description":"When ㅇ appears at the very beginning of a syllable or word, it is completely silent. You do not close the throat or add any extra consonant; just launch directly into the vowel that follows.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"아이돌","native":"아이돌","position":"Beginning","cultural_context":"K-pop term for a pop music star, borrowed from English 'idol'"},{"target":"어벤져스","native":"어벤져스","position":"Beginning","cultural_context":"Korean title for Marvel’s movie series 'Avengers'"},{"target":"오징어 게임","native":"오징어 게임","position":"Beginning","cultural_context":"Netflix hit show 'Squid Game'"},{"target":"올림픽","native":"올림픽","position":"Beginning","cultural_context":"Korean word for the international 'Olympic' Games"}]}]
["ㅇ",{"thoughts":"Word-final ㅇ is always the single nasal sound [ŋ] – the same consonant English writes with “ng” in “sing.”  It never sounds like a hard g/k.  Just let the back of your tongue touch the soft palate and let air hum through your nose; do not release a following vowel.","pattern":"ㅇ","position":"End","description":"At the very end of a Korean word, ㅇ is pronounced as the velar nasal [ŋ] – the “ng” of English “sing.”  Keep the tongue in place; there is no extra g sound afterward.  If another syllable follows (inside a longer word), you still keep the same nasal sound before moving on.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"삼성","native":"Samsung","position":"End","cultural_context":"Global electronics brand"},{"target":"강남스타일","native":"Gangnam Style","position":"Multiple","cultural_context":"2012 viral K-pop song title"},{"target":"김정은","native":"Kim Jong-un","position":"Multiple","cultural_context":"Name of North Korea’s leader often in the news"}]}]
["ㄹ",{"thoughts":"Initial ㄹ is uncommon in standard Korean, but it shows up in many loan-words and brand names that English speakers may have heard. It is produced as a quick single flap of the tongue (IPA ɾ), somewhere between the American English quick ‘d’ in “water” (fast speech) and the Spanish single ‘r’. It is neither the English ‘r’ (which is retroflex) nor the clear English ‘l’. Because English lacks this exact sound at word-initial position, learners often substitute an R or L, but a very brief tongue tap against the alveolar ridge gets closest.","pattern":"ㄹ","position":"Beginning","description":"At the very start of a word, ㄹ is pronounced as a light, single tongue flap (ɾ). Imagine touching the tip of your tongue quickly to the ridge just behind your upper teeth, like the middle sound in the fast-spoken American “butter,” but even shorter. Do not round your lips like the English ‘r’, and do not hold the tongue like an English ‘l’; it’s just a quick tap.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"라면","native":"라면","position":"Beginning","cultural_context":"Instant noodle soup (K-ramen) bought worldwide"},{"target":"레몬","native":"레몬","position":"Beginning","cultural_context":"Korean word for the fruit ‘lemon’, used in drinks and desserts"},{"target":"롯데","native":"롯데","position":"Beginning","cultural_context":"Lotte—major Korean confectionery & entertainment company seen on stadiums and candy"}]}]
["ㄹ",{"thoughts":"English speakers already use a ‘dark L’ at the end of words like “ball.” Korean final ㄹ is very similar but shorter—there’s no little vowel “trail-off.” The tongue touches just behind the upper teeth, air leaks around the sides, and the sound stops abruptly. The main trap is thinking it’s an English R; it never is.","pattern":"ㄹ","position":"End","description":"When ㄹ is the final consonant (받침), pronounce it like the back-of-the-mouth, ‘dark’ L in English “ball,” but cut it off quickly with no extra vowel. Tongue tip touches the alveolar ridge; lips stay neutral. It is never an R sound in this position.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"서울","native":"Seoul","position":"End","cultural_context":"Capital city of South Korea, well known from news, K-pop, and travel"},{"target":"불고기","native":"bulgogi","position":"Middle","cultural_context":"Famous Korean BBQ dish found on many restaurant menus"},{"target":"한글","native":"Hangul","position":"End","cultural_context":"Name of the Korean alphabet, often mentioned in language-learning apps"}]}]
["ㄱ",{"thoughts":"English speakers know a released /k/ at the end of words like “back.” Korean final ㄱ is the same place of articulation but the air is stopped—no audible burst. So the mouth shape is familiar, but the lack of release plus very short vowel can feel odd.","pattern":"ㄱ","position":"End","description":"At the end of a word, ㄱ is a voiceless, unreleased stop: the back of your tongue touches the soft palate like the English /k/, but you cut the airflow abruptly and do not let a puff of air escape. It’s shorter and quieter than the English final k in “back.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"정국","native":"정국","position":"End","cultural_context":"Member of world-famous K-pop group BTS"},{"target":"불닭","native":"불닭","position":"End","cultural_context":"Name of the popular Samyang “Buldak” spicy ramen and sauce"},{"target":"떡","native":"떡","position":"End","cultural_context":"Korean rice cake often seen in dishes like tteokbokki"}]}]
["ㄲ",{"thoughts":"Final ㄲ is rare in word-final position and is pronounced exactly like the unreleased final ㄱ ([k̚]). English speakers already make an unreleased K at the end of words like “back” or “cook,” so the sound itself is easy once you know not to release it. The bigger issue is simply noticing that the doubled letter in spelling does NOT change the sound at the end of a word.","pattern":"ㄲ","position":"End","description":"At the END of a word, ㄲ is pronounced as a voiceless, unreleased K-stop – the same way you would end the English word “back” if you stop your tongue and don’t let any air burst out. Hold the back of your tongue against the soft palate, cut the sound off sharply, and do not add a puff of air.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"밖","native":"outside","position":"End","cultural_context":"Seen in K-drama subtitles and song lyrics in phrases like “밖에” (outside)"}]}]
["ㅋ",{"thoughts":"Final ㅋ in Korean is rare but exists (e.g., 부엌). It is pronounced as an unreleased, voiceless stop – essentially the same clipped ‘k’ you might hear if you say the English word “back” but stop the airflow before letting the final puff of air out. English speakers occasionally make an unreleased /k/ in casual speech, so the sound is not totally foreign, but remembering to keep it completely voiceless and without aspiration can take practice.","pattern":"ㅋ","position":"End","description":"When ㅋ shows up as the final consonant (받침), it loses its strong burst. It is articulated at the back of the mouth like an English /k/, but the tongue stays in place and you do not release any extra air. Think of freezing the last sound in “back!” right before the little pop would come out.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"부엌","native":"kitchen","position":"End","cultural_context":"Shows up in subtitles or recipes on Korean cooking videos and dramas"},{"target":"ㅋㅋㅋ","native":"(online laugh, similar to “LOL”)","position":"Multiple","cultural_context":"Common string of Korean text laughter you see in K-pop comments and social media"}]}]
["ㄷ",{"thoughts":"ㄷ at the end of a Korean syllable is pronounced as an unreleased, voiceless “t.” English has a similar sound at the end of words like “bat” when said quickly, but speakers often add a small burst of air or voice it slightly—something Korean does not do. The tongue lightly touches the same spot as an English /t/, but you cut the sound off sharply with no aspiration.","pattern":"ㄷ","position":"End","description":"When ㄷ is the final consonant (받침), it is an unreleased alveolar stop [t̚]. Place your tongue where you would for an English /t/, stop the airflow, and do not release—no puff of air, no voicing. It is shorter and tenser than the usual English final “t.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"곧","native":"soon","position":"End","cultural_context":"Common subtitle word in K-dramas meaning “soon”"},{"target":"믿","native":"trust / believe","position":"End","cultural_context":"Root of verb 믿다; fans use the slang “믿듣” for artists they trust will release good music"},{"target":"걷","native":"walk","position":"End","cultural_context":"Root of 걷다 (to walk); shows up in lyrics and exercise-related phrases"}]}]
["ㅅ",{"thoughts":"English speakers expect a final written “s”-looking letter to sound like /s/, but Korean final ㅅ is really an unreleased /t/. That mismatch is the main hurdle; otherwise the tongue position is familiar.","pattern":"ㅅ","position":"End","description":"At the very end of a word ㅅ is pronounced as a tight, unreleased “t” stop (like the cut-off t in the very end of “cat” when you don’t let any air out). The tongue touches where you would for English t/d, then you simply stop the sound—no hissing /s/. If the following word begins with a vowel, the ㅅ links over and is then pronounced like a normal Korean /s/, similar to English s but a bit lighter.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"맛","native":"flavor / taste","position":"End","cultural_context":"Appears in the K-pop hit title “맛 (Hot Sauce)” and in the common word “맛있다” (delicious)"},{"target":"옷","native":"clothes","position":"End","cultural_context":"Heard in K-dramas when characters talk about buying or wearing clothes"}]}]
["ㅆ",{"thoughts":"Final ㅆ (batchim) is pronounced very differently from the double-s you see in the middle of a word. English speakers expect an audible “s” at the end, but Korean actually shuts the sound off like an unreleased “t.” When a following syllable starts with a vowel, however, the ㅆ carries over and you do hear a tense “ss.” So learners need to master both the silent-release version and the carried-over version.","pattern":"ㅆ","position":"End","description":"When ㅆ is the final consonant of a syllable or word, the tongue briefly touches the same place as an English “t,” but you stop the air completely—no hiss, no full release, just a clipped ending (similar to the cut-off t in American English “cat,” said quickly). If the next syllable begins with a vowel, the ㅆ moves forward and is pronounced as a strong, tense “ss,” like prolonging the “s” in “hiss” while tightening the tongue slightly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"있다","native":"to exist / to have","position":"Middle","cultural_context":"Basic verb you meet in any beginner Korean lesson or K-drama subtitles"},{"target":"있어","native":"there is / I have (spoken form)","position":"Middle","cultural_context":"Common everyday phrase often heard in K-dramas when characters say they ‘have’ something"},{"target":"있지","native":"ITZY (K-pop group name)","position":"Middle","cultural_context":"Name of globally popular K-pop girl group ‘ITZY’"}]}]
["ㅈ",{"thoughts":"Word-final ㅈ is a batchim consonant. Instead of the familiar English ‘j’ sound, Korean closes the syllable with a tight, unreleased [t] stop. English speakers already make an unreleased /t/ at the end of ‘cat’ when said casually, so the physical action is familiar even though the spelling looks different.","pattern":"ㅈ","position":"End","description":"At the end of a word ㅈ is pronounced as an unreleased /t/: place the tongue against the ridge just behind the upper teeth, stop the airflow, and do not release a burst. It should feel like the final consonant in English “cat” or “sit” spoken quickly—no voiced ‘j’ and no audible puff. If another syllable beginning with a vowel follows, the sound can resurface as a light ‘j’ link, but in absolute final position it stays a stopped /t/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"낮","native":"daytime","position":"End","cultural_context":"Basic word you’ll meet early in Korean textbooks and songs (‘낮과 밤’ – day and night)"},{"target":"빚","native":"debt","position":"End","cultural_context":"Often heard in K-dramas when characters talk about owing money"}]}]
["ㅊ",{"thoughts":"Final ㅊ is not the “ch” of “church.” In Korean batchim (syllable-final) position it is reduced to an unreleased t-stop [t̚]. English has a similar cut-off t at the end of words like “cat˺,” so the sound itself is familiar, but learners often expect to keep the puff of air or the full “ch.” Main challenge is to stop the tongue at the roof of the mouth and not release.","pattern":"ㅊ","position":"End","description":"When ㅊ is the final consonant of a syllable or word, it is pronounced as a short, unreleased t-sound [t̚]—tongue touches the alveolar ridge, then stops without a burst. It is never the aspirated “ch” you hear at the start of English “cheese” unless the next syllable begins with a vowel, in which case it surfaces as an initial ㅊ.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"꽃","native":"flower","position":"End","cultural_context":"Word from hit K-drama title “꽃보다 남자 (Boys Over Flowers)” and common in K-pop lyrics"},{"target":"빛","native":"light; shine","position":"End","cultural_context":"K-pop song titles such as HIGHLIGHT’s “빛 (Light)” make this word recognizable"},{"target":"햇빛","native":"sunlight","position":"End","cultural_context":"Appears in weather apps and travel guides describing sunny days in Korea"}]}]
["ㅌ",{"thoughts":"Final ㅌ is written but in Korean it collapses to the unreleased stop [t̚]; that’s familiar enough because English has a similar “stopped t” (as in the way many Americans say the last sound of “cat”), yet many learners try to let extra air out or add a small vowel after it. Need to warn them it should be completely shut with no release.","pattern":"ㅌ","position":"End","description":"When ㅌ is the very last consonant (batchim), it is pronounced as a stiff, unreleased “t”—your tongue touches the same spot as an English /t/ (just behind the upper front teeth) but you do NOT let any air burst out. It’s shorter and tenser than the English final /t/ in “cat”; think of cutting the sound off suddenly.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"끝","native":"end","position":"End","cultural_context":"Appears on screen or in comics to mark “The End” – often written just as 끝"},{"target":"못","native":"cannot; nail","position":"End","cultural_context":"Common word in K-dramas when characters say they ‘can’t’ do something (‘못 해’)"}]}]
["ㅎ",{"thoughts":"English rarely has a clearly audible final “h.” In Korean, when ㅎ sits in the batchim (final-consonant) slot, it is usually realized as a very light breath that may even disappear, but it can also make the next consonant sound more strongly aspirated. So learners have to remember that the spelling shows a hidden puff of air, not a full, separate syllable.","pattern":"ㅎ","position":"End","description":"When ㅎ is the final consonant of a syllable or word, don’t try to pronounce a full English “h.” Instead, end the vowel abruptly with a soft outward breath (as if you were about to say “h” but stop). If another consonant follows, that consonant often becomes strongly aspirated (e.g., 좋다 sounds more like [조타]).","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"좋아","native":"I like it / good","position":"Middle","cultural_context":"Common line in K-pop and dramas; people often shout “좋아!”"},{"target":"좋다","native":"to be good","position":"Middle","cultural_context":"Base dictionary form you see in language-learning apps when looking up “good”"},{"target":"싫어","native":"I don’t like it / no","position":"Middle","cultural_context":"Frequently heard in dramas when someone refuses something"}]}]
["ㅂ",{"thoughts":"When ㅂ is the final consonant of a syllable (batchim), it loses voicing and is pronounced as a tight, unreleased “p.” The lips close as for an English p-sound, but there is almost no burst of air and no vocal-cord vibration. If another consonant follows immediately, the lips still close but the release merges into the next sound. English speakers know the lip-closure gesture, but the lack of release can feel odd.","pattern":"ㅂ","position":"End","description":"At the end of a syllable ㅂ is an unvoiced, unreleased p-sound—similar to the very light p you feel (but barely hear) at the end of English words like “stop” when you say them casually. Close your lips, hold the air, and move on without letting the puff of air escape.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"김밥","native":"kimbap","position":"End","cultural_context":"Popular Korean seaweed-rice roll often shown in K-dramas and Korean restaurants"},{"target":"비빔밥","native":"bibimbap","position":"End","cultural_context":"Famous mixed-rice bowl served in many Korean eateries worldwide"},{"target":"케이팝","native":"K-pop","position":"End","cultural_context":"Global term for Korean pop music frequently mentioned in media"}]}]
["ㅍ",{"thoughts":"Word-final ㅍ is written with the same consonant you see at the start of 파, but in final (batchim) position it loses its puff of air. Phonetically it becomes an unreleased, voiceless stop [p̚], very much like cutting the air off at the end of the English word “cap” without letting any extra breath escape. English speakers already know the basic /p/ sound, but the lack of release can feel abrupt and requires a conscious stop.","pattern":"ㅍ","position":"End","description":"At the end of a Korean syllable or word, ㅍ is pronounced as a tight, unreleased “p” sound. Start to say an English ‘p’ but freeze your lips shut before any air bursts out – no puff, no aspiration.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"앞","native":"front","position":"End","cultural_context":"Appears in common K-pop fan chant phrase 앞으로 (forward) and basic Korean lessons"},{"target":"숲","native":"forest","position":"End","cultural_context":"Title word in the globally streamed K-drama “Secret Forest” (비밀의 숲)"},{"target":"옆","native":"side","position":"End","cultural_context":"Shows up in beginner phrases like 옆집 (next-door neighbor) seen in language apps"}]}]
["ㅁ",{"thoughts":"English already has the same bilabial nasal [m] at the ends of words (e.g., “mom”). When ㅁ sits in the final consonant slot of a Korean syllable, you simply close both lips and let air resonate through your nose—no extra vowel sound afterward.","pattern":"ㅁ","position":"End","description":"At the end of a Korean word, ㅁ is pronounced like the final “m” in English words such as “calm” or “ram.” Close both lips and let the sound go through the nose; do not add a trailing vowel. It is fully voiced but very short.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"김","native":"Kim (common surname / roasted seaweed)","position":"End","cultural_context":"Most famous Korean family name; also seen on menus as roasted seaweed “gim”"},{"target":"팀","native":"team (loan-word)","position":"End","cultural_context":"Same meaning as English “team,” used in K-pop groups and sports"},{"target":"쌈","native":"ssam (lettuce wrap)","position":"End","cultural_context":"Popular term on Korean BBQ menus for wrapping meat in lettuce or perilla leaves"}]}]
["ㄴ",{"thoughts":"Final ㄴ is simply an unreleased /n/. English speakers already have this sound; the only new point is that Korean keeps the tongue lightly in place without a burst of air.","pattern":"ㄴ","position":"End","description":"At the end of a word, ㄴ is pronounced like the English n in “sun,” made with the tongue against the ridge just behind the upper teeth. Hold the tongue there and let the sound stop quietly—no extra puff or vowel after it.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"라면","native":"ramyeon (instant noodles)","position":"End","cultural_context":"Korean ramen-style instant noodles sold worldwide"},{"target":"손","native":"Son (a common surname)","position":"End","cultural_context":"Surname of soccer star Son Heung-min, seen in sports news"},{"target":"한","native":"Han (as in Han River)","position":"End","cultural_context":"Name of the major river through Seoul, mentioned in travel and culture media"}]}]
["ㄳ",{"thoughts":"The final-consonant cluster ㄳ is rare and only shows up at the very end of a syllable. By default Koreans pronounce only the first letter (ㄱ) as an unreleased “k” sound, like the k at the end of the English word “back,” but without letting any air out.  When the next syllable starts with ㅇ (a silent initial), the hidden ㅅ ‘wakes up’ and moves forward, so the cluster is heard as an s sound (e.g., 값이 → 가시).  This stop-then-sometimes-change behaviour makes it feel unusual to English ears.","pattern":"ㄳ","position":"End","description":"Usually pronounced as a tight, unreleased k [k̚] at the very end of a syllable.  If the following syllable starts with ㅇ and a vowel, the k resyllabifies and only the s remains, giving a clear ‘s’ sound.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"값","native":"price, cost","position":"End","cultural_context":"Common word for “price” you might see in K-drama subtitles or phrasebooks when shopping"},{"target":"값이","native":"(the) price + subject particle","position":"End","cultural_context":"Shows the alternate ‘s’ pronunciation; heard when characters say things like “the price is…” in Korean TV shows"}]}]
["ㄵ",{"thoughts":"The cluster ㄵ is a final-consonant (batchim) spelling that really just sounds like an English “n” unless the next syllable starts with a vowel, in which case the hidden ㅈ re-emerges and you hear an added “j/ch” glide (e.g. an-ja). So the sound itself is easy, but the spelling-to-sound rule is unfamiliar.","pattern":"ㄵ","position":"End","description":"When ㄵ is the last consonant(s) of a syllable, only the ㄴ part is actually pronounced at the end of a word or before another consonant — it sounds just like the English n in “pin.” If the very next syllable begins with a vowel, the ㅈ slides over so you get an n-j combination, roughly “nj,” like saying “an-ja.” Think of it as: normally /n/, but before a vowel it becomes /nj/ or a quick /nch/ depending on accent.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"앉다","native":"to sit","position":"Middle","cultural_context":"Basic Korean verb you often hear in K-dramas when someone is asked to sit"},{"target":"앉아","native":"sit (command/informal)","position":"Middle","cultural_context":"Common phrase taught in beginner Korean and heard in variety shows (‘An-ja!’)"},{"target":"앉아요","native":"(you) sit / is sitting","position":"Middle","cultural_context":"Polite everyday form you’ll hear in K-pop interviews and dramas"}]}]
["ㄶ",{"thoughts":"ㄶ is rare and only occurs as a final (batchim) consonant cluster. It sounds exactly like a plain n, but the silent ㅎ can make the next consonant become aspirated (t→tʰ, j→ch, g→k, etc.). Learners therefore need to know that they will usually just say n, but watch out for the ‘extra puff of air’ on the next syllable.","pattern":"ㄶ","position":"End","description":"Pronounce it as the English n at the end of “bean.” The written ㅎ is not voiced; it only turns the next consonant into an aspirated sound (않다 → [안타]). If nothing follows, it is simply [n].","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"괜찮아","native":"괜찮아","position":"Middle","cultural_context":"Very common K-drama/K-pop phrase meaning “It’s okay.”"},{"target":"괜찮아요","native":"괜찮아요","position":"Middle","cultural_context":"Polite version of “It’s okay,” heard constantly in Korean media."},{"target":"많다","native":"많다","position":"Middle","cultural_context":"Basic vocabulary meaning “to be many,” appears in beginner textbooks and lyrics (“사랑이 많다”)."}]}]
["ㄺ",{"thoughts":"The batchim cluster ㄺ at word-final position is almost always realized as an unreleased /k/ sound. English speakers know a similar cut-off K in the way they might stop the K in “back” when said abruptly. Only a few everyday Korean words end with this cluster, but one of them – 닭 (dak, “chicken”) – is widely encountered thanks to the global popularity of Korean fried chicken dishes.","pattern":"ㄺ","position":"End","description":"When ㄺ appears at the very end of a word, the tongue is in the back like for an English “k,” but you don’t let any air burst out. It’s a short, clipped stop: imagine starting the K in “back” but freezing before the puff of air is released. (In other positions, ㄺ can surface as an ‘l,’ but at absolute word-end it is always this unreleased K.)","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"닭","native":"chicken","position":"End","cultural_context":"Seen in dish names like \"Korean fried chicken\" (dak) or \"dakgalbi\" that are popular abroad"}]}]
["ㄻ",{"thoughts":"ㄻ is a rare ‘double-final’ (받침) cluster: ㄹ + ㅁ.  English speakers already know the sounds [l] and [m], but not the rule that determines which one (or both) is actually heard.  At the very end of a word or phrase only the ㅁ part is pronounced ([m]).  When the next syllable starts with a vowel, the cluster splits: the ㄹ is kept as a dark, coda-style L and the ㅁ reappears at the start of the following syllable ([l.m]).  So learners must remember “word-final = m, followed by vowel = lm.”","pattern":"ㄻ","position":"End","description":"Think of an English word ending in “m,” but let the very tip of your tongue lightly touch the ridge behind your upper teeth first (as if starting an English dark L) and then close the lips for M.  If nothing follows, you actually drop the L and only pronounce the M: [m].  If a vowel follows, you say a quick dark L at the end of the first syllable then move straight into an M onset on the next syllable: [l.m].","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"삶","native":"life","position":"End","cultural_context":"Shows up in subtitles of K-dramas and lyrics (“life and death” = 삶과 죽음)."},{"target":"삶은","native":"boiled (as in ‘boiled egg’)","position":"Middle","cultural_context":"Common phrase in Korean recipes or menus: 삶은 달걀 = boiled egg; here ㄻ is followed by a vowel so it sounds like [sal-mɯn]."}]}]
["ㄼ",{"thoughts":"“ㄼ” only shows up as a final-consonant (받침) cluster, so learners meet it at the very end of a syllable.  In most everyday words it is pronounced like a clear English “l” (as in ‘ball’), because only the ㄹ half is actually released.  In a few fixed spellings it can surface as an unreleased /p/ before another consonant, but those are exceptions.","pattern":"ㄼ","position":"End","description":"At the end of a syllable, ㄼ is almost always pronounced just like the plain final ㄹ: the tongue touches the roof behind the teeth, letting the sound end quickly (no vocal-fold vibration after release).  Think of the ‘l’ sound at the end of “ball,” but shorter and with no extra vowel.  Rarely, before certain consonants you may hear a tight, unreleased ‘p’ sound instead.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"짧다","native":"짧다","position":"Middle","cultural_context":"Common adjective meaning “to be short,” often heard in beginner Korean phrases"},{"target":"넓다","native":"넓다","position":"Middle","cultural_context":"Means “to be wide”; shows up in basic Korean lessons and subtitles"},{"target":"밟다","native":"밟다","position":"Middle","cultural_context":"Verb “to step on”; appears in lyrics or dialogue as an imperative like ‘밟아’ (“step on it”)"}]}]
["ㄽ",{"thoughts":"\"ㄽ\" is one of Korean’s rare final-consonant (받침) clusters. Most English speakers have never seen it because it occurs in only a handful of native Korean words. The cluster behaves like two sounds squeezed into one slot: ㄹ is kept, ㅅ usually disappears unless a following vowel lets it resurface.","pattern":"ㄽ","position":"End","description":"When ㄽ sits at the end of a syllable, only the ㄹ is pronounced – a short, unreleased “l” similar to the final l in “ball,” but with the tongue touching higher against the roof of the mouth. The ㅅ is silent. If the next syllable begins with a vowel (e.g., when a grammatical ending is attached), ㄹ still ends the first syllable and the ㅅ moves over to start the next syllable, giving a normal Korean s/ɕ sound (like the “sh” in “she” before i/ya, or a plain “s” before other vowels).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"외곬","native":"single track; one-way / single-minded","position":"End","cultural_context":"May pop up in K-drama subtitles or news comments about someone being single-minded"},{"target":"외곬이","native":"being single-minded (with suffix –이)","position":"End","cultural_context":"Occasionally heard in Korean media; shows the hidden ㅅ surfacing before the vowel 이"}]}]
["ㄾ",{"thoughts":"ㄾ is a rare final-consonant (batchim) cluster made of ㄹ+l and ㅌ+tʰ.  In pause or before another consonant you only hear the ㄹ, so English speakers just need a dark, final L.  If a vowel follows, the hidden ㅌ reappears as a strong, aspirated T at the start of the next syllable (like the first T in “top”).  The sound itself is easy, but the rule about when the T is audible can trip learners up.  Native-level English vocabulary offers almost no famous words with ㄾ, so the examples are everyday Korean verbs you might bump into in subtitles or lyrics.","pattern":"ㄾ","position":"End","description":"At the very end of a word (or before another consonant) ㄾ is pronounced simply as a final, dark L—tongue touches the ridge behind your upper teeth, vocal cords vibrate, lips relaxed (similar to the “l” in English “ball”).  When the next syllable starts with a vowel, the ㄹ stays as that same dark L and the ㅌ hops over, becoming an aspirated T, like the English “t” in “top.”","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"훑다","native":"to sweep / skim","position":"Beginning","cultural_context":"Shows up in K-drama subtitles when someone ‘scans’ or ‘rakes’ through something"},{"target":"훑어","native":"(I) skim / sweep (colloquial)","position":"Beginning","cultural_context":"Common verb form in song lyrics meaning ‘look over quickly’—illustrates the T moving to the next syllable"},{"target":"핥다","native":"to lick","position":"Beginning","cultural_context":"You may see it in cooking shows when someone ‘licks’ a spoon"}]}]
["ㄿ",{"thoughts":"“ㄿ” only shows up as a final consonant cluster (batchim). By default it collapses into a very short, unreleased “p” sound. If the next syllable starts with a vowel, the first consonant (“ㄹ”) stays as a light English-style \"l\" at the end of the syllable, while the second consonant (“ㅍ”) moves forward and is pronounced like a plain \"b/p\" in the next syllable (e.g., 밟아 → 발바). English has no exact parallel to this split behavior, but the unreleased final “p” is similar to the way many Americans say the last sound in “stop” without a puff of air.","pattern":"ㄿ","position":"End","description":"At the very end of a syllable it sounds like a clipped, unreleased “p” (no burst of air). When followed by a vowel in the next syllable, it splits: the previous syllable ends with an “l” and the next syllable begins with a light “b/p.” Keep the tongue touching the roof (for the “l”) and stop the airflow sharply for the “p” before releasing into the next vowel.","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"밟다","native":"to step on","position":"Middle","cultural_context":"Common verb you may see in K-pop subtitles meaning “to step on” or “trample”"},{"target":"읊다","native":"to recite (a poem)","position":"Middle","cultural_context":"Shows up in literature-themed scenes in dramas and song lyrics"},{"target":"밟아","native":"step on (imperative/continuative form)","position":"Middle","cultural_context":"Heard in fast-paced lyrics or dialogue, meaning “step on it / step on”"}]}]
["ㅀ",{"thoughts":"ㅀ is a rare final-consonant cluster made of ㄹ (l/r) + ㅎ (h). English speakers normally only encounter it in a few high-frequency verbs such as 싫어 (‘I don’t like it’) and 잃다 (‘to lose’). Because ㅎ is usually silent or only changes the next consonant’s sound, learners mainly need to pronounce a firm final L sound and watch for the extra aspiration rule.","pattern":"ㅀ","position":"End","description":"When ㅀ sits at the end of a syllable it is pronounced mostly like a tight, unreleased final L in English “ball”. The ㅎ is silent, unless the next syllable starts with an aspiratable consonant (ㄱ, ㄷ, ㅈ, ㅅ, ㅂ). In that case the following consonant becomes aspirated (e.g. 싫다 → [실타]). If the next syllable begins with a vowel, the ㄹ carries over and you simply say an initial r/l sound, with no audible h (싫어 → [시러]).","familiarity":"ProbablyDoesNotKnow","difficulty":"Hard","example_words":[{"target":"싫어","native":"I don’t like it / hate it","position":"Beginning","cultural_context":"Very common exclamation in K-dramas and K-pop lyrics"},{"target":"싫다","native":"to dislike; to hate","position":"Beginning","cultural_context":"Dictionary form seen in subtitles and language-learning apps"},{"target":"잃다","native":"to lose","position":"Beginning","cultural_context":"Appears in song lyrics and beginner Korean textbooks (e.g., ‘lose memory’)"}]}]
["ㅄ",{"thoughts":"The consonant cluster ㅄ only shows up as a batchim (final consonant) and is rarely written or heard by English speakers unless they watch a lot of K-dramas/K-pop. It is normally just an unaspirated p sound, but if a vowel follows, the ㅅ moves over and you get p + s (often tensed to ss). So learners need to remember two possible surface pronunciations.","pattern":"ㅄ","position":"End","description":"In syllable-final position, ㅄ is pronounced like an unaspirated “p” – the quick, almost voiceless p you hear in the middle of the English word “spa.” If the next syllable starts with a vowel, the ㅅ slides to that syllable and becomes an “s” sound (often strengthened to a tense “ss”): 값 → /gap/, 없어 → /eop-sseo/. There is never a separate ‘b’ or ‘t’ sound.","familiarity":"ProbablyDoesNotKnow","difficulty":"Medium","example_words":[{"target":"값","native":"price / cost","position":"End","cultural_context":"Seen on Korean menus and subtitles to show the price of something"},{"target":"없어","native":"there isn’t / don’t have (informal)","position":"Beginning","cultural_context":"Frequently yelled or sung in K-dramas and K-pop lyrics"},{"target":"없어요","native":"there isn’t / don’t have (polite)","position":"Beginning","cultural_context":"Common everyday phrase heard in Korean variety shows and language lessons"}]}]
