["a",{"thoughts":"German “a” is basically the open “ah” English speakers say in “father.”  The only real novelty is that German distinguishes a short version and a clearly longer one, but the tongue and mouth shape stay the same.  So the main challenge is remembering to hold the long one a bit longer and not sliding into the English “æ” of “cat.”","pattern":"a","position":"Anywhere","description":"Pronounce German a with an open mouth, tongue low and slightly back, like the “ah” in English “father.”  There are two lengths: short /a/ (quick, clipped) and long /aː/ (held about twice as long, no extra glide).  Do NOT move the tongue forward into the “æ” of “cat.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Aldi","native":"Aldi (discount supermarket)","position":"Beginning","cultural_context":"International grocery chain found in many English-speaking countries"},{"target":"Bach","native":"Bach (surname of famous composer)","position":"Middle","cultural_context":"Johann Sebastian Bach—well-known classical composer"},{"target":"Danke","native":"thank you","position":"Middle","cultural_context":"Common German word tourists quickly learn for “thanks”"},{"target":"Volkswagen","native":"Volkswagen (car brand)","position":"Middle","cultural_context":"Global automobile brand abbreviated as “VW”"}]}]
["ä",{"thoughts":"English already has a very similar front-vowel (the e in “bet”), but German distinguishes a short and a somewhat longer/tenser version, so learners must mind length and clarity rather than learning a brand-new mouth shape.","pattern":"ä","position":"Anywhere","description":"Usually pronounced like the short open e in English “bet.” When it’s written with a length mark (ä + h or followed by another accented vowel), it is just a slightly longer, tenser version—hold it a beat and keep the mouth a bit wider. Keep the tongue forward, don’t let it drift back toward the English \"a\" in “cat.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Mädchen","native":"girl","position":"Middle","cultural_context":"Very common beginner textbook word, means “girl”"},{"target":"Käse","native":"cheese","position":"Beginning","cultural_context":"Shows up on menus; looks like English word “cheese” but with umlaut"},{"target":"Käfer","native":"beetle","position":"Beginning","cultural_context":"Name of the classic Volkswagen Beetle car in German"},{"target":"Äpfel","native":"apples","position":"Beginning","cultural_context":"Plural of “apple”; everyday food word, demonstrates capital Ä at start"}]}]
["b",{"thoughts":"German “b” is normally the same voiced sound English speakers make in “bat.”  The only twist is that German devoices final stops, so a written “b” at the very end of a word (or before another voiceless consonant) is pronounced like an English “p.”  Both sounds already exist in English, but the spelling–sound mismatch at word-ends can trip learners up.","pattern":"b","position":"Anywhere","description":"At the start or inside a word German “b” is a voiced bilabial stop, just like the English “b” in “boy.”  When the letter stands at the very end of a word—or right before a voiceless consonant—it is devoiced to [p], the same sound as English “p” in “tap.”  Remember: write “b,” say “p” at the end.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Berlin","native":"Berlin","position":"Beginning","cultural_context":"Famous capital city; most English speakers know it from geography or travel"},{"target":"Oktoberfest","native":"Oktoberfest","position":"Middle","cultural_context":"World-famous Munich beer festival often mentioned in English-language media"},{"target":"Jakob","native":"Jacob (male given name)","position":"End","cultural_context":"Biblical/first-name \"Jacob\" rendered in German; shows final devoiced b sounds like a p"}]}]
["c",{"thoughts":"German “c” isn’t very common on its own.  When it does occur it follows two predictable rules: before the front vowels e, i, ä, ö, ü (and y) it is pronounced /ts/ (like the end of “cats”); everywhere else it is pronounced /k/ (like English “k”).  There is no soft ‘s’ sound like in English “cent” or “city.”  Because both /k/ and /ts/ already exist in English, the sound itself is easy—the only trick is remembering which rule applies.","pattern":"c","position":"Anywhere","description":"1) /ts/ before the front vowels e, i, ä, ö, ü, y – similar to the “ts” at the end of “cats.” 2) /k/ in all other positions – like English “k.”  Unlike English, German never uses “c” for a soft /s/ sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Cent","native":"Cent","position":"Beginning","cultural_context":"The euro’s one-hundredth unit, same spelling as English “cent”"},{"target":"Celsius","native":"Celsius","position":"Beginning","cultural_context":"Temperature scale used worldwide"},{"target":"Currywurst","native":"Currywurst","position":"Beginning","cultural_context":"Well-known German street-food sausage; often mentioned in travel shows"}]}]
["d",{"thoughts":"English already has the alveolar stop /d/, so the sound itself is familiar. The only wrinkle is German’s rule that a written “d” is devoiced to [t] at the very end of a word or syllable. Learners need to remember to drop the vocal-cord vibration when the letter is final.","pattern":"d","position":"Anywhere","description":"At the start or inside a German word, “d” is the same voiced sound as English “d” in “dog.” When it ends a word or stressed syllable, the voice drops out and it sounds like a clean English “t.” Tongue tip touches the ridge behind the upper teeth; just keep (or stop) the vocal-cord buzz depending on position.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Deutschland","native":"Germany","position":"Multiple","cultural_context":"German name for the country—heard in international sports and news"},{"target":"Dachshund","native":"dachshund","position":"Multiple","cultural_context":"Well-known long-bodied dog breed sometimes called a “wiener dog”"},{"target":"Adidas","native":"Adidas","position":"Middle","cultural_context":"Global German sportswear brand"},{"target":"Bundesliga","native":"Bundesliga","position":"Middle","cultural_context":"Top German soccer league often mentioned in sports media"}]}]
["e",{"thoughts":"The German letter “e” shows up everywhere and has three common sounds: a long closed [eː] (similar to the first vowel in English “lay” but without the final glide), a short open [ɛ] (like the vowel in English “bet”), and an unstressed schwa [ə] (the relaxed ‘uh’ sound in the second syllable of “sofa”). English speakers know all of these mouth positions, but they must remember to keep the long [eː] pure—no trailing y-glide—and to use schwa only in unstressed syllables.","pattern":"e","position":"Anywhere","description":"In German, “e” can be:\n• long and closed [eː] – lips spread, tongue forward; like English “ay” in “say” but stop before the y-glide.\n• short and open [ɛ] – like the vowel in “bet”.\n• unstressed schwa [ə] – the relaxed ‘uh’ sound; appears in many final “-e” endings.\nPractice holding the long [eː] steady and clipping the short [ɛ] quickly. Don’t over-open your mouth, and avoid turning [eː] into the English diphthong [eɪ].","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Berlin","native":"Berlin","position":"Beginning","cultural_context":"Famous capital city of Germany, often visited by tourists"},{"target":"Danke","native":"Danke","position":"End","cultural_context":"Common word for “thanks” heard in travel phrases"},{"target":"Mercedes","native":"Mercedes","position":"Multiple","cultural_context":"Well-known German car brand"},{"target":"Beethoven","native":"Beethoven","position":"Multiple","cultural_context":"Legendary composer whose name appears on concert programs and CDs"}]}]
["f",{"thoughts":"English speakers already know the /f/ sound; in German it is produced exactly the same way and never turns into a /v/ as it sometimes does in English spelling changes (leaf/leaves). So the sound is straightforward.","pattern":"f","position":"Anywhere","description":"Voiceless labiodental fricative – same as the “f” in English “fun.” Upper or lower lip contact with upper teeth, continuous airflow, no vocal-cord vibration. Stays /f/ in all positions, even at word-ends.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Frankfurt","native":"Frankfurt","position":"Multiple","cultural_context":"Major German city and international airport"},{"target":"Oktoberfest","native":"Oktoberfest","position":"Middle","cultural_context":"World-famous Munich beer festival"},{"target":"Auf Wiedersehen","native":"Auf Wiedersehen","position":"End","cultural_context":"Common German farewell phrase heard in movies and TV"}]}]
["g",{"thoughts":"English speakers already know the hard “g” as in “go,” but German adds two twists: at the end of a syllable it loses its voice and sounds like a “k,” and in the common ending “-ig” it often softens to the same hissy sound you hear in “ich.” None of this is exotic, but you do have to remember to drop the voice or hiss instead of keeping the usual hard English g.","pattern":"g","position":"Anywhere","description":"1) Hard, voiced [g] exactly like the g in English “go” when it is at the start of a word or between vowels (Garten, sagen). 2) Final-devoiced [k] when it ends a syllable or word (Tag → [taːk], Hamburg → [ˈham.bʊrk]). 3) In the ending “-ig,” most Germans say [ɪç] (rhymes with “ich”), though some regions use [ɪk]. So König may sound like “KÖ-nich” or “KÖ-nik.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Goethe","native":"Goethe","position":"Beginning","cultural_context":"Famous German author—name seen in literature courses and on quotes"},{"target":"Hamburg","native":"Hamburg","position":"End","cultural_context":"Well-known German port city; same name linked to the hamburger"},{"target":"König","native":"König","position":"End","cultural_context":"Means “king”; appears in beer names like “König Pilsener” and in historical titles"}]}]
["h",{"thoughts":"German “h” is either the same breathy sound English speakers already know at the start of words, or it is completely silent inside words where it just shows that the vowel before it is long. Because the audible version is identical to English and the silent version requires doing nothing, it is usually no trouble for English speakers. The only thing to remember is that German never drops the initial /h/ the way some English accents do, and that the silent h never creates a new sound—just length.","pattern":"h","position":"Anywhere","description":"1) At the beginning of a syllable, pronounce it like the English h in “hat” – an easy, quick puff of air with no vocal-cord vibration.\n2) When it follows a vowel inside a word (a, e, i, o, u, ä, ö, ü) it is silent; its only job is to show that the vowel before it is long.\n3) In the old-fashioned spelling “th” (e.g., Beethoven), the h is also silent; just say a plain German /t/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Hamburg","native":"Hamburg","position":"Beginning","cultural_context":"Major German port city; name seen at airports, on maps, and in ‘Hamburger’"},{"target":"Heidi","native":"Heidi","position":"Beginning","cultural_context":"Famous children’s book and film character from the Alps"},{"target":"Bahnhof","native":"Bahnhof","position":"Multiple","cultural_context":"Common word on German train signs meaning ‘train station’; tourists quickly learn it"},{"target":"Beethoven","native":"Beethoven","position":"Middle","cultural_context":"World-famous composer; name seen in music and pop culture"}]}]
["i",{"thoughts":"German “i” has two main pronunciations: a long tense /iː/ (similar to the vowel in English “see,” but with the tongue a bit tenser) and a short lax /ɪ/ (close to the vowel in English “sit,” though German keeps it slightly tenser and shorter). English already has both sounds, but German distinguishes them mainly by length, not by spelling changes like English often does, so learners must pay attention to vowel length clues (single consonant after the vowel usually means long; double consonant or consonant cluster usually means short).","pattern":"i","position":"Anywhere","description":"Long /iː/: hold the tongue high and tense, lips unrounded, lengthen the sound—like English “see.”\nShort /ɪ/: same tongue height but more relaxed and noticeably shorter—like English “sit,” but don’t let it become a schwa. Watch spelling cues: “ie” or single final consonant often marks /iː/; a single “i” followed by double consonants usually marks /ɪ/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Berlin","native":"Berlin","position":"End","cultural_context":"German capital city, frequently mentioned in news and travel shows"},{"target":"Kinder","native":"Kinder","position":"Beginning","cultural_context":"Brand name for popular Kinder chocolate eggs and bars"},{"target":"Bikini","native":"Bikini","position":"Multiple","cultural_context":"Same word in English for two-piece swimsuit; often used in German as well"}]}]
["j",{"thoughts":"German “j” is always pronounced like the English consonant sound at the start of “yes.” The sound is already in English, but the letter-to-sound match is different, so learners must remember that German j is never the “dʒ” of English “jam.”","pattern":"j","position":"Anywhere","description":"Pronounce it as the English “y” in “yes.” Keep the tongue high and toward the front of the mouth, with lips relaxed (not pursed as for English “w”). Do NOT add the English ‘d’-like onset you hear in “jam.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"ja","native":"yes","position":"Beginning","cultural_context":"Common German word for “yes,” frequently heard in films and TV"},{"target":"Jägermeister","native":"Jägermeister","position":"Beginning","cultural_context":"Well-known German herbal liqueur brand sold worldwide"},{"target":"Johann","native":"Johann","position":"Beginning","cultural_context":"Famous first name of composer Johann Sebastian Bach, often mentioned in music contexts"}]}]
["k",{"thoughts":"German “k” is the same voiceless back-of-the-mouth stop English speakers already use in words like “cat” or “skin,” so there is virtually no new articulation to learn.","pattern":"k","position":"Anywhere","description":"Pronounced like the English hard “k” in “kite.” It’s a quick, unvoiced pop at the back of the mouth; the vocal cords stay silent until the following vowel begins.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Kindergarten","native":"Kindergarten (preschool)","position":"Beginning","cultural_context":"Common loanword in English for preschool"},{"target":"Oktoberfest","native":"Oktoberfest (October beer festival)","position":"Middle","cultural_context":"World-famous Bavarian beer festival"},{"target":"Danke","native":"Danke (thanks)","position":"Middle","cultural_context":"Basic German thank-you that shows up in travel guides and movies"}]}]
["l",{"thoughts":"German “l” is basically the same tongue shape English speakers already use at the start of words like “leaf,” but Germans keep that same clear /l/ all the time—even at the ends of syllables. English speakers often switch to a velarized “dark l” at the ends of words such as “ball.” If you just use the light, front-of-the-tongue “l” everywhere, you’ll sound German enough.","pattern":"l","position":"Anywhere","description":"Put the tip of your tongue against the ridge just behind your upper front teeth and let the air flow around the sides. Keep the back of the tongue relaxed (do NOT pull it back the way many English speakers do in “ball”). This light, non-velarized /l/ is used in all positions in German.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Lufthansa","native":"Lufthansa (German airline)","position":"Beginning","cultural_context":"Germany’s flag-carrier airline; you see the name on planes and tickets"},{"target":"Berlin","native":"Berlin","position":"Middle","cultural_context":"Germany’s capital city, popular travel destination"},{"target":"Volkswagen","native":"Volkswagen","position":"Middle","cultural_context":"Famous German car brand abbreviated as VW"},{"target":"Allianz","native":"Allianz","position":"Multiple","cultural_context":"Large international insurance company whose name appears on stadiums and ads"}]}]
["m",{"thoughts":"German “m” is the same voiced bilabial nasal English speakers already say in words like “mom.” It can occur anywhere in a word and is always pronounced the same way.","pattern":"m","position":"Anywhere","description":"Close both lips, let your vocal cords vibrate, and let the air resonate through the nose – exactly like the English m in “man” or “time.” It never turns into an n-sound or changes quality at the end of a word.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"München","native":"Munich","position":"Beginning","cultural_context":"Major German city known for Oktoberfest and its soccer team"},{"target":"Hamburg","native":"Hamburg","position":"Middle","cultural_context":"Large German port city; name seen on menus in “Hamburger”"},{"target":"Film","native":"film","position":"End","cultural_context":"Same word as English, often seen on German movie posters"}]}]
["n",{"thoughts":"German “n” is essentially the same sound as the English n in “no.” It’s an alveolar nasal, made by touching the tongue tip to the ridge just behind the upper front teeth while letting air flow through the nose. Because English already uses this sound, learners rarely have trouble with it. Just watch out for quick linking or assimilation before other consonants, but even then it behaves almost like English.","pattern":"n","position":"Anywhere","description":"Pronounce it like the n in English “no” or “ten.” Tip of the tongue touches the alveolar ridge, soft palate stays lowered so air escapes through the nose.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Nutella","native":"Nutella","position":"Beginning","cultural_context":"Famous chocolate-hazelnut spread brand"},{"target":"Nein","native":"nein","position":"Multiple","cultural_context":"German word for “no,” often heard in movies"},{"target":"Berlin","native":"Berlin","position":"End","cultural_context":"Capital city of Germany, popular travel destination"},{"target":"Kindergarten","native":"Kindergarten","position":"Multiple","cultural_context":"Loanword in English meaning preschool"}]}]
["o",{"thoughts":"German “o” is written with the same letter English uses, so learners recognise it instantly. The challenge is that German distinguishes two pure vowels: a long closed [oː] and a short open [ɔ]. English usually turns its written “o” into a diphthong /oʊ/ (as in “go”) or has an even more open back vowel /ɒ/ (BrE “hot”). Learners therefore tend to add a glide or pick the wrong mouth opening.","pattern":"o","position":"Anywhere","description":"German has two main pronunciations for the letter “o.” 1) Long, held for about twice the length of a short vowel and pronounced with rounded lips but no glide: [oː] (somewhere between English ‘go’ without the final /ʊ/ and the ‘o’ in Spanish ‘hola’). 2) Short, quicker and slightly more open: [ɔ] (similar to the vowel in BrE ‘off,’ but keep your lips rounded).  Length is phonemic, so changing it can change meaning.  Keep the tongue back, lips rounded, and avoid turning it into /oʊ/.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Mozart","native":"Mozart","position":"Beginning","cultural_context":"World-famous Austrian composer; name seen on concerts and chocolate ‘Mozartkugeln’"},{"target":"Oktoberfest","native":"Oktoberfest","position":"Multiple","cultural_context":"Iconic beer festival in Munich, widely mentioned in English-language media"},{"target":"Hallo","native":"Hallo","position":"End","cultural_context":"Common German greeting; looks like English ‘hello’"}]}]
["ö",{"thoughts":"English has no exact equivalent of German “ö”, so learners need a short, clear explanation and some very familiar examples. Pick words most English speakers have at least seen on beer labels, travel signs, or in documentaries.","pattern":"ö","position":"Anywhere","description":"German “ö” is a rounded version of the English short “e” in “bed.” Say “e” as in “bet,” but round your lips forward as if you were starting to say “o.” Your tongue stays in the same place as for “e,” only the lips change. It is NOT the same as English “oo” or “uh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Ötzi","native":"Ötzi","position":"Beginning","cultural_context":"The 5,000-year-old Alpine “Ice Man” often featured in documentaries"},{"target":"Köln","native":"Köln","position":"Middle","cultural_context":"German city of Cologne, common on travel guides and airport boards"},{"target":"Löwenbräu","native":"Löwenbräu","position":"Middle","cultural_context":"Well-known German beer brand sold internationally"},{"target":"Knödel","native":"Knödel","position":"Middle","cultural_context":"Central-European bread dumpling mentioned in food shows and cookbooks"}]}]
["p",{"thoughts":"English already has the same consonant /p/. The only novelty is that German releases it with less of an aspirated puff than the English \"p\" at the start of a stressed syllable. Otherwise it feels identical.","pattern":"p","position":"Anywhere","description":"German “p” is the same voiceless bilabial stop as English “p.” At the start of a word it is released with only a small burst of air—closer to the English “p” in “spa” than the strongly-aspirated “p” in “pie.” In the middle or at the end of words it is unaspirated and always stays voiceless. Double “pp” isn’t lengthened; it is just the same plain /p/.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Porsche","native":"Porsche","position":"Beginning","cultural_context":"Famous German sports-car brand known worldwide"},{"target":"kaputt","native":"kaputt","position":"Middle","cultural_context":"Loan-word in English meaning “broken”"},{"target":"Schnaps","native":"Schnaps","position":"End","cultural_context":"Strong distilled spirit; word seen on liquor bottles and in cocktail recipes"},{"target":"Doppelgänger","native":"Doppelgänger","position":"Multiple","cultural_context":"Common loan-word in English for a look-alike person"}]}]
["q",{"thoughts":"German q is almost always the first half of the digraph “qu.” English speakers already know the letter, but they expect an English “kw.” Switching the second part to a true /v/ sound is the only new bit, so difficulty is moderate. Rare stand-alone q in loanwords is simply /k/.","pattern":"q","position":"Anywhere","description":"In German, q nearly always appears as “qu” and is pronounced /kv/: start with a hard English k, then immediately make a voiced v (bottom lip against upper teeth). Do NOT round the lips for an English w. In the very rare case of a lone q from a foreign word, say just /k/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Quark","native":"quark (subatomic particle or dairy curd)","position":"Beginning","cultural_context":"Physics term you’ve heard in science news and pop culture"},{"target":"Quarantäne","native":"quarantine","position":"Beginning","cultural_context":"Common pandemic-related word that looks like English \"quarantine\""},{"target":"Äquator","native":"equator","position":"Middle","cultural_context":"Geography term you learned in school"}]}]
["r",{"thoughts":"German “r” has two big pronunciation families: (1) Consonantal r at the start or after another consonant is made in the back of the throat—either as a brief uvular fricative like the French r or a light uvular trill. (2) When it follows a long vowel or appears at the very end of a word, it usually weakens into a schwa-like sound, almost like the unstressed “-er” in British English “better”, so native German speech often sounds as if the r disappears.","pattern":"r","position":"Anywhere","description":"At the start or between vowels, shape the back of your tongue close to the uvula and let air rub there—think of a softer French r, not the English tip-of-the-tongue r. After long vowels or at word endings, relax the tongue and just let a brief ‘uh’ sound happen, without any real r tongue movement.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Rammstein","native":"Rammstein","position":"Beginning","cultural_context":"Internationally famous German rock/metal band"},{"target":"Berlin","native":"Berlin","position":"Middle","cultural_context":"German capital city, common travel destination"},{"target":"Bratwurst","native":"Bratwurst","position":"Multiple","cultural_context":"Well-known German sausage served at fairs and BBQs"},{"target":"Bier","native":"Bier","position":"End","cultural_context":"German word for beer; seen on menus at Oktoberfest"}]}]
["s",{"thoughts":"German “s” is written the same as English, but it doesn’t always sound the same. Depending on its position and surrounding letters it may be voiced [z], voiceless [s], or become the “sh”-sound [ʃ] in the clusters “sp / st” at the start of a syllable. English speakers already know all three sounds, but they must learn when each one appears in German.","pattern":"s","position":"Anywhere","description":"1) At the very start of a word before a vowel, single “s” is usually voiced, like the English “z” in “zoo” (e.g. Super = [ˈzuːpɐ]).\n2) Between vowels or before voiced consonants it is also voiced [z].\n3) At the end of a word or before voiceless consonants it is devoiced to plain [s] as in English “snake” (e.g. Haus = [haʊ̯s]).\n4) In the clusters “sp” and “st” at the beginning of a syllable, the “s” is pronounced [ʃ] (English “sh”), so “Spiel” begins with [ʃ].\nTip: Think “z-sound at the front, s-sound at the back, sh-sound for sp/st.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Super","native":"Super","position":"Beginning","cultural_context":"Same word in English meaning “great/super”; Germans use it exactly the same way."},{"target":"Haus","native":"Haus","position":"End","cultural_context":"Looks like English “house” and often appears in compound place names like “Bauhaus.”"},{"target":"Spiel","native":"Spiel","position":"Beginning","cultural_context":"Borrowed into English as “spiel” (a pitch or talk); also title of many German board-game fairs (‘Spiel Messe’)."}]}]
["ß",{"thoughts":"“ß” is just another way to spell the un-voiced “s” sound in German.  It never changes pronunciation: always like the “ss” in English “kiss” or “hiss.”  English speakers therefore only have to learn the spelling, not a new mouth position.","pattern":"ß","position":"Anywhere","description":"Always the sharp, un-voiced “s” (IPA /s/).  Think of the first sound in English “so.”  Hold the hiss a touch longer than in English and keep your vocal cords off (no vibration).  Do NOT pronounce it like English “z.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Fußball","native":"Fußball","position":"Middle","cultural_context":"German word you often see when people talk about European soccer"},{"target":"Straße","native":"Straße","position":"Middle","cultural_context":"Common German street signs shown in travel photos; literally means “street”"},{"target":"Maß","native":"Maß","position":"End","cultural_context":"Name for the one-liter beer mug you hear about during Oktoberfest coverage"}]}]
["t",{"thoughts":"English already has the voiceless “t” sound, so learners usually recognize it immediately. The only real novelty is that German does not puff out as much air (less aspiration) at the start of a word, and the sound stays sharp and voiceless even at the end (never turns into a flap or soft “d”).","pattern":"t","position":"Anywhere","description":"German “t” is the same voiceless tongue-tip stop you say in English, but keep the burst small: place the tip of your tongue on the ridge just behind your upper teeth, then release without a big puff of air. At word-final position, keep it crisp and voiceless (don’t let it drift toward a soft ‘d’).","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Tag","native":"day","position":"Beginning","cultural_context":"From the greeting “Guten Tag” heard in basic German lessons and travel guides"},{"target":"Bratwurst","native":"bratwurst (sausage)","position":"Middle","cultural_context":"Well-known German sausage often served at festivals and in U.S. grocery stores"},{"target":"gut","native":"good","position":"End","cultural_context":"Common word in phrases like “Das ist gut” that appear in beginner courses and pop culture"}]}]
["u",{"thoughts":"German “u” is usually either a long [uː] or a short [ʊ]. English has close equivalents (“boot” vs. “foot”), so the sound is familiar, but learners must avoid turning the long German [uː] into the English diphthong [uʊ]. Keeping the lips rounded and the tongue high-back through the whole vowel helps.","pattern":"u","position":"Anywhere","description":"German u is pronounced as a pure, rounded back vowel. • Long u (spelled simply “u” in an open syllable or followed by a single consonant) = [uː], like the vowel in English “boot” but held slightly longer and without any glide. • Short u (spelled “u” in a closed syllable) = [ʊ], similar to the vowel in English “foot,” a bit tenser and more rounded.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Guten Tag","native":"Guten Tag","position":"Middle","cultural_context":"Common greeting phrase often taught in beginner German classes"},{"target":"Bratwurst","native":"Bratwurst","position":"Middle","cultural_context":"Famous German sausage sold at festivals and ballparks"},{"target":"Lufthansa","native":"Lufthansa","position":"Beginning","cultural_context":"Major German airline frequently seen when booking international flights"},{"target":"Bundesliga","native":"Bundesliga","position":"Beginning","cultural_context":"Top German soccer league often mentioned in sports news"}]}]
["ü",{"thoughts":"English lacks a front-rounded vowel, so the written ü will look odd and the sound is unfamiliar; however a few well-known German words and the brand “Über” expose learners to it.","pattern":"ü","position":"Anywhere","description":"ü is a front-rounded vowel. Say the English long “ee” in “see” but round your lips as if you were saying “oo” in “too.” The tongue stays high and forward like “ee,” the lips are rounded like “oo.” English has no exact match, but French “u” in “tu” is very close. It can be short or long (length is shown in dictionaries with a colon /yː/ vs. /ʏ/).","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Über","native":"über","position":"Beginning","cultural_context":"Ride-share company name comes from German prefix meaning “over/super.”"},{"target":"München","native":"München","position":"Middle","cultural_context":"German name for Munich, home of Oktoberfest and a famous soccer team."},{"target":"Müsli","native":"Müsli","position":"Middle","cultural_context":"Breakfast cereal/granola sold internationally, often spelled “muesli” in English."},{"target":"Für Elise","native":"Für Elise","position":"Middle","cultural_context":"Title of Beethoven’s well-known piano piece heard in movies and music boxes."}]}]
["v",{"thoughts":"English speakers expect the letter v to sound like the English /v/. In German that is true in many recent loan-words, but in most older, native words v is pronounced /f/. The sounds themselves (/v/ and /f/) are familiar and easy; the only challenge is knowing which one to use.","pattern":"v","position":"Anywhere","description":"In German, the letter v has two possible pronunciations:\n• /f/ – the unvoiced sound in English ‘fun’. This is the usual value in older, native words (Vater, Vogel, Volk, etc.).\n• /v/ – the voiced sound in English ‘video’. This occurs mostly in modern loan-words or words of Latin/Romance origin (Video, Avocado, Vulkan, etc.).\nTip: If the German word also exists in English or looks international, keep it voiced (/v/). Otherwise try /f/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Volkswagen","native":"Volkswagen","position":"Beginning","cultural_context":"Famous German car brand: VW"},{"target":"Vorsprung","native":"Vorsprung","position":"Beginning","cultural_context":"Heard in Audi’s slogan ‘Vorsprung durch Technik’"},{"target":"Video","native":"Video","position":"Beginning","cultural_context":"Same word as English ‘video’, common tech term"},{"target":"Avocado","native":"Avocado","position":"Middle","cultural_context":"Same word in English for the green fruit"}]}]
["w",{"thoughts":"German “w” is pronounced like the English “v” sound (as in “vet”), never like the English “w” glide. English speakers already know the sound itself, but must remember to switch letters: see a German “w,” say an English “v.”","pattern":"w","position":"Anywhere","description":"Always a voiced labiodental fricative – the same sound English writes with the letter “v” in “violet.” Lower lip touches upper teeth; no lip-rounding or glide. Do NOT pronounce it like English “w” in “water.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Wiener","native":"Wiener","position":"Beginning","cultural_context":"Hot-dog/sausage style (“Wiener”) seen on menus and in cartoons"},{"target":"Bratwurst","native":"Bratwurst","position":"Middle","cultural_context":"Classic German sausage sold at festivals and ballparks"},{"target":"Schwarzwald","native":"Schwarzwald","position":"Middle","cultural_context":"The Black Forest region, famous for cake and cuckoo clocks"}]}]
["x",{"thoughts":"German “x” is straightforward for English speakers: it is always the unvoiced cluster /ks/, never the /gz/ you sometimes hear in English words like “exam.” It shows up inside words or, less commonly, at the very front of Greek-origin loans; there it is still /ks/ (no vowel sound before it).","pattern":"x","position":"Anywhere","description":"Always pronounce it like the “x” in English “fox”: a quick /k/ immediately followed by an /s/. At the start of a word just jump straight into /ks/ without adding an extra vowel (so “Xylophon” begins with /ks/, not “eks”).","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Xylophon","native":"Xylophon","position":"Beginning","cultural_context":"Looks like English “xylophone,” the percussion instrument"},{"target":"Pixel","native":"Pixel","position":"Middle","cultural_context":"Same tech term as in English—tiny dots on a screen"},{"target":"Box","native":"Box","position":"End","cultural_context":"Identical to English word for a container; also common in German for a small speaker"}]}]
["y",{"thoughts":"The letter “y” in German is a chameleon: at the start of many international words it sounds like the English y-glide (/j/), but inside or at the end of words it is usually a vowel. That vowel can either be the rounded front sound of German “ü” (/yː/ or /ʏ/) or, in some loanwords, a simple “ee” (/i/) sound. English speakers know the letter but not these vowel values.","pattern":"y","position":"Anywhere","description":"1) At the start of loanwords, pronounce it like the English y in “yes.”\n2) As a vowel, pronounce the rounded front “ü” sound: say English “ee,” but round your lips as for “oo.” Short in “System,” long in “Typ.”\n3) In some recent English loanwords (“Party”) it is just an unrounded “ee.”\nOverall, watch lip-rounding when it behaves like ü.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Yeti","native":"Yeti","position":"Beginning","cultural_context":"Legendary “Abominable Snowman” – same word in English"},{"target":"Bayern","native":"Bayern","position":"Middle","cultural_context":"Bavaria in German; famous soccer club FC Bayern Munich"},{"target":"System","native":"System","position":"Middle","cultural_context":"Looks like English “system,” often seen in tech contexts"},{"target":"Party","native":"Party","position":"End","cultural_context":"Same word as English “party,” used for celebrations"}]}]
["z",{"thoughts":"German “z” is always pronounced as the affricate /ts/, never as the English /z/. It sounds like the “ts” at the end of the English word “cats.” At the beginning of a word it starts quickly, almost like one burst. English speakers rarely start a word with /ts/, so they may need to practice keeping the tongue tip close to the upper teeth ridge, releasing the /t/ directly into a sharp /s/.","pattern":"z","position":"Anywhere","description":"Pronounce German “z” as /ts/ (like the “ts” in “cats”). Do not voice it like the English “z” in “zoo.” Start with a brief /t/ closure, then hiss into /s/ in one smooth sound.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Zebra","native":"Zebra","position":"Beginning","cultural_context":"Same name for the striped animal in English"},{"target":"Zeitgeist","native":"Zeitgeist","position":"Beginning","cultural_context":"Loan-word in English meaning the spirit of the times"},{"target":"Brezel","native":"Brezel","position":"Middle","cultural_context":"German pretzel often mentioned at Oktoberfest"},{"target":"Quiz","native":"Quiz","position":"End","cultural_context":"Same word as English for a short test"}]}]
["aa",{"thoughts":"German “aa” is simply the single long vowel /aː/. English speakers already know a similar sound in “spa” or “father,” so it is not new, though the German version is usually held a bit longer and kept pure (no glide toward a schwa). The spelling with two a’s is rare but occurs in well-known place and family names.","pattern":"aa","position":"Anywhere","description":"Pronounce it as a long, open “ah” (IPA /aː/)—like the vowel in the English word “father,” but sustain it slightly longer and keep the mouth relaxed and open without letting the sound slide toward an “uh.”","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Aachen","native":"Aachen (city)","position":"Beginning","cultural_context":"Famous German city near Belgium; appears in travel guides and history"},{"target":"Baader-Meinhof","native":"Baader-Meinhof","position":"Middle","cultural_context":"Notorious 1970s German terrorist group often mentioned in news and documentaries"},{"target":"Saale","native":"Saale (river)","position":"Middle","cultural_context":"Major German river; pops up in geography or wine discussions"}]}]
["ee",{"thoughts":"German “ee” is always the long pure vowel /eː/. English speakers know a similar quality at the start of the diphthong in “ay,” but they must hold it steady without sliding toward /ɪ/ or /y/.","pattern":"ee","position":"Anywhere","description":"Pronounce it as a long, steady version of the first part of the English “ay” in “say,” but don’t let it glide. Keep the tongue mid-high and forward, lips relaxed, and sustain the sound for an extra beat.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Beethoven","native":"Beethoven","position":"Beginning","cultural_context":"World-famous German composer"},{"target":"Spree","native":"Spree","position":"End","cultural_context":"River running through Berlin—often mentioned in travel shows"},{"target":"Bodensee","native":"Bodensee","position":"End","cultural_context":"German name for Lake Constance, a major tourist destination"}]}]
["ie",{"thoughts":"German “ie” is almost always the long, pure vowel /iː/. English speakers already have this sound in “see,” but they tend to let it glide toward a slight “y” (turning /iː/ into /ij/). In German, keep it steady and lengthened – no off-glide.","pattern":"ie","position":"Anywhere","description":"Pronounce it like the long “ee” in English “see,” but hold the vowel steady without adding a trailing “y” sound. It is always long; the preceding consonant is not doubled.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Bier","native":"Bier","position":"Middle","cultural_context":"German word for beer, seen on menus and at Oktoberfest"},{"target":"Siemens","native":"Siemens","position":"Middle","cultural_context":"International electronics and engineering brand"},{"target":"Wiener","native":"Wiener","position":"Beginning","cultural_context":"As in Wiener Schnitzel, the famous Austrian dish"}]}]
["ei",{"thoughts":"German “ei” is very friendly to English speakers because it is pronounced as the English long “i” sound (like “eye”). They will most often see it in famous names or loan-words such as Einstein, Heidi, Stein, Zeitgeist. The spelling is opposite of English “ie” vs. “ei”, so learners must remember that German “ei” → “eye”, while German “ie” → English “ee”. Overall ease is high.","pattern":"ei","position":"Anywhere","description":"Pronounce the two letters together as one vowel, like the English word “eye.” Keep it a single smooth sound—do NOT break it into two separate vowels. Compare: German “ei” = English long “i” (eye); German “ie” = English long “ee.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Einstein","native":"Einstein","position":"Beginning","cultural_context":"World-famous physicist’s surname"},{"target":"Heidi","native":"Heidi","position":"Beginning","cultural_context":"Title of the well-known children’s book and movie"},{"target":"Stein","native":"Stein","position":"End","cultural_context":"Loan-word for a large beer mug—“beer stein”"},{"target":"Zeitgeist","native":"Zeitgeist","position":"Middle","cultural_context":"Common philosophical loan-word meaning “spirit of the time”"}]}]
["ai",{"thoughts":"For English speakers, the German digraph “ai” is very straightforward: it is the same /aɪ/ sound they already know from English words like “eye” or “my.” The only caution is to keep the glide quick and not let the ending turn into a full English long ‘ee.’","pattern":"ai","position":"Anywhere","description":"Pronounced as the diphthong /aɪ/, like the vowel in English “eye” or “my.” Start with an open ‘ah’ and quickly glide toward a short ‘ee’ without fully closing the mouth. In modern standard German this is virtually the only pronunciation, and it is identical to the sound spelled “ei.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Aida","native":"Aida (proper name/opera title)","position":"Beginning","cultural_context":"Famous opera frequently advertised and performed worldwide"},{"target":"Kaiser","native":"emperor","position":"Middle","cultural_context":"Word used in English when talking about German emperors or a \"Kaiser roll\""},{"target":"Mai","native":"May (the month)","position":"End","cultural_context":"German name for the month of May; often seen on calendars or holiday references"}]}]
["ay",{"thoughts":"“ay” is rare in standard German spelling and mostly turns up in names or recent English borrowings. When it’s part of an old-established German word or name, Germans read it exactly like the common spellings “ei/ai” – the diphthong /aɪ/ (like the vowel in English “eye”, but usually a little shorter and more clipped). In newer English loanwords, however, Germans often keep the original English value /eː/ or /eɪ/ (close to the vowel in English “day”). So the same letters can give two different, but still very familiar, sounds.","pattern":"ay","position":"Anywhere","description":"Most of the time “ay” is pronounced /aɪ/ – the German “ei/ai” sound, similar to the English word “eye” but shorter. In a few recent English loan-words it is /eː/ or /eɪ/, like the vowel in English “day.” Keep the tongue low at first and glide quickly toward a high front position for /aɪ/; keep it mid-front and lengthen the vowel for /eː/.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bayern","native":"Bavaria","position":"Middle","cultural_context":"German state and famous soccer club FC Bayern Munich"},{"target":"Bayer","native":"Bayer","position":"Middle","cultural_context":"Global pharmaceutical company that invented aspirin"},{"target":"Bayreuth","native":"Bayreuth","position":"Beginning","cultural_context":"Town known for Richard Wagner’s annual opera festival"},{"target":"okay","native":"okay","position":"End","cultural_context":"Same everyday word as in English, used in German too"}]}]
["au",{"thoughts":"German “au” is the same diphthong English speakers already use in words like “house” or “cow,” so most learners have heard and produced it before. The main caution is to keep it fairly short and not let the first part drift toward an “ahw” or “ow” with an extra glide—start with a pure open “a” and slide quickly toward a relaxed “oo/ʊ.”","pattern":"au","position":"Anywhere","description":"Pronounced as the diphthong /aʊ̯/: start with the open ‘a’ in “father,” then glide quickly toward the ‘oo’ in “book,” ending before you fully round the lips. It sounds very close to the English “ow” in “cow,” just slightly shorter and cleaner.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Audi","native":"Audi (car brand)","position":"Beginning","cultural_context":"Famous German automobile maker"},{"target":"Sauerkraut","native":"sauerkraut","position":"Middle","cultural_context":"Common fermented cabbage side dish served with sausages"},{"target":"Bauhaus","native":"Bauhaus","position":"Multiple","cultural_context":"Influential German design movement and name of home-improvement stores"},{"target":"Frau","native":"Mrs.; woman","position":"End","cultural_context":"German word often seen in phrases like “Frau Müller,” used in World War II movies and textbooks"}]}]
["eu",{"thoughts":"“eu” is one of German’s two common falling diphthongs (eu/äu → /ɔɪ̯/). English speakers have heard it in words like “Deutsch” or the currency name “Euro,” but they often read it as separate letters. The sound is close to the English diphthong in “boy/coin” but starts with slightly more rounded lips.","pattern":"eu","position":"Anywhere","description":"Pronounced as one diphthong /ɔɪ̯/, similar to the “oy” in English “boy.” Start with a rounded open-mid back vowel (like British English “thought”) and glide quickly to a short “ee” sound. Keep the lips rounded throughout so it doesn’t turn into the flatter American “oy.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Euro","native":"Euro","position":"Beginning","cultural_context":"Name of the European currency—mentioned in news and travel"},{"target":"Deutsch","native":"Deutsch","position":"Middle","cultural_context":"The German word for “German”; you see it on language menus and subtitles"},{"target":"Freud","native":"Freud","position":"Middle","cultural_context":"Sigmund Freud, the famous psychoanalyst"},{"target":"Europa","native":"Europa","position":"Beginning","cultural_context":"German name for Europe—recognizable from mythology, science, and the continent"}]}]
["äu",{"thoughts":"The spelling “äu” is the same diphthong as “eu” in German, IPA /ɔʏ/. English has nothing identical, but the closest is the vowel in “boy” /ɔɪ/. German starts a little more rounded and ends with a fronted, rounded sound, so it feels like saying English “oy” while keeping the lips tightly rounded.","pattern":"äu","position":"Anywhere","description":"Pronounce it like a very rounded version of English “oy” in “boy.” Start with an open-mid rounded back vowel (like British English “o” in “thought”) and glide quickly toward a short, rounded “ee,” without letting the tongue un-round. Same sound as German “eu.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Fräulein","native":"Miss / young lady","position":"Middle","cultural_context":"Old-fashioned title heard in English-language films and literature set in Germany"},{"target":"Löwenbräu","native":"Löwenbräu (beer brand)","position":"End","cultural_context":"Well-known German beer sold internationally"}]}]
["ey",{"thoughts":"In German the letter-pair “ey” is rare but when it does appear it is almost always pronounced the same as the very common digraph “ei/ai” – the diphthong /aɪ̯/, like the English vowel in “eye” or “my.” The sound itself is easy for English speakers; the only challenge is remembering that the spelling “ey” gives this diphthong, not an “ay” or “ee” sound.","pattern":"ey","position":"Anywhere","description":"Pronounce “ey” as the diphthong /aɪ̯/ – start with an open ‘ah’ and quickly glide toward a short ‘ee.’ It ends with a relaxed jaw (do NOT close into a full English long ‘A’). Essentially it sounds like the English word “eye.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Hey","native":"hey (interjection)","position":"End","cultural_context":"Same informal greeting as English “hey!”"},{"target":"Meyer","native":"Meyer (surname)","position":"Middle","cultural_context":"Very common German last name; seen on products, authors, and athletes"},{"target":"Speyer","native":"Speyer","position":"Middle","cultural_context":"Historic German city with a famous cathedral, often mentioned in travel guides"}]}]
["ah",{"thoughts":"German “ah” is simply the long open ‘a’ vowel /aː/. The written h is silent; it only tells you to stretch the preceding a. English has almost the same sound in “father,” so most learners have heard it, but they must remember to keep it long, flat, and never turn it into the diphthong heard in some U.S. pronunciations of “spa.”","pattern":"ah","position":"Anywhere","description":"Pronounce it like the a in English “father,” but hold it slightly longer—mouth open, tongue low and flat. The following h is NOT pronounced; it just marks length.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bahn","native":"Bahn","position":"Middle","cultural_context":"You see “Deutsche Bahn” on German trains; means railway"},{"target":"Brahms","native":"Brahms","position":"Middle","cultural_context":"Famous German composer (Johannes Brahms)"},{"target":"Mahler","native":"Mahler","position":"Middle","cultural_context":"Well-known composer often performed by orchestras"},{"target":"Aha","native":"Aha","position":"Multiple","cultural_context":"Same interjection used in English for sudden realization"}]}]
["eh",{"thoughts":"German “eh” is almost always the long, pure vowel /eː/. English has a similar vowel in the word “say,” but English speakers usually glide toward a second sound (/eɪ/). German keeps it steady and long.","pattern":"eh","position":"Anywhere","description":"Pronounce it as a long, steady /eː/ – like the first part of the English vowel in “say,” but freeze it before it starts to glide. Lips are relaxed and slightly spread; tongue is mid-high and forward. Very rarely, in unstressed endings, it can be a shorter /ɛ/, but the /eː/ value covers almost all common words.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Auf Wiedersehen","native":"goodbye","position":"Middle","cultural_context":"Classic German farewell phrase often heard in movies and TV"},{"target":"gehen","native":"to go","position":"Middle","cultural_context":"Basic verb that shows up in beginner German courses and common phrases"},{"target":"stehen","native":"to stand","position":"Middle","cultural_context":"Appears in song titles like “Steh’ auf!” and is a core verb taught early"}]}]
["ih",{"thoughts":"German “ih” is simply the long, tense “ee” sound /iː/. The written h is silent and only signals that the vowel is long. English has the same vowel in “see”, so the quality is familiar; learners mostly have to remember to keep it long and not split the letters into two sounds.","pattern":"ih","position":"Anywhere","description":"Pronounce it like the long “ee” in English “see”, but hold it a touch longer and keep the tongue high and tense. The written “h” is silent; it just marks the length of the vowel.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"ihn","native":"him","position":"Beginning","cultural_context":"Common German pronoun that shows up in basic phrasebooks"},{"target":"Ihnen","native":"you (formal)","position":"Beginning","cultural_context":"Seen on polite German signs and letters addressing the reader formally"},{"target":"ihr","native":"her / their / your (plural)","position":"Beginning","cultural_context":"Another very common pronoun encountered early in German study"},{"target":"ihre","native":"her / their / your","position":"Beginning","cultural_context":"Appears in simple German phrases like “Ihre Bestellung” (your order)"}]}]
["oh",{"thoughts":"“oh” in German spelling simply tells you the vowel has to be held long; the silent “h” is just a length-marker. Phonetically it is the pure long [oː]. English speakers already have a similar vowel in the first part of “go,” although in English it usually glides toward a “w.” The main thing to remember: keep it pure and steady – do not let it slide into a diphthong.","pattern":"oh","position":"Anywhere","description":"Long, pure “o” sound [oː]. Start with the vowel you say in the word “go,” but freeze your lips in that rounded position and don’t let the sound glide toward a “w.” The written “h” is silent; it only signals that the “o” stays long.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"ohne","native":"ohne","position":"Beginning","cultural_context":"Often seen on German menus (means “without,” e.g. “ohne Zucker” – without sugar)"},{"target":"Johann","native":"Johann","position":"Middle","cultural_context":"Famous first name in ‘Johann Sebastian Bach,’ a composer most people have heard of"},{"target":"Kohl","native":"Kohl","position":"Middle","cultural_context":"Surname of former German chancellor Helmut Kohl, often mentioned in history or news contexts"}]}]
["uh",{"thoughts":"“uh” in German is simply the letter u followed by an h.  The h is silent; it just says “stretch the u.”  English already has the same long /uː/ sound in “moon,” so the quality is familiar even though the spelling trick (adding h) is new.","pattern":"uh","position":"Anywhere","description":"Pronounced as a long, pure “oo” sound /uː/, like the oo in English “moon.”  The h is not spoken; it merely lengthens the preceding u.  Keep the lips rounded and hold the vowel a bit longer than in a short English “put.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Uhu","native":"Uhu (brand of glue / eagle-owl)","position":"Beginning","cultural_context":"Well-known European glue brand; name seen in craft stores"},{"target":"Buch","native":"book","position":"Middle","cultural_context":"Common beginner German word; looks like English “book” in phrasebooks"},{"target":"Kuh","native":"cow","position":"End","cultural_context":"Often appears in children’s songs or animal-sound examples (\"Die Kuh macht muh\")"}]}]
["ch",{"thoughts":"German “ch” has two main pronunciations. After front vowels (i, e, ü, ä, ö) and consonants like l- or r-, it is the soft, hissy palatal fricative [ç]—think of a whispery “hy” with no tongue on the teeth. After back vowels (a, o, u, au) or at word-beginnings in loanwords like “China,” it is the harsher back fricative [x], similar to the Scottish “loch.” Neither sound exists in standard English, so they feel new. Practice: for [ç] say English “he” but keep the tongue high and blow air; for [x] say English “h” while pulling the tongue back toward the soft palate.","pattern":"ch","position":"Anywhere","description":"Two new fricatives for English speakers: soft front [ç] after front vowels (ich, München) and rough back [x] after back vowels or at word start (Bach, Achtung). Think “h” plus friction either near the hard palate or far back near the uvula.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Bach","native":"Bach (the composer’s surname)","position":"End","cultural_context":"Famous classical composer J. S. Bach; many people know the name"},{"target":"ich","native":"ich = I","position":"End","cultural_context":"Appears in the well-known quote “Ich bin ein Berliner”"},{"target":"Achtung","native":"Achtung = Attention/Watch out","position":"Middle","cultural_context":"Commonly heard in WWII films or warnings like “Achtung!”"},{"target":"München","native":"München = Munich","position":"Middle","cultural_context":"City of Oktoberfest; English calls it Munich"}]}]
["sch",{"thoughts":"English speakers already know the /ʃ/ sound (as in “sh”); German simply spells it “sch”. The only thing to remember is that it is ALWAYS that one sound—never “s-k” or two separate consonants.","pattern":"sch","position":"Anywhere","description":"Always pronounced like the English “sh” in “ship” (IPA /ʃ/). Lips are slightly rounded; tongue is raised just behind the ridge behind your teeth. It never changes with vowels and is never split into two consonants.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Schnitzel","native":"Schnitzel","position":"Beginning","cultural_context":"Classic breaded cutlet served in many German restaurants"},{"target":"Bosch","native":"Bosch","position":"End","cultural_context":"Global German brand for home appliances and power tools"},{"target":"Garmisch-Partenkirchen","native":"Garmisch-Partenkirchen","position":"Multiple","cultural_context":"Well-known Bavarian ski resort town, host of the 1936 Winter Olympics"}]}]
["tsch",{"thoughts":"“tsch” represents the single consonant sound /tʃ/, the same affricate English speakers hear at the start of the word “ch-air.” English already has this sound, just spelled “ch.” The only new idea is that German often spells it with the four letters t-s-c-h, so learners must read all four as one sound.","pattern":"tsch","position":"Anywhere","description":"Pronounce it like the “ch” in English “church”: touch the tip of your tongue to the ridge behind your upper teeth (as for a quick /t/), then immediately release into a hissing “sh.” It is one smooth sound, not two separate ones.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Tschüss","native":"Tschüss","position":"Beginning","cultural_context":"Common informal German goodbye that shows up in travel guides and phrasebooks"},{"target":"Deutsch","native":"Deutsch","position":"End","cultural_context":"The German word for the German language—seen on language-selection menus and in “Deutschmarks.”"},{"target":"Putsch","native":"Putsch","position":"End","cultural_context":"Loanword in English political vocabulary meaning a coup d’état"},{"target":"Tschechien","native":"Tschechien","position":"Beginning","cultural_context":"German name for the Czech Republic, appears on European road signs and sports broadcasts"}]}]
["ck",{"thoughts":"English already uses the digraph “ck,” so learners will instantly recognise it. In German it always stands for the plain hard /k/ sound and never for /ks/. Its main spelling function is to signal that the vowel before it is short. Articulatorily it’s the same as an English k in “skin” – a quick, voiceless stop with very little extra puff of air.","pattern":"ck","position":"Anywhere","description":"Always a single hard k sound /k/. Say it quickly and with minimal aspiration (like the k in English “sKip,” not the breathy k in “Kate”). The vowel before it is short.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Beck’s","native":"Beck’s","position":"End","cultural_context":"Popular German beer brand sold internationally"},{"target":"Glockenspiel","native":"Glockenspiel","position":"Middle","cultural_context":"Well-known percussion instrument heard in orchestras and holiday music"},{"target":"Rucksack","native":"Rucksack","position":"Multiple","cultural_context":"German word for backpack; often used in outdoor and travel gear contexts"},{"target":"Knackwurst","native":"Knackwurst","position":"Middle","cultural_context":"Type of German sausage you may see on deli menus"}]}]
["tz",{"thoughts":"English already uses the /ts/ cluster at the ends of words (cats, hits), so the sound is familiar. German simply writes that cluster as “tz,” and it is never voiced. The pattern can show up almost anywhere inside a word, though rarely right at the very beginning.","pattern":"tz","position":"Anywhere","description":"Pronounce it as a quick, single burst /ts/: place your tongue for a regular English “t,” release, and let the air immediately hiss through an “s.” It’s exactly the same sound you make at the end of the English word “cats,” just happening wherever the letters t-z occur in German. Keep it sharp and unvoiced—never like the English ‘z’ in “zoo.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Schnitzel","native":"Schnitzel","position":"Middle","cultural_context":"Famous breaded cutlet dish found on many menus"},{"target":"Blitzkrieg","native":"Blitzkrieg","position":"Middle","cultural_context":"WWII term often heard in history shows"},{"target":"Pretzel","native":"Pretzel","position":"Middle","cultural_context":"Well-known twisted bread snack, loanword in English"},{"target":"Fritz","native":"Fritz","position":"End","cultural_context":"Common German first name; phrase “on the fritz” in English"}]}]
["ss",{"thoughts":"For English speakers, the double-s in German is simply the unvoiced /s/ they already know (like “hiss”). The only new idea is that German “ss” guarantees a short vowel before it and is never pronounced /z/, unlike a single “s” between vowels. No new mouth position is needed; it is more of a spelling/length rule than a new sound.","pattern":"ss","position":"Anywhere","description":"Pronounce it exactly like the sharp, unvoiced S in English “miss.” It is always /s/, never the /z/ sound that a single German “s” can have between vowels. The vowel right before it stays short.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Boss","native":"Boss","position":"End","cultural_context":"Global fashion label “Hugo Boss”"},{"target":"Strauss","native":"Strauss","position":"End","cultural_context":"Surname of famous composers and of jeans pioneer Levi Strauss"},{"target":"Messerschmitt","native":"Messerschmitt","position":"Middle","cultural_context":"Historic German aircraft brand mentioned in WWII films"},{"target":"Tassimo","native":"Tassimo","position":"Middle","cultural_context":"Widely sold coffee-pod machine brand"}]}]
["pf",{"thoughts":"The consonant pair “pf” is unusual for English speakers because English almost never pronounces p and f as one tight cluster. In German the two consonants are released almost at the same time: start with a brief /p/ closure and let it flow immediately into /f/. If you try to say the English word “pffff” while keeping a very short, almost imperceptible ‘p’ burst, you will be close.","pattern":"pf","position":"Anywhere","description":"Pronounce a quick /p/ followed instantly by /f/ with no vowel in-between – like a very short, popping ‘p’ that slides straight into an ‘f’. At the beginning of a word it may sound like one blended consonant; in the middle or end you still keep both sounds, just very rapidly.","familiarity":"MaybeAlreadyKnows","difficulty":"Hard","example_words":[{"target":"Pfizer","native":"Pfizer (company name)","position":"Beginning","cultural_context":"Global pharmaceutical brand mentioned in news and vaccine discussions"},{"target":"Apfelstrudel","native":"apple strudel","position":"Middle","cultural_context":"Well-known Austrian/German dessert found on menus"},{"target":"Pfeffer","native":"pepper","position":"Beginning","cultural_context":"Ingredient name that looks similar to English ‘pepper,’ appears in recipes"}]}]
["ph",{"thoughts":"German “ph” is the same spelling that English already uses in words such as “phone” or “photo,” so native English speakers usually recognise and pronounce it automatically as an F-sound. It never represents a P+H sequence in German—always a single /f/.","pattern":"ph","position":"Anywhere","description":"Always pronounced like the English “f” sound, as in “fun.” Lips and teeth lightly touch; let air flow without voicing. Never pronounce a separate P or an aspirated sound.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Phantasie","native":"fantasy / imagination","position":"Beginning","cultural_context":"Looks and means almost the same as English “fantasy,” common in pop-culture contexts"},{"target":"Alphabet","native":"alphabet","position":"Middle","cultural_context":"The word for the set of letters; spelled the same as in English"},{"target":"Philosophie","native":"philosophy","position":"Multiple","cultural_context":"Academic term identical in meaning to English “philosophy,” often seen in university names and book titles"}]}]
["th",{"thoughts":"German “th” is never the English dental sound; it’s just a plain /t/. That makes it very familiar and easy for English speakers, but they must remember NOT to lisp it like in “think/this.”","pattern":"th","position":"Anywhere","description":"In German the letter-pair “th” is pronounced exactly like a crisp, unaspirated “t.” Keep the tongue behind the upper teeth as for an ordinary English “t,” but do not stick the tongue between the teeth as you would for English “th.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Theater","native":"theater","position":"Beginning","cultural_context":"Spelled almost the same as English “theater”"},{"target":"Thüringen","native":"Thuringia (German state)","position":"Beginning","cultural_context":"Famous for sausages; often mentioned in travel shows"},{"target":"Luther","native":"Luther (surname of Martin Luther)","position":"Middle","cultural_context":"Name of the well-known church reformer"}]}]
["qu",{"thoughts":"German “qu” is always pronounced /kv/, never /kw/. The lips do NOT round after the k; instead you move straight from an un-aspirated German k to a voiced v. English speakers know the spelling but expect the \"w\" sound, so they must remember to use v instead.","pattern":"qu","position":"Anywhere","description":"Pronounce it as one tight sequence /k + v/: start with a crisp, un-aspirated German k (like the k in English “ski,” not the puffier k in “key”), then immediately voice a v sound. It is never the English “kw” as in “quick.”","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Quark","native":"quark (fresh cheese; subatomic particle)","position":"Beginning","cultural_context":"Physics term you’ve heard in science news; also a dairy product in German cuisine"},{"target":"Quiz","native":"quiz","position":"Beginning","cultural_context":"Same word you use in English for a short test or game show"},{"target":"Qualität","native":"quality","position":"Beginning","cultural_context":"Looks like the English word “quality,” seen on German product packaging or ads"},{"target":"Aquarium","native":"aquarium","position":"Middle","cultural_context":"Same word in English for a fish tank or marine exhibit"}]}]
["sp",{"thoughts":"English speakers already know the letter-pair “sp,” but German has an extra twist: at the start of a word or syllable it is said “shp” [ʃp]; elsewhere it stays the familiar “sp.” So the spelling is familiar, the rule is new.","pattern":"sp","position":"Anywhere","description":"In German, “sp” sounds two different ways.\n• At the very beginning of a word OR at the beginning of any new syllable (after a prefix), pronounce it like English “shp”: start with the “sh” in “shoe,” then immediately add a voiceless p.  \n• In all other positions (after a vowel or another consonant inside the same syllable), pronounce it just like the English cluster in “crisp” – an unvoiced s followed by p.\nTip: If you see a clear syllable break before the p (As-pi-rin), keep the normal English sound. If the word or part of the word starts with “sp” (Spätz-le), go for “shp.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Spätzle","native":"egg-noodle dish","position":"Beginning","cultural_context":"German comfort food found on many menus in the U.S. and Europe"},{"target":"Spree","native":"Spree (river through Berlin)","position":"Beginning","cultural_context":"Name of the river you hear about when visiting or reading about Berlin"},{"target":"Aspirin","native":"aspirin (pain reliever)","position":"Middle","cultural_context":"International brand name of the common headache medicine"}]}]
["st",{"thoughts":"English speakers already know the letter pair “st,” but German throws a curve-ball: at the start of a word or syllable it turns into the “sh” sound plus a hard unvoiced t (IPA /ʃt/), while everywhere else it stays the straightforward /st/. So learners must remember to say “sht” when they see an initial St-, then switch back to a normal “st” in the middle or at the end of words.","pattern":"st","position":"Anywhere","description":"• At the very beginning of a word or syllable, “st” is pronounced like English “sh” + “t”: /ʃt/ (think “SH + T” said quickly).  Example: Stuttgart → “SHTUT-gart.”\n• After a vowel or at the end of a word it is the familiar /st/ (“s” as in ‘stay’ + sharp unvoiced t).  Example: Oktoberfest → ok-TOE-ber-fest (/st/).\nTip: For the initial version, round your lips slightly as if starting an English “sh,” then snap into a crisp t without adding a vowel in between.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Stuttgart","native":"Stuttgart","position":"Beginning","cultural_context":"Major German city; car brands like Mercedes and Porsche are headquartered there"},{"target":"Münster","native":"Münster","position":"Middle","cultural_context":"Well-known university town and the cheese that carries its name; often cited in travel shows"},{"target":"Oktoberfest","native":"Oktoberfest","position":"End","cultural_context":"Famous Munich beer festival often mentioned in English-language media"}]}]
["ng",{"thoughts":"English already has the velar-nasal /ŋ/ (as in “siNG”), so the basic sound is familiar. German “ng” is usually just that nasal, with no audible /g/. However, if the next syllable begins with a vowel, the /g/ re-appears, so you get /ŋg/. Learners mainly have to remember: no extra /g/ at the end of words like “Jung”, but keep it in words like “singen”.","pattern":"ng","position":"Anywhere","description":"Usually pronounced like the final sound in English “sing”: a single velar nasal /ŋ/ made in the back of the mouth, no tongue release for a /g/. When a following vowel begins the next syllable (si-ngen, E-ngel), you say /ŋg/—let the /g/ pop out before the vowel.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Angst","native":"fear, anxiety","position":"Middle","cultural_context":"Common loan-word in English meaning deep fear"},{"target":"Jung","native":"(surname)","position":"End","cultural_context":"Carl Jung, the famous Swiss psychologist"},{"target":"singen","native":"to sing","position":"Middle","cultural_context":"Looks like the English verb “sing,” often seen in beginner German lessons"}]}]
["nk",{"thoughts":"German “nk” is essentially the same consonant cluster English speakers already know from words like “think” or “bank”: you first make the back-of-the-tongue nasal [ŋ] and release straight into a voiceless [k]. Because it behaves almost exactly as in English, it rarely causes trouble.","pattern":"nk","position":"Anywhere","description":"Pronounce the velar nasal [ŋ] (the sound at the end of English “sing”) immediately followed by a hard, voiceless “k.” It’s identical to the way English says “nk” in words such as “think” or “bank.” Just be sure not to insert a separate vowel between the two consonants.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Danke","native":"thank you","position":"Middle","cultural_context":"Common first-phrase tourists learn for “thank you” in German"},{"target":"Frankfurt","native":"Frankfurt","position":"Middle","cultural_context":"Major German city and international airport hub"},{"target":"Bank","native":"bank","position":"End","cultural_context":"Same word and meaning as English—financial institution"}]}]
["chs",{"thoughts":"German “chs” almost always collapses into the consonant cluster /ks/, so English speakers only have to link an English-style “k” and “s” together. The letters look scary because of the silent “h,” but nothing new has to be learned.","pattern":"chs","position":"Anywhere","description":"Pronounce it like the /ks/ sound in English “six” or “fox.” The “h” disappears—there is no separate rough “ch” sound. Just say a quick “k” immediately followed by “s.” After front vowels (e, i, ä, ö, ü) a native speaker’s “k” may be a touch softer, edging toward the German “ich” sound, but aiming for a normal English /ks/ is perfectly acceptable.","familiarity":"MaybeAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Sechs","native":"sechs","position":"End","cultural_context":"German word for the number six—shows up in basic phrasebooks and counting lists"},{"target":"Dachshund","native":"Dachshund","position":"Middle","cultural_context":"Well-known small dog breed whose English name is the original German word"},{"target":"Sachsen","native":"Sachsen","position":"Middle","cultural_context":"German state “Saxony,” encountered in history (Anglo-Saxons) and geography contexts"},{"target":"Fuchs","native":"Fuchs","position":"End","cultural_context":"German word (and surname) meaning “fox,” seen in last names such as mathematician ‘Fuchs’"}]}]
["sp",{"thoughts":"Initial “sp” in German is pronounced /ʃp/ (like the English “sh” plus “p”), not /sp/ as in English “sport.” English speakers already know the individual sounds /ʃ/ and /p/, but rarely start a word with that exact cluster, so they may default to the familiar English /sp/. The trick is to round the lips for a quick “sh” and let the lips stay rounded for the following unvoiced “p.” Once this rule is learned it’s predictable: it applies to every native German word that starts with “sp.”","pattern":"sp","position":"Beginning","description":"At the very start of a German word, “sp” is pronounced like “shp” (/ʃp/). Think of saying “sh” in “ship” immediately followed by the “p” in “spin,” with no vowel in between. It is never pronounced like the English /sp/ cluster at the beginning of words.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Spiel","native":"Spiel","position":"Beginning","cultural_context":"Loan-word in English meaning a sales pitch; common in phrases like “That’s his spiel.”"},{"target":"Spätzle","native":"Spätzle","position":"Beginning","cultural_context":"German egg noodles served in many restaurants and recipe videos."},{"target":"Spiegel","native":"Spiegel","position":"Beginning","cultural_context":"‘Der Spiegel’ is a well-known German news magazine often quoted in international media."}]}]
["st",{"thoughts":"German st at the start of a word is almost always pronounced “sht” ([ʃt]). English never spells that sound with st, so learners tend to start with a plain s+t, missing the initial sh-like quality.","pattern":"st","position":"Beginning","description":"At the beginning of a German word, st is pronounced like the English sounds in “sh” + “t” said quickly together: [ʃt]. Imagine saying “sh” in “ship” and immediately adding a crisp t. Don’t voice the sh, and be sure the t is clear, not softened into “d.”","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Stuttgart","native":"Stuttgart (city)","position":"Beginning","cultural_context":"Major German city; Mercedes-Benz and Porsche are headquartered there"},{"target":"Stollen","native":"Stollen (Christmas bread)","position":"Beginning","cultural_context":"Traditional German fruit-filled holiday cake, sold internationally"},{"target":"Strudel","native":"Strudel (pastry)","position":"Beginning","cultural_context":"Famous layered pastry, often apple strudel, on many dessert menus"}]}]
["ig",{"thoughts":"Final -ig looks simple on paper but hides a distinctly German sound (/ɪç/). English speakers want to read it like the g in “big,” yet the standard pronunciation ends with the soft hiss of the German “ich-sound.” In some regions or very careful speech it can surface as a hard /k/, so learners will hear both.","pattern":"ig","position":"End","description":"At the end of a word, -ig is normally pronounced like short English “i” plus the German “ich-sound”: /ɪç/ – almost “ihh-sh.” Do NOT voice the g as in English “big.” If you can say “ich,” just put a short i in front of it. In some northern accents and in slow, very careful speech, it is pronounced /ɪk/ (like English “ick”). Both versions are acceptable to Germans; the /ɪç/ is standard.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"König","native":"king","position":"End","cultural_context":"Seen on German beer brand König Pilsener and in references to chess pieces (the King) in German"},{"target":"Leipzig","native":"Leipzig (city name)","position":"End","cultural_context":"Well-known German city, home to soccer club RB Leipzig—frequent in sports news and travel guides"},{"target":"lustig","native":"funny","position":"End","cultural_context":"Word pops up in Oktoberfest songs and German folk lyrics that English speakers may hear"}]}]
["g",{"thoughts":"German g at the very end of a word is almost never a true voiced English g as in “dog.” Most of the time it is devoiced to a k-sound /k/. When the ending is ‑ig, many speakers go a step further and pronounce it /ɪç/ (like English “ish” but with the German “ich” hiss). Both variants surprise English ears, but the mouth positions are ones they already know from /k/ or German /ç/.","pattern":"g","position":"End","description":"At the end of a German word, the letter g is pronounced like an unaspirated k (/k/). In the common ending ‑ig it is often pronounced /ɪç/ (similar to the “h” in German “ich”), though /ɪk/ also occurs. So expect a hard, voiceless release—not the voiced g you use in English “bag.” Keep the vocal cords off.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Tag","native":"day","position":"End","cultural_context":"Heard in the greeting “Guten Tag”"},{"target":"Hamburg","native":"Hamburg","position":"End","cultural_context":"Well-known German port city and hamburger namesake"},{"target":"König","native":"king","position":"End","cultural_context":"Appears in the title of the musical/film “Der König der Löwen” (The Lion King)"}]}]
["r",{"thoughts":"German word-final “r” is not a hard English /r/. Most speakers simply turn it into a relaxed vowel sound, similar to the second syllable of English “comma,” transcribed [ɐ]. In careful or regional speech you may also hear a soft uvular fricative [ʁ] or an alveolar trill, but the neutral choice is the short, color-less schwa-like vowel.","pattern":"r","position":"End","description":"At the end of a word, German “r” is usually pronounced like a very short, central vowel [ɐ]—imagine saying the English word “comma” and stopping right after the schwa. Your tongue stays relaxed and low; there is no curling as in American /r/. If you already know the German unstressed “e” sound (schwa), just make that and you are very close.","familiarity":"MaybeAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Bier","native":"beer","position":"End","cultural_context":"German word on many pub menus; sounds like English “beer”"},{"target":"Oktober","native":"October","position":"End","cultural_context":"Month name seen in “Oktoberfest” celebrations"},{"target":"Super","native":"super","position":"End","cultural_context":"Same spelling and meaning as English “super”, common in ads and casual speech"}]}]
["e",{"thoughts":"Final -e in German is pronounced as an unstressed schwa /ə/, like the final ‘a’ in English “sofa,” never as an English long “ee.” English already has the schwa, so the sound itself is familiar; the main challenge is remembering not to lengthen it.","pattern":"e","position":"End","description":"At the end of a German word, “e” is usually a very short, neutral vowel (schwa /ə/). Keep the mouth relaxed and don’t stretch the vowel; it should be softer and shorter than English “ee.”","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Danke","native":"thanks","position":"End","cultural_context":"Common tourist phrase meaning “thank you”"},{"target":"Goethe","native":"Goethe (famous author)","position":"End","cultural_context":"Well-known German writer; name of many streets and institutes"},{"target":"Deutsche","native":"German (feminine/plural)","position":"End","cultural_context":"Seen in “Deutsche Bank,” “Deutsche Bahn,” etc."}]}]
["er",{"thoughts":"German word-final “er” is not pronounced like the strong English “er” in “her.” Instead, Standard German reduces it to a very short, neutral vowel similar to the “a” in English “sofa,” followed (in many accents) by no audible r at all. Phonetically it is [ɐ]. Some speakers, especially in the south, may let a light, tapped or uvular r color this schwa-like vowel, but it is never the fully stressed American “er.” English speakers therefore must learn to relax the tongue and almost drop the r.","pattern":"er","position":"End","description":"At the end of a word, “er” is usually pronounced as a short, unstressed central vowel [ɐ] – like the ‘a’ in ‘sofa’ – with little or no ‘r’ sound. Do NOT pronounce a strong English r.","familiarity":"LikelyAlreadyKnows","difficulty":"Medium","example_words":[{"target":"Kinder","native":"Kinder","position":"End","cultural_context":"Famous chocolate brand (Kinder Surprise, Kinder Bueno)"},{"target":"Hamburger","native":"Hamburger","position":"End","cultural_context":"Same word as the food; originally means someone from Hamburg"},{"target":"Lager","native":"Lager","position":"End","cultural_context":"Type of beer commonly sold in English-speaking countries"},{"target":"Oktober","native":"Oktober","position":"End","cultural_context":"‘Oktoberfest’ beer festival that appears in news and advertising"}]}]
["en",{"thoughts":"German –en at the end of a word is normally reduced to a very quick, weak vowel (the neutral “uh” /ə/) followed by an /n/. In casual speech the vowel may disappear completely, leaving a syllabic /n̩/ – much like the final sound in the English word “button.” Because English already reduces vowels before final n, the sound feels familiar.","pattern":"en","position":"End","description":"Pronounce it as schwa + n: a short, relaxed “uh-n.” In faster speech the tongue just stays on the /n/ and the vowel almost vanishes. Think of the ending of English “happen” or “open,” but keep it crisp and avoid turning the n into an “nɹ” like some American accents do.","familiarity":"LikelyAlreadyKnows","difficulty":"Easy","example_words":[{"target":"Volkswagen","native":"Volkswagen","position":"End","cultural_context":"Globally known German car brand"},{"target":"Beethoven","native":"Beethoven","position":"End","cultural_context":"Famous classical composer whose music is everywhere"},{"target":"Guten Tag","native":"Guten Tag","position":"End","cultural_context":"Common German greeting meaning “Good day,” often heard in language-learning apps and travel shows"}]}]
